{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia diffusa",
    "plant_slug": "acacia-diffusa",
    "plant_name_scientific": "acacia diffusa",
    "intro": "Acacia diffusa, commonly known as the yellow acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It features slender, often branched stems covered in soft, grayish-green bark. The plant produces small, yellow flowers that bloom in clusters, typically during the dry season. Its leaves are bipinnate, consisting of numerous tiny, thread-like leaflets. Acacia diffusa is well adapted to drought conditions, with deep root systems that allow it to survive in poor soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia diffusa is primarily native to eastern Australia, including regions in New South Wales, Queensland, and the Australian Capital Territory. It thrives in a variety of habitats such as dry forests, woodlands, and rocky outcrops. This species is commonly found in areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Acacia diffusa is well adapted to nutrient-poor soils and can tolerate drought conditions. It plays an important ecological role by providing habitat and food for various native animals and insects.",
    "distribution_introduced_art_desc": "Acacia diffusa was mainly introduced to areas with a warm, dry climate and well-drained soils, often as an ornamental plant or for its hardy nature. It is commonly found in regions of Australia, where it has been cultivated for its attractive foliage and ability to thrive in harsh conditions. The plant's introduction has led to its establishment in some non-native environments, where it can spread aggressively. Due to its adaptability, it has become a common sight in gardens and along roadsides in parts of the southern United States. However, its invasive potential in certain ecosystems remains a concern for local biodiversity."
}
