{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacallis rosariana",
    "plant_slug": "acacallis-rosariana",
    "plant_name_scientific": "acacallis rosariana",
    "intro": "Acacallis rosariana, commonly known as the Rosary Flower, is a flowering plant native to South Africa. It belongs to the Amaryllis family (Amaryllidaceae) and is characterized by its striking, showy inflorescences. The plant produces clusters of bell-shaped flowers in shades of pink, white, and red, which bloom in spring. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and containers. Due to its ornamental value, it is often cultivated for its beauty and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacallis rosariana is primarily native to southern Africa, specifically South Africa. It is found in the eastern and western regions of the country. This plant typically grows in grasslands and open woodlands. It is adapted to the temperate to subtropical climate of its native range. Acacallis rosariana is often seen in areas with well-drained soils.",
    "distribution_introduced_art_desc": "Acacallis rosariana was mainly introduced to New Zealand as an ornamental plant due to its attractive yellow flowers and compact growth habit. It was first recorded in the 19th century and has since become naturalized in several regions across the country. The plant thrives in coastal and sandy soils, often growing in disturbed areas such as roadsides and dunes. Despite its beauty, it has raised concerns due to its potential to spread and compete with native vegetation. Its distribution is now limited to specific coastal zones, though it remains a subject of ecological study."
}
