{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mutabilis",
    "plant_slug": "acacia-mutabilis",
    "plant_name_scientific": "acacia mutabilis",
    "intro": "Acacia mutabilis, commonly known as the everett acacia, is a shrub or small tree native to the southwestern United States and northern Mexico. It is characterized by its feathery, bipinnate leaves that change color throughout the year, ranging from green to red or yellow. The plant produces yellow to orange globular flower clusters, which bloom in late spring to early summer. It thrives in well-drained soils and full sun, making it adaptable to arid and semi-arid environments. The acacia's ability to fix nitrogen through its root system makes it beneficial for soil enrichment in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mutabilis"
    },
    "taxonomy_art_desc": "Acacia mutabilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower heads and often used in traditional medicine. Its species is Acacia mutabilis, a specific type of acacia known for its variable flower color and native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mutabilis is primarily native to South Australia and Western Australia. This species is commonly found in the arid and semi-arid regions of these two states. It thrives in sandy soils and is often seen along roadsides and in open woodlands. The plant is well adapted to the harsh climatic conditions of the region. Its distribution is largely restricted to the southern and western parts of Australia.",
    "distribution_introduced_art_desc": "Acacia mutabilis was mainly introduced to urban and suburban landscapes in Australia for its ornamental value and ability to thrive in dry conditions. It is commonly found in gardens and along roadsides, where it provides visual interest with its yellow flowers and feathery foliage. The plant's adaptability to various soil types and climate conditions has contributed to its widespread use in landscaping. However, it has also been reported as an invasive species in some regions, outcompeting native vegetation. Due to its rapid growth and spread, management strategies are often required to control its distribution."
}
