{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verniciflua var. pendula",
    "plant_slug": "acacia-verniciflua-var-pendula",
    "plant_name_scientific": "acacia verniciflua var. pendula",
    "intro": "Acacia verniciflua var. pendula, commonly known as the weeping acacia, is a deciduous shrub or small tree native to the arid regions of Australia. It is characterized by its drooping, feathery foliage, which gives it a distinctive, elegant appearance. The plant produces yellow flowers in winter, which are followed by flat, pod-like fruits containing seeds. Its leaves are bipinnate, with small, oval leaflets that are often covered in fine hairs. This species is well adapted to drought and poor soil conditions, making it a hardy plant suitable for arid landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verniciflua var. pendula is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory, Western Australia, and South Australia. This variety is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. It thrives in coastal and inland desert environments, adapting well to extreme temperatures and limited water availability. The plant is well-known for its distinctive pendulous pods and is often used in traditional Aboriginal practices. Its distribution is closely associated with the dry inland regions of Australia, where it plays an important ecological role.",
    "distribution_introduced_art_desc": "Acacia verniciflua var. pendula was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions due to its deep root system and ability to thrive in harsh conditions. It is commonly used in reforestation projects and land rehabilitation efforts in countries such as China, India, and parts of Africa. The plant's rapid growth and tolerance to drought make it a valuable species for ecological restoration. However, its introduction has sometimes led to competition with native vegetation, raising concerns about its impact on local ecosystems. Despite these challenges, it remains an important plant for combating desertification and improving land productivity."
}
