{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia schaffneri var. bravoensis",
    "plant_slug": "acacia-schaffneri-var-bravoensis",
    "plant_name_scientific": "acacia schaffneri var. bravoensis",
    "intro": "Acacia schaffneri var. bravoensis, commonly known as the Bravo acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellow, spherical flower heads that are clustered in dense, globular inflorescences. It thrives in well-drained soils and is often found in rocky or sandy habitats. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its distinctive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia schaffneri var. bravoensis is primarily native to the arid and semi-arid regions of northern Mexico, particularly in the states of Chihuahua, Coahuila, and Nuevo León. This variety is commonly found in rocky soils and dry grasslands, often growing in areas with low rainfall. It is well adapted to the harsh environmental conditions of its native habitat, including high temperatures and limited water availability. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to the northern parts of the Mexican desert landscape.",
    "distribution_introduced_art_desc": "Acacia schaffneri var. bravoensis was mainly introduced to areas with well-drained soils and full sun exposure, typically found in arid or semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it suitable for xeriscaping and landscape restoration projects. This plant is commonly used in ecological restoration due to its ability to stabilize soil and prevent erosion. Its introduction has been noted in several regions of the southwestern United States and northern Mexico. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
