{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia viarum",
    "plant_slug": "acacia-viarum",
    "plant_name_scientific": "acacia viarum",
    "intro": "Acacia viarum, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers that are clustered in spherical inflorescences, which bloom in spring. Acacia viarum is adapted to arid and semi-arid environments, making it a hardy species. It plays a role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia viarum is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, often growing in sandy or rocky soils. This species is well adapted to the harsh environmental conditions of its native habitat. It is often seen in open woodlands and along riverine areas. Its distribution is closely tied to the availability of water and suitable soil conditions in these regions.",
    "distribution_introduced_art_desc": "Acacia viarum was mainly introduced to new environments as an ornamental plant due to its unique appearance and drought tolerance. It has been reported in several regions outside its native range, including parts of the southern United States and Australia. The distribution of this species has expanded through human activities such as landscaping and horticultural trade. It has shown adaptability to various soil types and climatic conditions, contributing to its spread. However, its introduction has raised concerns about potential ecological impacts on native flora and fauna."
}
