{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia densispina",
    "plant_slug": "acacia-densispina",
    "plant_name_scientific": "acacia densispina",
    "intro": "Acacia densispina, commonly known as the dense thorn acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, thorny branches and bipinnate leaves that are often covered in fine hairs. The plant produces yellow, globular flower heads that bloom in summer, attracting various pollinators. Its seeds are encased in hard, woody pods and are dispersed by animals. Acacia densispina is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia densispina is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry, open habitats such as grasslands, woodlands, and along riverbanks. This species thrives in well-drained soils and is often associated with sandy or loamy substrates. It is well adapted to the semi-arid and arid climates of its native range. Acacia densispina plays an important ecological role by providing food and shelter for various native fauna.",
    "distribution_introduced_art_desc": "Acacia densispina was mainly introduced to control soil erosion and for its ability to thrive in arid and semi-arid environments. It is commonly used in reclamation projects due to its rapid growth and deep root system. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, it has been reported to spread aggressively and may become invasive in certain ecosystems. Its introduction has led to both ecological and economic benefits in regions where it is cultivated."
}
