{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia epedunculata",
    "plant_slug": "acacia-epedunculata",
    "plant_name_scientific": "acacia epedunculata",
    "intro": "Acacia epedunculata, commonly known as the slender acacia, is a shrub native to southern Africa. It is characterized by its slender, branching stems and small, greenish-yellow flowers arranged in compact, globular heads. The plant produces flat, bipinnate leaves that are often covered in fine hairs. It thrives in arid and semi-arid environments, making it well-adapted to drought conditions. Acacia epedunculata is also known for its role in providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia epedunculata"
    },
    "taxonomy_art_desc": "Acacia epedunculata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that are typically legumes, often with compound leaves and pods as fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used in traditional medicine and as ornamental plants. Its species is Acacia epedunculata, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia epedunculata is primarily native to Western Australia. It is found in the arid and semi-arid regions of the state, particularly in the southern and central parts. This plant thrives in sandy soils and is commonly seen in shrublands and open woodlands. It is well adapted to the harsh climate of the region, with its small, waxy leaves helping to reduce water loss. Acacia epedunculata plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia epedunculata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in sandy soils and coastal areas. The plant is known for its ability to withstand drought and high salinity, making it adaptable to various environmental conditions. It is often used in reclamation projects due to its rapid growth and nitrogen-fixing capabilities. However, its invasive potential has raised concerns in some ecosystems where it may outcompete native vegetation."
}
