{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia diallaga",
    "plant_slug": "acacia-diallaga",
    "plant_name_scientific": "acacia diallaga",
    "intro": "Acacia diallaga, commonly known as the white acacia, is a shrub or small tree native to Africa. It is characterized by its slender, branching structure and its distinctive yellow flowers that bloom in clusters. The plant produces small, flat pods that contain seeds, which are often used in traditional medicine. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia diallaga is adapted to arid environments and is often found in savannas and rocky areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia diallaga"
    },
    "taxonomy_art_desc": "Acacia diallaga belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their primitive features and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which comprises plants with distinctive flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acorn-like seed pods and often used in traditional medicine and land restoration. Its species is Acacia diallaga, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia diallaga is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid zones. This plant thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important ecological role in providing habitat and food for local wildlife. Its distribution is largely restricted to the western parts of the state.",
    "distribution_introduced_art_desc": "Acacia diallaga was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils. It is commonly found in savannas and open woodlands where it thrives in full sun. This plant is often used for soil stabilization due to its deep root system and ability to tolerate drought. It has also been introduced as an ornamental plant in some parts of the world. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
