{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia delagoensis",
    "plant_slug": "acacia-delagoensis",
    "plant_name_scientific": "acacia delagoensis",
    "intro": "Acacia delagoensis, commonly known as the umbrella thorn acacia, is a deciduous shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive umbrella-shaped crown formed by its many branches. The plant has long, thin, and often spiny leaves that are adapted to reduce water loss. Its yellow flowers are produced in dense clusters and are an important food source for various pollinators. The tree is also valued for its hard, durable wood and its ability to thrive in harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia delagoensis is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, Rwanda, Burundi, Democratic Republic of the Congo, Zambia, Zimbabwe, and South Africa. It thrives in a variety of habitats, including savannas, woodlands, and rocky areas. This species is commonly found in regions with a tropical or subtropical climate. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia delagoensis is also known for its ability to withstand drought and poor soil conditions.",
    "distribution_introduced_art_desc": "Acacia delagoensis was mainly introduced to areas where it can thrive in arid and semi-arid environments, particularly in regions with well-drained soils. It is commonly found in savannas and woodland areas across sub-Saharan Africa. This plant is valued for its hardy nature and ability to withstand drought conditions. Its introduction has also contributed to local ecosystems by providing habitat and food for various wildlife species. Additionally, it is used by local communities for timber, fuelwood, and traditional medicine."
}
