{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cavaleriei",
    "plant_slug": "acacia-cavaleriei",
    "plant_name_scientific": "acacia cavaleriei",
    "intro": "Acacia cavaleriei, commonly known as the white acacia, is a shrub or small tree native to Madagascar. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in compact, globular clusters. The plant is well adapted to arid and semi-arid environments, showcasing drought resistance through its thick, waxy leaves. It plays an important role in local ecosystems by providing habitat and food for various insects and birds. The wood of Acacia cavaleriei is hard and durable, making it valuable for traditional uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cavaleriei is primarily native to China South-Central. This species is found in the mountainous regions of central China, particularly in provinces such as Hunan, Hubei, and Sichuan. It thrives in subtropical climates with well-drained soils and is often found in forests or on rocky slopes. The plant is adapted to the humid and mild conditions of this region. Its native distribution is largely confined to these specific geographic areas within China.",
    "distribution_introduced_art_desc": "Acacia cavaleriei was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and ability to thrive in dry climates. It has been widely cultivated in gardens and public spaces across southern Europe, particularly in countries like Spain, Italy, and Greece. Despite its aesthetic appeal, it has raised concerns due to its invasive potential in certain areas where it can outcompete native flora. Its introduction has led to ecological impacts in some regions, prompting monitoring and management efforts. The plant's adaptability to various soil types and drought conditions has contributed to its successful spread in non-native environments."
}
