{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nigripilosa subsp. latifolia",
    "plant_slug": "acacia-nigripilosa-subsp-latifolia",
    "plant_name_scientific": "acacia nigripilosa subsp. latifolia",
    "intro": "Acacia nigripilosa subsp. latifolia, commonly known as the broad-leaved wattle, is a shrub native to northern Australia. It is characterized by its slender, multi-branched stems and bipinnate leaves with broad, ovate leaflets. The plant produces yellow globular flower heads that bloom during the dry season, attracting nectar-feeding birds and insects. Its wood is hard and durable, historically used by Indigenous Australians for tools and weapons. The subspecies is distinguished by its broader foliage compared to other acacia species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nigripilosa"
    },
    "taxonomy_art_desc": "Acacia nigripilosa subsp. latifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its vascular system and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose family. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by the pod-like fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia nigripilosa, a specific type within the Acacia genus, which is further divided into subspecies, with subsp. latifolia being a variant distinguished by its broader foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nigripilosa subsp. latifolia is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the Geraldton area. This subspecies thrives in sandy soils and is commonly found in coastal and inland areas. It is often associated with shrublands and woodland habitats. The plant is well adapted to the dry and semi-arid conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia nigripilosa subsp. latifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in sandy soils along coastal areas. This subspecies is often cultivated for its ornamental value due to its attractive foliage and ability to thrive in dry conditions. However, it is considered invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns about its ecological impact on local ecosystems."
}
