{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fleckeri",
    "plant_slug": "acacia-fleckeri",
    "plant_name_scientific": "acacia fleckeri",
    "intro": "Acacia fleckeri, commonly known as the Darling River acacia, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. Its seeds are enclosed in woody pods and can remain viable in the soil for many years. Acacia fleckeri plays a role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia fleckeri"
    },
    "taxonomy_art_desc": "Acacia fleckeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia fleckeri, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fleckeri is primarily native to Queensland. This species is found in the northern parts of the state, particularly in the tropical and subtropical regions. It typically grows in sandy soils and is often found in open woodlands and heathlands. The plant is well adapted to the local climate and plays a role in the local ecosystem. Its distribution is relatively limited, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Acacia fleckeri was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It has been reported in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often found in open woodlands and along riverbanks, adapting well to harsh environmental conditions. Its introduction has been primarily through natural dispersal and human activities such as land clearing and revegetation projects. Due to its resilience, it has become a common species in disturbed ecosystems."
}
