{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dietrichiana",
    "plant_slug": "acacia-dietrichiana",
    "plant_name_scientific": "acacia dietrichiana",
    "intro": "Acacia dietrichiana, commonly known as the dwarf silver wattle, is a small shrub native to Western Australia. It is characterized by its slender, wiry stems and feathery, bipinnate leaves that give it a delicate, fern-like appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia dietrichiana is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for coastal or sandy soils. It is often used in horticulture for its ornamental value and ability to thrive in challenging conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dietrichiana"
    },
    "taxonomy_art_desc": "Acacia dietrichiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia dietrichiana, a specific type of acacia that is notable for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dietrichiana is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This species thrives in sandy soils and is often seen in coastal areas and inland dry regions. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. The plant is well adapted to the climate and environmental conditions of Queensland.",
    "distribution_introduced_art_desc": "Acacia dietrichiana was mainly introduced to new environments for its ornamental value and potential for soil stabilization. It is commonly found in regions with arid or semi-arid climates, where it thrives in well-drained soils. This plant has been introduced to several countries in Africa and parts of the Middle East as part of ecological restoration projects. However, its spread has raised concerns due to its invasive potential in some areas. Proper management is necessary to prevent it from outcompeting native vegetation."
}
