{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia implexa var. brevipes",
    "plant_slug": "acacia-implexa-var-brevipes",
    "plant_name_scientific": "acacia implexa var. brevipes",
    "intro": "Acacia implexa var. brevipes, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Western Australia. It is characterized by its slender, often multi-stemmed form and small, feathery leaves that are typically less than 5 cm in length. The plant produces yellow flowers in late winter to early spring, which are clustered in compact, cylindrical inflorescences. It is adapted to arid and semi-arid environments, with a deep root system to access water. The species is also valued for its ornamental appeal and is often used in horticultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia implexa var. brevipes is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the Geraldton and Esperance areas. This species typically grows in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. The plant is part of the larger Acacia genus, which is known for its ecological and economic importance in Australia.",
    "distribution_introduced_art_desc": "Acacia implexa var. brevipes was mainly introduced to South Australia as a potential ornamental and potentially useful plant for rehabilitation projects. It was introduced during the early 20th century as part of efforts to establish hardy, drought-tolerant vegetation in arid and semi-arid regions. The plant was favored for its ability to thrive in poor soils and its capacity to fix nitrogen, which could improve soil fertility. However, its introduction has raised concerns due to its potential to become invasive in certain environments. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
