{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aspidioides",
    "plant_slug": "acacia-aspidioides",
    "plant_name_scientific": "acacia aspidioides",
    "intro": "Acacia aspidioides, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and bright yellow flowers that bloom in late winter to early spring. The plant is part of the Fabaceae family, known for its nitrogen-fixing ability, which benefits soil fertility. It thrives in a variety of soil types but prefers well-drained conditions. Acacia aspidioides is also valued for its ornamental appeal and is often used in landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aspidioides is primarily native to eastern and southern Africa, including countries such as South Africa, Mozambique, Tanzania, and Kenya. It is commonly found in savanna and woodland habitats, often growing in well-drained soils. This species is adapted to a variety of environmental conditions, including seasonal droughts and moderate temperatures. It plays an important ecological role by providing food and shelter for local wildlife. Acacia aspidioides is also valued for its hardy nature and is sometimes used in reforestation efforts.",
    "distribution_introduced_art_desc": "Acacia aspidioides was mainly introduced to areas with well-drained soils and full sun exposure, typically in tropical and subtropical regions. It thrives in arid and semi-arid environments, making it suitable for reclamation of degraded lands. The plant is often used for its hardy nature and ability to fix nitrogen, which benefits soil fertility. It has been introduced to several countries in Africa, Asia, and the Pacific for its ecological and agricultural benefits. However, its invasive potential in some regions requires careful management."
}
