{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hainanensis",
    "plant_slug": "acacia-hainanensis",
    "plant_name_scientific": "acacia hainanensis",
    "intro": "Acacia hainanensis, commonly known as the Hainan acacia, is a small to medium-sized evergreen tree native to Hainan Island in China. It is characterized by its slender, spreading crown and bipinnate leaves that are often covered in fine hairs. The plant produces yellowish-white flowers arranged in cylindrical inflorescences, which bloom during the dry season. Acacia hainanensis is adapted to tropical and subtropical climates and thrives in well-drained soils. It is also valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hainanensis is primarily native to the island of Hainan in China. It is found in the tropical and subtropical regions of the island, particularly in lowland areas with well-drained soils. This species thrives in humid climates and is commonly found in coastal forests and secondary vegetation. It is also occasionally reported in southern Vietnam and the northern parts of the Philippines. Acacia hainanensis is an important component of the local flora and plays a role in the ecological balance of its native habitat.",
    "distribution_introduced_art_desc": "Acacia hainanensis was mainly introduced to tropical and subtropical regions for its ornamental value and potential use in reforestation. It is commonly found in areas with well-drained soils and a warm climate, making it suitable for coastal and urban landscapes. The plant is also valued for its ability to thrive in poor soil conditions, which enhances its adaptability. Due to its drought tolerance, it has been introduced to several countries in Southeast Asia and the Pacific Islands. However, its introduction has raised concerns about potential invasiveness in non-native environments."
}
