{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sclerosperma",
    "plant_slug": "acacia-sclerosperma",
    "plant_name_scientific": "acacia sclerosperma",
    "intro": "Acacia sclerosperma, commonly known as the hard-seeded acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are grey-green in color. The plant produces yellow to pale yellow flowers in compact, globular inflorescences, followed by woody, hard-seeded pods. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. Acacia sclerosperma is also valued for its use in traditional medicine and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sclerosperma"
    },
    "taxonomy_art_desc": "Acacia sclerosperma belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes and some other related families. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are widespread in Australia and other regions. Its species is Acacia sclerosperma, a specific type of acacia known for its unique features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [
        "Palestine"
    ],
    "distribution_native_art_desc": "Acacia sclerosperma is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Geraldton and Shark Bay regions. This species thrives in sandy soils and is often associated with coastal and inland habitats. It is well adapted to the arid and semi-arid conditions of its native range. The plant plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia sclerosperma was mainly introduced to Palestine as a hardy, drought-resistant species for afforestation and land rehabilitation efforts. It is valued for its ability to thrive in arid and semi-arid environments, making it suitable for soil stabilization and preventing desertification. The plant has been used in reforestation projects to restore degraded lands and improve ecological resilience. Its introduction has contributed to the diversification of local vegetation and provided habitat for native wildlife. However, its spread requires careful management to prevent potential invasiveness in native ecosystems."
}
