{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rugata var. concinna",
    "plant_slug": "acacia-rugata-var-concinna",
    "plant_name_scientific": "acacia rugata var. concinna",
    "intro": "Acacia rugata var. concinna, commonly known as the narrow-leaf wattle, is a shrub native to Western Australia. It features slender, zigzagging stems and small, feathery leaves that are often covered in fine hairs. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical inflorescences. It is well adapted to arid and semi-arid environments, thriving in sandy or gravelly soils. This variety is valued for its ornamental appeal and ability to provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rugata var. concinna is primarily native to northern and central Australia. It is found in the states of Queensland, Northern Territory, and Western Australia. This variety thrives in arid and semi-arid regions, often growing in sandy or rocky soils. It is commonly found in open woodlands and along river systems. Its distribution is closely associated with areas that have a dry climate and low rainfall.",
    "distribution_introduced_art_desc": "Acacia rugata var. concinna was mainly introduced to South Australia and southern New South Wales. It is commonly found in sandy soils along coastal areas and in open woodlands. This plant is often used in revegetation projects due to its hardiness and ability to stabilize soil. It has also been introduced to parts of Victoria and Queensland as part of ecological restoration efforts. However, its spread is generally limited to specific environmental conditions and does not typically become invasive."
}
