{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fraseri",
    "plant_slug": "acacia-fraseri",
    "plant_name_scientific": "acacia fraseri",
    "intro": "Acacia fraseri, commonly known as the Fraser's acacia, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and produces yellow flowers in clusters. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. It belongs to the legume family, Fabaceae, and has the ability to fix nitrogen through symbiotic relationships with root nodules. Acacia fraseri is often used in revegetation projects due to its resilience and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fraseri is primarily native to the arid and semi-arid regions of Australia, particularly in the states of Queensland, New South Wales, and South Australia. It thrives in sandy soils and is commonly found in coastal dunes, inland sandplains, and rocky outcrops. This species is well adapted to drought conditions and can survive in areas with low rainfall. It plays an important ecological role by providing habitat and food for native wildlife. Acacia fraseri is also sometimes cultivated in gardens for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia fraseri was mainly introduced to South Africa, where it has since become an invasive species. It was originally brought there for ornamental purposes due to its attractive foliage and ability to thrive in various soil conditions. However, its rapid growth and spread have led to the displacement of native vegetation in certain areas. The plant is now considered a weed in some regions, particularly in grassland and woodland ecosystems. Its introduction has raised concerns about biodiversity loss and the need for effective management strategies."
}
