{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aciphylla",
    "plant_slug": "acacia-aciphylla",
    "plant_name_scientific": "acacia aciphylla",
    "intro": "Acacia aciphylla, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, often twisted stems and small, feathery leaves that are typically less than 1 cm in length. The plant produces yellow flowers in globular or cylindrical clusters, which appear in spring. It is well adapted to arid and semi-arid environments, showing drought tolerance and efficient water use. Acacia aciphylla plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aciphylla"
    },
    "taxonomy_art_desc": "Acacia aciphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive thorn-like structures and small flowers. Its species is Acacia aciphylla, a specific type of acacia characterized by its lack of leaves and its adaptation to harsh, arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aciphylla is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often seen in coastal and inland areas. It thrives in arid and semi-arid environments. Acacia aciphylla is an important component of the local flora and plays a role in the ecosystem of Western Australia.",
    "distribution_introduced_art_desc": "Acacia aciphylla was mainly introduced to areas with well-drained soils and moderate to high rainfall. It thrives in regions with full sun exposure and is commonly found in open woodlands and grasslands. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has led to its establishment in several parts of Australia. However, it can become invasive in certain environments if not managed properly."
}
