{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia quinquenervia",
    "plant_slug": "acacia-quinquenervia",
    "plant_name_scientific": "acacia quinquenervia",
    "intro": "Acacia quinquenervia, commonly known as the five-veined acacia, is a shrub or small tree native to tropical regions of Africa and the Arabian Peninsula. It is characterized by its slender, often spiny stems and bipinnate leaves with five distinct veins on each leaflet. The plant produces small, yellow flowers arranged in globular or cylindrical inflorescences, which are followed by flat, pod-like fruits containing several seeds. It thrives in well-drained soils and is often found in dry, open habitats. Acacia quinquenervia is also known for its ecological importance, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia quinquenervia"
    },
    "taxonomy_art_desc": "Acacia quinquenervia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have leaves with stipules and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees primarily found in arid and seasonal climates, known for their distinctive, often thorn-like foliage. Its species is Acacia quinquenervia, a specific type of acacia characterized by its five-veined leaves and is commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia quinquenervia is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This plant typically grows in dry, sandy soils and is often seen in shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native habitat. The species is an important component of the local flora and plays a role in the ecological balance of the region.",
    "distribution_introduced_art_desc": "Acacia quinquenervia was mainly introduced to areas with tropical and subtropical climates, often as an ornamental plant or for its hardy nature. It is commonly found in regions with well-drained soils and moderate to high rainfall. The plant has been introduced to several parts of the world, including parts of the United States, Australia, and Southeast Asia. Its introduction has sometimes led to it becoming invasive in certain environments. Due to its adaptability, it is now considered a potential weed in some regions where it has escaped cultivation."
}
