{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leucocephala",
    "plant_slug": "acacia-leucocephala",
    "plant_name_scientific": "acacia leucocephala",
    "intro": "Acacia leucocephala, commonly known as the white-headed acacia, is a deciduous shrub or small tree native to tropical Africa. It is characterized by its bipinnate leaves, which are divided into numerous small leaflets, and its distinctive yellow flowers that appear in dense, globular clusters. The plant produces flat, elongated pods that contain seeds covered in a sticky, resinous substance. It thrives in dry, sandy soils and is often found in savanna and woodland habitats. Acacia leucocephala is also valued for its role in soil stabilization and as a source of fodder for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leucocephala is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It is commonly found in savannas, woodlands, and along riverbanks in these regions. The plant thrives in areas with a tropical or subtropical climate and is often associated with dry or semi-arid environments. It is well adapted to poor soils and can tolerate drought conditions. Acacia leucocephala is also known for its ecological importance, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia leucocephala was mainly introduced to areas where it is used for its hard, durable wood and as a source of fodder for livestock. It is also valued for its ability to thrive in arid and semi-arid environments, making it useful for soil stabilization and land rehabilitation. The plant has been introduced to several regions in Africa, the Middle East, and parts of Asia for its ecological and economic benefits. However, its introduction has sometimes led to competition with native species and ecological imbalances. Despite these challenges, it remains an important plant in many regions for its multiple uses and adaptability."
}
