{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heterochroa subsp. robertii",
    "plant_slug": "acacia-heterochroa-subsp-robertii",
    "plant_name_scientific": "acacia heterochroa subsp. robertii",
    "intro": "Acacia heterochroa subsp. robertii, commonly known as the yellow acacia, is a shrub native to southern Africa. It is characterized by its slender, wiry stems and bipinnate leaves composed of small, oval-shaped leaflets. The plant produces yellow globular flowers that are clustered in dense, spherical inflorescences. It thrives in well-drained soils and is often found in rocky or sandy habitats. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its distinctive appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia heterochroa"
    },
    "taxonomy_art_desc": "Acacia heterochroa subsp. robertii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a unique structure called a papilionaceous corolla. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive fruit type and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acorn-like pods and often used in traditional medicine and as sources of timber. Its species is Acacia heterochroa, a specific type within the Acacia genus, distinguished by its unique morphological features and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heterochroa subsp. robertii is primarily native to Western Australia. This subspecies is found in the southwestern region of the state, particularly in areas with sandy soils. It typically grows in open habitats such as shrublands and coastal dunes. The plant is adapted to the dry and often harsh conditions of its native environment. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in its region.",
    "distribution_introduced_art_desc": "Acacia heterochroa subsp. robertii was mainly introduced to areas with well-drained soils and a temperate climate, particularly in regions where it can thrive in full sun. It is commonly found in disturbed habitats such as roadsides, open woodlands, and degraded soils. This subspecies is known for its ability to tolerate drought and poor soil conditions, making it adaptable to a variety of environments. It has been introduced to parts of the United States, including California and Oregon, where it has established populations. However, its spread is limited due to its specific ecological requirements and the presence of natural barriers."
}
