{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia × hybrida",
    "plant_slug": "acacia-×-hybrida",
    "plant_name_scientific": "acacia × hybrida",
    "intro": "Acacia × hybrida, commonly known as the silver wattle, is a hybrid plant resulting from the crossbreeding of Acacia dealbata and Acacia longifolia. It is a shrub or small tree native to southern Australia, characterized by its feathery, bipinnate leaves and yellow globular flowers. The plant is drought-tolerant and thrives in well-drained soils, making it adaptable to various environmental conditions. It is often cultivated for its ornamental value and is also used in reforestation projects due to its rapid growth and nitrogen-fixing ability. The species is notable for its ecological importance in supporting local wildlife and its role in stabilizing soil in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia × hybrida is primarily native to Australia. It is found in the eastern and southern regions of the country, including areas such as New South Wales, Victoria, and South Australia. This hybrid species is commonly found in a variety of habitats, including coastal areas, sandy soils, and disturbed sites. It is known for its adaptability and is often used in landscaping and reclamation projects. Its native range reflects its ability to thrive in diverse environmental conditions across Australia.",
    "distribution_introduced_art_desc": "Acacia × hybrida was mainly introduced to South Africa for its ornamental value and ability to thrive in arid conditions. It is commonly used in landscaping due to its fast growth and attractive foliage. The plant has also been introduced to other regions, including parts of Australia and the United States, for similar purposes. However, it has become invasive in some areas, outcompeting native vegetation. Its spread highlights the need for careful management of introduced species in ecological systems."
}
