{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia belairioides",
    "plant_slug": "acacia-belairioides",
    "plant_name_scientific": "acacia belairioides",
    "intro": "Acacia belairioides, commonly known as the narrow-leaf acacia, is a shrub native to the coastal regions of southern Africa. It is characterized by its slender, often zigzagging stems and small, bipinnate leaves that are typically gray-green in color. The plant produces yellow flowers in globular or cylindrical spikes, which appear during the warmer months. Acacia belairioides is adapted to arid and saline environments, making it a resilient species in coastal ecosystems. It plays a role in stabilizing dunes and providing habitat for various insects and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia belairioides is primarily native to the coastal regions of southern Western Australia. It is commonly found in sandy soils along the margins of the Swan Coastal Plain. This species thrives in open, sunny habitats such as coastal dunes and rocky outcrops. It is adapted to the dry, temperate climate of its native range. Acacia belairioides is an important component of the local flora and is often found in association with other coastal shrubs.",
    "distribution_introduced_art_desc": "Acacia belairioides was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in coastal regions. It thrives in full sun and is commonly planted for its ornamental value and ability to fix nitrogen. This species is often used in landscaping and reforestation projects due to its hardiness and adaptability. However, it can become invasive in certain environments if not properly managed. Its introduction has had both ecological and economic impacts depending on the region."
}
