{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia andongensis",
    "plant_slug": "acacia-andongensis",
    "plant_name_scientific": "acacia andongensis",
    "intro": "Acacia andongensis, commonly known as the Andong acacia, is a flowering plant native to Southeast Asia. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are bipinnate, with small, feather-like leaflets, and it produces yellow flowers in clusters. Acacia andongensis is valued for its ornamental appeal and ecological role in supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia andongensis is primarily native to the Philippines. It is found in the island of Mindanao, specifically in the provinces of Davao del Sur, Davao Oriental, and the Sulu Archipelago. This species thrives in tropical rainforests and secondary growth areas. It is often associated with disturbed habitats and is commonly found along roadsides and in open woodland areas. Due to habitat loss, it is considered vulnerable and requires conservation efforts to ensure its survival.",
    "distribution_introduced_art_desc": "Acacia andongensis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Kenya, Tanzania, and Uganda. This plant is valued for its ability to stabilize soil and prevent erosion in degraded landscapes. It also provides forage for livestock and has cultural significance in some local communities. Due to its hardy nature, it has been introduced to other parts of the world for reclamation and afforestation projects."
}
