{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia discolor var. unijuga",
    "plant_slug": "acacia-discolor-var-unijuga",
    "plant_name_scientific": "acacia discolor var. unijuga",
    "intro": "Acacia discolor var. unijuga, commonly known as the slender wattle, is a small shrub native to Australia. It is characterized by its delicate, feathery foliage and produces yellow flowers in clusters. The plant has small, flat, linear leaves that are often covered in fine hairs. It thrives in well-drained soils and is often found in coastal areas and sand dunes. The species is valued for its ornamental appeal and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia discolor var. unijuga is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variant is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. It thrives in environments with low rainfall and high temperatures, adapting well to harsh desert conditions. The plant is often seen in shrubland and savanna ecosystems, contributing to the local biodiversity. Its distribution is closely tied to the availability of well-drained soils and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acacia discolor var. unijuga was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It was originally cultivated for its aesthetic value in gardens and landscaped areas. However, it has since become an invasive species, spreading beyond cultivated areas into native ecosystems. Its rapid growth and ability to thrive in various soil types have contributed to its spread. Efforts are now being made to control its population to prevent further ecological disruption."
}
