{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia falciformis",
    "plant_slug": "acacia-falciformis",
    "plant_name_scientific": "acacia falciformis",
    "intro": "Acacia falciformis, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and narrow, feather-like leaves. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in dry, sandy soils and is adapted to arid and semi-arid environments. Acacia falciformis is also known for its ability to fix nitrogen, contributing to soil fertility in its ecosystem.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia falciformis"
    },
    "taxonomy_art_desc": "Acacia falciformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia falciformis, a specific type of acacia known for its sickle-shaped phyllodes and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [
        "Great Britain"
    ],
    "distribution_native_art_desc": "Acacia falciformis is primarily native to New South Wales, Queensland, and Victoria. This species is commonly found in the coastal and inland regions of these Australian states. It thrives in a variety of soil types but is often associated with sandy or well-drained soils. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important role in local ecosystems and is often used in restoration projects.",
    "distribution_introduced_art_desc": "Acacia falciformis was mainly introduced to Great Britain as an ornamental plant due to its unique foliage and drought tolerance. It was cultivated in gardens and landscaped areas for its aesthetic value and hardy nature. However, it has since spread beyond cultivated areas, raising concerns about its potential invasiveness. The plant's ability to thrive in various soil types and climates has contributed to its establishment in the wild. Despite its ornamental appeal, its ecological impact in Great Britain remains a subject of ongoing study."
}
