{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia triptycha",
    "plant_slug": "acacia-triptycha",
    "plant_name_scientific": "acacia triptycha",
    "intro": "Acacia triptycha, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow globular flowers in spring, which are clustered in inflorescences at the ends of the branches. Its seeds are enclosed in woody pods that split open when mature. Acacia triptycha is adapted to arid and semi-arid environments, making it a hardy species often found in dry coastal areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia triptycha"
    },
    "taxonomy_art_desc": "Acacia triptycha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex vascular systems. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, which comprises flowering plants with a wide range of morphological diversity and includes many economically important species. Its order is Fabales, a group of flowering plants that includes legumes and other plants capable of nitrogen fixation through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive acorn-like seed pods and often used for timber or as ornamental plants. Its species is Acacia triptycha, a specific type of acacia found in certain regions of Africa, distinguished by its unique leaf structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia triptycha is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal regions and inland areas of the state. This plant thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the dry climate and can tolerate poor soil conditions. Acacia triptycha plays an important ecological role in its native habitat by providing food and shelter for local wildlife.",
    "distribution_introduced_art_desc": "Acacia triptycha was mainly introduced to areas with a temperate to subtropical climate, characterized by well-drained soils and moderate rainfall. It thrives in regions where it can receive full sun exposure and has good air circulation. This plant is often found in coastal dunes, sandy soils, and disturbed sites due to its adaptability. Its introduction has been noted in parts of Australia, New Zealand, and the Pacific Islands. However, it is considered a potential weed in some regions due to its rapid growth and ability to spread easily."
}
