{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia falcata",
    "plant_slug": "acacia-falcata",
    "plant_name_scientific": "acacia falcata",
    "intro": "Acacia falcata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are narrow and often drooping. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia falcata is adapted to arid and semi-arid environments, making it drought-tolerant. It plays an important ecological role by providing nectar for honeyeaters and other native pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia falcata"
    },
    "taxonomy_art_desc": "Acacia falcata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia falcata, a specific type of acacia native to Australia, known for its sickle-shaped leaves and ecological importance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [
        "Jawa"
    ],
    "distribution_native_art_desc": "Acacia falcata is primarily native to New South Wales and Queensland. It is commonly found in the eastern regions of Australia, particularly in areas with sandy soils. This species thrives in dry and semi-arid environments, often growing in open woodlands and heathlands. It is well adapted to the local climate and plays an important role in the ecosystem. Its distribution is closely linked to the natural habitats of these two states.",
    "distribution_introduced_art_desc": "Acacia falcata was mainly introduced to Jawa for its hardy nature and ability to thrive in arid conditions. It is commonly found in degraded lands and along roadsides, where it helps prevent soil erosion. The plant is valued for its nitrogen-fixing properties, which improve soil fertility in nutrient-poor areas. However, its introduction has led to concerns about its potential to become invasive in local ecosystems. Despite its ecological benefits, careful management is needed to prevent unintended environmental impacts."
}
