{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia permixta var. glabra",
    "plant_slug": "acacia-permixta-var-glabra",
    "plant_name_scientific": "acacia permixta var. glabra",
    "intro": "Acacia permixta var. glabra, commonly known as the smooth acacia, is a shrub or small tree native to southern Africa. It is characterized by its smooth, often greyish bark and bipinnate leaves that are reduced to small, scale-like structures in some varieties. The plant produces yellow to golden globular inflorescences, which are rich in nectar and attract various pollinators. Its seeds are encased in hard pods and are often used in traditional medicine. Acacia permixta var. glabra is adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia permixta var. glabra is primarily native to northern Australia, including regions of Queensland and the Northern Territory. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This variety is adapted to dry climates and is often seen in open woodlands and shrublands. It plays an important role in local ecosystems by providing habitat and food for native fauna. Its distribution is closely associated with specific soil types and climatic conditions of the region.",
    "distribution_introduced_art_desc": "Acacia permixta var. glabra was mainly introduced to South Africa, where it has been widely planted for its ornamental value and potential for soil stabilization. It is commonly found in coastal and semi-arid regions, particularly in the Eastern and Western Cape provinces. This species is also cultivated in parts of Australia and New Zealand for similar reasons. However, its introduction has raised concerns due to its potential invasive nature in certain environments. It is important to monitor its spread to prevent ecological imbalances."
}
