{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macracantha",
    "plant_slug": "acacia-macracantha",
    "plant_name_scientific": "acacia macracantha",
    "intro": "Acacia macracantha, commonly known as the large-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and pinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow globular flower heads that appear in spring, attracting a variety of pollinators. Its seeds are encased in long, slender pods that split open to release the seeds. Acacia macracantha is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macracantha is primarily native to Australia. It is found in the arid and semi-arid regions of the country, particularly in the states of Western Australia, South Australia, and parts of Queensland. This species thrives in sandy or rocky soils and is commonly found in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of its native habitat. The plant is also known as the white wattle and is a characteristic feature of the Australian landscape.",
    "distribution_introduced_art_desc": "Acacia macracantha was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was also introduced for erosion control because of its ability to thrive in poor soil conditions. However, it has since become invasive, outcompeting native species and altering local ecosystems. Its rapid growth and prolific seed production contribute to its spread across various habitats. Despite its benefits in certain contexts, its ecological impact has raised concerns among conservationists."
}
