{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia floribunda var. latifolia",
    "plant_slug": "acacia-floribunda-var-latifolia",
    "plant_name_scientific": "acacia floribunda var. latifolia",
    "intro": "Acacia floribunda var. latifolia, commonly known as the broadleaf acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage composed of small, narrow leaves that are often arranged in pairs. The plant produces yellow, globular flower heads that bloom in spring, attracting pollinators such as bees and birds. It thrives in well-drained soils and full sun, making it suitable for arid and semi-arid regions. The wood is hard and durable, historically used for construction and fuel.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia floribunda var. latifolia is primarily native to the eastern regions of South Africa, including countries such as South Africa, Mozambique, and Zimbabwe. It is commonly found in savanna woodlands and grassland areas with well-drained soils. This variety thrives in regions with a subtropical climate, characterized by warm temperatures and a distinct dry season. It is often associated with rocky outcrops and is well adapted to fire-prone environments. Due to its resilience, it plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia floribunda var. latifolia was mainly introduced to South Africa, where it has been cultivated for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides, particularly in the Western and Eastern Cape provinces. This variant is known for its broad, lance-shaped leaves and clusters of yellow flowers that bloom in spring. Despite its aesthetic appeal, it has the potential to spread beyond cultivated areas and compete with native vegetation. Therefore, its introduction has raised concerns among conservationists regarding its impact on local ecosystems."
}
