{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tetragonocarpa f. scabra",
    "plant_slug": "acacia-tetragonocarpa-f-scabra",
    "plant_name_scientific": "acacia tetragonocarpa f. scabra",
    "intro": "Acacia tetragonocarpa f. scabra, commonly known as the rough acacia, is a shrub or small tree native to the arid and semi-arid regions of southern Africa. It is characterized by its distinctive quadrangular (four-sided) stems and compound leaves that are typically covered in fine, rough hairs. The plant produces yellow, globular flower heads that are clustered in dense spikes, which are a key feature for identification. Its small, leathery seeds are enclosed in woody pods and are adapted for dispersal by wind or animals. This species is well-suited to dry environments and is often used in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tetragonocarpa f. scabra is primarily native to northern Australia, including regions of Queensland and the Northern Territory. This plant is commonly found in arid and semi-arid environments, particularly in sandy soils. It thrives in open woodlands and shrublands, often in areas with low rainfall. The species is well adapted to the harsh conditions of the Australian outback. Its distribution is closely linked to the ecological zones characterized by low humidity and high temperatures.",
    "distribution_introduced_art_desc": "Acacia tetragonocarpa f. scabra was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Queensland. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has been associated with land rehabilitation projects in degraded landscapes. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
