{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stowardii",
    "plant_slug": "acacia-stowardii",
    "plant_name_scientific": "acacia stowardii",
    "intro": "Acacia stowardii, commonly known as the Stoward's wattle, is a shrub native to Western Australia. It is characterized by its slender, wiry stems and small, yellow floral spikes that bloom during the warmer months. The plant produces small, pod-like fruits that contain several seeds, which are dispersed by wind. Acacia stowardii is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system and reduced leaf surface. It plays a role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stowardii is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. It is commonly found in sandy soils and along riverbanks in these areas. This plant is well adapted to the harsh climate, with its small, waxy leaves helping to reduce water loss. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia stowardii is also sometimes referred to as the \"Stoward's wattle.\"",
    "distribution_introduced_art_desc": "Acacia stowardii was mainly introduced to Australia, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, particularly in the northern parts of the country. The plant is often associated with disturbed habitats and can spread rapidly in these environments. Due to its adaptability, it has been reported in several states including Queensland and Western Australia. However, its impact on native ecosystems is still being studied."
}
