{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia colletioides var. typica",
    "plant_slug": "acacia-colletioides-var-typica",
    "plant_name_scientific": "acacia colletioides var. typica",
    "intro": "Acacia colletioides var. typica, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow floral spikes that bloom in late winter to early spring. The plant is well adapted to arid and semi-arid environments, with deep roots that help it survive in drought conditions. It is a member of the Fabaceae family, known for its nitrogen-fixing capabilities. The golden wattle is also the national floral emblem of Australia, symbolizing the country's natural heritage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia colletioides var. typica is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia, Botswana, and southwestern Angola. It thrives in sandy soils and is commonly found in savanna and shrubland habitats. This species is well adapted to drought conditions and can tolerate high temperatures. It is often seen growing along roadsides and in open grasslands. Its distribution is closely linked to the availability of water and soil conditions in these regions.",
    "distribution_introduced_art_desc": "Acacia colletioides var. typica was mainly introduced to New Zealand as an ornamental plant due to its attractive golden foliage and hardy nature. It has since become naturalized in various regions, particularly in coastal and lowland areas. The plant is known for its ability to thrive in a range of soil types and its tolerance to drought and salt spray. However, it has raised concerns due to its potential to become invasive in certain environments. Its distribution continues to expand, prompting monitoring efforts to manage its ecological impact."
}
