{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polyantha",
    "plant_slug": "acacia-polyantha",
    "plant_name_scientific": "acacia polyantha",
    "intro": "Acacia polyantha, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its delicate, feathery foliage and clusters of small, yellow flowers that bloom in spring. The plant has compound leaves with numerous small leaflets, and its flowers are often visited by bees and other pollinators. Acacia polyantha is adapted to dry environments and is often found in heathlands and coastal areas. It is also valued for its ornamental appeal and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polyantha is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in a variety of habitats, including grasslands, savannas, and rocky outcrops. This plant is commonly found in regions with a tropical or subtropical climate. It plays an important ecological role by providing food and shelter for various wildlife species. Its distribution is also influenced by factors such as soil type and rainfall patterns.",
    "distribution_introduced_art_desc": "Acacia polyantha was mainly introduced to areas with warm, temperate climates and well-drained soils, particularly in regions of Australia and parts of Southeast Asia. It thrives in sunny conditions and is often found in coastal and inland regions where the soil is not too acidic. This plant is commonly used in landscaping due to its hardy nature and ability to tolerate drought. It has also been introduced to some parts of the United States, especially in southern states with similar environmental conditions. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
