{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia newbeyi",
    "plant_slug": "acacia-newbeyi",
    "plant_name_scientific": "acacia newbeyi",
    "intro": "Acacia newbeyi, commonly known as the Newbey acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, bipinnate leaves that are adapted to conserve water. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its survival in harsh environments. Acacia newbeyi plays a role in stabilizing soil and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia newbeyi"
    },
    "taxonomy_art_desc": "Acacia newbeyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or bean family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a group of flowering plants known for their shrub or tree forms, often with phyllodes instead of leaves, and a wide distribution in arid regions. Its species is Acacia newbeyi, a specific type of acacia native to Australia, characterized by its unique morphology and ecological adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia newbeyi is primarily native to Western Australia. It is found in the southern regions of the state, particularly in the areas around the Fitzgerald River National Park and the southern coast. This species thrives in sandy soils and is commonly found in coastal heathlands and open woodlands. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia newbeyi plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acacia newbeyi was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It has been commonly found in parts of Australia, particularly in Western Australia and South Australia. This plant is often used in reclamation projects due to its ability to stabilize soil and withstand drought conditions. Its introduction has sometimes led to concerns about potential invasiveness in non-native environments. However, it is generally considered a low-risk species for ecological disruption."
}
