{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia karina",
    "plant_slug": "acacia-karina",
    "plant_name_scientific": "acacia karina",
    "intro": "Acacia karina, commonly known as the yellow acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often branched stems and feathery, bipinnate leaves that are typically green with a slight waxy coating. The plant produces yellow flowers in globular clusters, which bloom during the dry season, attracting various pollinators. Acacia karina is adapted to arid environments and has a deep root system that helps it survive in nutrient-poor soils. It is also valued for its role in traditional medicine and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia karina"
    },
    "taxonomy_art_desc": "Acacia karina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in arid regions, known for their distinctive phyllodes and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia karina, a specific type of acacia found in certain regions of Africa, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia karina is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy or rocky soils and is often seen in shrublands and woodland areas. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Acacia karina is well adapted to the harsh climate of Western Australia.",
    "distribution_introduced_art_desc": "Acacia karina was mainly introduced to stabilize soil and prevent erosion in degraded lands. It is commonly found in arid and semi-arid regions where it thrives in poor soil conditions. This plant is valued for its ability to fix nitrogen, improving soil fertility over time. Its rapid growth and hardy nature make it a popular choice for reforestation and land rehabilitation projects. However, its introduction has sometimes led to competition with native species in certain ecosystems."
}
