{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia imbricata",
    "plant_slug": "acacia-imbricata",
    "plant_name_scientific": "acacia imbricata",
    "intro": "Acacia imbricata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are often covered in a fine layer of white, silky hairs. The plant produces yellow globular flowers in late winter to early spring, which are followed by flat, pod-like fruits. Acacia imbricata is well adapted to arid and semi-arid environments, thriving in sandy or rocky soils. It is also valued for its ornamental appeal and is used in reforestation efforts due to its hardiness and ability to fix nitrogen.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia imbricata"
    },
    "taxonomy_art_desc": "Acacia imbricata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often with compound leaves and pod fruits. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their thorny stems and often compound leaves. Its species is Acacia imbricata, a specific type of acacia found in certain regions, distinguished by its unique leaf and flower characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia imbricata is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the southern and western parts. This plant thrives in sandy soils and is often seen in open woodlands and scrublands. It is well adapted to the harsh climate of the region, with its small, waxy leaves helping to conserve water. Acacia imbricata plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia imbricata was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions. The plant thrives in disturbed soils and can spread rapidly through its extensive root system. Due to its hardiness, it has become naturalized in several parts of Africa and the Middle East. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation."
}
