{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sentis var. victoriae",
    "plant_slug": "acacia-sentis-var-victoriae",
    "plant_name_scientific": "acacia sentis var. victoriae",
    "intro": "Acacia sentis var. victoriae, commonly known as the Victoria acacia, is a shrub or small tree native to southern Australia. It is characterized by its feathery, bipinnate leaves and produces yellow globular flower heads. The plant thrives in well-drained soils and is adapted to arid and semi-arid environments. It is often used in landscaping for its ornamental value and drought tolerance. The species is also valued for its role in providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sentis var. victoriae is primarily native to the eastern regions of Australia, specifically Queensland and New South Wales. This variant is commonly found in coastal areas and sandy soils along the eastern coastline. It thrives in warm, temperate climates with well-drained soils. The plant is often seen in open woodlands and heathlands. Its distribution is closely associated with the subtropical and temperate zones of eastern Australia.",
    "distribution_introduced_art_desc": "Acacia sentis var. victoriae was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various soil types. It is commonly found in gardens and urban landscapes across regions with Mediterranean climates. This variety is known for its ability to thrive in full sun and well-drained soil conditions. However, it has raised concerns regarding its potential invasiveness in certain native ecosystems. Its distribution has expanded beyond its native range, leading to increased monitoring in areas where it may outcompete local flora."
}
