{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia samoryana",
    "plant_slug": "acacia-samoryana",
    "plant_name_scientific": "acacia samoryana",
    "intro": "Acacia samoryana, commonly known as the Samoryana acacia, is a flowering plant native to the arid and semi-arid regions of Africa. It is a small to medium-sized shrub or tree that typically grows in sandy soils and is adapted to withstand drought conditions. The plant produces yellow flowers arranged in cylindrical spikes, which are often visited by bees and other pollinators. Its leaves are bipinnate, consisting of multiple pairs of small, narrow leaflets. Acacia samoryana is also valued for its hard, durable wood and has been used in traditional practices in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia samoryana is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, Rwanda, Burundi, and the Democratic Republic of the Congo. It is commonly found in savanna and woodland habitats, often growing in areas with well-drained soils. This species is adapted to semi-arid and tropical climates, making it a resilient plant in regions with seasonal rainfall. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia samoryana is also known for its ability to thrive in disturbed soils, which contributes to its widespread distribution across the continent.",
    "distribution_introduced_art_desc": "Acacia samoryana was mainly introduced to South Africa, where it has become an invasive species. It was originally from West Africa but was introduced for its ornamental value and potential for soil stabilization. The plant thrives in disturbed areas and can outcompete native vegetation. It is now considered a weed in several regions due to its rapid growth and ability to spread through seeds. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
