{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pelophila",
    "plant_slug": "acacia-pelophila",
    "plant_name_scientific": "acacia pelophila",
    "intro": "Acacia pelophila, commonly known as the coastal acacia, is a shrub native to southern Africa. It is characterized by its slender, often spiny stems and small, bipinnate leaves. The plant produces yellow flowers in dense, globular clusters, which are followed by flat, pod-like fruits. It thrives in coastal and sandy environments, showing tolerance to salt spray and drought. Its ecological importance includes providing habitat and food for various native wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pelophila"
    },
    "taxonomy_art_desc": "Acacia pelophila belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and complex structures such as stomata. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of parts. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their distinctive phyllodes and often for their ability to fix nitrogen. Its species is Acacia pelophila, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pelophila is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. This species thrives in sandy soils and is commonly found in coastal and inland heathlands. It is adapted to the dry, temperate climate of the region. Acacia pelophila plays an important role in the local ecosystem by providing habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia pelophila was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, often along the western and southern coasts. The plant is well adapted to the local climate and can thrive in both full sun and partial shade. It is sometimes used in landscaping due to its hardy nature and attractive foliage. However, it is important to monitor its spread to prevent potential ecological impacts."
}
