{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica var. cupressiformis",
    "plant_slug": "acacia-nilotica-var-cupressiformis",
    "plant_name_scientific": "acacia nilotica var. cupressiformis",
    "intro": "Acacia nilotica var. cupressiformis, commonly known as the weeping acacia, is a deciduous shrub or small tree native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its pendulous, feathery foliage that gives it a distinctive, tree-like appearance. The plant produces yellow flowers in winter, followed by long, flat pods that contain seeds. Its bark is thick and fissured, and it has a deep root system that helps it survive in dry conditions. It is often used in traditional medicine and as a source of timber and charcoal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica var. cupressiformis is primarily native to parts of Africa, including countries such as Sudan, South Sudan, Ethiopia, and Eritrea. It is also found in regions of the Arabian Peninsula, including Saudi Arabia and Yemen. This variety thrives in arid and semi-arid environments, often growing in savannas and along riverbanks. It is well adapted to hot and dry climates with poor soil conditions. Its native distribution is closely linked to areas with a tropical or subtropical climate.",
    "distribution_introduced_art_desc": "Acacia nilotica var. cupressiformis was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reforestation projects due to its hardiness and ability to thrive in poor soil conditions. The plant is also valued for its timber and its role in traditional medicine. However, its introduction has sometimes led to competition with native species in certain ecosystems. It is widely cultivated in parts of Africa, the Middle East, and South Asia."
}
