{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glutinosissima",
    "plant_slug": "acacia-glutinosissima",
    "plant_name_scientific": "acacia glutinosissima",
    "intro": "Acacia glutinosissima, commonly known as the sticky acacia, is a shrub or small tree native to Australia. It is characterized by its glandular, sticky leaves that exude a resinous substance, which gives the plant its common name. The plant produces yellow flowers in globular or cylindrical clusters, typically during the warmer months. Its small, woody pods contain several seeds, which are dispersed by wind. Acacia glutinosissima is often found in dry, open habitats and is adapted to withstand arid conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia glutinosissima"
    },
    "taxonomy_art_desc": "Acacia glutinosissima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are native to Australia and include many species with distinctive foliage. Its species is Acacia glutinosissima, a specific type of acacia known for its sticky leaves and is typically found in arid and semi-arid regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glutinosissima is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This species thrives in arid and semi-arid environments, often growing in sandy or gravelly soils. It is typically found in open woodlands and shrublands. Its distribution is largely restricted to the coastal and inland areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia glutinosissima was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, often growing in sandy soils along coastal areas. The plant is known for its ability to thrive in dry conditions, making it adaptable to various environments. It has been used in restoration projects due to its resilience and ability to prevent soil erosion. However, its spread has raised concerns about its potential impact on native vegetation."
}
