{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decora",
    "plant_slug": "acacia-decora",
    "plant_name_scientific": "acacia decora",
    "intro": "Acacia decora, commonly known as the weeping acacia, is a flowering plant native to South Africa. It is characterized by its slender, drooping branches that give it a distinctive, elegant appearance. The plant produces small, yellow flowers that bloom in clusters during the warmer months. Its leaves are bipinnate, consisting of multiple small leaflets arranged in a feathery pattern. Acacia decora is often cultivated for ornamental purposes due to its unique form and seasonal blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia decora"
    },
    "taxonomy_art_desc": "Acacia decora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid and semi-arid regions, known for their distinctive thorn-like structures and small, fragrant flowers. Its species is Acacia decora, a specific type of acacia that is native to certain regions and is characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia decora is primarily native to New South Wales, Queensland, and Victoria. It is commonly found in coastal and lowland areas within these regions. This species thrives in a variety of soil types but prefers well-drained soils. It is often seen in open woodlands and heathlands. Acacia decora plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia decora was mainly introduced to India as an ornamental plant due to its attractive foliage and adaptability to various environmental conditions. It has been widely cultivated in gardens and landscapes across the country because of its drought tolerance and ability to thrive in poor soil. The plant is also valued for its use in traditional medicine and as a source of timber. However, its introduction has raised concerns about potential ecological impacts in native habitats. Despite these concerns, Acacia decora remains a popular choice for horticultural purposes in India."
}
