{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia galioides f. hirsutiuscula",
    "plant_slug": "acacia-galioides-f-hirsutiuscula",
    "plant_name_scientific": "acacia galioides f. hirsutiuscula",
    "intro": "Acacia galioides f. hirsutiuscula, commonly known as the woolly acacia, is a shrub native to southern Africa. It is characterized by its small, clustered leaves and yellow flowers that bloom in spring. The plant has a woody stem with a distinctive, flaky bark. It is adapted to arid environments and is often found in rocky soils. This variety is noted for its dense growth habit and is sometimes used in ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia galioides f. hirsutiuscula is primarily native to South Africa, specifically the Eastern Cape and Western Cape provinces. This subspecies is typically found in fynbos vegetation, which is a unique type of shrubland endemic to the region. It thrives in well-drained soils and is adapted to the Mediterranean climate characterized by wet winters and dry summers. The plant is often found in rocky outcrops and along the edges of sandy soils. Its distribution is limited to specific areas within its native range due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Acacia galioides f. hirsutiuscula was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, growing in sandy or rocky soils. This form is characterized by its dense, shrub-like growth and hairy foliage, distinguishing it from other acacia species. It is often used in horticulture for its ornamental value and ability to thrive in arid conditions. However, it is considered an invasive species in some areas, posing a threat to native vegetation."
}
