{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stigmatophylla",
    "plant_slug": "acacia-stigmatophylla",
    "plant_name_scientific": "acacia stigmatophylla",
    "intro": "Acacia stigmatophylla, commonly known as the narrow-leaf wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, often zigzagging stems and small, bipinnate leaves that are typically narrow and leathery. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. Acacia stigmatophylla is well adapted to drought conditions, with a deep root system that allows it to access water from deeper soil layers. It plays an important ecological role in stabilizing sandy soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stigmatophylla"
    },
    "taxonomy_art_desc": "Acacia stigmatophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some extinct groups. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have small, clustered flowers and include legumes and other related families. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and compound leaves. Its species is Acacia stigmatophylla, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stigmatophylla is primarily native to the Northern Territory and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy or gravelly soils, often in open woodlands or shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia stigmatophylla was mainly introduced to areas with dry to semi-arid climates, particularly in regions with well-drained soils. It is commonly found in coastal and inland dunes, as well as on rocky slopes and sandy soils. This plant has been introduced to several parts of Australia, including New South Wales, South Australia, and Western Australia. Its introduction is often associated with land clearing and agricultural activities. Due to its rapid growth and ability to thrive in disturbed environments, it can become invasive in certain ecosystems."
}
