{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hooperiana",
    "plant_slug": "acacia-hooperiana",
    "plant_name_scientific": "acacia hooperiana",
    "intro": "Acacia hooperiana, commonly known as the Hooper's acacia, is a small, evergreen shrub native to the coastal regions of southern Australia. It is characterized by its dense, feathery foliage and produces yellow, globular flower heads that bloom from late winter to early spring. The plant has compound leaves with phyllodes, which are flattened, leaf-like structures that perform photosynthesis. It is well adapted to coastal conditions, tolerating salt spray and sandy soils. Acacia hooperiana is often used in coastal landscaping due to its hardiness and ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hooperiana is primarily native to the island of Rodrigues, which is part of the Mascarene Islands in the Indian Ocean. This species is found in the dry coastal areas and low-lying regions of the island. It thrives in sandy soils and is adapted to the tropical climate with seasonal rainfall. Acacia hooperiana is commonly found in coastal dunes and near the shoreline. Its distribution is limited to Rodrigues, making it a rare and endemic species in this region.",
    "distribution_introduced_art_desc": "Acacia hooperiana was mainly introduced to New Zealand. It was brought there as part of the broader introduction of acacia species for agricultural and environmental purposes. This plant is now considered an invasive species in certain regions of New Zealand. Its rapid growth and ability to thrive in various soil types have led to its spread beyond its original introduction sites. Efforts are ongoing to control its distribution and mitigate its impact on native ecosystems."
}
