{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tubulifera",
    "plant_slug": "acacia-tubulifera",
    "plant_name_scientific": "acacia tubulifera",
    "intro": "Acacia tubulifera, commonly known as the narrow-leaved wattle, is a shrub native to the arid regions of Australia. It features feathery, bipinnate leaves that are adapted to reduce water loss in hot, dry climates. The plant produces yellow flowers in clusters, which are followed by long, slender pods. It is often found in sandy soils and is well-suited to drought conditions. Acacia tubulifera plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tubulifera is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savannas and shrublands. This species is well adapted to hot, dry climates and can tolerate poor soil conditions. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia tubulifera is also known for its distinctive cylindrical seed pods, which are a key feature of its appearance.",
    "distribution_introduced_art_desc": "Acacia tubulifera was mainly introduced to control soil erosion and for its ornamental value in arid and semi-arid regions. It is commonly found in areas with low rainfall and well-drained soils. The plant has been introduced in several countries in Africa, the Middle East, and parts of Australia. Due to its rapid growth and ability to thrive in harsh conditions, it has become naturalized in some regions. However, it is also considered a potential invasive species in certain ecosystems."
}
