{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella durangensis",
    "plant_slug": "acaciella-durangensis",
    "plant_name_scientific": "acaciella durangensis",
    "intro": "Acaciella durangensis, commonly known as the Durango acacia, is a small shrub native to the Mexican state of Durango. It belongs to the Fabaceae family, which includes legumes, and is characterized by its compound leaves and small, yellow flowers. The plant is adapted to arid and semi-arid environments, showcasing features such as reduced leaf surface to minimize water loss. It plays a role in local ecosystems by providing habitat and food for various insects and small animals. Due to its limited distribution, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella durangensis is primarily native to the mountainous regions of central Mexico, specifically in the states of Durango, Zacatecas, and San Luis Potosí. It thrives in arid and semi-arid environments, often found in rocky soils and on slopes. This species is adapted to withstand drought and high temperatures, making it a resilient plant in its native habitat. It is commonly found in scrublands and woodlands, contributing to the local biodiversity. Due to its limited distribution, it is considered a rare and endemic species in its region.",
    "distribution_introduced_art_desc": "Acaciella durangensis was mainly introduced to the region of Durango, Mexico, as part of ecological restoration efforts. It was introduced to restore degraded lands and combat soil erosion in arid and semi-arid environments. The plant was also introduced to enhance biodiversity in native ecosystems where it can thrive. Its introduction has been documented in several conservation projects aimed at rehabilitating native vegetation. However, its spread has raised concerns about potential invasiveness in non-native habitats."
}
