{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pruinocarpa",
    "plant_slug": "acacia-pruinocarpa",
    "plant_name_scientific": "acacia pruinocarpa",
    "intro": "Acacia pruinocarpa, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stem and bipinnate leaves that are covered in a fine, whitish bloom, giving it a silky appearance. The plant produces yellow flowers in clustered inflorescences, which are followed by flat, pod-like fruits containing several seeds. It thrives in arid and semi-arid environments, often growing on rocky soils. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pruinocarpa"
    },
    "taxonomy_art_desc": "Acacia pruinocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia pruinocarpa, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pruinocarpa is primarily native to the Northern Territory, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy or rocky soils and is often seen in shrublands and open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia pruinocarpa was mainly introduced to areas with well-drained soils and a temperate to subtropical climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in open woodlands and along rocky outcrops. Its introduction has been primarily for soil stabilization and as an ornamental species. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
