{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia euphleba",
    "plant_slug": "acacia-euphleba",
    "plant_name_scientific": "acacia euphleba",
    "intro": "Acacia euphleba, commonly known as the narrow-leaf acacia, is a small to medium-sized shrub or tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often thornless stems and bipinnate leaves that are narrow and feathery in appearance. The plant produces yellow to golden flowers in dense, globular clusters, which are highly attractive to pollinators such as bees and birds. Acacia euphleba is adapted to arid and semi-arid environments, making it a resilient species in dry landscapes. Its wood is sometimes used locally for fuel and minor construction purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia euphleba is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This plant is adapted to withstand high temperatures and low precipitation, making it a resilient component of the local flora. It plays an important ecological role by providing habitat and food for various wildlife species. Its distribution is closely linked to the specific environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia euphleba was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the inland parts of Western Australia and South Australia. This plant is often used for soil stabilization and as a windbreak due to its hardy nature. Its introduction has sometimes led to the displacement of native vegetation in certain areas. However, it is also valued for its ecological benefits, including providing habitat for local wildlife."
}
