{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens f. normalis",
    "plant_slug": "acacia-decurrens-f-normalis",
    "plant_name_scientific": "acacia decurrens f. normalis",
    "intro": "Acacia decurrens f. normalis, commonly known as the common wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, yellow flowers that appear in spring and summer. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It thrives in well-drained soils and is often found in open woodlands and grasslands. Acacia decurrens f. normalis is also valued for its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens f. normalis is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savanna and grassland habitats, often in areas with well-drained soils. This shrub or small tree thrives in regions with a temperate to subtropical climate. It is well adapted to dry conditions and can tolerate periods of drought. The species is also occasionally found in parts of eastern and southern Australia.",
    "distribution_introduced_art_desc": "Acacia decurrens f. normalis was mainly introduced to the southeastern United States, particularly in states like Florida and Texas. It was brought in for its ornamental value due to its attractive, feathery foliage and ability to thrive in coastal environments. The plant is commonly found in urban and suburban landscapes, where it is used for erosion control and as a decorative shrub. It has also been introduced to parts of California and the Gulf Coast for similar reasons. However, its spread has raised concerns due to its potential to become invasive in certain ecosystems."
}
