{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ruddiae",
    "plant_slug": "acacia-ruddiae",
    "plant_name_scientific": "acacia ruddiae",
    "intro": "Acacia ruddiae, commonly known as the Cape York acacia, is a shrub native to northern Australia. It is characterized by its slender, branching structure and phyllodes that are typically straight or slightly curved. The plant produces yellow flowers in globular heads, which appear during the warmer months. Its leaves are modified into phyllodes, a feature common in many acacia species, reducing water loss in arid environments. Acacia ruddiae is well adapted to drought and is often found in sandy soils across its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ruddiae is primarily native to the arid and semi-arid regions of southern Africa, particularly in Namibia and southwestern Angola. It thrives in sandy soils and is commonly found in coastal and inland dunes. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role in stabilizing sandy soils and providing habitat for local wildlife. Acacia ruddiae is also known for its distinctive yellow flowers and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia ruddiae was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance and hardy nature. However, it has since become invasive, outcompeting native species in certain regions. Its rapid growth and ability to thrive in various soil types contribute to its spread. Efforts are ongoing to control its distribution and mitigate its impact on local ecosystems."
}
