{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gorinii",
    "plant_slug": "acacia-gorinii",
    "plant_name_scientific": "acacia gorinii",
    "intro": "Acacia gorinii, commonly known as the Japanese acacia, is a small, deciduous shrub native to Japan. It features slender, zigzagging branches and small, feathery leaves that are often covered in fine hairs. The plant produces yellow flowers in clusters, which appear in early spring and are followed by flat, pod-like fruits. Acacia gorinii is valued for its ornamental appeal and is often cultivated in gardens for its delicate appearance. It prefers well-drained soil and partial to full sun, making it adaptable to a variety of garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gorinii is primarily native to the island of Socotra, which is located in the Arabian Sea, off the coast of Yemen. This unique plant is found in the arid and semi-arid regions of Socotra, where it thrives in rocky and coastal environments. It is well adapted to the harsh climate of the island, characterized by high temperatures and low rainfall. The species is part of the diverse flora of Socotra, which is known for its endemic plant species. Due to its restricted range, Acacia gorinii is considered a rare and vulnerable plant.",
    "distribution_introduced_art_desc": "Acacia gorinii was mainly introduced to South Africa, where it has been widely planted for its hardy nature and ability to thrive in arid conditions. It is commonly found in agricultural areas and along roadsides, where it serves as a windbreak and soil stabilizer. Despite its ecological benefits, it has also been reported to spread aggressively in some regions, potentially outcompeting native vegetation. The plant is well adapted to hot, dry climates and can tolerate poor soil conditions. Its introduction has had both positive and negative impacts on local ecosystems."
}
