{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia synoria",
    "plant_slug": "acacia-synoria",
    "plant_name_scientific": "acacia synoria",
    "intro": "Acacia synoria, commonly known as the silky acacia, is a shrub or small tree native to the arid regions of Australia. It is characterized by its slender, branching structure and its distinctive, feathery, yellow to golden-green foliage. The plant produces small, spherical pods that contain edible seeds, which are often used in traditional Indigenous Australian diets. Acacia synoria is adapted to survive in harsh, dry environments, with deep root systems and waxy leaves to reduce water loss. It also plays an important ecological role by providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia synoria"
    },
    "taxonomy_art_desc": "Acacia synoria belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have a distinctive leaf structure and include many legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its pod fruits and nitrogen-fixing abilities through root nodules. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often for their ability to thrive in arid environments. Its species is Acacia synoria, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia synoria is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid zones. This plant thrives in sandy soils and is often seen in coastal and inland areas. It is an important component of the local vegetation in these environments. Its distribution is largely restricted to the western parts of the state.",
    "distribution_introduced_art_desc": "Acacia synoria was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in arid and semi-arid regions where it thrives in poor soils. The plant is valued for its hardy nature and ability to establish quickly in disturbed areas. However, its rapid growth can lead to the displacement of native vegetation if not managed properly. It is often used in reclamation projects and as a windbreak in agricultural settings."
}
