{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fimbriata var. glabra",
    "plant_slug": "acacia-fimbriata-var-glabra",
    "plant_name_scientific": "acacia fimbriata var. glabra",
    "intro": "Acacia fimbriata var. glabra, commonly known as the smooth wattle, is a shrub or small tree native to Western Australia. It is characterized by its smooth, pale grey bark and trifoliate leaves composed of three elliptical leaflets. The plant produces yellow globular flower heads that bloom in late winter to early spring. It is adapted to arid and semi-arid environments, with a deep root system for water absorption. The species is valued for its ornamental appeal and its role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fimbriata var. glabra is primarily native to northern Australia, including parts of Queensland, the Northern Territory, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species is often associated with mulga woodlands and open grasslands. It thrives in areas with low rainfall and is well adapted to the harsh conditions of the Australian outback. Its distribution is closely linked to the availability of suitable habitats in these regions.",
    "distribution_introduced_art_desc": "Acacia fimbriata var. glabra was mainly introduced to areas with well-drained soils and a temperate climate, particularly in regions of Australia where it thrives in full sun. It is commonly found in dry sclerophyll forests and open woodlands, often growing on rocky or sandy soils. This plant is valued for its hardy nature and ability to withstand drought conditions, making it suitable for landscaping and erosion control. Its introduction has also led to its use in restoration projects due to its rapid growth and nitrogen-fixing capabilities. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
