{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dentifera",
    "plant_slug": "acacia-dentifera",
    "plant_name_scientific": "acacia dentifera",
    "intro": "Acacia dentifera, commonly known as the serrated acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow to golden-green flowers that appear in dense, globular clusters, typically during the warmer months. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia dentifera is well-suited to arid and semi-arid environments, showing resilience to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dentifera"
    },
    "taxonomy_art_desc": "Acacia dentifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and the production of pods containing seeds. Its species is Acacia dentifera, a specific type of acacia known for its serrated leaf margins and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dentifera is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the southwestern and central areas. This species thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distinctive appearance and resilience make it a notable component of the region's flora.",
    "distribution_introduced_art_desc": "Acacia dentifera was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and drought tolerance. It has since become naturalized in several regions, including parts of the Western Cape and the Eastern Cape. The plant is also used in reforestation projects because of its ability to thrive in poor soils and its role in preventing soil erosion. However, its invasive potential has raised concerns in some areas where it outcompetes native vegetation. Proper management is necessary to control its spread and minimize ecological impacts."
}
