{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella hirta",
    "plant_slug": "acaciella-hirta",
    "plant_name_scientific": "acaciella hirta",
    "intro": "Acaciella hirta, commonly known as the hairy acacia, is a small shrub native to arid and semi-arid regions of southern Africa. It is characterized by its dense, thorny foliage and small, pod-like fruits that contain edible seeds. The plant has small, pale green leaves that are covered in fine hairs, giving it a distinctive appearance. It is well adapted to drought conditions, with deep roots that allow it to survive in poor soil. Acaciella hirta plays an important role in local ecosystems by providing shelter and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella hirta is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It is commonly found in dry, open habitats such as grasslands and savannas. This species thrives in areas with well-drained soils and is often associated with disturbed or secondary vegetation. It is an important component of the flora in the Cerrado and Chaco biomes. Due to its adaptability, it can also be found in parts of Central America.",
    "distribution_introduced_art_desc": "Acaciella hirta was mainly introduced to areas with warm, arid climates and well-drained soils, often as an ornamental or for erosion control. It is commonly found in regions of Australia, South Africa, and parts of the United States. The plant thrives in full sun and is drought-tolerant, making it suitable for xeriscaping. However, it has been known to become invasive in some areas, outcompeting native vegetation. Its rapid growth and ability to spread through seeds and root sprouts contribute to its success in introduced habitats."
}
