{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia platyptera",
    "plant_slug": "acacia-platyptera",
    "plant_name_scientific": "acacia platyptera",
    "intro": "Acacia platyptera, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and small, bipinnate leaves composed of numerous thread-like leaflets. The plant produces yellow globular flowers in late winter to early spring, which are arranged in compact clusters. Acacia platyptera is adapted to arid and semi-arid environments, showing drought tolerance and a capacity for rapid growth after rainfall. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia platyptera is primarily native to Australia. It is commonly found in the arid and semi-arid regions of the country, particularly in Western Australia, South Australia, and parts of the Northern Territory. This plant thrives in sandy soils and is often associated with shrublands and grasslands. It is well adapted to drought conditions and can survive in harsh environmental conditions. Acacia platyptera plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia platyptera was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soils. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, it can become invasive in some areas if not managed properly. Its introduction has had both ecological and economic benefits in certain environments."
}
