{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia prostrata",
    "plant_slug": "acacia-prostrata",
    "plant_name_scientific": "acacia prostrata",
    "intro": "Acacia prostrata, commonly known as the prostrate acacia, is a low-growing shrub native to arid and semi-arid regions of Australia. It features woody stems that lie close to the ground, forming a dense mat-like structure. The plant produces small, yellow flowers arranged in spikes, which are typically followed by pod-like fruits containing several seeds. Its leaves are phyllodes, which are flattened leaf stalks that perform the functions of true leaves. Acacia prostrata is well adapted to harsh environments, showing resistance to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia prostrata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and along coastal dunes, where it thrives in harsh, dry conditions. This species is well adapted to withstand high temperatures and low rainfall, making it a characteristic plant of the Namib Desert and other similar ecosystems. It plays an important role in stabilizing sand dunes and providing habitat for local wildlife. Acacia prostrata is also sometimes found in rocky outcrops and coastal areas within its native range.",
    "distribution_introduced_art_desc": "Acacia prostrata was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh environmental conditions. The plant is also valued for its drought tolerance and capacity to fix nitrogen, improving soil fertility. Its introduction has helped in restoring degraded lands across several countries in Africa and the Middle East. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
