{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella breviracemosa",
    "plant_slug": "acaciella-breviracemosa",
    "plant_name_scientific": "acaciella breviracemosa",
    "intro": "Acaciella breviracemosa, commonly known as the narrow raceme acacia, is a shrub native to the Caribbean islands. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellow flowers arranged in compact inflorescences, which attract pollinators such as bees and butterflies. Its adaptability to coastal and dry environments makes it a resilient species in tropical regions. The bark and leaves have been used traditionally for their medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella breviracemosa is primarily native to the Caribbean region, specifically the islands of Cuba, Hispaniola, and the Bahamas. It is commonly found in coastal areas and dry forests, where it thrives in well-drained soils. This plant is adapted to tropical and subtropical climates, often growing in sandy or limestone soils. It plays an important ecological role in its native habitat by providing shelter and food for local wildlife. Due to its limited range, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acaciella breviracemosa was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and drought tolerance. It has since become naturalized in several regions, particularly in the Western Cape and along the coastal areas. The plant thrives in well-drained soils and is commonly found in disturbed habitats such as roadsides and urban gardens. Its rapid growth and ability to spread through seeds have led to concerns about its potential invasiveness. However, it is not currently classified as a major invasive species in the region."
}
