{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia anegadensis",
    "plant_slug": "acacia-anegadensis",
    "plant_name_scientific": "acacia anegadensis",
    "intro": "Acacia anegadensis, commonly known as the Anegada acacia, is a small evergreen shrub native to the British Virgin Islands. It is characterized by its dense, thorny foliage and small, fragrant yellow flowers that bloom in spring. The plant has bipinnate leaves composed of numerous tiny leaflets, and its pods contain seeds that are dispersed by wind. It thrives in coastal areas and is adapted to salt-laden air and sandy soils. Due to its limited distribution, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Vachellia",
        "species": "Vachellia anegadensis"
    },
    "taxonomy_art_desc": "Acacia anegadensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their distinct reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Vachellia, a group of flowering plants native to Africa and the Arabian Peninsula, often referred to as acacias, with distinctive leaf structures and thorns. Its species is Vachellia anegadensis, a specific type of acacia found in the Anegada Island, known for its adaptability to arid environments and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Leeward Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia anegadensis is primarily native to the Leeward Islands. This species is found in the tropical and subtropical regions of the Caribbean, specifically within the Leeward Islands. It thrives in coastal areas and dry, sandy soils. The plant is well adapted to the arid and saline conditions of its native habitat. It plays an important ecological role in stabilizing dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia anegadensis was mainly introduced to the Caribbean region, particularly the island of Anegada in the British Virgin Islands. It was brought there likely for ornamental purposes due to its attractive foliage and ability to thrive in coastal environments. The plant has since become established in the local ecosystem, growing along sandy shores and in dry, disturbed areas. Its introduction has raised concerns due to its potential to outcompete native vegetation. Despite its invasive tendencies, it remains a notable species in the region's flora."
}
