{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia neilii",
    "plant_slug": "acacia-neilii",
    "plant_name_scientific": "acacia neilii",
    "intro": "Acacia neilii, commonly known as the Neil's acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branching stems and feathery, bipinnate leaves. The plant produces yellow or golden flowers in globular or cylindrical clusters, which bloom in late winter to early spring. Acacia neilii is adapted to arid and semi-arid environments, making it drought-tolerant. Its ecological importance includes providing nectar for pollinators and serving as a habitat for various desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia neilii is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and Angola. It is commonly found in rocky outcrops, sandy soils, and coastal areas where it thrives in harsh, dry conditions. This species is well adapted to withstand high temperatures and low rainfall, making it a resilient component of local ecosystems. It plays an important role in stabilizing soil and providing habitat for various wildlife species. Acacia neilii is also sometimes cultivated in regions with similar climates for its ornamental value and ecological benefits.",
    "distribution_introduced_art_desc": "Acacia neilii was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has helped in restoring degraded lands across several countries in Africa and Australia. However, it has raised concerns about potential invasiveness in some ecosystems."
}
