{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eremaea",
    "plant_slug": "acacia-eremaea",
    "plant_name_scientific": "acacia eremaea",
    "intro": "Acacia eremaea, commonly known as the desert wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, wiry stems and small, yellow flowers that appear in clusters. The plant has small, bipinnate leaves that are adapted to reduce water loss in harsh environments. It produces long, slender pods that contain seeds, which are dispersed by wind. Acacia eremaea is well-suited to dry conditions and is often found in sandy or rocky soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia eremaea"
    },
    "taxonomy_art_desc": "Acacia eremaea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and complex reproductive structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acacia-like foliage and often used in traditional medicine. Its species is Acacia eremaea, a specific type of acacia found in arid regions, adapted to survive in harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eremaea is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is well adapted to the harsh climatic conditions of the region. Acacia eremaea is an important component of the local flora and is often found in shrublands and open woodlands.",
    "distribution_introduced_art_desc": "Acacia eremaea was mainly introduced to South Australia and Western Australia. It is commonly found in arid and semi-arid regions, growing on rocky soils and sand dunes. The plant is well adapted to dry conditions and can survive with minimal rainfall. It is often used in revegetation projects due to its resilience and ability to stabilize soil. However, it can become invasive in some areas if not managed properly."
}
