{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia capillaris",
    "plant_slug": "acacia-capillaris",
    "plant_name_scientific": "acacia capillaris",
    "intro": "Acacia capillaris, commonly known as the slender acacia, is a shrub native to southern Africa. It is characterized by its delicate, feathery foliage and yellow flower spikes that bloom in the summer months. The plant has small, bean-like pods that contain seeds, which are dispersed by wind. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia capillaris is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia capillaris"
    },
    "taxonomy_art_desc": "Acacia capillaris belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and the ability to fix nitrogen. Its species is Acacia capillaris, a specific type of acacia found in certain regions, known for its small, feathery leaves and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia capillaris is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This plant thrives in dry, sandy soils and is often seen in coastal and inland areas. It is well adapted to the arid and semi-arid climates of its native range. Acacia capillaris plays an important role in the local ecosystem and is a characteristic species of the region.",
    "distribution_introduced_art_desc": "Acacia capillaris was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since become naturalized in various regions, particularly in coastal and disturbed areas. The plant spreads through both seeds and vegetative propagation, contributing to its rapid establishment in new environments. Its introduction has raised concerns due to its potential to outcompete native species in certain ecosystems. Despite its ornamental value, management efforts are ongoing to control its spread in sensitive habitats."
}
