{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptospermoides subsp. leptospermoides",
    "plant_slug": "acacia-leptospermoides-subsp-leptospermoides",
    "plant_name_scientific": "acacia leptospermoides subsp. leptospermoides",
    "intro": "Acacia leptospermoides subsp. leptospermoides, commonly known as the slender-leaved wattle, is a shrub native to western Australia. It is characterized by its narrow, feathery leaves and yellow flowers that bloom in winter. The plant thrives in well-drained soils and is adapted to arid and semi-arid environments. It is often found in coastal and inland regions, forming part of the local flora. The species is valued for its ornamental appeal and ecological role in supporting native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leptospermoides"
    },
    "taxonomy_art_desc": "Acacia leptospermoides subsp. leptospermoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which includes legumes and related plants, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive phyllodes and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia leptospermoides, a specific type within the Acacia genus, characterized by its slender, spindly growth and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptospermoides subsp. leptospermoides is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the Geraldton and Shark Bay areas. This subspecies typically grows in sandy soils and is often found in coastal and inland regions. It is adapted to the arid and semi-arid climates of its native range. The plant is part of the broader Acacia flora that is characteristic of Western Australia's unique ecosystems.",
    "distribution_introduced_art_desc": "Acacia leptospermoides subsp. leptospermoides was mainly introduced to urban and rural landscapes in Australia for its ornamental value and hardy nature. It is commonly used in gardens and along roadsides due to its ability to thrive in a variety of soil conditions. This subspecies is also valued for its nitrogen-fixing properties, making it useful in soil rehabilitation projects. However, it has the potential to become invasive in certain environments if not managed properly. Its introduction has raised concerns about its impact on native plant communities in some regions."
}
