{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia asak var. unispinosa",
    "plant_slug": "acacia-asak-var-unispinosa",
    "plant_name_scientific": "acacia asak var. unispinosa",
    "intro": "Acacia asak var. unispinosa, commonly known as the slender acacia, is a shrub or small tree native to the tropical regions of Southeast Asia. It is characterized by its slender, sparsely branched stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow to golden-green globular flowers arranged in compact, cylindrical clusters. It thrives in well-drained soils and is adapted to humid, warm climates. This variety is valued for its ornamental appeal and is sometimes used in horticulture for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia asak var. unispinosa is primarily native to the islands of the western Pacific, including parts of Indonesia, the Philippines, and Papua New Guinea. This variant is commonly found in tropical and subtropical regions, particularly in coastal and lowland areas. It thrives in sandy soils and is often associated with coastal dunes and disturbed sites. The plant is well adapted to high salinity and wind exposure, making it a common species in coastal vegetation. Its distribution is largely limited to the Indo-Pacific region, where it plays a role in stabilizing sand dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia asak var. unispinosa was mainly introduced to areas with warm, tropical climates and well-drained soils, often found in coastal regions and disturbed sites. It is commonly used for its hardy nature and ability to thrive in poor soil conditions. This plant is often introduced for erosion control and as an ornamental due to its attractive foliage and flowers. However, it can become invasive in some regions if not managed properly. Its introduction has raised concerns about its potential impact on native ecosystems."
}
