{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lehmannii",
    "plant_slug": "acacia-lehmannii",
    "plant_name_scientific": "acacia lehmannii",
    "intro": "Acacia lehmannii, commonly known as the Lehmann's wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features bright yellow flowers that bloom in spring, attracting pollinators such as bees and birds. Its woody stems and bipinnate leaves are typical of many Acacia species. Acacia lehmannii is often found in dry, sandy soils and is adapted to arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lehmannii is primarily native to South Africa, specifically the western and southwestern regions. It is commonly found in the Karoo and surrounding areas, where it thrives in arid and semi-arid environments. This species is adapted to sandy soils and can withstand periods of drought. It is often seen growing along roadsides and in open plains. Acacia lehmannii plays an important ecological role in its native habitat by providing shelter and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia lehmannii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in rocky soils and along coastal areas. This plant is often used for its hardy nature and ability to thrive in arid conditions. However, its introduction has raised concerns about its potential to become invasive in local ecosystems. Despite its ornamental value, careful management is needed to prevent its spread into native habitats."
}
