{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farnesiana var. pedunculata",
    "plant_slug": "acacia-farnesiana-var-pedunculata",
    "plant_name_scientific": "acacia farnesiana var. pedunculata",
    "intro": "Acacia farnesiana var. pedunculata, commonly known as the sweet acacia or weeping acacia, is a shrub or small tree native to tropical and subtropical regions. It is characterized by its feathery, bipinnate leaves and clusters of small, yellow, fragrant flowers. The plant produces long, slender pods that contain seeds surrounded by a fibrous covering. It thrives in well-drained soils and requires full sun to partial shade. Its ornamental value is enhanced by its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farnesiana var. pedunculata is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and the Middle East. It thrives in coastal areas and is commonly found in sandy or rocky soils. This variety is also native to certain regions of the Canary Islands and Madeira. It is well adapted to dry, sunny climates and is often seen along coastal dunes. Its natural range extends to some parts of southern California in the United States, where it has been introduced.",
    "distribution_introduced_art_desc": "Acacia farnesiana var. pedunculata was mainly introduced to the southern United States, particularly in Texas and Florida, as an ornamental plant due to its attractive yellow flowers and adaptability to various soil types. It has also been introduced to parts of California and the Caribbean, where it has established itself in disturbed habitats and along roadsides. This introduction has led to its spread into native ecosystems, raising concerns about its potential invasiveness. Despite its aesthetic appeal, it can outcompete native vegetation in certain environments. Its distribution is primarily associated with human activity, including landscaping and erosion control efforts."
}
