{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mimica var. angusta",
    "plant_slug": "acacia-mimica-var-angusta",
    "plant_name_scientific": "acacia mimica var. angusta",
    "intro": "Acacia mimica var. angusta, commonly known as the narrow-leaf acacia, is a shrub native to Australia. It features slender, angular stems and narrow, feather-like leaves that are often covered in fine hairs. The plant produces yellow globular flowers that bloom in late winter to early spring. It is adapted to arid and semi-arid environments, making it drought-tolerant. This variety is valued for its ornamental appeal and ability to thrive in well-drained soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mimica"
    },
    "taxonomy_art_desc": "Acacia mimica var. angusta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which comprises plants with flowers typically having five petals and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as timber. Its species is Acacia mimica, a specific type of acacia known for its narrow leaves and is a variant of the species with the botanical name var. angusta.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mimica var. angusta is primarily native to Western Australia. This variant of Acacia mimica is found in the southern regions of the state, particularly in the areas of the Geraldton and Esperance regions. It typically grows in sandy soils and is often associated with coastal and inland dune environments. The plant is well adapted to the arid and semi-arid conditions of its native habitat. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia mimica var. angusta was mainly introduced to ornamental horticulture and ecological restoration projects due to its unique foliage and adaptability. It is commonly found in regions with arid or semi-arid climates, where it thrives in well-drained soils. The plant's ability to tolerate drought and poor soil conditions makes it a valuable addition to landscaping and reclamation efforts. However, its introduction has raised concerns about potential invasiveness in non-native environments. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
