{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia asak",
    "plant_slug": "acacia-asak",
    "plant_name_scientific": "acacia asak",
    "intro": "Acacia asak, commonly known as the Japanese acacia, is a flowering plant native to Japan and parts of eastern Asia. It is a deciduous shrub or small tree that typically grows to a height of 2 to 5 meters. The plant is characterized by its feathery, bipinnate leaves and yellow flowers that appear in clusters. Acacia asak is often cultivated for its ornamental value and is also used in traditional medicine. Its ability to thrive in a variety of soil types makes it a versatile plant in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia asak is primarily native to the island of Socotra, located in the Arabian Sea. It is found in the arid and semi-arid regions of Socotra, where it thrives in rocky and limestone soils. This species is well adapted to the harsh climate of the island, which includes high temperatures and low rainfall. Acacia asak is part of the unique flora of Socotra, which is known for its endemic plant species. It plays an important ecological role in the local environment, providing habitat and food for various wildlife.",
    "distribution_introduced_art_desc": "Acacia asak was mainly introduced to Hawaii. It was brought there during the 19th century as an ornamental plant due to its attractive appearance. However, it has since become invasive, outcompeting native species for resources. Its rapid growth and ability to thrive in various soil types contribute to its spread. Efforts are ongoing to control its population to protect the local ecosystem."
}
