{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia richii",
    "plant_slug": "acacia-richii",
    "plant_name_scientific": "acacia richii",
    "intro": "Acacia richii, commonly known as the Socotra acacia, is a unique plant native to the island of Socotra. It is characterized by its distinctive, umbrella-like crown and feathery, thornless branches. The plant produces small, yellow flowers that bloom in clusters, followed by flat, pod-like fruits containing seeds. Its leaves are usually reduced to spines, which help reduce water loss in the arid environment. Acacia richii is adapted to survive in harsh, dry conditions, making it a resilient species of the Arabian Peninsula.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia richii"
    },
    "taxonomy_art_desc": "Acacia richii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia richii, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia richii is primarily native to Fiji. It is found in the tropical regions of the country, particularly in the lowland areas and coastal regions. This plant thrives in humid and warm climates, often growing in open woodlands or along riverbanks. It plays an important ecological role in its native habitat by providing shelter and food for various local wildlife. Acacia richii is well adapted to the environmental conditions of Fiji, making it a significant part of the local flora.",
    "distribution_introduced_art_desc": "Acacia richii was mainly introduced to coastal and inland areas of the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is commonly found in disturbed soils and along roadsides, where it thrives in dry, sunny conditions. This plant has been spread through human activities such as agriculture and land development. Its rapid growth and ability to colonize new areas make it an invasive species in many regions. However, it also plays a role in stabilizing soils and providing habitat for certain wildlife."
}
