{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia seifriziana",
    "plant_slug": "acacia-seifriziana",
    "plant_name_scientific": "acacia seifriziana",
    "intro": "Acacia seifriziana, commonly known as the Cape York acacia, is a shrub or small tree native to northern Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow globular flowers arranged in dense, cylindrical spikes, which bloom during the wet season. It is adapted to arid and semi-arid environments, with deep roots that allow it to access groundwater. Acacia seifriziana is also known for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia seifriziana is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. This species is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia seifriziana is often used in traditional medicine and has cultural significance in the communities where it is found.",
    "distribution_introduced_art_desc": "Acacia seifriziana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. The plant thrives in sandy soils and is often associated with coastal and semi-arid environments. Due to its rapid growth and ability to spread through seed dispersal, it has become an invasive species in some areas. Its introduction has raised concerns about its impact on native vegetation and biodiversity."
}
