{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polifolia",
    "plant_slug": "acacia-polifolia",
    "plant_name_scientific": "acacia polifolia",
    "intro": "Acacia polifolia, commonly known as the coastal acacia, is a shrub native to the coastal regions of southern Africa. It is characterized by its dense, feathery foliage and yellow flowers that bloom in clusters. The plant has small, flat leaves that help reduce water loss in its arid environment. It is often used in coastal dune stabilization due to its strong root system. Acacia polifolia is also valued for its ornamental appeal and ability to thrive in sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia polifolia"
    },
    "taxonomy_art_desc": "Acacia polifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex vascular systems. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a wide range of morphological diversity and are often found in tropical and temperate regions. Its order is Fabales, which includes plants with compound leaves and flowers that have a distinctive arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their acorn-like seed pods and often used in various ecological and economic contexts. Its species is Acacia polifolia, a specific type of acacia known for its unique leaf structure and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polifolia is primarily native to Queensland. It is commonly found in the eastern regions of the state, particularly in areas with sandy soils. This plant thrives in open habitats such as woodlands and grasslands. It is well adapted to the local climate and soil conditions of Queensland. Acacia polifolia plays an important role in the local ecosystem and is often used in restoration projects.",
    "distribution_introduced_art_desc": "Acacia polifolia was mainly introduced to areas with well-drained soils and moderate climates, often in regions where it is used for erosion control and as a windbreak. It thrives in full sun and is commonly found in disturbed soils along roadsides and in agricultural fields. The plant is known for its ability to fix nitrogen, making it beneficial for soil enrichment. However, it can become invasive in some regions if not managed properly. Its distribution has expanded beyond its native range due to its adaptability and ecological benefits."
}
