{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catechu var. erythrantha",
    "plant_slug": "acacia-catechu-var-erythrantha",
    "plant_name_scientific": "acacia catechu var. erythrantha",
    "intro": "Acacia catechu var. erythrantha, commonly known as the red acacia, is a shrub or small tree native to tropical regions of Africa and Asia. It is characterized by its slender, often thornless branches and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow to orange globular flower heads, which are clustered in dense, cylindrical inflorescences. Its seeds are encased in a hard, woody pod, and the plant is known for its ability to thrive in dry, arid environments. The wood and bark of Acacia catechu var. erythrantha have been traditionally used for tanning and medicinal purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catechu var. erythrantha is primarily native to Southeast Asia, including countries such as India, Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in forested areas and along riverbanks. This variant of Acacia catechu thrives in humid climates with well-drained soils. It is often associated with secondary forests and is known for its hard, heavy wood. The plant plays an important ecological role in these regions, supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acacia catechu var. erythrantha was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Southeast Asia, including parts of India, Indonesia, and the Philippines. This plant is often cultivated for its hard, durable wood and its use in traditional medicine. It has also been introduced to other parts of the world for ornamental purposes due to its attractive foliage and adaptability. However, its spread can sometimes lead to ecological impacts in non-native environments."
}
