{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis f. spirocarpa",
    "plant_slug": "acacia-tortilis-f-spirocarpa",
    "plant_name_scientific": "acacia tortilis f. spirocarpa",
    "intro": "Acacia tortilis f. spirocarpa, commonly known as the spiral acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive spiral arrangement of thorns, which are often curved and twisted. The plant produces yellow flowers and flat, bipinnate leaves that are adapted to reduce water loss in hot, dry environments. Its root system is deep and extensive, allowing it to access groundwater in nutrient-poor soils. This species plays an important ecological role by providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis f. spirocarpa is primarily native to the Horn of Africa, including countries such as Somalia, Eritrea, and Ethiopia. It is also found in parts of the Arabian Peninsula, particularly in Yemen and Oman. This subspecies thrives in arid and semi-arid environments, often growing in rocky soils and along coastal areas. It plays an important ecological role in these regions by providing habitat and food for various wildlife species. Its distribution is closely linked to the availability of water and suitable soil conditions in its native range.",
    "distribution_introduced_art_desc": "Acacia tortilis f. spirocarpa was mainly introduced to areas with arid or semi-arid climates, where it thrives in sandy or rocky soils. It is commonly found in regions of Africa, particularly in countries like Sudan, Ethiopia, and Kenya. This subspecies is known for its ability to withstand drought and high temperatures, making it well-suited for harsh environments. It plays an important role in stabilizing soil and providing habitat for various wildlife species. Additionally, it has been used traditionally for its timber and as a source of food and medicine."
}
