{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pseudowightii",
    "plant_slug": "acacia-pseudowightii",
    "plant_name_scientific": "acacia pseudowightii",
    "intro": "Acacia pseudowightii, commonly known as the white acacia, is a flowering plant native to southern Africa. It is a small, shrub-like tree that typically grows in dry, sandy soils. The plant produces small, yellow flowers arranged in cylindrical clusters, which bloom during the dry season. Its leaves are bipinnate, consisting of numerous tiny leaflets, and it has a distinctive, knobby root system. Acacia pseudowightii is adapted to arid environments and plays a role in stabilizing soil in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pseudowightii is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species thrives in open woodlands and shrublands, often along watercourses or in areas with seasonal rainfall. It is well adapted to the harsh conditions of the Australian outback. Its distribution is largely limited to the inland regions of northern Australia.",
    "distribution_introduced_art_desc": "Acacia pseudowightii was mainly introduced to areas with semi-arid to arid climates, particularly in regions with well-drained soils. It thrives in environments with low rainfall and high temperatures, making it suitable for degraded or disturbed lands. This plant is often used for soil stabilization and as a source of fodder for livestock. Its introduction has been noted in parts of Africa and the Middle East where it has adapted well to the local conditions. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
