{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia impressa",
    "plant_slug": "acacia-impressa",
    "plant_name_scientific": "acacia impressa",
    "intro": "Acacia impressa, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its narrow, feathery leaves. The plant produces yellow flowers in spring, which are clustered in spherical inflorescences. Acacia impressa is adapted to arid and semi-arid environments, making it drought-tolerant. Its root system helps prevent soil erosion, contributing to its ecological importance in native landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia impressa is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savannas and shrublands. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia impressa is also sometimes cultivated for its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia impressa was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and ability to thrive in various soil conditions. It has since spread beyond cultivated areas, becoming established in native ecosystems, particularly in coastal and lowland regions. The plant's rapid growth and seed dispersal mechanisms have contributed to its invasive potential in some parts of the country. Despite its ornamental value, it is now considered a weed in certain regions, posing a threat to local biodiversity. Management efforts are ongoing to control its spread and minimize ecological impacts."
}
