{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia officinalis",
    "plant_slug": "acacia-officinalis",
    "plant_name_scientific": "acacia officinalis",
    "intro": "Acacia officinalis, commonly known as the medicinal acacia, is a shrub native to the Mediterranean region. It is characterized by its feathery, bipinnate leaves and yellow, globular flower heads. The plant produces a resinous gum that has been used in traditional medicine for its healing properties. Its botanical features include a woody stem, small leaves, and clusters of yellow flowers. The plant is also valued for its ornamental appeal and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tasmania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia officinalis is primarily native to Tasmania. It is commonly found in various habitats across the island, including coastal areas, heathlands, and dry forests. This plant thrives in well-drained soils and is adapted to the temperate climate of Tasmania. It plays an important ecological role in supporting local wildlife and maintaining biodiversity. Acacia officinalis is also valued for its medicinal properties and has been used by Indigenous communities for generations.",
    "distribution_introduced_art_desc": "Acacia officinalis was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of Australia, Africa, and the Middle East. This plant is often used for its medicinal properties, including its use in traditional medicine for treating various ailments. Its introduction has sometimes led to ecological concerns due to its ability to spread rapidly in new environments. Despite these challenges, it remains an important species in both ecological and pharmaceutical contexts."
}
