{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nubica var. erythraea",
    "plant_slug": "acacia-nubica-var-erythraea",
    "plant_name_scientific": "acacia nubica var. erythraea",
    "intro": "Acacia nubica var. erythraea, commonly known as the Erythraean acacia, is a shrub native to the Horn of Africa and the Arabian Peninsula. It is characterized by its small, yellow flowers and compound leaves with thorny tips. The plant thrives in arid and semi-arid environments, making it well-adapted to dry climates. Its bark and leaves are used in traditional medicine for their purported healing properties. The species is also valued for its role in preventing soil erosion in degraded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nubica var. erythraea is primarily native to the Horn of Africa, including countries such as Eritrea, Ethiopia, and Somalia. It is also found in parts of Sudan and the Arabian Peninsula. This plant thrives in arid and semi-arid environments, often growing in rocky soils and along coastal areas. It is commonly found in dry savannas and shrublands. Its distribution is closely associated with regions that have a dry climate and limited rainfall.",
    "distribution_introduced_art_desc": "Acacia nubica var. erythraea was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of North Africa and the Middle East. This plant is often used for its hardy nature and ability to prevent soil erosion. It has been introduced to various parts of the world for reclamation projects and as an ornamental plant. Due to its adaptability, it has become naturalized in some regions outside its native range."
}
