{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella talpana",
    "plant_slug": "acaciella-talpana",
    "plant_name_scientific": "acaciella talpana",
    "intro": "Acaciella talpana, commonly known as the Mexican acacia, is a shrub native to Mexico and parts of Central America. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant features compound leaves with small, oval-shaped leaflets and produces yellow to orange flowers in clusters. Its seeds are encased in hard pods, and the plant is often used in traditional medicine. Acaciella talpana is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella talpana is primarily native to the Caribbean islands, particularly the Greater Antilles. It is commonly found in the tropical regions of Cuba, Hispaniola, and Jamaica. This plant thrives in dry, limestone-based soils and is often associated with coastal and dry forest ecosystems. It is also present in parts of the Florida Keys, where it has been introduced but is not native. Acaciella talpana is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acaciella talpana was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, grazing lands, and abandoned agricultural fields. It thrives in regions with a warm climate and low rainfall, making it common in tropical and subtropical zones. The plant is often spread through seed dispersal by animals or wind, contributing to its rapid colonization of new areas. Its introduction has led to concerns about its potential invasiveness in certain ecosystems. Due to its adaptability, it is now found in several countries across Africa and parts of the Middle East."
}
