{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ehrenbergiana",
    "plant_slug": "acacia-ehrenbergiana",
    "plant_name_scientific": "acacia ehrenbergiana",
    "intro": "Acacia ehrenbergiana, commonly known as the white acacia, is a flowering plant native to arid and semi-arid regions of Africa and the Middle East. It is a small to medium-sized shrub or tree that typically grows up to 5 meters in height. The plant is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in clusters. Its bark is often fissured and greyish in color, while its branches are usually thornless. Acacia ehrenbergiana is well adapted to drought conditions, making it a resilient species in harsh environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ehrenbergiana is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, particularly in coastal and inland deserts. This plant thrives in sandy soils and is often seen growing along dunes and in shrublands. It plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife. Acacia ehrenbergiana is well adapted to the harsh climate of its native range, with its deep root system and drought-resistant characteristics.",
    "distribution_introduced_art_desc": "Acacia ehrenbergiana was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This plant is often used in reclamation projects due to its hardy nature and ability to thrive in harsh conditions. It has also been introduced as an ornamental plant in some regions for its attractive foliage and floral display. However, its introduction has sometimes led to ecological concerns due to its potential to become invasive in certain environments."
}
