{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lophantha",
    "plant_slug": "acacia-lophantha",
    "plant_name_scientific": "acacia lophantha",
    "intro": "Acacia lophantha, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, feathery leaves and distinctive yellow flowers that bloom in spring. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. It thrives in a variety of soil types but prefers well-drained soils and full sun. Acacia lophantha is often used in landscaping due to its ornamental value and ability to tolerate drought.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lophantha is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, growing in sandy or rocky soils. This plant is often seen in savanna and thicket ecosystems, where it thrives in full sun and has adapted to drought conditions. It plays an important role in the local environment by providing habitat and food for various wildlife species. Acacia lophantha is also known for its distinctive yellow flowers and thorny structure.",
    "distribution_introduced_art_desc": "Acacia lophantha was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces. This plant thrives in coastal and sandy soils, often along the edges of forests and in disturbed areas. Its introduction has led to concerns about its potential invasiveness in some ecosystems. It is used for erosion control and as a source of timber and fuelwood."
}
