{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pyrifolia",
    "plant_slug": "acacia-pyrifolia",
    "plant_name_scientific": "acacia pyrifolia",
    "intro": "Acacia pyrifolia, commonly known as the flame tree, is a deciduous shrub or small tree native to eastern Australia. It is characterized by its striking, bright red or orange flowers that appear in clusters during the spring and summer seasons. The plant has feathery, bipinnate leaves that are often shed during dry periods. Its bark is smooth and greyish, with a flaky texture that peels away in strips. Acacia pyrifolia is well adapted to arid and semi-arid environments, making it a resilient and ornamental species in native gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pyrifolia"
    },
    "taxonomy_art_desc": "Acacia pyrifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its nitrogen-fixing ability and diverse ecological roles. Its genus is Acacia, a large group of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia pyrifolia, a specific type of acacia native to Australia, characterized by its flame-like foliage and ability to thrive in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pyrifolia is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Cape Le Grand National Park. This plant thrives in coastal and sandy soils, often growing in heathlands and woodlands. It is well adapted to the Mediterranean climate of the region, characterized by hot, dry summers and mild, wet winters. Acacia pyrifolia plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia pyrifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the eastern coast, thriving in coastal and semi-arid environments. The plant is valued for its hardy nature and ability to tolerate poor soil conditions. It has also been introduced to other parts of the world, including Australia and New Zealand, for ornamental purposes. However, its spread has raised concerns about its potential to become invasive in non-native habitats."
}
