{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polyacantha subsp. campylacantha",
    "plant_slug": "acacia-polyacantha-subsp-campylacantha",
    "plant_name_scientific": "acacia polyacantha subsp. campylacantha",
    "intro": "Acacia polyacantha subsp. campylacantha, commonly known as the narrow-leaf wattle, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often twisted branches and narrow, bipinnate leaves that are usually covered in fine hairs. The plant produces yellow flowers in globular or cylindrical inflorescences, which are followed by flat, triangular seed pods. It is well adapted to drought conditions and can thrive in poor soils, making it a hardy species for ecological restoration. The plant is also valued for its ornamental appeal and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polyacantha subsp. campylacantha is primarily native to northern Australia, including parts of Queensland, the Northern Territory, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils and along riverbanks. This subspecies thrives in tropical and subtropical climates, often growing in open woodlands and shrublands. It is well adapted to drought conditions and can tolerate high temperatures. The plant is an important component of the local ecosystem, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia polyacantha subsp. campylacantha was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, growing in coastal fynbos vegetation. This subspecies is often cultivated for its ornamental value due to its distinctive foliage and ability to thrive in coastal conditions. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasive behavior. Its introduction is largely attributed to horticultural practices and its adaptability to diverse environmental conditions."
}
