{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia canescens var. fulva",
    "plant_slug": "acacia-canescens-var-fulva",
    "plant_name_scientific": "acacia canescens var. fulva",
    "intro": "Acacia canescens var. fulva, commonly known as the yellow wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and bright yellow flowers that appear in dense, cylindrical clusters. The leaves are bipinnate, consisting of multiple pairs of small, oval leaflets. The plant thrives in well-drained soils and is adapted to arid and semi-arid environments. It is also known for its ability to fix nitrogen, making it valuable in soil rehabilitation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia canescens var. fulva is primarily native to the arid and semi-arid regions of Australia, particularly in the northern and central parts of the country. This variety is commonly found in areas such as Queensland, the Northern Territory, and Western Australia. It thrives in sandy or rocky soils and is often associated with dry woodlands and shrublands. The plant is well adapted to drought conditions and can survive in low-nutrient environments. Its distribution is closely linked to the ecological zones where it can receive sufficient sunlight and minimal rainfall.",
    "distribution_introduced_art_desc": "Acacia canescens var. fulva was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. This plant is also valued for its drought tolerance and capacity to fix nitrogen, improving soil fertility. Its introduction has helped restore degraded lands in parts of Australia and the southwestern United States. However, it has occasionally become invasive in some areas, requiring careful management."
}
