{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia xylocarpa var. tenuissima",
    "plant_slug": "acacia-xylocarpa-var-tenuissima",
    "plant_name_scientific": "acacia xylocarpa var. tenuissima",
    "intro": "Acacia xylocarpa var. tenuissima, commonly known as the narrow-leaved golden wattle, is a shrub or small tree native to Australia. It is characterized by its slender, narrow leaves and yellow flowers that bloom in spring. The plant is well adapted to arid and semi-arid environments, making it resilient to drought conditions. It belongs to the legume family, Fabaceae, and has the ability to fix nitrogen through symbiotic relationships with rhizobia bacteria. This variety is often used in revegetation projects due to its hardiness and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia xylocarpa var. tenuissima is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils and is often associated with shrublands and grasslands. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native habitat. The plant is known for its distinctive, narrow leaves and yellow flowers, which attract various pollinators. Due to its resilience, it plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia xylocarpa var. tenuissima was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This variety is commonly found in coastal and inland regions of Australia. It is often used in landscaping due to its drought tolerance and ornamental value. The plant's distribution has been expanded through horticultural practices and ecological restoration projects."
}
