{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia deltoidea",
    "plant_slug": "acacia-deltoidea",
    "plant_name_scientific": "acacia deltoidea",
    "intro": "Acacia deltoidea, commonly known as the weeping boerkea, is a shrub native to southern Africa. It is characterized by its distinctive, drooping, yellow flower spikes that appear during the winter months. The plant has feathery, bipinnate leaves that are often covered in fine hairs. It thrives in well-drained soils and full sunlight, making it suitable for coastal and sandy environments. Acacia deltoidea is also valued for its ornamental appeal and ability to attract pollinators such as bees and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia deltoidea"
    },
    "taxonomy_art_desc": "Acacia deltoidea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants with a distinctive floral structure and includes legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia deltoidea, a shrub native to Australia, recognized for its triangular leaves and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia deltoidea is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This species thrives in a variety of habitats, including open woodlands, rocky outcrops, and coastal areas. It is well adapted to the dry and semi-arid conditions typical of much of Western Australia. Acacia deltoidea plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia deltoidea was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, often thriving in sandy or disturbed soils. The plant is known for its distinctive triangular leaflets and yellow flowers, which make it a popular ornamental species. Its rapid growth and ability to colonize open areas have led to its classification as an invasive species in some parts of its range. Due to its adaptability, it has spread beyond its original introduction sites, impacting local ecosystems."
}
