{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cylindrica",
    "plant_slug": "acacia-cylindrica",
    "plant_name_scientific": "acacia cylindrica",
    "intro": "Acacia cylindrica, commonly known as the cylindrical acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, cylindrical stems that are often covered in a distinctive whitish, powdery coating. The plant produces small, yellow flowers arranged in dense, globular clusters, which are typical of the Acacia genus. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia cylindrica is adapted to arid environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cylindrica"
    },
    "taxonomy_art_desc": "Acacia cylindrica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their simple vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their phyllodes and ability to thrive in harsh environments. Its species is Acacia cylindrica, a specific type of acacia characterized by its cylindrical seed pods and adapted to grow in dry, sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cylindrica is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia cylindrica plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia cylindrica was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was first brought to the country in the 19th century by European settlers who admired its unique foliage and floral features. Despite its aesthetic appeal, it has since become a weed in certain regions, spreading rapidly in disturbed soils and outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential to invade natural ecosystems. Efforts are now underway to control its spread and prevent further ecological damage."
}
