{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia coatesii",
    "plant_slug": "acacia-coatesii",
    "plant_name_scientific": "acacia coatesii",
    "intro": "Acacia coatesii, commonly known as the Texas acacia, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its slender, branching stems and small, feathery leaves that are often covered in fine hairs. The plant produces yellow flowers in compact spherical clusters, which are followed by long, flat pods containing seeds. Acacia coatesii is adapted to arid environments and is drought-tolerant, making it a hardy plant for dry landscapes. It plays a role in stabilizing soil and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia coatesii"
    },
    "taxonomy_art_desc": "Acacia coatesii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their relatives, including horsetails, and is known for its vascular system and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes plants such as legumes and vetches, and is notable for its nitrogen-fixing capabilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing ability. Its genus is Acacia, a large group of shrubs and trees primarily found in arid regions, known for their characteristic thorn-like structures and small, fragrant flowers. Its species is Acacia coatesii, a specific type of acacia native to the southwestern United States and northern Mexico, known for its hardy nature and ecological importance in desert ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia coatesii is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal and inland regions of the state. This plant thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the hot, dry climate typical of much of Western Australia. Acacia coatesii plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia coatesii was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in regions such as Texas, New Mexico, and parts of Arizona in the United States. This plant thrives in sandy or loamy soils and is often used for erosion control due to its deep root system. It is also valued for its ability to fix nitrogen, improving soil fertility. However, it can become invasive in some regions if not managed properly."
}
