{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elachantha",
    "plant_slug": "acacia-elachantha",
    "plant_name_scientific": "acacia elachantha",
    "intro": "Acacia elachantha, commonly known as the slender acacia, is a small shrub native to southern Africa. It is characterized by its narrow, trifoliate leaves and produces yellow flowers in spring. The plant is adapted to arid environments and is often found in rocky soils. Its seed pods are elongated and contain small, hard seeds. Acacia elachantha is valued for its hardy nature and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia elachantha"
    },
    "taxonomy_art_desc": "Acacia elachantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex reproductive structures. Its class is Equisetopsida, which encompasses ferns, horsetails, and their allies, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages with primitive floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include economically important legumes. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used for timber or as ornamental plants. Its species is Acacia elachantha, a specific type of acacia found in certain regions, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elachantha is primarily native to Northern Territory, Queensland, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions across these states. It thrives in sandy soils and is often seen in shrublands and open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. Its distribution reflects its ability to survive in low-resource environments.",
    "distribution_introduced_art_desc": "Acacia elachantha was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for dryland environments. This plant is often used for soil stabilization and as a source of fodder for livestock. Its introduction has been noted in parts of Australia, South Africa, and the Middle East. However, it can become invasive in some ecosystems if not managed properly."
}
