{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bidwillii",
    "plant_slug": "acacia-bidwillii",
    "plant_name_scientific": "acacia bidwillii",
    "intro": "Acacia bidwillii, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant produces long, flat pods that contain seeds, which are dispersed by wind. Acacia bidwillii is adapted to dry, sandy soils and is often found in coastal areas. It plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bidwillii is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the inland parts of Western Australia, South Australia, and the Northern Territory. This plant thrives in sandy or loamy soils and is often seen in open woodlands and shrublands. It is well adapted to drought conditions and can survive in areas with low rainfall. Acacia bidwillii is also known for its distinctive yellow flowers and is an important species in the local ecosystem.",
    "distribution_introduced_art_desc": "Acacia bidwillii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often forming dense thickets. The plant is valued for its hardy nature and ability to thrive in arid conditions. It has been used in reclamation projects due to its fast growth and erosion control capabilities. However, its spread has raised concerns about potential invasiveness in local ecosystems."
}
