{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leiophylla",
    "plant_slug": "acacia-leiophylla",
    "plant_name_scientific": "acacia leiophylla",
    "intro": "Acacia leiophylla, commonly known as the coastal wattle, is a shrub native to southern Australia. It is characterized by its slender, often prostrate stems and small, feathery leaves that are adapted to coastal conditions. The plant produces yellow flowers in clusters, which attract a variety of pollinators. It thrives in sandy or rocky soils and is drought-tolerant. Acacia leiophylla plays an important role in stabilizing coastal dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leiophylla"
    },
    "taxonomy_art_desc": "Acacia leiophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns, horsetails, and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and beans. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia leiophylla, a specific type of acacia found in certain regions, known for its unique leaf structure and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leiophylla is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This plant typically grows in sandy or gravelly soils along coastal areas and inland dunes. It is well adapted to the harsh environmental conditions of the region. Acacia leiophylla plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia leiophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, thriving in coastal and semi-arid environments. The plant is valued for its hardy nature and ability to grow in poor soils, making it a popular choice for erosion control. However, it is considered an invasive species in some areas, outcompeting native vegetation. Its introduction has had both ecological and economic impacts on local ecosystems."
}
