{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia praecox f. inermis",
    "plant_slug": "acacia-praecox-f-inermis",
    "plant_name_scientific": "acacia praecox f. inermis",
    "intro": "Acacia praecox f. inermis, commonly known as the silky acacia, is a shrub native to southern Africa. It is characterized by its slender, branching stems and small, feathery leaves that are covered in fine, silky hairs. The plant produces yellow, globular inflorescences that bloom throughout the warmer months. Its flowers are often visited by various pollinators, including bees and birds. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia praecox f. inermis is primarily native to eastern Australia, including regions in New South Wales and Queensland. This plant thrives in dry, sandy soils and is commonly found in woodland and open forest habitats. It is well adapted to the arid and semi-arid climates of its native range. The species is often seen in coastal and inland areas where it forms part of the native vegetation. Its distribution is largely restricted to the subtropical and temperate zones of eastern Australia.",
    "distribution_introduced_art_desc": "Acacia praecox f. inermis was mainly introduced to the United States as an ornamental plant due to its attractive, feathery foliage and drought tolerance. It is commonly found in USDA hardiness zones 8 through 10, where it thrives in well-drained soils and full sun. This plant is often used in landscaping for its ability to withstand harsh environmental conditions. However, it has been noted to spread aggressively and may become invasive in certain regions. Its introduction has raised concerns about its ecological impact on native plant communities."
}
