{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spilleriana",
    "plant_slug": "acacia-spilleriana",
    "plant_name_scientific": "acacia spilleriana",
    "intro": "Acacia spilleriana, commonly known as the Spiller's wattle, is a shrub native to the arid regions of South Africa. It is characterized by its slender, yellow-flowered spikes that bloom during the cooler months. The plant has feathery, bipinnate leaves that are adapted to reduce water loss in its harsh environment. Acacia spilleriana is often found growing on rocky outcrops and in sandy soils. Its ecological significance includes providing nectar for local pollinators and supporting various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spilleriana"
    },
    "taxonomy_art_desc": "Acacia spilleriana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include many legumes, known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and the ability to form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their characteristic bipinnate leaves and often spiny thorns, widely distributed in tropical and subtropical regions. Its species is Acacia spilleriana, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spilleriana is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen along coastal areas and inland dunes. It is an important part of the local ecosystem, providing habitat and food for various wildlife. Its distribution is largely restricted to the southern parts of the country.",
    "distribution_introduced_art_desc": "Acacia spilleriana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in coastal and semi-arid environments. The plant is often used for its hardy nature and ability to withstand harsh conditions. It has been introduced for ornamental purposes and as a potential source of timber. However, its spread has raised concerns about its potential impact on native ecosystems."
}
