{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vermoesenii",
    "plant_slug": "acacia-vermoesenii",
    "plant_name_scientific": "acacia vermoesenii",
    "intro": "Acacia vermoesenii, commonly known as the Vervooren's acacia, is a shrub or small tree native to South Africa. It is characterized by its dense, thorny branches and yellow flowers that bloom in winter. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It thrives in arid and semi-arid environments, showing adaptability to drought conditions. Acacia vermoesenii is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vermoesenii is primarily native to southern Africa, specifically found in countries such as South Africa, Namibia, and Botswana. It thrives in arid and semi-arid regions, often growing in rocky soils and savanna habitats. This species is commonly found in the Kalahari Desert and surrounding areas, where it adapts well to the harsh climatic conditions. It plays an important ecological role in these regions by providing shelter and food for various wildlife species. Acacia vermoesenii is also sometimes cultivated in local gardens for its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia vermoesenii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, growing in sandy soils and coastal areas. The plant is often used for its hardy nature and ability to thrive in arid conditions. It has been introduced as an ornamental plant due to its attractive golden flowers and drought tolerance. However, its spread has raised concerns about potential invasiveness in local ecosystems."
}
