{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brandegeeana",
    "plant_slug": "acacia-brandegeeana",
    "plant_name_scientific": "acacia brandegeeana",
    "intro": "Acacia brandegeeana, commonly known as the flame tree, is a striking ornamental plant native to Mexico and parts of Central America. It is characterized by its large, feathery, bipinnate leaves that turn a vibrant red or orange during the dry season. The plant produces long, yellow to orange flower spikes that bloom in the summer, attracting a variety of pollinators. It thrives in full sun and well-drained soil, making it suitable for tropical and subtropical climates. Due to its ornamental value, it is often planted in gardens and as a street tree in warmer regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brandegeeana is primarily native to the southern United States, particularly Texas, and parts of northern Mexico. It thrives in arid and semi-arid environments, often found in desert scrub and rocky soils. This species is well adapted to hot, dry climates and can tolerate poor soil conditions. It is commonly seen in the Chihuahuan Desert region. The plant is also known as the honey mesquite and is valued for its hardy nature and ability to stabilize soil in harsh landscapes.",
    "distribution_introduced_art_desc": "Acacia brandegeeana was mainly introduced to the southern United States, particularly in Texas and Florida, as an ornamental plant due to its striking yellow flowers and drought tolerance. It has since become naturalized in parts of the southeastern United States, where it thrives in disturbed soils and open areas. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have led to its establishment in native habitats. It is often found in urban landscapes, roadsides, and along riverbanks, where it can outcompete native vegetation. Despite its aesthetic appeal, its invasive potential has raised concerns among land managers and conservationists."
}
