{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pluricapitata",
    "plant_slug": "acacia-pluricapitata",
    "plant_name_scientific": "acacia pluricapitata",
    "intro": "Acacia pluricapitata, commonly known as the many-headed acacia, is a shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are typically pinnate with numerous small, oval leaflets. The plant produces yellow flowers in globular inflorescences, which are highly attractive to pollinators such as bees and birds. Its seeds are encased in woody pods and are often used in traditional medicine. Acacia pluricapitata is adapted to arid and semi-arid environments, making it a resilient species in dry regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pluricapitata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in dry savannas, rocky outcrops, and woodland areas. This species thrives in regions with a warm climate and well-drained soils. It is often seen growing along roadsides and in open grasslands. Acacia pluricapitata is well adapted to arid and semi-arid environments, making it a resilient plant in its native range.",
    "distribution_introduced_art_desc": "Acacia pluricapitata was mainly introduced to control erosion and for its hardy nature in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant has been introduced in several countries across Africa, including Kenya, Tanzania, and South Africa. However, it has also become invasive in some areas, outcompeting native vegetation. Its rapid growth and seed dispersal make it both useful and problematic in certain ecosystems."
}
