{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia alata var. biglandulosa",
    "plant_slug": "acacia-alata-var-biglandulosa",
    "plant_name_scientific": "acacia alata var. biglandulosa",
    "intro": "Acacia alata var. biglandulosa, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its slender, drooping branches and small, compound leaves. The plant produces yellow flowers in cylindrical spikes, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and sandy areas. The species is noted for its ability to fix nitrogen, making it valuable for soil enrichment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia alata"
    },
    "taxonomy_art_desc": "Acacia alata var. biglandulosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, often with distinctive morphological features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single carpel and are often legumes, including many nitrogen-fixing species. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and a wide range of ecological and economic importance. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive umbrella-shaped or flat-topped inflorescences and often used in traditional medicine and land restoration. Its species is Acacia alata, a specific type of acacia that is known for its slender, spreading branches and is often found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia alata var. biglandulosa is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This variety thrives in sandy soils and is often associated with coastal and inland habitats. It is well adapted to the arid and semi-arid climates of the region. The plant is an important component of the local flora and plays a role in stabilizing sandy soils.",
    "distribution_introduced_art_desc": "Acacia alata var. biglandulosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas with sandy soils, particularly in the Western and Eastern Cape provinces. This plant is often used in landscaping due to its hardy nature and attractive foliage. However, it has also been reported to spread aggressively in some environments, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact and management in native ecosystems."
}
