{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hastulata",
    "plant_slug": "acacia-hastulata",
    "plant_name_scientific": "acacia hastulata",
    "intro": "Acacia hastulata, commonly known as the slender wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow globular flowers that bloom in spring, attracting various pollinators. Its seed pods are elongated and contain small, hard seeds. Acacia hastulata is often used in ecological restoration due to its ability to thrive in arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hastulata"
    },
    "taxonomy_art_desc": "Acacia hastulata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes legumes and related plants, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often compound leaves. Its genus is Acacia, a large group of shrubs and trees commonly known as wattles, native to Australia and other parts of the world. Its species is Acacia hastulata, a specific type of acacia known for its distinctive leaf shape and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hastulata is primarily native to Western Australia. It is commonly found in the coastal and sandy regions of the state. This plant thrives in well-drained soils and is often associated with dry, open habitats. It is a shrub or small tree that plays an important role in local ecosystems. Its distribution is largely confined to the southwestern and southern parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia hastulata was mainly introduced to Australia as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond cultivation and is now considered an environmental weed in several regions of southern Australia. The plant thrives in a variety of soil types but is particularly common in disturbed areas such as roadsides and agricultural land. Its rapid growth and ability to form dense thickets make it a significant threat to native vegetation. Despite its invasive nature, it remains popular in horticulture for its aesthetic value."
}
