{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucophylla",
    "plant_slug": "acacia-glaucophylla",
    "plant_name_scientific": "acacia glaucophylla",
    "intro": "Acacia glaucophylla, commonly known as the silver-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, silvery-green phyllodes that give it a distinctive appearance. The plant produces yellow globular flowers in spring, which are clustered in dense, cylindrical spikes. It is adapted to arid and semi-arid environments, making it drought-tolerant. Acacia glaucophylla plays a role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucophylla is primarily native to eastern Australia, including parts of New South Wales, Queensland, and the Australian Capital Territory. It is commonly found in dry sclerophyll forests and open woodlands. This species thrives in well-drained soils and is often associated with rocky or sandy landscapes. It is an important component of the local ecosystem, providing habitat and food for various wildlife. Acacia glaucophylla is also known for its distinctive pale-green foliage and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia glaucophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the coastal areas of the Western and Eastern Cape provinces. The plant thrives in sandy soils and is often seen along roadsides and in disturbed habitats. Due to its rapid growth and ability to spread, it is considered a potential invasive species in some areas. Its introduction has raised concerns about its impact on native plant communities."
}
