{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia confusa var. inamuroi",
    "plant_slug": "acacia-confusa-var-inamuroi",
    "plant_name_scientific": "acacia confusa var. inamuroi",
    "intro": "Acacia confusa var. inamuroi, commonly known as the Japanese acacia, is a flowering plant native to Japan and parts of Southeast Asia. It is a small to medium-sized tree or shrub characterized by its bipinnate leaves and yellow globular flowers. The plant belongs to the Fabaceae family, known for its nitrogen-fixing ability through symbiotic relationships with root nodules. It thrives in well-drained soils and is often found in coastal areas and mountainous regions. The wood of this species is valued for its durability and is used in traditional crafts and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia confusa var. inamuroi is primarily native to the coastal areas of southern Africa, particularly in South Africa and parts of Mozambique. This variant is commonly found in sandy soils along the shoreline, where it thrives in the warm, humid climate. It is often associated with coastal dunes and other maritime environments. The plant is well adapted to salt spray and can tolerate periodic inundation by seawater. Its distribution is limited to specific regions where the ecological conditions match its requirements.",
    "distribution_introduced_art_desc": "Acacia confusa var. inamuroi was mainly introduced to urban and suburban landscapes in Southeast Asia for its ornamental value and ability to thrive in disturbed soils. It is commonly found in parks, roadside plantings, and along riverbanks due to its hardy nature and rapid growth. The plant's ability to fix nitrogen makes it useful in soil rehabilitation projects. However, it has also become invasive in some regions, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in areas where it is not native."
}
