{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paolii",
    "plant_slug": "acacia-paolii",
    "plant_name_scientific": "acacia paolii",
    "intro": "Acacia paolii, commonly known as the Paul's acacia, is a shrub native to Madagascar. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces small, yellowish-green flowers arranged in spikes, which are followed by flat, bean-like pods. Acacia paolii is adapted to arid and semi-arid environments, showcasing drought-resistant features. Its ecological role includes providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paolii is primarily native to the island of Sicily, specifically found in the southern regions. It thrives in coastal areas and rocky soils, often growing in dry, sunny environments. This species is adapted to the Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is commonly found in scrublands and along the coastline of southern Sicily. Due to its limited range, Acacia paolii is considered a rare and endemic plant in this region.",
    "distribution_introduced_art_desc": "Acacia paolii was mainly introduced to stabilize soil and prevent erosion in coastal and arid regions. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant has been introduced to several islands in the Pacific, including parts of Fiji and Tonga. Its introduction has led to both ecological benefits and concerns about invasive spread. Careful monitoring is recommended to ensure it does not disrupt native ecosystems."
}
