{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leiocalyx subsp. leiocalyx",
    "plant_slug": "acacia-leiocalyx-subsp-leiocalyx",
    "plant_name_scientific": "acacia leiocalyx subsp. leiocalyx",
    "intro": "Acacia leiocalyx subsp. leiocalyx, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, linear leaves and yellow globular flowers that appear in late winter to early spring. The plant belongs to the Fabaceae family, which is known for its nitrogen-fixing abilities. It typically grows in sandy or loamy soils and is often found in coastal and inland regions. The species is valued for its ornamental appeal and is sometimes used in landscaping due to its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leiocalyx"
    },
    "taxonomy_art_desc": "Acacia leiocalyx subsp. leiocalyx belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is known for its primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes plants such as legumes and vetches, and is notable for the presence of nitrogen-fixing symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species adapted to arid environments. Its species is Acacia leiocalyx, a specific variant within the Acacia genus that is typically found in certain regions of Australia and is characterized by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leiocalyx subsp. leiocalyx is primarily native to New South Wales and Queensland. This subspecies is commonly found in the arid and semi-arid regions of these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climate conditions of the region. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia leiocalyx subsp. leiocalyx was mainly introduced to the coastal regions of southern Australia, particularly in New South Wales and Victoria. It is commonly found in sandy soils along the shoreline and in open woodlands. This subspecies is well adapted to saline and arid conditions, making it a hardy plant in coastal environments. It is often used in coastal stabilization projects due to its strong root system and drought tolerance. However, it is considered a potential weed in some areas where it can spread aggressively."
}
