{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura",
    "plant_slug": "acacia-aneura",
    "plant_name_scientific": "acacia aneura",
    "intro": "Acacia aneura, commonly known as the ghost gum, is a small to medium-sized evergreen tree native to Australia. It is characterized by its slender, often twisted trunk and grayish bark that peels in thin layers. The plant has bipinnate leaves, which are reduced to small, scale-like structures in mature plants. Its flowers are yellow and occur in dense, globular clusters, attracting nectar-feeding birds and insects. Acacia aneura is well adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aneura"
    },
    "taxonomy_art_desc": "Acacia aneura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants with a distinctive type of flower and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive acorn-like seed pods and often used for timber and traditional medicine. Its species is Acacia aneura, a specific type of acacia found in arid regions of Australia, known for its distinctive appearance and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Kenya",
        "Pakistan"
    ],
    "distribution_native_art_desc": "Acacia aneura is primarily native to New South Wales, Northern Territory, Queensland, South Australia, and Western Australia. It is commonly found in arid and semi-arid regions across these states. This plant thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. Acacia aneura is well adapted to the harsh climatic conditions of these regions. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia aneura was mainly introduced to Kenya and Pakistan. It is commonly found in arid and semi-arid regions of these countries. The plant is often used for its hardy nature and ability to thrive in harsh conditions. It has been introduced for purposes such as soil stabilization and as a source of timber. However, its spread has raised concerns about potential ecological impacts in native ecosystems."
}
