{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia yirrkallensis",
    "plant_slug": "acacia-yirrkallensis",
    "plant_name_scientific": "acacia yirrkallensis",
    "intro": "Acacia yirrkallensis, commonly known as Yirrkallensis wattle, is a shrub native to the Northern Territory of Australia. It is characterized by its slender, often multi-branched stems and small, phyllode-like leaves. The plant produces yellow globular flowers in clusters, which are typical of the Acacia genus. It is adapted to arid and semi-arid environments, showing resilience to drought conditions. The species is also valued for its ecological role in providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia yirrkallensis"
    },
    "taxonomy_art_desc": "Acacia yirrkallensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure called a vexillum. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often complex inflorescences. Its species is Acacia yirrkallensis, a specific type of acacia found in Australia, known for its ecological significance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia yirrkallensis is primarily native to the Northern Territory. It is found in the arid and semi-arid regions of this area. This species is commonly associated with rocky outcrops and sandplain habitats. It plays an important role in the local ecosystem and is adapted to the harsh environmental conditions. Its distribution is limited to specific regions within the Northern Territory.",
    "distribution_introduced_art_desc": "Acacia yirrkallensis was mainly introduced to areas of northern Australia, particularly in the Northern Territory and Queensland. It is commonly found in sandy soils and rocky outcrops, often in arid or semi-arid environments. This plant is well adapted to harsh conditions and can thrive with minimal water. It plays an important role in stabilizing soil and providing habitat for native wildlife. However, its spread can sometimes lead to competition with native vegetation."
}
