{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucescens var. leucadendron",
    "plant_slug": "acacia-glaucescens-var-leucadendron",
    "plant_name_scientific": "acacia glaucescens var. leucadendron",
    "intro": "Acacia glaucescens var. leucadendron, commonly known as the white flame tree, is a flowering plant native to southern Africa. It is characterized by its striking, fluffy white inflorescences that resemble flames, which appear during the summer months. The plant has compound leaves with small, narrow leaflets and produces pods that contain seeds. It thrives in full sun and well-drained soil, making it a popular ornamental tree in warm climates. Its botanical features make it both visually appealing and ecologically valuable in native landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucescens var. leucadendron is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and parts of the Northern Cape. This plant typically grows in coastal areas, sandy soils, and near the ocean. It is often seen in fynbos vegetation, which is characteristic of the region's unique biodiversity. The species is well adapted to the Mediterranean climate of the area, with dry summers and wet winters.",
    "distribution_introduced_art_desc": "Acacia glaucescens var. leucadendron was mainly introduced to South Africa, where it has been cultivated for its ornamental value and hardy nature. It is commonly found in gardens and along roadsides due to its ability to thrive in a variety of soil types. This plant is also used in reforestation projects because of its fast growth and nitrogen-fixing capabilities. However, it has shown invasive tendencies in some regions, raising concerns about its ecological impact. Despite its benefits, careful management is necessary to prevent it from outcompeting native flora."
}
