{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia holosericea",
    "plant_slug": "acacia-holosericea",
    "plant_name_scientific": "acacia holosericea",
    "intro": "Acacia holosericea, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in globular inflorescences, which are followed by flat, linear pods. It thrives in arid and semi-arid environments, often growing on rocky soils. Acacia holosericea is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia holosericea"
    },
    "taxonomy_art_desc": "Acacia holosericea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and vetches. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid and tropical regions, known for their distinctive phyllodes and nitrogen-fixing capabilities. Its species is Acacia holosericea, a specific type of acacia native to certain regions of Australia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Burkina",
        "Guinea",
        "New Guinea"
    ],
    "distribution_native_art_desc": "Acacia holosericea is primarily native to Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions across these areas. It thrives in sandy soils and is often seen in shrublands and open woodlands. The plant is well adapted to the harsh climate of these regions. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia holosericea was mainly introduced to Burkina, Guinea, and New Guinea. It is commonly found in savanna and woodland areas within these regions. The plant thrives in tropical and subtropical climates with well-drained soils. Its introduction has been associated with both ecological and agricultural purposes. However, it is important to monitor its spread to prevent potential invasiveness."
}
