{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciopsis sesquijuga",
    "plant_slug": "acaciopsis-sesquijuga",
    "plant_name_scientific": "acaciopsis sesquijuga",
    "intro": "Acaciopsis sesquijuga, commonly known as the narrow-leaf acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its compound leaves, which are often divided into narrow, linear segments. The plant produces small, yellowish flowers that are clustered in inflorescences, followed by flat, pod-like fruits. It is adapted to survive in dry conditions, with deep roots that allow it to access water from deeper soil layers. The species is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciopsis sesquijuga is primarily native to the island of Madagascar. It is found in the dry and humid forests of the eastern and southern regions of the country. This plant thrives in areas with well-drained soils and is commonly associated with secondary growth and disturbed habitats. It is an important component of the local flora and plays a role in the ecological balance of its native environment. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Acaciopsis sesquijuga was mainly introduced to areas with disturbed soils and open habitats, often as part of reforestation or land rehabilitation efforts. It thrives in regions with moderate to high rainfall and well-drained soils. The plant is commonly found in coastal and inland areas where it can establish quickly due to its fast growth rate. Its introduction has sometimes led to the displacement of native vegetation in certain ecosystems. However, it is valued for its ability to stabilize soil and provide forage for livestock."
}
