{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ammitia",
    "plant_slug": "acacia-ammitia",
    "plant_name_scientific": "acacia ammitia",
    "intro": "Acacia ammitia, commonly known as the Egyptian acacia, is a flowering plant native to the arid regions of Africa. It is characterized by its compound leaves and yellowish-green flowers that bloom in clusters. The plant is well adapted to dry environments, with deep roots that help it access water from underground sources. Its thorny stems provide protection against herbivores, and it plays a role in stabilizing sandy soils. Acacia ammitia is also valued for its gum, which has been used historically in various traditional applications.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ammitia"
    },
    "taxonomy_art_desc": "Acacia ammitia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have compound leaves and produce legume-like fruits. Its family is Fabaceae, commonly known as the legume family, which includes plants that form nitrogen-fixing symbioses with bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia ammitia, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ammitia is primarily native to Queensland. It is found in the tropical and subtropical regions of the state, particularly in areas with sandy soils. This plant thrives in open woodlands and grasslands, often near water sources. It is well adapted to the local climate and plays an important role in the ecosystem. Acacia ammitia is a hardy species that contributes to the biodiversity of Queensland's native flora.",
    "distribution_introduced_art_desc": "Acacia ammitia was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Sudan, Ethiopia, and Somalia. This plant is often used for its hardy nature and ability to provide shade and forage for livestock. Its introduction has sometimes led to competition with native vegetation in certain ecosystems. Due to its resilience, it is also being considered for reforestation projects in degraded lands."
}
