{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia reniformis",
    "plant_slug": "acacia-reniformis",
    "plant_name_scientific": "acacia reniformis",
    "intro": "Acacia reniformis, commonly known as the warty acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive, warty, and often branched stems, which are covered in small, rounded tubercles. The plant produces yellow, globular flower heads that are clustered in dense, spherical inflorescences. Its leaves are bipinnate, with small, linear leaflets that are often covered in fine hairs. Acacia reniformis is well adapted to harsh environments, exhibiting drought tolerance and resilience to poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia reniformis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and open woodlands, often growing along riverbanks and in coastal areas. This species is well adapted to drought conditions and can thrive in harsh environments with limited water availability. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia reniformis is also known for its distinctive kidney-shaped leaves and yellow flowers, which make it a notable plant in its native habitat.",
    "distribution_introduced_art_desc": "Acacia reniformis was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has been documented in several countries within the Mediterranean and Middle East regions. However, it has raised concerns about its potential to become invasive in certain ecosystems."
}
