{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spinulosa",
    "plant_slug": "acacia-spinulosa",
    "plant_name_scientific": "acacia spinulosa",
    "intro": "Acacia spinulosa, commonly known as the spiny wattle, is a shrub native to southern Africa. It is characterized by its slender, spiny stems and small, yellow flowers that bloom in late summer. The plant produces oval, leathery leaves that are often covered in fine, stiff hairs. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia spinulosa is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spinulosa is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in grasslands and rocky outcrops. This plant thrives in well-drained soils and is adapted to withstand drought conditions. It is often seen growing in open habitats with low vegetation. Acacia spinulosa plays an important role in local ecosystems by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia spinulosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. This plant is often used for erosion control due to its ability to stabilize soil with its extensive root system. However, it can also become invasive in some areas, outcompeting native vegetation. Its introduction has led to both ecological and economic impacts in the regions where it has spread."
}
