{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia denudata",
    "plant_slug": "acacia-denudata",
    "plant_name_scientific": "acacia denudata",
    "intro": "Acacia denudata, commonly known as the silky acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often branching stems and small, bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow flowers in globular or cylindrical clusters, which appear in late winter to early spring. Its seeds are enclosed in pods and are often used in traditional Aboriginal medicine. Acacia denudata is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia denudata is primarily native to northern Australia, including parts of Queensland, Western Australia, and the Northern Territory. It thrives in arid and semi-arid environments, often found in sandy soils and open woodlands. This species is well adapted to harsh climatic conditions, making it a common sight in coastal and inland regions. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. Acacia denudata is also known for its distinctive appearance, with long, thin leaves and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia denudata was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low rainfall and full sun exposure. This plant has been introduced to parts of Australia, particularly in the inland areas of New South Wales and Queensland. It is often used in reforestation projects due to its fast growth and ability to stabilize soil. However, it can become invasive in certain environments if not properly managed."
}
