{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia costiniana",
    "plant_slug": "acacia-costiniana",
    "plant_name_scientific": "acacia costiniana",
    "intro": "Acacia costiniana, commonly known as the African acacia, is a deciduous shrub or small tree native to tropical Africa. It is characterized by its compound leaves, which are typically trifoliate and have a distinctive, feathery appearance. The plant produces small, yellowish flowers that are clustered in spikes, followed by flat, bean-like pods containing seeds. It thrives in well-drained soils and is often found in dry, open habitats such as savannas and woodlands. Acacia costiniana is also noted for its ability to fix nitrogen, making it an important component of nitrogen-cycling ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia costiniana"
    },
    "taxonomy_art_desc": "Acacia costiniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often with a long evolutionary history. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and are often legumes. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in various ecological and economic contexts. Its species is Acacia costiniana, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia costiniana is primarily native to New South Wales. It is commonly found in the coastal regions and sand plains of the state. This plant thrives in sandy soils and is often associated with coastal heathlands. It is well adapted to the dry and sunny conditions of the region. Acacia costiniana plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia costiniana was mainly introduced to regions with tropical and subtropical climates, particularly in areas where it can thrive in well-drained soils. It is commonly found in parts of Africa, including countries like Kenya, Uganda, and Tanzania. This plant is often introduced for its ability to stabilize soil and provide forage for livestock. However, it can become invasive in some environments if not managed properly. Its distribution is also expanding due to human activities and climate change."
}
