{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farnesiana f. pedunculata",
    "plant_slug": "acacia-farnesiana-f-pedunculata",
    "plant_name_scientific": "acacia farnesiana f. pedunculata",
    "intro": "Acacia farnesiana f. pedunculata, commonly known as the fringed acacia, is a variant of the weeping acacia, characterized by its distinctive fringed or lobed leaves. It is a deciduous shrub or small tree native to arid and semi-arid regions of the Americas. The plant produces yellow flowers in dense, pendulous clusters, which are followed by flat, linear seed pods. It thrives in well-drained soils and is drought-tolerant, making it suitable for xeriscaping. The species is also valued for its ornamental appeal and ability to provide habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farnesiana f. pedunculata is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and the Middle East. This plant thrives in arid and semi-arid environments, often found in coastal areas and along dry riverbeds. It is well adapted to hot, dry climates and can tolerate poor soil conditions. The subspecies is known for its distinctive yellow flowers and thorny growth habit. It has been introduced to other regions outside its native range, including parts of the United States and Australia.",
    "distribution_introduced_art_desc": "Acacia farnesiana f. pedunculata was mainly introduced to ornamental horticulture and landscaping due to its attractive, feathery foliage and showy yellow flowers. It is commonly used in gardens and as a decorative plant in tropical and subtropical regions. Despite its aesthetic appeal, it has the potential to become invasive in certain environments if not managed properly. The plant thrives in well-drained soils and full sun, making it adaptable to a variety of climates. Its introduction has raised concerns about ecological impacts in areas where it can outcompete native vegetation."
}
