{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia triptycha var. pungens",
    "plant_slug": "acacia-triptycha-var-pungens",
    "plant_name_scientific": "acacia triptycha var. pungens",
    "intro": "Acacia triptycha var. pungens, commonly known as the spiked wattle, is a shrub native to southern Africa. It is characterized by its compound leaves composed of three leaflets, which are usually narrow and slightly serrated. The plant produces yellow globular flowers in late summer, which are clustered in dense spikes. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The plant is often used in landscaping for its ornamental value and ability to attract birds and insects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia triptycha var. pungens is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, including the Karoo andNamaqualand areas. This variant thrives in sandy soils and is often seen along roadsides and in open grasslands. It is well adapted to the hot, dry climate of its native habitat. The plant is known for its distinctive, spiny thorns and yellow flowers that bloom during the rainy season.",
    "distribution_introduced_art_desc": "Acacia triptycha var. pungens was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in degraded lands and along roadsides where it can thrive in poor soil conditions. This plant is also used in reclamation projects due to its rapid growth and ability to fix nitrogen. However, its introduction has led to concerns about its potential invasiveness in some ecosystems. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
