{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia smeringa",
    "plant_slug": "acacia-smeringa",
    "plant_name_scientific": "acacia smeringa",
    "intro": "Acacia smeringa, commonly known as the white acacia, is a deciduous shrub or small tree native to Australia. It is characterized by its slender, often spiny branches and small, feathery leaves that are typically shed during dry periods. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits containing seeds. Acacia smeringa thrives in arid and semi-arid environments, showcasing its adaptability to harsh climates. It is also valued for its ecological role in providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia smeringa"
    },
    "taxonomy_art_desc": "Acacia smeringa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their diverse flower structures and complex reproductive systems. Its order is Fabales, which consists of flowering plants that often have legume fruits and are commonly associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, also known as the legume family, which is recognized for its distinctive pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and semi-arid regions, known for their distinctive phyllodes and often used for timber or in traditional medicine. Its species is Acacia smeringa, a specific type of acacia native to Australia, characterized by its slender, leaf-like stems and yellow flowers, commonly used in landscaping and for its hardy nature.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia smeringa is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This species thrives in a variety of habitats, including sandy soils and coastal areas. It is often seen in woodlands and heathlands. Acacia smeringa is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia smeringa was mainly introduced to control soil erosion and provide shade in arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardy nature and ability to fix nitrogen, improving soil fertility. It has been introduced to several countries in Africa and parts of Asia for its ecological and agricultural benefits. However, its spread has sometimes led to competition with native species, raising concerns about its invasive potential."
}
