{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia prominens var. whiteana",
    "plant_slug": "acacia-prominens-var-whiteana",
    "plant_name_scientific": "acacia prominens var. whiteana",
    "intro": "Acacia prominens var. whiteana, commonly known as the White's Acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-stemmed structure and its distinctive, feathery foliage composed of small, needle-like phyllodes. The plant produces yellow globular flowers in late winter to early spring, which are arranged in dense, spherical clusters. It is adapted to arid and semi-arid environments, showing drought tolerance and resistance to fire. The species is of interest in ecological studies due to its role in providing habitat and food for native fauna.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia prominens var. whiteana is primarily native to the arid and semi-arid regions of Western Australia. This variant is commonly found in the Pilbara and Geraldton areas, where it thrives in sandy soils. It is often associated with coastal and inland dunes, as well as rocky outcrops. The plant is well adapted to the harsh conditions of the region, including high temperatures and low rainfall. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia prominens var. whiteana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western Cape and the Eastern Cape provinces. This plant thrives in sandy or loamy soils and is often seen in disturbed habitats such as roadsides and agricultural fields. Due to its ability to tolerate drought and poor soil conditions, it has spread beyond its original cultivation sites. However, its introduction has raised concerns about its potential impact on native flora in invaded areas."
}
