{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennivenia",
    "plant_slug": "acacia-pennivenia",
    "plant_name_scientific": "acacia pennivenia",
    "intro": "Acacia pennivenia, commonly known as the coastal acacia, is a shrub native to the coastal regions of southern Africa. It is characterized by its slender, often spiny stems and small, bipinnate leaves that are adapted to reduce water loss in arid environments. The plant produces yellow flowers arranged in cylindrical spikes, which attract pollinators such as bees and birds. Its seeds are encased in hard pods, and the plant is often used in traditional medicine for its purported healing properties. Acacia pennivenia plays an important ecological role in stabilizing coastal dunes and preventing erosion.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennivenia is primarily native to parts of eastern Australia, including New South Wales and Queensland. It is commonly found in dry sclerophyll forests and open woodlands. This species thrives in well-drained soils and is adapted to the temperate to subtropical climates of its native range. It plays an important ecological role by providing habitat and food for various native animals. Acacia pennivenia is also known for its distinctive yellow flowers and is often used in landscaping due to its ornamental value.",
    "distribution_introduced_art_desc": "Acacia pennivenia was mainly introduced to areas with sandy soils and coastal environments. It thrives in regions with moderate to high rainfall and full sun exposure. This plant is commonly found in the Mediterranean climate zones and along the coasts of Southern California. Its introduction has led to its establishment in both natural and disturbed habitats. However, it is considered a potential invasive species in some regions due to its rapid growth and competitive nature."
}
