{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia palmeri",
    "plant_slug": "acacia-palmeri",
    "plant_name_scientific": "acacia palmeri",
    "intro": "Acacia palmeri, commonly known as the Palmer's acacia, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its slender, branching stems and small, compound leaves that are often covered in fine hairs. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits containing seeds. Acacia palmeri is adapted to arid environments and is often found in rocky soils. It plays a role in stabilizing soil and providing habitat for various desert species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia palmeri is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in desert and semi-arid regions, particularly in states like Arizona, New Mexico, and California. This plant thrives in sandy or gravelly soils and is often associated with creosote bush and other desert vegetation. It is well adapted to arid conditions and can tolerate high temperatures and low precipitation. Acacia palmeri is also known as the palmer's acacia and is a characteristic species of the Sonoran Desert ecosystem.",
    "distribution_introduced_art_desc": "Acacia palmeri was mainly introduced to the southwestern United States, particularly in Arizona and California. It is commonly found in desert environments, such as the Sonoran and Chihuahuan Deserts. This plant thrives in well-drained soils and full sun, making it well adapted to arid conditions. It is often used for erosion control and as a ornamental plant due to its distinctive foliage. However, its introduction has raised concerns about its potential to invade native ecosystems."
}
