{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia haematostoma",
    "plant_slug": "acacia-haematostoma",
    "plant_name_scientific": "acacia haematostoma",
    "intro": "Acacia haematostoma, commonly known as the red-stemmed acacia, is a species of flowering plant native to southern Africa. It is a shrub or small tree that typically grows in dry, rocky habitats. The plant is characterized by its slender, reddish stems and bipinnate leaves with small, needle-like leaflets. Its yellow flowers are clustered in cylindrical inflorescences and bloom during the warmer months. Acacia haematostoma is valued for its hardiness and is often used in ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia haematostoma is primarily native to the eastern and southern regions of Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savanna and woodland habitats, often growing in well-drained soils. This species is also present in parts of Madagascar and the Arabian Peninsula. It thrives in dry to semi-arid climates and is often associated with rocky or sandy terrain. Acacia haematostoma plays an important ecological role in its native range, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia haematostoma was mainly introduced to areas with a Mediterranean climate, characterized by dry summers and wet winters. It thrives in well-drained soils and is commonly found in coastal regions and inland valleys. This plant is often cultivated for its ornamental value due to its attractive foliage and ability to withstand drought conditions. It has been introduced to several regions outside its native range, including parts of California and the Mediterranean Basin. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
