{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia resinocostata",
    "plant_slug": "acacia-resinocostata",
    "plant_name_scientific": "acacia resinocostata",
    "intro": "Acacia resinocostata, commonly known as the coast acacia, is a shrub or small tree native to southern Australia. It is characterized by its slender, often multi-branched structure and phyllodes that are linear to narrowly elliptic. The plant produces yellow flowers in globular clusters, which are typically followed by flat, leathery pods. Acacia resinocostata is known for its ability to thrive in coastal and sandy soils, making it well adapted to harsh environmental conditions. Its resinous sap has historically been used by Indigenous Australians for various purposes, including as a natural adhesive.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia resinocostata"
    },
    "taxonomy_art_desc": "Acacia resinocostata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Fabales, which consists of flowering plants that typically have a unique type of flower with a single carpel and includes legumes. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are found mainly in Australia and are known for their distinctive floral structures. Its species is Acacia resinocostata, a specific type of acacia known for its resinous characteristics and its native habitat in certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia resinocostata is primarily native to Queensland. It is found in the eastern part of the state, particularly in the tropical and sub-tropical regions. This plant typically grows in open woodland and heathland environments. It is well adapted to the local climate and soil conditions of Queensland. Its distribution is limited to specific areas within the state where the environmental conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Acacia resinocostata was mainly introduced to New South Wales, Australia, as part of environmental restoration and land rehabilitation efforts. It is commonly found in coastal and sandy soils, where it helps stabilize dunes and prevent erosion. This plant is often used in revegetation projects due to its hardy nature and ability to thrive in harsh conditions. However, it has also been reported to spread beyond its intended areas, potentially impacting native vegetation. Its introduction has raised concerns about its ecological impact in non-native environments."
}
