{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drepanophylla",
    "plant_slug": "acacia-drepanophylla",
    "plant_name_scientific": "acacia drepanophylla",
    "intro": "Acacia drepanophylla, commonly known as the umbrella thorn acacia, is a shrub or small tree native to arid regions of Africa. It is characterized by its distinctive umbrella-like crown formed by its dense, spreading branches. The plant has small, compound leaves that are often modified into spines, reducing water loss in harsh environments. Its yellow flowers are clustered in spherical heads and attract various pollinators. Acacia drepanophylla is well adapted to survive in dry climates with minimal rainfall.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia drepanophylla"
    },
    "taxonomy_art_desc": "Acacia drepanophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and numerous stamens, and includes legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorny appearance and the production of pod-like fruits. Its species is Acacia drepanophylla, a specific type of acacia native to Australia, known for its unique leaf structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drepanophylla is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas around the Fitzgerald River National Park and the Augusta-Russell National Park. This plant thrives in sandy soils and is often associated with coastal and inland heathlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia drepanophylla plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia drepanophylla was mainly introduced to regions with arid or semi-arid climates, where it thrives in harsh environmental conditions. It is commonly found in areas with low rainfall and high temperatures, such as parts of Africa, the Middle East, and Australia. This plant is often used for soil stabilization due to its deep root system and ability to prevent erosion. It also serves as a source of food and habitat for various wildlife species. Its introduction has sometimes led to ecological changes in native ecosystems."
}
