{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decora var. typica",
    "plant_slug": "acacia-decora-var-typica",
    "plant_name_scientific": "acacia decora var. typica",
    "intro": "Acacia decora var. typica, commonly known as the decorative acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its feathery, bipinnate leaves and yellow, globular flower heads that bloom in spring. The plant is drought-tolerant and thrives in well-drained soils, making it suitable for xeriscaping. Its rapid growth and ornamental value make it a popular choice for landscaping in warm climates. The wood of Acacia decora var. typica is also valued for its durability and resistance to decay.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decora var. typica is primarily native to eastern and southern Africa, including countries such as South Africa, Mozambique, Zimbabwe, and Tanzania. It thrives in regions with a tropical or subtropical climate, often found in savannas, woodlands, and along riverbanks. This variant is well adapted to dry and semi-arid environments, making it a common sight in open grasslands and rocky areas. It is also occasionally found in coastal regions where the climate is more humid. The plant plays an important ecological role by providing habitat and food for various local wildlife species.",
    "distribution_introduced_art_desc": "Acacia decora var. typica was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various climates. It is commonly found in regions with Mediterranean or subtropical climates, where it thrives in well-drained soils. This plant is often used in garden design for its drought tolerance and ability to provide shade. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
