{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cyperophylla",
    "plant_slug": "acacia-cyperophylla",
    "plant_name_scientific": "acacia cyperophylla",
    "intro": "Acacia cyperophylla, commonly known as the narrow-leaf wattle, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, feathery foliage and yellow flowers that bloom in late winter to early spring. The plant has small, bean-like pods that contain seeds, which are dispersed by wind. It is well adapted to dry conditions, with a deep root system and waxy leaves to reduce water loss. Acacia cyperophylla plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cyperophylla"
    },
    "taxonomy_art_desc": "Acacia cyperophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their acicular leaves and often producing floral clusters. Its species is Acacia cyperophylla, a specific type of Acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cyperophylla is primarily native to Northern Territory, Queensland, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions across these states. It thrives in sandy soils and is often seen in shrublands and open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia cyperophylla was mainly introduced to areas with sandy or coastal soils, particularly in regions with a Mediterranean climate. It thrives in well-drained soils and is often found in coastal dunes and heathlands. The plant is known for its ability to tolerate salt spray and drought conditions. It has been introduced to several parts of southern Australia, including New South Wales and Victoria. Due to its hardiness, it is sometimes used in ecological restoration projects."
}
