{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sphacelata var. retrorsa",
    "plant_slug": "acacia-sphacelata-var-retrorsa",
    "plant_name_scientific": "acacia sphacelata var. retrorsa",
    "intro": "Acacia sphacelata var. retrorsa, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, often twisted stems and small, bipinnate leaves that are narrow and opposite. The plant produces yellow globular flowers in spring, which are clustered in dense inflorescences. It is well adapted to arid and semi-arid environments, with a deep root system for water uptake. The species is valued for its ornamental appeal and is used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sphacelata var. retrorsa is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. This variety is commonly found in arid and semi-arid regions, particularly in rocky outcrops and sandy soils. It thrives in environments with low rainfall and high temperatures, making it well adapted to the harsh conditions of the savanna and shrubland ecosystems. The plant is often seen growing along riverbanks and in open woodlands where it can receive adequate sunlight. Its distribution is closely linked to the availability of well-drained soil and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acacia sphacelata var. retrorsa was mainly introduced to Australia as an ornamental plant due to its attractive foliage and drought tolerance. It has been widely cultivated in gardens and landscaping across the country, particularly in regions with Mediterranean climates. However, it has also become naturalized in some areas, raising concerns about its potential to invade native ecosystems. Its rapid growth and ability to thrive in disturbed soils make it a potential weed in certain environments. Despite its ornamental value, its ecological impact requires careful management to prevent spread into natural habitats."
}
