{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia anceps",
    "plant_slug": "acacia-anceps",
    "plant_name_scientific": "acacia anceps",
    "intro": "Acacia anceps, commonly known as the silver wattle, is a deciduous shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves that turn a striking silver-white color during the dry season. The plant produces small yellow globular flowers in late winter to early spring, which are followed by long, flat pods. It thrives in well-drained soils and is often found in coastal and inland areas with a Mediterranean climate. Acacia anceps is valued for its ornamental appeal and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia anceps"
    },
    "taxonomy_art_desc": "Acacia anceps belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of plants that typically have flowers with five petals and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often yellow flowers. Its species is Acacia anceps, a specific type of acacia found in certain regions, recognized by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia anceps is primarily native to South Australia and Western Australia. It is commonly found in arid and semi-arid regions within these states. The plant thrives in sandy or rocky soils and is often seen in coastal and inland areas. It plays an important role in local ecosystems by providing habitat and food for native wildlife. Its distribution is closely linked to the specific environmental conditions of these regions.",
    "distribution_introduced_art_desc": "Acacia anceps was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly used in reclamation projects due to its ability to thrive in poor soils. The plant forms dense thickets, which can help stabilize soil and reduce wind erosion. However, it can become invasive in certain environments if not managed properly. Its rapid growth and adaptability make it a valuable but potentially problematic species in ecological restoration efforts."
}
