{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sciophanes",
    "plant_slug": "acacia-sciophanes",
    "plant_name_scientific": "acacia sciophanes",
    "intro": "Acacia sciophanes, commonly known as the shade acacia, is a shrub native to arid and semi-arid regions of Africa. It is characterized by its dense, thorny foliage and small, greenish-white flowers that bloom in clusters. The plant has adapted to low-water environments through its deep root system and waxy leaf surfaces that reduce water loss. Its flowers are pollinated by insects, and the seed pods produce hard, angular seeds. Acacia sciophanes is often used in traditional medicine and as a source of firewood in its native habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sciophanes"
    },
    "taxonomy_art_desc": "Acacia sciophanes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes and have distinctive flowers with a single pistil. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and seasonal environments, known for their distinctive phyllodes. Its species is Acacia sciophanes, a specific type of acacia that is typically found in shaded or semi-shaded environments and is adapted to low light conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sciophanes is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This species thrives in sandy soils and is often associated with coastal and inland habitats. It is well adapted to the arid and semi-arid climates of its native range. The plant plays an important ecological role in the local flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia sciophanes was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and degraded forests. It thrives in regions with moderate to high rainfall and well-drained soils. The plant is often found in tropical and subtropical climates, particularly in Southeast Asia and parts of Africa. Its introduction has led to its spread in invasive plant communities, sometimes outcompeting native flora. Due to its rapid growth and adaptability, it is considered a potential weed in certain ecosystems."
}
