{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guaiaguilensis",
    "plant_slug": "acacia-guaiaguilensis",
    "plant_name_scientific": "acacia guaiaguilensis",
    "intro": "Acacia guaiaguilensis, commonly known as the yellow acacia, is a shrub or small tree native to South America, particularly found in Argentina, Chile, and Peru. It is characterized by its slender, often branched stems and bipinnate leaves that are typically yellow-green in color. The plant produces small, yellowish flowers arranged in cylindrical spikes, which bloom during the warmer months. Its seed pods are elongated and contain several seeds, which are dispersed by wind. Acacia guaiaguilensis is adapted to arid and semi-arid environments, making it a resilient species in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guaiaguilensis is primarily native to the Andean region of South America, specifically in countries such as Bolivia, Peru, and Ecuador. It is commonly found in the high-altitude grasslands and shrublands of the Andes, where it thrives in temperate and semi-arid climates. This species is often associated with rocky soils and is adapted to the harsh conditions of mountainous environments. It plays an important ecological role in these regions by providing habitat and food for various wildlife species. The plant is also valued for its hardy nature and is sometimes used in local landscaping and traditional practices.",
    "distribution_introduced_art_desc": "Acacia guaiaguilensis was mainly introduced to South America, particularly in regions of Argentina, Chile, and Peru. It was brought in for its potential use in soil stabilization and as a source of timber and forage. The plant thrives in dry to semi-arid environments, making it suitable for reforestation and land restoration projects. However, its introduction has raised concerns due to its potential to become invasive in native ecosystems. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
