{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vaga",
    "plant_slug": "acacia-vaga",
    "plant_name_scientific": "acacia vaga",
    "intro": "Acacia vaga, commonly known as the wandering acacia, is a shrub native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, branching stems and small, feathery leaves that are often reduced to spines. The plant produces yellow flowers in globular clusters, which are followed by long, flat pods containing edible seeds. Acacia vaga is adapted to arid environments and is often found in coastal dunes and rocky areas. It plays a role in stabilizing soil and providing habitat for various desert organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vaga is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savanna and shrubland habitats. The plant is well adapted to drought conditions and can survive in areas with low rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia vaga is also sometimes cultivated in other parts of the world for its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia vaga was mainly introduced to areas with sandy or well-drained soils, particularly in regions with a warm climate. It thrives in arid and semi-arid environments, making it common in parts of Australia and the southwestern United States. This plant is often found along roadsides, in disturbed soils, and in open woodlands. Its introduction has led to its establishment in several non-native regions where it can outcompete native vegetation. Due to its rapid growth and adaptability, it is considered a potential invasive species in some areas."
}
