{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia calamifolia var. euthycarpa",
    "plant_slug": "acacia-calamifolia-var-euthycarpa",
    "plant_name_scientific": "acacia calamifolia var. euthycarpa",
    "intro": "Acacia calamifolia var. euthycarpa, commonly known as the narrow-leaf wattle, is a shrub native to the arid and semi-arid regions of Australia. It is characterized by its slender, often drooping stems and small, bipinnate leaves that are typically green with a slight waxy coating. The plant produces yellow globular flowers in late summer, which are clustered in dense inflorescences. It is well adapted to drought conditions, with deep root systems that allow it to access water from deeper soil layers. The wood of this acacia is hard and durable, making it valuable for local use in construction and fencing.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia calamifolia var. euthycarpa is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils and is adapted to the harsh, dry conditions of the region. It thrives in open woodlands and savannas, often growing along riverbanks and in rocky outcrops. The plant is well-known for its distinctive yellow flowers and its ability to withstand prolonged droughts. Its distribution is closely linked to the availability of water and well-drained soil, making it a characteristic species of the Namib Desert and surrounding areas.",
    "distribution_introduced_art_desc": "Acacia calamifolia var. euthycarpa was mainly introduced to areas with well-drained sandy or loamy soils and a warm, temperate climate. It thrives in regions with full sun exposure and moderate to low rainfall. This variety is often used in landscaping for its ornamental value and hardy nature. It has been introduced to parts of the United States, particularly in the southern and western states. However, its spread is limited due to its specific environmental requirements."
}
