{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella sousae",
    "plant_slug": "acaciella-sousae",
    "plant_name_scientific": "acaciella sousae",
    "intro": "Acaciella sousae, commonly known as the Socotra acacia, is a flowering plant native to the island of Socotra in the Arabian Sea. It belongs to the Fabaceae family and is characterized by its distinctive, flat, shield-like leaves that are adapted to reduce water loss in arid conditions. The plant produces small, yellowish-white flowers that are clustered in spherical inflorescences, which are pollinated by insects. Its seeds are enclosed in elongated, woody pods that split open to release the seeds. Acaciella sousae is also notable for its unique, thorned structure and its role in the unique ecosystem of Socotra.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella sousae"
    },
    "taxonomy_art_desc": "Acaciella sousae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their complex vascular systems and often ancient evolutionary origins. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which consists of flowering plants with a distinctive type of flower and includes well-known families such as the legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acaciella, a group of flowering plants typically found in arid and semi-arid regions, with species often adapted to harsh environmental conditions. Its species is Acaciella sousae, a specific plant species within the genus Acaciella, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella sousae is primarily native to Mexico Central and Mexico Southwest. This species is found in the southern regions of Mexico, particularly in the states of Oaxaca, Chiapas, and Veracruz. It thrives in tropical and subtropical climates, often in areas with well-drained soils. The plant is commonly associated with dry forests and scrublands. Its distribution is limited to these specific regions within Mexico.",
    "distribution_introduced_art_desc": "Acaciella sousae was mainly introduced to the Mediterranean region as an ornamental plant due to its unique appearance and drought tolerance. It has since been reported in several countries including Spain, Italy, and France. The plant is often found in gardens and along roadsides, where it thrives in well-drained soils. Its introduction has raised concerns due to its potential to spread into natural habitats. Despite its aesthetic value, it is considered an invasive species in some areas."
}
