{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia anomala",
    "plant_slug": "acacia-anomala",
    "plant_name_scientific": "acacia anomala",
    "intro": "Acacia anomala, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the Fabaceae family, which is characterized by its typical pod fruits and nitrogen-fixing abilities. The plant has narrow, linear leaves that are often clustered at the base of the stems. It produces bright yellow flowers in spring, which are clustered in cylindrical spikes. Acacia anomala is well adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia anomala"
    },
    "taxonomy_art_desc": "Acacia anomala belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their phyllodes and ability to thrive in harsh environments. Its species is Acacia anomala, a specific type of acacia found in certain regions of Australia, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia anomala is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This plant thrives in dry, sandy soils and is often associated with coastal and inland habitats. It is well adapted to the arid and semi-arid climates of its native range. Acacia anomala is an important component of the local flora and plays a role in stabilizing soils in its native environment.",
    "distribution_introduced_art_desc": "Acacia anomala was mainly introduced to new environments for its ornamental value and potential use in soil stabilization. It is commonly found in disturbed areas such as roadsides, open woodlands, and degraded soils. The plant thrives in tropical and subtropical climates, making it adaptable to a variety of habitats. Its rapid growth and ability to fix nitrogen contribute to its success in invasive settings. However, it can outcompete native species, raising concerns about its ecological impact in non-native regions."
}
