{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia smithiana",
    "plant_slug": "acacia-smithiana",
    "plant_name_scientific": "acacia smithiana",
    "intro": "Acacia smithiana, commonly known as the Smith's wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its pod fruits and nitrogen-fixing ability. The plant features feathery, bipinnate leaves and produces yellow flowers in spring. It is often found in dry, sandy soils and is adapted to arid environments. Acacia smithiana is valued for its ornamental appeal and ecological role in supporting native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia smithiana is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, South Africa, and Botswana. It is commonly found in sandy soils and rocky outcrops within these areas. This species thrives in environments with low rainfall and high temperatures. It is often seen growing along the edges of shrublands and in coastal dunes. Acacia smithiana plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia smithiana was mainly introduced to New Zealand as part of ornamental horticulture due to its attractive appearance and hardy nature. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant thrives in a variety of soil types and is adapted to both full sun and partial shade. Its rapid growth and ability to establish itself in disturbed sites contribute to its invasive potential. Management strategies are being developed to control its spread and mitigate its impact on native ecosystems."
}
