{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegal var. fistula",
    "plant_slug": "acacia-senegal-var-fistula",
    "plant_name_scientific": "acacia senegal var. fistula",
    "intro": "Acacia senegal var. fistula, commonly known as the gum arabic tree, is a deciduous shrub or small tree native to the Sahel region of Africa. It is characterized by its thorned stems, bipinnate leaves, and yellowish-green inflorescences that produce small, pod-like fruits. The plant is well-adapted to arid and semi-arid environments, with deep roots that help it survive in dry conditions. It is particularly noted for producing a high-quality gum arabic, which is harvested from the exudation of its bark. This gum is widely used in food, pharmaceutical, and industrial applications due to its unique properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegal var. fistula is primarily native to the Sahel region of Africa, including countries such as Senegal, Mali, Burkina Faso, and Niger. It thrives in semi-arid and arid environments, often found in savannas and along riverbanks. This variant is well adapted to hot and dry climates with poor soil conditions. It is commonly used for its gum arabic production and has ecological and economic importance in the region. The plant plays a significant role in local ecosystems and traditional practices.",
    "distribution_introduced_art_desc": "Acacia senegal var. fistula was mainly introduced to areas with semi-arid to arid climates, particularly in regions where it can thrive in sandy or loamy soils. It is commonly found in parts of Africa, the Middle East, and South Asia, where it has been cultivated for its gum arabic production. This plant is often introduced for its ecological benefits, such as soil stabilization and providing habitat for wildlife. It has also been introduced for its potential in agroforestry systems due to its drought tolerance. However, its introduction has sometimes led to competition with native species in certain regions."
}
