{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia igualensis",
    "plant_slug": "acacia-igualensis",
    "plant_name_scientific": "acacia igualensis",
    "intro": "Acacia igualensis, commonly known as the Iguazu acacia, is a shrub or small tree native to South America, particularly Brazil and Paraguay. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant is distinguished by its slender, often thorny stems and bipinnate leaves composed of numerous small leaflets. Its yellow flowers are clustered in spherical inflorescences, and it produces elongated pods containing flat, seed-rich seeds. Acacia igualensis plays a role in local ecosystems and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia igualensis is primarily native to the dry forests and shrublands of northern Argentina and southern Bolivia. It thrives in arid and semi-arid environments, often found in regions with low rainfall and high temperatures. This species is commonly associated with sandy or rocky soils, making it well adapted to the harsh conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its limited distribution, it is considered a regionally significant plant species in the Andean foothills.",
    "distribution_introduced_art_desc": "Acacia igualensis was mainly introduced to the coastal regions of northeastern Brazil, where it has established itself in sandy soils. It is commonly found in areas with high salinity and low rainfall, adapting well to the harsh environmental conditions. The plant is often used for dune stabilization due to its extensive root system and ability to thrive in poor soil. However, its introduction has led to concerns about its potential invasiveness in native ecosystems. Despite its ecological benefits, monitoring its spread is essential to prevent unintended environmental impacts."
}
