{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia faucium",
    "plant_slug": "acacia-faucium",
    "plant_name_scientific": "acacia faucium",
    "intro": "Acacia faucium, commonly known as the coastal acacia, is a shrub native to southern Africa. It is characterized by its slender, often thornless stems and small, bipinnate leaves. The plant produces yellow, globular inflorescences that attract various pollinators, including bees and birds. It is well adapted to coastal environments, tolerating salt spray and sandy soils. Acacia faucium plays an important role in stabilizing dunes and providing habitat for coastal wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia faucium"
    },
    "taxonomy_art_desc": "Acacia faucium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are typically characterized by compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and their ability to thrive in arid environments. Its species is Acacia faucium, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia faucium is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in open woodlands and grasslands. It is well adapted to the local climate and soil conditions. Acacia faucium plays an important role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acacia faucium was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has helped in restoring degraded lands across parts of Africa and the Middle East. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
