{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trissoneura",
    "plant_slug": "acacia-trissoneura",
    "plant_name_scientific": "acacia trissoneura",
    "intro": "Acacia trissoneura, commonly known as the silky oaks, is a species of flowering plant in the legume family. It is native to Australia and is characterized by its distinctive, feathery foliage and showy yellow flowers. The plant is a deciduous tree that can grow up to 30 meters tall, with a broad, spreading canopy. Its bark is smooth and grayish, while its leaves are bipinnate, consisting of numerous small, rounded leaflets. Acacia trissoneura plays an important role in its native ecosystem, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trissoneura is primarily native to the arid regions of Western Australia. It is commonly found in the Pilbara and Gascoyne regions, where it thrives in sandy soils. This plant is well adapted to the harsh, dry climate of these areas. It is often seen growing in open woodlands and along riverbanks. Its distribution is limited to specific ecological zones within the southwestern part of the country.",
    "distribution_introduced_art_desc": "Acacia trissoneura was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in arid and semi-arid regions where it establishes quickly and forms dense thickets. The plant is valued for its ability to fix nitrogen, improving soil fertility in poor soils. However, its rapid growth can lead to the displacement of native vegetation if not managed properly. It is often used in rehabilitation projects due to its hardiness and adaptability to harsh environmental conditions."
}
