{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vilhelmii",
    "plant_slug": "acacia-vilhelmii",
    "plant_name_scientific": "acacia vilhelmii",
    "intro": "Acacia vilhelmii, commonly known as the coastal acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often thornless branches and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellow flowers in dense, globular clusters, which are highly attractive to bees and other pollinators. It thrives in coastal and sandy environments, often tolerating salt spray and drought. Acacia vilhelmii is valued for its ecological role in stabilizing dunes and providing habitat for wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vilhelmii is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and southwestern Angola. It is commonly found in sandy soils and rocky outcrops, often in savanna and shrubland ecosystems. This plant is well adapted to the harsh climate of its native habitat, with its deep root system allowing it to access water from deeper underground. It plays an important ecological role by providing shelter and food for local wildlife. Acacia vilhelmii is also sometimes cultivated in regions with similar environmental conditions for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia vilhelmii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the eastern coast, thriving in coastal and semi-arid environments. This plant is often used for its ornamental value due to its unique foliage and ability to withstand harsh conditions. It has also been introduced to other parts of the world, including Australia and the United States, as an ornamental and for erosion control. However, its spread has raised concerns about its potential impact on native ecosystems."
}
