{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paniculiflora",
    "plant_slug": "acacia-paniculiflora",
    "plant_name_scientific": "acacia paniculiflora",
    "intro": "Acacia paniculiflora, commonly known as the coastal wattle, is a shrub native to coastal regions of southern Australia. It is characterized by its slender, often spiny stems and narrow, linear leaves. The plant produces yellow flowers in dense, pendulous clusters, which bloom from late winter to early spring. It is well adapted to sandy soils and saline environments, making it a hardy species. Acacia paniculiflora plays an important role in stabilizing coastal dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paniculiflora is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the northern parts of Western Australia, the Northern Territory, and Queensland. This plant thrives in sandy soils and is often associated with spinifex plains and rocky outcrops. It is well adapted to the harsh, dry conditions of its native habitat. Acacia paniculiflora plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia paniculiflora was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for soil stabilization and as a source of timber due to its hardy nature. Its introduction has sometimes led to ecological concerns due to its potential to become invasive. It is also valued for its ornamental qualities and ability to provide habitat for native wildlife."
}
