{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acachmena cuspidata",
    "plant_slug": "acachmena-cuspidata",
    "plant_name_scientific": "acachmena cuspidata",
    "intro": "Acachmena cuspidata, commonly known as the prickly pear cactus, is a species of cactus native to the arid regions of the Americas. It is characterized by its spiny, fleshy stems that store water, allowing it to thrive in dry environments. The plant produces vibrant flowers, typically in shades of yellow, orange, or red, which bloom in the spring. Its fruit, known as a tuna, is edible and has been used by indigenous peoples for food and medicine. Acachmena cuspidata plays an important ecological role by providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acachmena cuspidata is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid, warm climates with high rainfall. It is often associated with disturbed habitats and can be seen growing along forest edges or in swampy areas. Its distribution is largely confined to these specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acachmena cuspidata was mainly introduced to new habitats in tropical and subtropical regions, often as an ornamental plant or for erosion control. It has spread beyond its original range due to its rapid growth and ability to thrive in disturbed soils. This distribution has raised concerns about its potential to become invasive in non-native environments. The plant's adaptability to various climatic conditions contributes to its successful establishment in new areas. However, its ecological impact remains under study in many regions where it has become naturalized."
}
