{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptospermoides subsp. obovata",
    "plant_slug": "acacia-leptospermoides-subsp-obovata",
    "plant_name_scientific": "acacia leptospermoides subsp. obovata",
    "intro": "Acacia leptospermoides subsp. obovata, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It features compound leaves with small, oval-shaped phyllodes that are typically narrow and slightly curved. The plant produces yellow floral spikes that bloom during the warmer months, attracting pollinators such as bees and birds. It thrives in well-drained soils and is often found in dry, open habitats. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardy nature and attractive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leptospermoides"
    },
    "taxonomy_art_desc": "Acacia leptospermoides subsp. obovata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often leguminous, producing pods as fruits. Its family is Fabaceae, commonly known as the legume or pea family, which is known for its nitrogen-fixing abilities and diverse growth forms. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, characterized by their distinctive phyllodes and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia leptospermoides, a specific type of acacia known for its slender, spindly growth and is a subspecies of obovata, which refers to its broadly ovate leaves.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptospermoides subsp. obovata is primarily native to Western Australia. This subspecies is found in the southern and southwestern regions of the state. It typically grows in sandy soils and is adapted to the arid and semi-arid environments of the region. The plant is commonly found in open woodlands and shrublands. Its distribution is largely restricted to the coastal and inland areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia leptospermoides subsp. obovata was mainly introduced to urban and suburban areas in southern Australia for its ornamental value and ability to thrive in disturbed soils. It is commonly found in gardens, along roadsides, and in degraded landscapes where it can establish quickly. The subspecies is known for its dense, spreading habit and its capacity to form thickets, which can sometimes lead to invasiveness in non-native environments. Due to its hardiness and adaptability, it has become a popular choice for erosion control and landscaping. However, its introduction has raised concerns about its potential to spread beyond cultivated areas."
}
