{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armatoides",
    "plant_slug": "acacia-armatoides",
    "plant_name_scientific": "acacia armatoides",
    "intro": "Acacia armatoides, commonly known as the rough wattle, is a shrub or small tree native to Australia. It is characterized by its yellow flowers and phyllodes, which are modified leaves that serve as photosynthetic organs. The plant has a woody stem with a thick, ridged bark that provides protection against fire and drought. It thrives in arid and semi-arid environments, often found in open woodlands and rocky soils. Acacia armatoides is also valued for its hardy nature and ability to stabilize soil in degraded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armatoides is primarily native to northern Australia, including the Northern Territory, Western Australia, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant thrives in open woodlands and shrublands, often along riverbanks and in coastal areas. It is well adapted to drought conditions and can tolerate high temperatures. Acacia armatoides is also known as the \"bullock's wheat\" and is an important component of the local flora.",
    "distribution_introduced_art_desc": "Acacia armatoides was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It has since become naturalized in several regions, particularly in the North Island. The plant is known for its dense, spiny foliage and ability to thrive in a variety of soil types. However, it has raised concerns due to its potential to spread aggressively and compete with native vegetation. Its introduction highlights the ecological impacts of non-native species in new environments."
}
