{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kuhlmannii",
    "plant_slug": "acacia-kuhlmannii",
    "plant_name_scientific": "acacia kuhlmannii",
    "intro": "Acacia kuhlmannii, commonly known as the Kuhlmann's wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in globular clusters, which bloom during the warmer months. It is adapted to arid and semi-arid environments, showcasing drought tolerance. Acacia kuhlmannii is also known for its ability to fix nitrogen in the soil, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kuhlmannii is primarily native to parts of southern Africa, including South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This plant thrives in well-drained soils and is adapted to the dry climate of its native habitat. It is often seen growing along roadsides and in open grasslands. Due to its hardy nature, it plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia kuhlmannii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for stabilizing soils and preventing erosion due to its extensive root system. Its ability to fix nitrogen makes it valuable for improving soil fertility in degraded lands. However, it can become invasive in some environments if not managed properly."
}
