{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis var. lenticellosa",
    "plant_slug": "acacia-tortilis-var-lenticellosa",
    "plant_name_scientific": "acacia tortilis var. lenticellosa",
    "intro": "Acacia tortilis var. lenticellosa, commonly known as the umbrella thorn acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive umbrella-shaped crown formed by dense, spreading branches. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. Its flowers are yellow and clustered in globular heads, attracting various pollinators. The acacia is well adapted to drought conditions, with deep roots and a waxy coating on its phyllodes to reduce water loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis var. lenticellosa is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of the Arabian Peninsula, particularly in southern Saudi Arabia and Yemen. This plant thrives in arid and semi-arid regions, often growing in rocky or sandy soils. It is commonly found in savannas and woodlands, where it plays an important ecological role. The species is well adapted to drought conditions and can survive in areas with low rainfall.",
    "distribution_introduced_art_desc": "Acacia tortilis var. lenticellosa was mainly introduced to arid and semi-arid regions of Africa, particularly in countries like Sudan, Ethiopia, and Somalia. It is commonly found in savannas, rocky outcrops, and along riverbanks where it can thrive in poor soil conditions. This species is valued for its ability to fix nitrogen, improving soil fertility and supporting other plant life in degraded areas. Its dense foliage also provides shade and habitat for various wildlife species. Due to its ecological and economic importance, it has been widely planted for reforestation and land rehabilitation efforts."
}
