{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scandens",
    "plant_slug": "acacia-scandens",
    "plant_name_scientific": "acacia scandens",
    "intro": "Acacia scandens, commonly known as the climbing acacia, is a shrub or small tree native to tropical and subtropical regions of Africa and Asia. It is characterized by its slender, woody stems that can climb or trail along the ground, often forming dense thickets. The plant produces small, yellow flowers arranged in spherical clusters, which are highly attractive to bees and other pollinators. Its leaves are bipinnate, consisting of multiple pairs of small, oval-shaped leaflets. Acacia scandens is often used in traditional medicine and is also valued for its ornamental appeal in landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scandens is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in open woodlands, savannas, and along riverbanks where it can receive adequate sunlight. This plant is well adapted to dry and seasonal climates, often growing in areas with well-drained soils. Its distribution extends into parts of the Arabian Peninsula and the Indian subcontinent. Acacia scandens is commonly found in regions with a mix of grasslands and scattered trees.",
    "distribution_introduced_art_desc": "Acacia scandens was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and adaptability to various environmental conditions. It has since become naturalized in several regions, particularly in coastal and disturbed areas. The plant's rapid growth and ability to thrive in poor soils have contributed to its spread beyond its original introduction sites. However, it is not considered invasive in New Zealand and is generally managed as a non-native species. Its distribution is primarily limited to the northern and western parts of the country."
}
