{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fitzgeraldii",
    "plant_slug": "acacia-fitzgeraldii",
    "plant_name_scientific": "acacia fitzgeraldii",
    "intro": "Acacia fitzgeraldii, commonly known as the Fitzgerald's wattle, is a shrub or small tree native to the arid regions of Western Australia. It is characterized by its slender, branching structure and phyllodes that are typically linear to narrowly elliptic in shape. The plant produces yellow flower spikes during the winter months, which are clustered in dense, cylindrical inflorescences. Its leaves are modified into phyllodes, a common adaptation in acacia species to reduce water loss in dry environments. Acacia fitzgeraldii is often found in sandy soils and is well adapted to the harsh conditions of its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fitzgeraldii is primarily native to the arid and semi-arid regions of Australia, particularly in the northern and central parts of the country. It is commonly found in the Northern Territory, Western Australia, and South Australia. This plant thrives in sandy soils and is often associated with shrublands and woodland ecosystems. It is well adapted to the harsh climate, with its small, waxy leaves helping to reduce water loss. Acacia fitzgeraldii plays an important ecological role by providing shelter and food for native wildlife.",
    "distribution_introduced_art_desc": "Acacia fitzgeraldii was mainly introduced to areas with a warm, dry climate and well-drained soils, often in regions where it is used for soil stabilization and as a source of timber. It is commonly found in arid and semi-arid environments, particularly in parts of Australia and the Mediterranean. This plant has been introduced to various parts of the world, including southern Africa and the Middle East, where it thrives in similar ecological conditions. Its introduction has sometimes led to concerns about its potential invasiveness in non-native habitats. Due to its hardy nature and adaptability, it has become a valuable species in reforestation and land rehabilitation projects."
}
