{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stanleyi",
    "plant_slug": "acacia-stanleyi",
    "plant_name_scientific": "acacia stanleyi",
    "intro": "Acacia stanleyi, commonly known as the Stanley's acacia, is a deciduous shrub or small tree native to eastern Africa. It is characterized by its slender, multi-branched stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow to golden-yellow flowers in globular or cylindrical inflorescences, which appear in late winter to early spring. Acacia stanleyi is adapted to arid and semi-arid environments, showing resilience to drought and heat. It plays an important ecological role by providing food and habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stanleyi"
    },
    "taxonomy_art_desc": "Acacia stanleyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, which comprises flowering plants with a wide range of morphological diversity and includes many economically important species. Its order is Fabales, a group of flowering plants that includes legumes and other plants capable of nitrogen fixation through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their sharp thorns and distinctive foliage, often found in arid environments. Its species is Acacia stanleyi, a specific type of acacia native to certain regions of Africa, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stanleyi is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the state. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of the region. Acacia stanleyi plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia stanleyi was mainly introduced to areas with well-drained soils and a warm, dry climate. It is commonly found in regions with low precipitation and high temperatures. This plant thrives in open habitats such as grasslands and rocky slopes. It has been introduced to several parts of Africa, particularly in countries like Kenya and Tanzania. Its introduction has sometimes led to concerns about its impact on native vegetation."
}
