{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oraria var. typica",
    "plant_slug": "acacia-oraria-var-typica",
    "plant_name_scientific": "acacia oraria var. typica",
    "intro": "Acacia oraria var. typica, commonly known as the white wattle, is a shrub native to Australia. It is characterized by its narrow, feathery leaves and yellow flowers that bloom in clusters. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. It plays an important role in stabilizing soils and providing habitat for native wildlife. Its botanical features make it a valuable species for ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oraria var. typica is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This species is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. It thrives in environments with high temperatures and limited water availability. The plant is well adapted to the harsh conditions of its native habitat, showcasing resilience and drought tolerance. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia oraria var. typica was mainly introduced to areas with dry to semi-arid climates, particularly in regions with well-drained soils. It thrives in environments with moderate to high sunlight exposure and is often found in coastal and inland dunes. This plant is commonly used for erosion control due to its extensive root system and ability to stabilize sandy soils. It is also valued for its ornamental qualities, including its feathery foliage and yellow flowers. However, its introduction has sometimes led to ecological concerns in non-native regions where it may outcompete local vegetation."
}
