{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia philippinarum",
    "plant_slug": "acacia-philippinarum",
    "plant_name_scientific": "acacia philippinarum",
    "intro": "Acacia philippinarum, commonly known as the Philippine acacia, is a flowering plant native to Southeast Asia. It is characterized by its slender, branching stems and feathery, bipinnate leaves. The plant produces yellow flowers arranged in cylindrical clusters, which are often used in traditional medicine. It thrives in tropical and subtropical climates, often growing in open woodlands or along coastal areas. Its seeds are encased in a hard, woody pod, which can remain on the plant for several years.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia philippinarum is primarily native to the Philippines, particularly in the islands of Luzon, Mindanao, and Palawan. It thrives in tropical and subtropical regions, often found in lowland areas with well-drained soils. This species is commonly associated with disturbed habitats such as roadsides, clearings, and secondary forests. It is also present in parts of Indonesia and Malaysia. Acacia philippinarum is known for its ability to colonize degraded lands, making it an important pioneer species in ecological succession.",
    "distribution_introduced_art_desc": "Acacia philippinarum was mainly introduced to control soil erosion and as a source of timber and fodder in various regions. It is commonly found in disturbed soils and along roadsides, where it thrives in sunny, open environments. The plant has become naturalized in several countries, including the United States and Australia, due to its rapid growth and adaptability. However, its introduction has led to concerns about its potential to invade native ecosystems and outcompete local plant species. Despite its benefits, careful management is needed to prevent its spread in sensitive ecological areas."
}
