{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia conzattii",
    "plant_slug": "acacia-conzattii",
    "plant_name_scientific": "acacia conzattii",
    "intro": "Acacia conzattii, commonly known as the Conzatti's wattle, is a shrub native to the arid regions of western Australia. It is characterized by its slender, branched stems and small, feathery leaves that are often covered in a fine layer of white wax. The plant produces yellow flowers in compact, cylindrical clusters, which bloom during the warmer months. Acacia conzattii is adapted to survive in dry conditions, with deep root systems that allow it to access water from deeper soil layers. It plays an important role in stabilizing sandy soils and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia conzattii is primarily native to the arid regions of northern Australia, particularly in the Northern Territory and Western Australia. It is commonly found in sandy soils and dry shrublands, often growing in areas with low rainfall. This species is adapted to extreme heat and drought, making it a resilient component of the local ecosystem. It plays a vital role in stabilizing soil and providing habitat for native wildlife. Due to its limited range, it is considered a rare and threatened species in its native habitat.",
    "distribution_introduced_art_desc": "Acacia conzattii was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, particularly in Namibia and South Africa. This plant is often used for its hardy nature and ability to withstand harsh environmental conditions. Its introduction has been largely for ornamental purposes and as a potential source of timber. However, it has also raised concerns about its potential invasiveness in certain ecosystems."
}
