{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rohriana",
    "plant_slug": "acacia-rohriana",
    "plant_name_scientific": "acacia rohriana",
    "intro": "Acacia rohriana, commonly known as the white acacia, is a small shrub native to arid regions of southern Africa. It is characterized by its slender, erect stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow flowers in globular or cylindrical inflorescences, which bloom during the rainy season. Its seeds are enclosed in woody pods and are adapted to disperse in dry conditions. Acacia rohriana is well-suited to harsh environments and is often used in traditional medicine and as a source of fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rohriana is primarily native to the southern regions of Africa, specifically South Africa. It is commonly found in the Western Cape province, particularly in the fynbos biome. This plant thrives in sandy soils and is often associated with coastal and mountainous areas. It is well adapted to the Mediterranean climate of the region, characterized by wet winters and dry summers. Acacia rohriana plays an important ecological role in its native habitat, providing habitat and food for various local wildlife species.",
    "distribution_introduced_art_desc": "Acacia rohriana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. The plant thrives in dry, sandy soils and is often seen in coastal and inland areas. It is known for its distinctive yellow flowers and ability to withstand drought conditions. Due to its adaptability, it has spread beyond its original introduction sites, raising concerns about its impact on local ecosystems."
}
