{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ataxiphylla subsp. magna",
    "plant_slug": "acacia-ataxiphylla-subsp-magna",
    "plant_name_scientific": "acacia ataxiphylla subsp. magna",
    "intro": "Acacia ataxiphylla subsp. magna, commonly known as the large-flowered acacia, is a shrub or small tree native to Australia. It is characterized by its distinctive, flat, bipinnate leaves and yellow or pale yellow flowers that appear in dense, globular clusters. The plant thrives in arid and semi-arid environments, often found in sandy or rocky soils. It is well adapted to withstand drought conditions due to its deep root system and waxy leaf surfaces. The species is valued for its ornamental appeal and is sometimes used in horticulture for its unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ataxiphylla"
    },
    "taxonomy_art_desc": "Acacia ataxiphylla subsp. magna belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often having nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in tropical and subtropical regions, known for their unique floral structures and often used for timber or as ornamental plants. Its species is Acacia ataxiphylla, a specific variety within the Acacia genus, distinguished by its particular morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ataxiphylla subsp. magna is primarily native to Western Australia. This subspecies is typically found in the southern and western regions of the state. It grows in arid and semi-arid environments, often in sandy or rocky soils. The plant is well adapted to the harsh climatic conditions of its native range. It is commonly found in areas with low rainfall and high temperatures.",
    "distribution_introduced_art_desc": "Acacia ataxiphylla subsp. magna was mainly introduced to South Africa, where it has been cultivated for its ornamental value and hardy nature. It is commonly found in gardens and along roadsides due to its ability to thrive in arid and semi-arid conditions. This subspecies is known for its distinctive foliage and yellow flowers, making it a popular choice for landscaping. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its introduction has contributed to the diversity of plant species in certain regions of the country."
}
