{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dealbata var. mackayana",
    "plant_slug": "acacia-dealbata-var-mackayana",
    "plant_name_scientific": "acacia dealbata var. mackayana",
    "intro": "Acacia dealbata var. mackayana, commonly known as the silver wattle, is a variant of the silver wattle species native to Australia. It is characterized by its feathery, bipinnate leaves that are covered in fine white hairs, giving it a silvery appearance. The plant produces yellow globular flowers that bloom in late winter to early spring, attracting a variety of pollinators. It thrives in well-drained soils and is often found in open woodlands and along coastal areas. This variety is valued for its ornamental beauty and is sometimes cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dealbata var. mackayana is primarily native to southeastern Australia, including parts of New South Wales and Victoria. This variant is typically found in coastal regions and sandy soils along the eastern coast of Australia. It thrives in temperate climates with mild winters and warm, dry summers. The plant is often associated with open woodlands and heathlands. Its distribution is limited compared to the broader Acacia dealbata species, which has a wider range.",
    "distribution_introduced_art_desc": "Acacia dealbata var. mackayana was mainly introduced to New Zealand. It was brought there during the 19th century as an ornamental plant due to its attractive white flowers and unique foliage. The introduction has led to its establishment in various regions, particularly in the North Island. However, it is considered an invasive species in some areas, outcompeting native vegetation. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
