{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pycnantha var. latissima",
    "plant_slug": "acacia-pycnantha-var-latissima",
    "plant_name_scientific": "acacia pycnantha var. latissima",
    "intro": "Acacia pycnantha var. latissima, commonly known as the broad-leaved golden wattle, is a shrub or small tree native to southeastern Australia. It is characterized by its narrow, lance-shaped leaves and clusters of bright yellow flowers that bloom in spring. The plant is well adapted to dry conditions and thrives in full sun. It is a popular ornamental plant due to its attractive appearance and hardiness. The variety latissima is distinguished by its broader leaves compared to the typical form of A. pycnantha.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pycnantha var. latissima is primarily native to southern Australia, including the states of New South Wales, Victoria, and South Australia. It is commonly found in dry, open habitats such as woodlands, grasslands, and rocky outcrops. This variety is particularly adapted to arid and semi-arid regions, where it thrives in well-drained soils. It is often seen along roadsides and in disturbed areas due to its ability to colonize quickly. The plant plays an important ecological role by providing food and shelter for native wildlife.",
    "distribution_introduced_art_desc": "Acacia pycnantha var. latissima was mainly introduced to South Africa, where it has been cultivated for its ornamental value and hardiness. It is commonly found in gardens and along roadsides due to its ability to thrive in a variety of soil types. This variety is known for its distinctive yellow flowers and broad, flat leaves, making it a popular choice for landscaping. However, it has also been reported to spread into natural areas, raising concerns about its potential invasiveness. Despite its beauty, careful management is recommended to prevent it from becoming a weed in local ecosystems."
}
