{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia steedmanii subsp. steedmanii",
    "plant_slug": "acacia-steedmanii-subsp-steedmanii",
    "plant_name_scientific": "acacia steedmanii subsp. steedmanii",
    "intro": "Acacia steedmanii subsp. steedmanii, commonly known as the Steedman's wattle, is a shrub or small tree native to Western Australia. It features slender, zigzagging branches and produces yellow flowers in globular clusters, which bloom during the warmer months. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The species is valued for its ornamental appeal and is often used in landscaping in suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia steedmanii"
    },
    "taxonomy_art_desc": "Acacia steedmanii subsp. steedmanii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its vascular system and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by a wide variety of floral structures. Its order is Fabales, which includes legumes and related plants, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Australia and other parts of Africa and Asia, known for their characteristic phyllodes and often used in traditional medicine. Its species is Acacia steedmanii, a specific variety within the Acacia genus, known for its ecological significance and adaptation to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia steedmanii subsp. steedmanii is primarily native to Western Australia. It is commonly found in the southwestern and central regions of the state. This subspecies thrives in arid and semi-arid environments, often growing on rocky soils. It is typically found in open woodlands and shrublands. Its distribution is largely restricted to the coastal and interior areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia steedmanii subsp. steedmanii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and hardy nature. This subspecies is commonly found in coastal and urban areas where it thrives in well-drained soils. However, it has also become naturalized in some regions, raising concerns about its potential impact on native ecosystems. Its introduction has led to discussions about its role in both landscaping and ecological management."
}
