{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia euthyphylla",
    "plant_slug": "acacia-euthyphylla",
    "plant_name_scientific": "acacia euthyphylla",
    "intro": "Acacia euthyphylla, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spindly growth habit and its distinctive, narrow, phyllode-like leaves that are typically green and hairless. The plant produces yellow globular flowers in winter, which are arranged in spikes and attract a variety of pollinators. Acacia euthyphylla is well adapted to arid and semi-arid environments, showing drought tolerance and a capacity for resprouting after fire. It is often found in sandy or rocky soils and is an important component of local ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia euthyphylla"
    },
    "taxonomy_art_desc": "Acacia euthyphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, often with a distinctive morphology. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse growth forms. Its order is Fabales, which consists of flowering plants that are typically legumes, often with symbiotic nitrogen-fixing relationships. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia euthyphylla, a specific type of acacia known for its unique leaf structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia euthyphylla is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the state. This plant thrives in arid and semi-arid environments, often growing in open woodlands and scrublands. It is well adapted to the harsh climatic conditions of the region. Its distribution is largely restricted to the western part of Australia, where it plays an important ecological role.",
    "distribution_introduced_art_desc": "Acacia euthyphylla was mainly introduced to specific regions in Australia, particularly in the southern parts of Western Australia and South Australia. It was introduced for its potential as a windbreak and for its ability to stabilize sandy soils. The plant is commonly found in coastal and inland areas where it thrives in well-drained soils. It has been used in rehabilitation projects due to its hardiness and adaptability. However, its spread has been limited due to its preference for specific environmental conditions."
}
