{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oliveri",
    "plant_slug": "acacia-oliveri",
    "plant_name_scientific": "acacia oliveri",
    "intro": "Acacia oliveri, commonly known as Oliver's wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, zigzagging stems and phyllodes that are narrow and often recurved. The plant produces yellow flowers in compact, spherical clusters, which bloom during the warmer months. It is adapted to survive in dry conditions with its deep root system and ability to fix nitrogen. Acacia oliveri is often used in rehabilitation of degraded soils due to its hardy nature and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oliveri is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. This plant is well adapted to harsh environmental conditions, making it a resilient component of its native ecosystem. It plays an important role in local biodiversity and is often used for its timber and medicinal properties. Its distribution is closely tied to the specific climatic and geological features of southern Africa.",
    "distribution_introduced_art_desc": "Acacia oliveri was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This plant has been widely used in reclamation projects due to its ability to thrive in harsh environmental conditions. Its deep root system helps in binding the soil and reducing the risk of landslides. However, it can sometimes become invasive in certain ecosystems if not managed properly."
}
