{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia arabica var. cupressiformis",
    "plant_slug": "acacia-arabica-var-cupressiformis",
    "plant_name_scientific": "acacia arabica var. cupressiformis",
    "intro": "Acacia arabica var. cupressiformis, commonly known as the narrow-leaved acacia, is a shrub or small tree native to arid and semi-arid regions of the Arabian Peninsula. It is characterized by its narrow, needle-like leaves that are often arranged in clusters, giving it a resemblance to cypress trees. The plant produces yellow to orange flowers that bloom in spring, attracting various pollinators. Its root system is deep and extensive, allowing it to thrive in poor, sandy soils with minimal water. This species is also valued for its hard, durable wood and has been used traditionally for construction and fuel.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia arabica var. cupressiformis is primarily native to the Arabian Peninsula, particularly in regions of Saudi Arabia, Yemen, and Oman. It thrives in arid and semi-arid environments, often found in rocky soils and coastal areas. This variety is well adapted to the hot and dry climate typical of its native range. It is commonly found in coastal dunes and rocky hillsides. Due to its unique appearance, it is also sometimes cultivated in botanical gardens and as an ornamental plant.",
    "distribution_introduced_art_desc": "Acacia arabica var. cupressiformis was mainly introduced to South Africa, where it has been cultivated for its ornamental value and hardiness. It is commonly found in gardens and along roadsides due to its ability to thrive in arid and semi-arid conditions. This variety is known for its distinctive, compact growth habit and dark green foliage. Although it is not native to the region, it has become a popular choice for landscaping in coastal and inland areas. However, its invasive potential in certain environments has led to caution in its use."
}
