{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens var. normalis",
    "plant_slug": "acacia-decurrens-var-normalis",
    "plant_name_scientific": "acacia decurrens var. normalis",
    "intro": "Acacia decurrens var. normalis, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its narrow, linear leaves and yellow, globular flower heads that appear in late summer. The plant is adapted to arid and semi-arid environments, with a deep root system for water uptake. It produces long, slender pods that contain seeds dispersed by wind. This species is valued for its ornamental appeal and is often used in landscaping due to its drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens var. normalis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in well-drained soils. This variety is adapted to withstand drought conditions and high temperatures, making it a resilient plant in its native habitat. It plays an important ecological role by providing food and shelter for various wildlife species. Its distribution is also influenced by the availability of water and the specific soil composition in these regions.",
    "distribution_introduced_art_desc": "Acacia decurrens var. normalis was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the arid and semi-arid zones of Western Australia and South Australia. This plant is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has been associated with both ecological benefits and potential invasiveness in certain environments. It is an important species in the revegetation of degraded lands in its native range."
}
