{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crispula",
    "plant_slug": "acacia-crispula",
    "plant_name_scientific": "acacia crispula",
    "intro": "Acacia crispula, commonly known as the silver wattle, is a shrub native to southeastern Australia. It is characterized by its finely divided, feathery leaves that give it a delicate, silvery appearance. The plant produces yellow globular flowers that bloom in spring, attracting pollinators such as bees and birds. Acacia crispula is drought-tolerant and thrives in well-drained soils, making it suitable for coastal and sandy environments. It is also valued for its ornamental appeal and is often used in landscaping and restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia crispula"
    },
    "taxonomy_art_desc": "Acacia crispula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and vetches. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used in traditional medicine and landscaping. Its species is Acacia crispula, a specific type of acacia known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crispula is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the areas of the Swan Coastal Plain and the Geraldton region. This plant thrives in sandy soils and is often seen in coastal and inland areas. It is well adapted to the dry and warm climate of its native habitat. Acacia crispula plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia crispula was mainly introduced to areas with well-drained soils and moderate to high rainfall, typically in regions with a temperate climate. It thrives in open habitats such as grasslands, woodlands, and along riverbanks. This plant is often found in the southeastern and eastern parts of Australia, including New South Wales and Victoria. It is commonly used for soil stabilization and as a source of browse for livestock. Its distribution has been influenced by human activities such as land clearing and agricultural expansion."
}
