{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kirkii subsp. mildbraedii",
    "plant_slug": "acacia-kirkii-subsp-mildbraedii",
    "plant_name_scientific": "acacia kirkii subsp. mildbraedii",
    "intro": "Acacia kirkii subsp. mildbraedii, commonly known as the Kirk's acacia, is a shrub or small tree native to eastern and southern Africa. It is characterized by its slender, often spiny branches and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in globular clusters, which are followed by elongated, woody pods containing seeds. It thrives in dry, sandy soils and is adapted to arid and semi-arid environments. This subspecies is valued for its ornamental appeal and traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kirkii subsp. mildbraedii is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and parts of Mozambique. It thrives in dry to semi-arid regions, often found in savannas and woodland areas. This subspecies is well adapted to hot and arid climates, with its deep root system allowing it to access water from deeper soil layers. It is commonly found in rocky soils and along riverbanks in its native range. The plant plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia kirkii subsp. mildbraedii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern and Western Cape provinces, as well as parts of KwaZulu-Natal. This subspecies thrives in a variety of habitats, including rocky outcrops, coastal cliffs, and sandy soils. It is often used in ecological restoration projects due to its hardiness and ability to stabilize soils. However, its introduction has raised concerns about potential invasiveness in some ecosystems."
}
