{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leucosperma",
    "plant_slug": "acacia-leucosperma",
    "plant_name_scientific": "acacia leucosperma",
    "intro": "Acacia leucosperma, commonly known as the white-flowered acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are feathery in appearance. The plant produces yellow flowers in dense, globular clusters, which are followed by elongated, woody pods containing seeds. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia leucosperma is often used in traditional medicine and has ecological importance as a source of food and shelter for various animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leucosperma is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savannas, grasslands, and rocky outcrops across these regions. This species thrives in well-drained soils and is often associated with dry, open habitats. It is an important component of the local vegetation and plays a role in supporting wildlife. The plant is also known for its distinctive yellow flowers and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia leucosperma was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western and Eastern Cape provinces, as well as in parts of KwaZulu-Natal. The plant thrives in coastal and sandy soils, often growing along the edges of forests and in open woodland areas. Its introduction has led to some ecological concerns due to its potential invasiveness in certain habitats. It is widely used in horticulture for its ornamental value and as a source of timber."
}
