{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennata var. heyneana",
    "plant_slug": "acacia-pennata-var-heyneana",
    "plant_name_scientific": "acacia pennata var. heyneana",
    "intro": "Acacia pennata var. heyneana, commonly known as the silky acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It is characterized by its slender, often twisted branches and feathery, bipinnate leaves that give it a delicate, lace-like appearance. The plant produces yellow to orange flowers in compact spikes, which bloom during the dry season. Its seed pods are long, slender, and ribbed, containing small, hard seeds. Acacia pennata var. heyneana is often used in horticulture for its ornamental value and can thrive in well-drained soils with full sun exposure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennata var. heyneana is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is commonly found in savanna and woodland habitats, often growing in well-drained soils. This variant is adapted to seasonal rainfall patterns and can thrive in both full sun and partial shade. It is often used in traditional medicine and as a source of timber and fuelwood. Its distribution is also influenced by human activities such as land use changes and deforestation.",
    "distribution_introduced_art_desc": "Acacia pennata var. heyneana was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and ability to thrive in tropical climates. It has also been introduced to parts of Central America and the Caribbean, where it is sometimes used in landscaping and reforestation projects. Despite its ornamental value, it has shown potential to become invasive in certain regions, outcompeting native vegetation. The plant prefers well-drained soils and full sun, making it adaptable to a variety of environmental conditions. Its introduction has raised concerns among conservationists due to its rapid spread and ecological impact."
}
