{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longispicata",
    "plant_slug": "acacia-longispicata",
    "plant_name_scientific": "acacia longispicata",
    "intro": "Acacia longispicata, commonly known as the long-spined acacia, is a shrub or small tree native to the arid and semi-arid regions of Australia. It is characterized by its long, slender, spiny stipules that are often mistaken for leaves. The plant produces yellow flowers in summer, which are arranged in cylindrical or spicate inflorescences. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia longispicata is adapted to withstand drought and high temperatures, making it a resilient component of its native ecosystem.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia longispicata"
    },
    "taxonomy_art_desc": "Acacia longispicata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns, horsetails, and flowering plants, and is distinguished by their vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of plants with flowers typically having five petals and includes legumes and other plants that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive phyllodes and ability to thrive in harsh environments. Its species is Acacia longispicata, a specific type of acacia characterized by its long, spiky pods and is native to parts of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [
        "India",
        "Lesser Sunda Is."
    ],
    "distribution_native_art_desc": "Acacia longispicata is primarily native to Queensland. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distinctive long, spiky pods are a notable feature of its appearance.",
    "distribution_introduced_art_desc": "Acacia longispicata was mainly introduced to India and the Lesser Sunda Islands. It is a shrub or small tree native to Australia and has been introduced for various purposes such as ornamental use or for soil stabilization. The plant thrives in tropical and subtropical climates, making it suitable for the regions where it has been introduced. In India, it has been found in areas with well-drained soils and adequate sunlight. On the Lesser Sunda Islands, it has adapted to the local environmental conditions and has become part of the local flora."
}
