{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oblonga",
    "plant_slug": "acacia-oblonga",
    "plant_name_scientific": "acacia oblonga",
    "intro": "Acacia oblonga, commonly known as the narrowleaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and narrow, feathery leaves. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia oblonga is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid regions. It is also valued for its ornamental appeal and role in ecological restoration.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oblonga is primarily native to the arid and semi-arid regions of southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This species is well adapted to hot and dry climates, often growing along riverbanks or in areas with seasonal rainfall. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia oblonga is also known for its distinctive, flat, bipinnate leaves and yellow flowers that bloom during the rainy season.",
    "distribution_introduced_art_desc": "Acacia oblonga was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its deep root system and ability to thrive in poor soil conditions. The plant is also valued for its rapid growth and ability to provide shade and forage for livestock. Its introduction has helped in restoring degraded lands across several countries in Africa and the Middle East. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
