{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia turnbulliana",
    "plant_slug": "acacia-turnbulliana",
    "plant_name_scientific": "acacia turnbulliana",
    "intro": "Acacia turnbulliana, commonly known as the Turner's wattle, is a flowering plant native to Western Australia. It is a shrub or small tree that typically grows in sandy soils and coastal areas. The plant produces bright yellow flowers in late winter to early spring, attracting various pollinators. Its leaves are bipinnate, consisting of multiple small leaflets, and it has distinctive, flattened pods that contain its seeds. Acacia turnbulliana is well adapted to arid and semi-arid environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia turnbulliana is primarily native to the coastal regions of southern Australia, including the states of New South Wales, Victoria, and South Australia. It thrives in sandy soils along the coastlines and is commonly found in dune systems and coastal heathlands. This species is well adapted to the arid and semi-arid climates of these regions. It plays an important ecological role in stabilizing dunes and providing habitat for native wildlife. Acacia turnbulliana is also known for its distinctive yellow flowers and is often used in local landscaping due to its hardiness and aesthetic appeal.",
    "distribution_introduced_art_desc": "Acacia turnbulliana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This plant is often used for soil stabilization due to its deep root system and ability to tolerate drought. However, it can also become invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
