{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia melaleucoides",
    "plant_slug": "acacia-melaleucoides",
    "plant_name_scientific": "acacia melaleucoides",
    "intro": "Acacia melaleucoides, commonly known as the white wattle, is a small to medium-sized shrub or tree native to Australia. It is characterized by its slender, often branched stems and small, feathery leaves that are usually grey-green in color. The plant produces yellow flowers in late winter to early spring, which are clustered in dense, cylindrical inflorescences. It is adapted to a variety of soil types but prefers well-drained soils and is drought-tolerant. Acacia melaleucoides is also valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia melaleucoides is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the Pilbara and Gascoyne regions, where it thrives in sandy soils. This plant is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It often grows in open woodlands and shrublands, contributing to the local flora diversity. Its distribution is closely linked to the availability of well-drained soils and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acacia melaleucoides was mainly introduced to control soil erosion and for its ornamental value in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its rapid growth and adaptability. This plant thrives in low-nutrient soils and can tolerate drought conditions, making it suitable for rehabilitation projects. However, its invasive potential has raised concerns in some areas where it outcompetes native vegetation. Despite its benefits, careful management is recommended to prevent ecological imbalances."
}
