{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia purpurea",
    "plant_slug": "acacia-purpurea",
    "plant_name_scientific": "acacia purpurea",
    "intro": "Acacia purpurea, commonly known as the purple wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves and clusters of yellow flowers that bloom in spring. The plant produces elongated, flat pods that contain seeds covered in a fluffy, white coating. It thrives in well-drained soils and is often found in coastal and sandy habitats. Acacia purpurea is valued for its ornamental appeal and is also used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia purpurea is primarily native to the southwestern United States and northern Mexico. It is commonly found in regions such as Arizona, New Mexico, and Texas. This plant thrives in arid and semi-arid environments, often growing in rocky soils and desert landscapes. It is well adapted to hot, dry climates and can tolerate poor soil conditions. Acacia purpurea is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acacia purpurea was mainly introduced to areas with Mediterranean climates, characterized by mild, wet winters and hot, dry summers. It thrives in well-drained soils and full sun, making it suitable for regions with similar environmental conditions. This plant is often found in coastal scrub and chaparral habitats, where it contributes to the local biodiversity. Its introduction has sometimes led to ecological concerns due to its potential invasiveness in non-native environments. Proper management is essential to ensure it does not outcompete native flora in new regions."
}
