{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leucoclada subsp. leucoclada",
    "plant_slug": "acacia-leucoclada-subsp-leucoclada",
    "plant_name_scientific": "acacia leucoclada subsp. leucoclada",
    "intro": "Acacia leucoclada subsp. leucoclada, commonly known as the white wattle, is a shrub or small tree native to parts of Australia. It is characterized by its slender, often multi-branched stems and small, clustered phyllodes that are typically pale green to whitish in color. The plant produces yellow flowers in globular or cylindrical inflorescences, which are often visited by nectar-feeding birds and insects. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The species is valued for its ornamental appeal and is sometimes used in horticulture for its hardy nature and aesthetic features.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leucoclada"
    },
    "taxonomy_art_desc": "Acacia leucoclada subsp. leucoclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often retaining primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which comprises plants with legume-like flowers and includes many nitrogen-fixing species. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often a symbiotic relationship with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in traditional medicine and land restoration. Its species is Acacia leucoclada, a specific variety within the Acacia genus known for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leucoclada subsp. leucoclada is primarily native to New South Wales. It is commonly found in the coastal regions and sandplain areas of the state. This subspecies thrives in well-drained soils and is often associated with dry, open habitats. It plays an important ecological role in supporting local wildlife and maintaining biodiversity. Its distribution is largely restricted to the southern and western parts of New South Wales.",
    "distribution_introduced_art_desc": "Acacia leucoclada subsp. leucoclada was mainly introduced to South Africa, where it has been widely planted for its hardy nature and ornamental value. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This species is also used in agroforestry and for soil stabilization due to its deep root system. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems. Despite its benefits, careful management is needed to prevent unintended ecological impacts."
}
