{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pugioniformis",
    "plant_slug": "acacia-pugioniformis",
    "plant_name_scientific": "acacia pugioniformis",
    "intro": "Acacia pugioniformis, commonly known as the narrowleaf wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, needle-like phyllodes that are typically 5–15 cm long and have a distinctive linear shape. The plant produces small yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It is well adapted to drought conditions, with deep roots that allow it to thrive in sandy or rocky soils. Acacia pugioniformis is also valued for its ornamental appeal and is often used in landscaping in semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pugioniformis is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species thrives in open woodlands and shrublands, often growing in association with other drought-tolerant plants. It is well adapted to the harsh environmental conditions of its native range. The plant plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia pugioniformis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, often along the eastern and southern coasts. The plant is known for its distinctive needle-like leaves and yellow flowers, which make it a popular ornamental species. Due to its rapid growth and ability to thrive in disturbed environments, it has spread beyond its original introduction sites. However, it is considered a potential invasive species in some areas, raising concerns about its ecological impact."
}
