{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pendula",
    "plant_slug": "acacia-pendula",
    "plant_name_scientific": "acacia pendula",
    "intro": "Acacia pendula, commonly known as the weeping acacia, is a small evergreen shrub native to South Africa. It is characterized by its drooping, feathery foliage that gives it a distinctive, cascading appearance. The plant produces yellow flowers in spring, which are arranged in spherical heads and attract pollinators such as bees and birds. Its leaves are bipinnate, meaning they are divided into multiple pairs of small leaflets. Acacia pendula thrives in well-drained soils and is often used in ornamental landscaping due to its unique form and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pendula"
    },
    "taxonomy_art_desc": "Acacia pendula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a specific structure and include legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their unique, often thorn-like structures and nitrogen-fixing capabilities. Its species is Acacia pendula, a specific type of acacia known for its pendulous branches and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pendula is primarily native to New South Wales, Queensland, South Australia, and Victoria. This species is commonly found in dry, open habitats such as grasslands, woodlands, and rocky outcrops. It thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. The plant is well adapted to arid and semi-arid environments, often growing on sandy or gravelly soils. Its distribution reflects its ability to survive in nutrient-poor soils and withstand periodic drought conditions.",
    "distribution_introduced_art_desc": "Acacia pendula was mainly introduced to specific regions for its ornamental value and potential for soil stabilization. It is commonly found in areas with sandy or gravelly soils, particularly in coastal and inland dunes. The plant thrives in full sun and has a moderate drought tolerance, making it suitable for arid and semi-arid environments. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. It is often used in landscaping and restoration projects in regions where it is not native."
}
