{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amblygona",
    "plant_slug": "acacia-amblygona",
    "plant_name_scientific": "acacia amblygona",
    "intro": "Acacia amblygona, commonly known as the narrow-leaf wattle, is a flowering plant native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, bipinnate leaves and yellow flowers. The plant is often found in sandy soils and is adapted to arid and semi-arid environments. It plays a role in soil stabilization and provides nectar for pollinators. Its seeds are encased in hard pods and are dispersed by wind or animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia amblygona"
    },
    "taxonomy_art_desc": "Acacia amblygona belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by a wide variety of floral structures. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities, such as peas and beans. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic acicular (needle-like) phyllodes and often used in traditional medicine and as a source of timber. Its species is Acacia amblygona, a specific type of acacia found in certain regions, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amblygona is primarily native to New South Wales, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions across these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. Acacia amblygona is well adapted to the harsh climatic conditions of its native range. Its distribution reflects its ability to survive in dry and nutrient-poor environments.",
    "distribution_introduced_art_desc": "Acacia amblygona was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas of Australia, particularly in the northern and western parts of the country. This plant is often used for erosion control due to its ability to stabilize sandy soils. It also serves as a valuable source of fodder for livestock in pastoral regions. However, its introduction has sometimes led to competition with native flora in certain ecosystems."
}
