{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia inceae",
    "plant_slug": "acacia-inceae",
    "plant_name_scientific": "acacia inceae",
    "intro": "Acacia inceae, commonly known as the Ince's acacia, is a species of flowering plant in the legume family, Fabaceae. It is characterized by its compound leaves and yellow to golden-orange flowers that bloom in clusters. Native to specific regions of Australia, this plant thrives in dry, sandy soils and is often found in arid or semi-arid environments. The plant has small, pod-like fruits that contain several seeds, which are dispersed by wind. Acacia inceae is valued for its ecological role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia inceae is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savanna and shrubland ecosystems. This species is well adapted to dry climates and can withstand periods of drought. It plays an important role in local ecosystems by providing habitat and food for various animals. Acacia inceae is also sometimes used in traditional medicine by indigenous communities.",
    "distribution_introduced_art_desc": "Acacia inceae was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in disturbed areas such as roadsides, quarries, and agricultural fields. The plant has adapted well to arid and semi-arid conditions, making it a resilient species in these environments. Its rapid growth and ability to fix nitrogen contribute to its success in colonizing new areas. However, its spread can sometimes lead to the displacement of native vegetation if not managed properly."
}
