{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura var. intermedia",
    "plant_slug": "acacia-aneura-var-intermedia",
    "plant_name_scientific": "acacia aneura var. intermedia",
    "intro": "Acacia aneura var. intermedia, commonly known as the river red gum, is a variant of the slender acacia species native to Australia. It is characterized by its slender, often multi-branched trunk and long, narrow leaves that are typically shed during dry periods. The plant produces small, yellow flowers in globular clusters, which are followed by flat, pod-like fruits containing seeds. It thrives in a range of soil types but prefers well-drained soils and is commonly found near water sources. This species plays an important ecological role in providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aneura var. intermedia is primarily native to the arid and semi-arid regions of Australia, particularly in the central and western parts of the country. This variant is commonly found in areas such as the Simpson Desert, the Great Sandy Desert, and the surrounding regions of South Australia and Western Australia. It thrives in sandy soils and is often associated with shrublands and mulga woodlands. The plant is well adapted to drought and high temperatures, making it a resilient component of the local flora. Its distribution is largely confined to the inland areas where it plays a significant role in the ecosystem.",
    "distribution_introduced_art_desc": "Acacia aneura var. intermedia was mainly introduced to areas with sandy soils and arid or semi-arid climates, particularly in parts of Australia. It is often found in regions with low rainfall and high temperatures, where it thrives in well-drained soils. This variety is commonly used for erosion control and as a windbreak due to its hardy nature. It has also been introduced to other parts of the world for similar environmental purposes. Its introduction has sometimes led to ecological impacts in non-native regions."
}
