{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia deltoidea subsp. ampla",
    "plant_slug": "acacia-deltoidea-subsp-ampla",
    "plant_name_scientific": "acacia deltoidea subsp. ampla",
    "intro": "Acacia deltoidea subsp. ampla, commonly known as the broad-leaf acacia, is a shrub or small tree native to southern Africa. It is characterized by its bipinnate leaves, which are divided into small, feather-like segments. The plant produces yellow globular flowers that bloom in summer, attracting various pollinators. Its woody pods contain seeds that are dispersed by wind. This species is often used in traditional medicine and for soil stabilization in arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia deltoidea"
    },
    "taxonomy_art_desc": "Acacia deltoidea subsp. ampla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and complex vascular structures. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, often exhibiting primitive features. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic acorn-like seed pods and often thorny structures. Its species is Acacia deltoidea, a specific type of acacia that includes the subspecies ampla, which is native to certain regions of Africa and is known for its distinctive leaf and flower morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia deltoidea subsp. ampla is primarily native to Western Australia. This subspecies is commonly found in the southern and southwestern regions of the state. It thrives in a variety of habitats, including sandy soils and coastal areas. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in local ecosystems by providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acacia deltoidea subsp. ampla was mainly introduced to South Africa, particularly in the Eastern Cape and Western Cape provinces. It was brought there for its ornamental value and ability to thrive in arid and semi-arid conditions. The plant is commonly used in landscaping due to its drought tolerance and attractive foliage. It has also been introduced to other parts of southern Africa, including Namibia and Botswana. However, its spread has raised concerns due to its potential to become invasive in certain ecosystems."
}
