{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macbridei",
    "plant_slug": "acacia-macbridei",
    "plant_name_scientific": "acacia macbridei",
    "intro": "Acacia macbridei, commonly known as the MacBride's wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and phyllodes that are typically linear to narrowly elliptic in shape. The plant produces small, yellow flowers in spikes, which are typical of the Acacia genus. It is adapted to arid and semi-arid environments, showing drought tolerance and ability to thrive in poor soils. The species is also noted for its role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macbridei is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species is often associated with mulga woodlands and open shrublands. It thrives in areas with low rainfall and high temperatures. Acacia macbridei plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia macbridei was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for erosion control due to its ability to establish quickly and stabilize soils. Its introduction has also been noted in some parts of Southeast Asia, where it is cultivated for ornamental purposes. However, its spread in non-native environments can sometimes lead to ecological concerns."
}
