{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scleroclada",
    "plant_slug": "acacia-scleroclada",
    "plant_name_scientific": "acacia scleroclada",
    "intro": "Acacia scleroclada, commonly known as the hard-shelled acacia, is a shrub or small tree native to arid regions of Africa and the Arabian Peninsula. It is characterized by its dense, thorny branches and small, oval-shaped leaves that are often reduced to spines. The plant produces yellow flowers in globular inflorescences, which are followed by flat, pod-like fruits containing seeds. Acacia scleroclada is well adapted to drought conditions, with deep roots and a slow growth rate. It plays an important role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia scleroclada"
    },
    "taxonomy_art_desc": "Acacia scleroclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia scleroclada, a specific type of acacia known for its adaptations to arid environments and its role in local ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scleroclada is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This plant thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is well adapted to the dry climate and can survive with minimal water. Acacia scleroclada is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acacia scleroclada was mainly introduced to control soil erosion and for its hardy nature in arid environments. It is commonly found in regions with low rainfall and poor soil conditions. This plant is often used in reclamation projects due to its ability to thrive in harsh climates. Its introduction has helped stabilize degraded lands and prevent further soil degradation. However, it requires careful management to avoid becoming invasive in non-native habitats."
}
