{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia phasmoides",
    "plant_slug": "acacia-phasmoides",
    "plant_name_scientific": "acacia phasmoides",
    "intro": "Acacia phasmoides, commonly known as the dwarf acacia, is a small shrub native to arid and semi-arid regions of southern Africa. It features dense, wiry branches and small, fern-like leaves that help reduce water loss in its harsh environment. The plant produces yellow flowers in clusters, which are followed by elongated, bean-like pods containing seeds. Acacia phasmoides is well adapted to drought conditions and can thrive in poor soils. It plays a role in local ecosystems by providing food and shelter for various insects and small animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia phasmoides"
    },
    "taxonomy_art_desc": "Acacia phasmoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants with a characteristic flower structure and includes legumes. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia phasmoides, a specific type of acacia found in certain regions, known for its unique morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia phasmoides is primarily native to New South Wales and Victoria. This species is commonly found in the temperate regions of southeastern Australia. It thrives in a variety of soil types but prefers well-drained soils. The plant is often seen in open woodlands and along coastal areas. Its distribution is largely limited to these two states within Australia.",
    "distribution_introduced_art_desc": "Acacia phasmoides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is often used for erosion control due to its ability to stabilize soils with its extensive root system. However, it can also become invasive in some areas, outcompeting native vegetation. Its introduction has led to both ecological and economic impacts, depending on the local environment."
}
