{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rostriformis",
    "plant_slug": "acacia-rostriformis",
    "plant_name_scientific": "acacia rostriformis",
    "intro": "Acacia rostriformis, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted stems and bipinnate leaves composed of numerous small, needle-like leaflets. The plant produces yellow globular flower heads that appear in late winter to early spring, attracting a variety of pollinators. It thrives in well-drained soils and is often found in coastal and dry inland regions. Acacia rostriformis is also valued for its hardy nature and ability to stabilize sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rostriformis"
    },
    "taxonomy_art_desc": "Acacia rostriformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as a source of timber. Its species is Acacia rostriformis, a specific type of acacia known for its unique rostriform (beak-like) seed pods and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rostriformis is primarily native to Victoria. It is found in the southeastern region of Australia, specifically within the state of Victoria. This species thrives in a variety of habitats, including dry sclerophyll forests and open woodlands. It is commonly associated with sandy or rocky soils in the coastal and inland areas of Victoria. Acacia rostriformis plays an important ecological role in its native environment, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia rostriformis was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It was also introduced for soil stabilization and erosion control in certain regions. Despite its benefits, it has shown invasive tendencies in some areas, outcompeting native vegetation. Its rapid growth and ability to thrive in various soil types have contributed to its spread. Management efforts are ongoing to control its impact on local ecosystems."
}
