{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella delicata",
    "plant_slug": "acaciella-delicata",
    "plant_name_scientific": "acaciella delicata",
    "intro": "Acaciella delicata, commonly known as the delicate acacia, is a small shrub native to the arid regions of South America. It is characterized by its slender, branched stems and small, feathery leaves that help reduce water loss in its harsh environment. The plant produces yellow flowers in clusters, which are often visited by pollinators such as bees and birds. Its seeds are enclosed in pods and dispersed by wind, contributing to its adaptation to dry, open habitats. Acaciella delicata is valued for its ornamental appeal and its role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella delicata is primarily native to the Caribbean region, including parts of Cuba, Hispaniola, and Jamaica. It is commonly found in coastal areas and dry forests, where it thrives in well-drained soils. This plant is often associated with limestone substrates and is adapted to the warm, tropical climate of its native habitat. Due to habitat loss and environmental changes, its distribution has become more restricted in recent years. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acaciella delicata was mainly introduced to the Pacific Islands for its ornamental value and ability to thrive in coastal environments. It is commonly found in areas with sandy soils and high salinity, making it suitable for landscaping in coastal regions. The plant's introduction has led to its establishment in several non-native habitats, sometimes outcompeting native vegetation. Due to its rapid growth and adaptability, it has become a concern in some areas where it invades natural ecosystems. Conservation efforts are ongoing to manage its spread and protect local biodiversity."
}
