{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subangulata",
    "plant_slug": "acacia-subangulata",
    "plant_name_scientific": "acacia subangulata",
    "intro": "Acacia subangulata, commonly known as the narrow-angled acacia, is a shrub or small tree native to Australia. It is characterized by its slender, angular branches and compound leaves composed of several narrow, linear leaflets. The plant produces yellow globular flowers that bloom in summer, attracting various pollinators. Its seed pods are elongated and woody, containing several seeds that are dispersed by wind. Acacia subangulata is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subangulata is primarily native to northern Australia, including parts of Queensland, the Northern Territory, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant is well adapted to dry environments and can thrive in areas with low rainfall. It is often seen in open woodlands and shrublands. Its distribution is largely restricted to the northern parts of the Australian continent.",
    "distribution_introduced_art_desc": "Acacia subangulata was mainly introduced to South Africa, where it has been widely planted for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides, particularly in the Western Cape and Eastern Cape provinces. The plant is also used in reforestation projects due to its hardy nature and rapid growth. However, it has become invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns about its ecological impact in local ecosystems."
}
