{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia robecchii",
    "plant_slug": "acacia-robecchii",
    "plant_name_scientific": "acacia robecchii",
    "intro": "Acacia robecchii, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and clusters of yellow flowers that bloom in spring. The plant is part of the legume family, Fabaceae, and has the ability to fix nitrogen in the soil through symbiotic bacteria in its root nodules. Acacia robecchii is well adapted to arid and semi-arid environments, making it a resilient component of native Australian flora. It is also noted for its ecological importance, providing food and habitat for various native wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia robecchii is primarily native to the island of Madagascar. It is found in the eastern part of the country, particularly in the humid forests and along riverbanks. This species thrives in tropical climates with high rainfall and well-drained soils. It is commonly observed in the northeastern regions, such as the Anosy and Sambirano areas. Acacia robecchii plays an important ecological role in its native habitat, contributing to biodiversity and soil stability.",
    "distribution_introduced_art_desc": "Acacia robecchii was mainly introduced to regions with a tropical or subtropical climate, particularly in areas with well-drained soils and sufficient sunlight. It is commonly found in parts of Southeast Asia, including countries like Thailand, Vietnam, and Malaysia. This plant is often used for its hardy nature and ability to thrive in disturbed or degraded soils. Its introduction has been largely for ornamental purposes and soil stabilization. However, it has also been reported as an invasive species in some regions where it outcompetes native vegetation."
}
