{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eggelingii",
    "plant_slug": "acacia-eggelingii",
    "plant_name_scientific": "acacia eggelingii",
    "intro": "Acacia eggelingii, commonly known as the Eeling's acacia, is a shrub native to southern Africa. It is characterized by its compound leaves, which are typically bipinnate and covered in fine hairs. The plant produces yellow flowers arranged in cylindrical spikes, which bloom during the dry season. Its woody pods contain flat, edible seeds that are used in traditional cuisine. Acacia eggelingii is adapted to arid environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eggelingii is primarily native to southern Africa, specifically South Africa. It is found in the eastern and northern regions of the country, including the provinces of KwaZulu-Natal, Mpumalanga, and Limpopo. This species thrives in savanna and woodland habitats, often growing in well-drained soils. It is commonly found in areas with a subtropical climate, characterized by warm, dry summers and mild, wet winters. Acacia eggelingii is an important component of the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia eggelingii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, including Namibia, Botswana, and South Africa. This plant is often used for its hardy nature and ability to withstand drought conditions. Its introduction has been largely for ecological restoration and as a source of timber and fodder. However, it is important to monitor its spread to prevent potential invasiveness in new environments."
}
