{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia magdalenae",
    "plant_slug": "acacia-magdalenae",
    "plant_name_scientific": "acacia magdalenae",
    "intro": "Acacia magdalenae, commonly known as the Magdalenae acacia, is a shrub or small tree native to the Canary Islands. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, elliptical leaflets. The plant produces yellow to golden-green globular flower heads, which are clustered in dense, branched inflorescences. Acacia magdalenae thrives in rocky, well-drained soils and is adapted to the arid and semi-arid climates of its native habitat. It plays a role in local ecosystems by providing nectar for pollinators and shelter for small animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia magdalenae is primarily native to the island of Socotra, which is located in the Arabian Sea off the coast of Yemen. This unique plant is found in the arid and semi-arid regions of Socotra, where it thrives in rocky and limestone soils. It is adapted to the harsh environmental conditions of the island, including high temperatures and limited rainfall. The species is endemic to Socotra, meaning it is not found anywhere else in the world. Due to its restricted habitat, Acacia magdalenae is considered a rare and vulnerable plant species.",
    "distribution_introduced_art_desc": "Acacia magdalenae was mainly introduced to the Mediterranean region as an ornamental plant due to its unique appearance and drought tolerance. It has since been reported in several countries, including Spain, Italy, and parts of southern France. Although it is not considered invasive in its introduced range, it has the potential to spread in disturbed soils and along roadsides. Its introduction has raised concerns about its impact on native vegetation in certain areas. Proper management is recommended to prevent its spread in sensitive ecosystems."
}
