{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia microcarpa var. linearis",
    "plant_slug": "acacia-microcarpa-var-linearis",
    "plant_name_scientific": "acacia microcarpa var. linearis",
    "intro": "Acacia microcarpa var. linearis, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, linear leaves that are often arranged in a spiral pattern along the stems. The plant produces yellow flowers in spring, which are grouped into cylindrical spikes. It thrives in well-drained soils and is adapted to arid and semi-arid environments. This variety is often used in landscaping for its ornamental value and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia microcarpa var. linearis is primarily native to South Australia. This variant of the species is found in the arid and semi-arid regions of the state. It typically grows in sandy soils and is commonly seen in coastal and inland areas. The plant is well adapted to the dry climate and can thrive with minimal water. It plays an important role in the local ecosystem and is often used in landscaping due to its hardy nature.",
    "distribution_introduced_art_desc": "Acacia microcarpa var. linearis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since become naturalized in several regions, particularly in the North Island, where it thrives in coastal and disturbed habitats. The plant's rapid growth and ability to colonize open areas have led to concerns about its potential impact on native ecosystems. Despite its invasive tendencies, it is still cultivated for its aesthetic value in gardens and landscaping. Its distribution continues to expand, raising questions about its ecological role in the region."
}
