{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortuosa var. glabrior",
    "plant_slug": "acacia-tortuosa-var-glabrior",
    "plant_name_scientific": "acacia tortuosa var. glabrior",
    "intro": "Acacia tortuosa var. glabrior, commonly known as the smooth acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, branching structure and phyllodes that are typically smooth and glabrous, distinguishing it from other acacia species. The plant produces yellow flowers in globular clusters, which bloom during the rainy season. Its root system is well adapted to drought, allowing it to thrive in sandy or rocky soils. The wood is hard and durable, making it valuable for local use in construction and crafts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortuosa var. glabrior is primarily native to the arid and semi-arid regions of northern Africa, particularly in countries such as Algeria, Tunisia, and Libya. This variety is commonly found in sandy soils and rocky habitats, often growing in association with other drought-tolerant plants. It is well adapted to high temperatures and low rainfall, making it a characteristic species of the Mediterranean and Saharan climates. The plant is known for its ability to thrive in harsh environments, contributing to the ecological stability of its native range. Its distribution is closely linked to the availability of well-drained soils and minimal vegetation competition.",
    "distribution_introduced_art_desc": "Acacia tortuosa var. glabrior was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Sudan, Ethiopia, and Kenya. This plant is often used for its hardy nature and ability to provide shade and forage for livestock. Its introduction has sometimes led to ecological impacts, including competition with native species. Despite this, it remains an important plant in certain agricultural and environmental contexts."
}
