{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia erioclada",
    "plant_slug": "acacia-erioclada",
    "plant_name_scientific": "acacia erioclada",
    "intro": "Acacia erioclada, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stem and small, bipinnate leaves that are typically reduced to leaflets. The plant produces yellow or pale yellow flowers arranged in compact, globular heads, which are a notable feature. It thrives in arid and semi-arid environments, often found in rocky soils and coastal areas. The plant is also valued for its hardy nature and ability to fix nitrogen, making it useful in soil rehabilitation.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia erioclada"
    },
    "taxonomy_art_desc": "Acacia erioclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and often complex flower structures. Its order is Fabales, which includes plants with characteristic flowers and legumes, many of which have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, recognized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their thorny stems and often small, pod-like fruits. Its species is Acacia erioclada, a specific type of acacia native to parts of Africa, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia erioclada is primarily native to Western Australia. It is commonly found in the sandy soils of the southwestern region of the state. This plant thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the dry climate and can withstand periods of drought. Its distribution is largely confined to the coastal and inland areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia erioclada was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its hardy nature and potential use in reforestation and as a source of timber. However, its rapid growth and ability to outcompete native vegetation have led to significant ecological concerns. The plant thrives in a variety of soil types and can tolerate both drought and fire, contributing to its spread. Due to these characteristics, it is now considered a problematic weed in many parts of the country."
}
