{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia suaveolens subsp. grampianensis",
    "plant_slug": "acacia-suaveolens-subsp-grampianensis",
    "plant_name_scientific": "acacia suaveolens subsp. grampianensis",
    "intro": "Acacia suaveolens subsp. grampianensis, commonly known as the Grampian acacia, is a shrub native to the Scottish Highlands. It features small, yellow, globular flowers that bloom in spring, attracting pollinators such as bees and butterflies. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. It thrives in well-drained, acidic soils and is often found in heathland and moorland habitats. Its botanical characteristics make it an important species for ecological studies in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia suaveolens subsp. grampianensis is primarily native to the Scottish Highlands and parts of northern England. This subspecies is commonly found in heathland and grassland habitats. It thrives in well-drained soils and is often associated with open, sunny environments. The plant is particularly common in the Grampian Mountains and surrounding areas. Its distribution is limited to these specific regions in the British Isles.",
    "distribution_introduced_art_desc": "Acacia suaveolens subsp. grampianensis was mainly introduced to the Scottish Highlands and parts of northern England. It is commonly found in dry, open habitats such as heathlands and grassy slopes. This subspecies is known for its distinctive yellow flowers and its ability to thrive in nutrient-poor soils. It has been recorded in several conservation areas due to its ecological significance. However, its distribution remains relatively localized and not widely spread across the British Isles."
}
