{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia saligna",
    "plant_slug": "acacia-saligna",
    "plant_name_scientific": "acacia saligna",
    "intro": "Acacia saligna, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and feathery, bipinnate leaves. The plant produces yellow globular flower heads that bloom in spring, attracting various pollinators. Its bark is smooth and greyish, often shedding in strips, and it is adapted to arid and semi-arid environments. Acacia saligna is also valued for its role in soil stabilization and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia saligna"
    },
    "taxonomy_art_desc": "Acacia saligna belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, often featuring jointed stems and spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse flower structures and ecological roles. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pods as fruits and often forming symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive flattened or spiny leaves and often used in traditional medicine. Its species is Acacia saligna, a specific type of acacia known for its fast growth and adaptability to various environments, commonly found in coastal areas and used for timber and fuel.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [
        "Albania",
        "Algeria",
        "Angola",
        "Argentina Northeast",
        "Baleares",
        "California",
        "Canary Is.",
        "Cape Provinces",
        "Corse",
        "Cyprus",
        "DR Congo",
        "East Aegean Is.",
        "Eritrea",
        "Ethiopia",
        "Florida",
        "France",
        "Greece",
        "India",
        "Iraq",
        "Italy",
        "Kenya",
        "Kriti",
        "Lebanon-Syria",
        "Libya",
        "Madeira",
        "Morocco",
        "Mozambique",
        "Namibia",
        "Nevada",
        "New South Wales",
        "Palestine",
        "Portugal",
        "Queensland",
        "Sardegna",
        "Saudi Arabia",
        "Sicilia",
        "Somalia",
        "South Australia",
        "Spain",
        "Tanzania",
        "Tunisia",
        "Türkey",
        "Victoria",
        "Yemen",
        "Zambia"
    ],
    "distribution_native_art_desc": "Acacia saligna is primarily native to Western Australia. It is commonly found in the coastal and inland regions of the state, particularly in sandy soils. This plant thrives in a variety of habitats, including woodlands, heathlands, and coastal dunes. It is well adapted to the dry and arid conditions of the region. Acacia saligna plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia saligna was mainly introduced to regions across the Mediterranean, parts of Africa, and several areas in South and North America. It has been established in countries such as Albania, Algeria, Angola, and Argentina, particularly in the northeastern region. The plant is also found in the Canary Islands, California, and various parts of Europe, including France, Italy, and Spain. It has been introduced to Australia in states like New South Wales, Queensland, and South Australia. Additionally, it is present in parts of the Middle East, such as Saudi Arabia and Yemen, and in regions like Kenya and Tanzania."
}
