{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia coa",
    "plant_slug": "acacia-coa",
    "plant_name_scientific": "acacia coa",
    "intro": "Acacia coa, commonly known as the coastal acacia, is a shrub or small tree native to coastal regions of southern Africa. It is characterized by its slender, branching structure and phyllodes that are typically linear and slightly curved. The plant produces yellow flowers in dense, globular clusters, which are followed by flat, pod-like fruits. Acacia coa thrives in sandy or rocky soils and is adapted to coastal conditions with high salt exposure. It plays an important role in stabilizing dunes and providing habitat for various coastal wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia coa is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry, sandy soils and is often associated with open woodlands and heathlands. This species thrives in regions with a subtropical to temperate climate, characterized by warm, dry summers and mild, wet winters. Acacia coa is well adapted to fire-prone environments and can regenerate quickly after bushfires. Its distribution is largely limited to the coastal and inland areas of eastern Australia.",
    "distribution_introduced_art_desc": "Acacia coa was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in Queensland and the Northern Territory. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced to other parts of the world, including parts of Southeast Asia and the Pacific Islands. Its introduction has sometimes led to ecological concerns due to its aggressive growth and potential to outcompete native species."
}
