{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia implexa",
    "plant_slug": "acacia-implexa",
    "plant_name_scientific": "acacia implexa",
    "intro": "Acacia implexa, commonly known as the weeping acacia, is a small evergreen shrub native to South Africa. It is characterized by its delicate, feathery foliage and its unique, pendulous yellow flowers that bloom in spring. The plant has small, leathery leaves that are often clustered at the ends of branches, giving it a distinctive appearance. Acacia implexa thrives in well-drained soils and full sun, making it a popular choice for coastal gardens. Its ornamental value is enhanced by its ability to attract birds and insects, contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia implexa"
    },
    "taxonomy_art_desc": "Acacia implexa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex vascular system and true roots. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often found in tropical and subtropical regions. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their thorned stems and compound leaves. Its species is Acacia implexa, a specific type of acacia found in certain regions of Australia, known for its unique growth habit and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [
        "Cape Provinces"
    ],
    "distribution_native_art_desc": "Acacia implexa is primarily native to New South Wales, Queensland, and Victoria. This species is commonly found in a variety of habitats within these regions, including dry sclerophyll forests and rocky outcrops. It is well adapted to the dry and warm climates typical of these areas. The plant is often seen growing in sandy or loamy soils. Its distribution reflects its ability to thrive in the diverse environmental conditions of southeastern Australia.",
    "distribution_introduced_art_desc": "Acacia implexa was mainly introduced to the Cape Provinces. It is a shrub or small tree native to South Africa. This plant has been introduced to various regions beyond its native range. It is often found in coastal areas and on sandy soils. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
