{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dampieri",
    "plant_slug": "acacia-dampieri",
    "plant_name_scientific": "acacia dampieri",
    "intro": "Acacia dampieri, commonly known as the West Australian acacia, is a small, evergreen shrub native to Western Australia. It is characterized by its compound leaves, which are often covered in fine hairs, and its yellow floral spikes that bloom in spring. The plant is well adapted to arid and semi-arid environments, with deep root systems that allow it to thrive in poor soils. It plays an important role in local ecosystems by providing habitat and food for various insects and small animals. Due to its hardy nature, it is also cultivated as an ornamental plant in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dampieri is primarily native to the northern regions of Western Australia. It is commonly found in the Pilbara and Kimberley regions, where it thrives in arid and semi-arid environments. This species is often associated with sandy soils and is well adapted to the harsh climatic conditions of its native habitat. It plays an important ecological role in stabilizing soils and providing shelter for local wildlife. Acacia dampieri is also known for its distinctive yellow flowers, which bloom during the wet season.",
    "distribution_introduced_art_desc": "Acacia dampieri was mainly introduced to areas with sandy or gravelly soils, particularly in arid and semi-arid regions. It thrives in environments with low rainfall and high temperatures. This plant is commonly found in coastal and inland dune systems. It has been introduced to several regions outside its native range for soil stabilization and ornamental purposes. Its distribution is often associated with disturbed or degraded landscapes."
}
