{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ixodes",
    "plant_slug": "acacia-ixodes",
    "plant_name_scientific": "acacia ixodes",
    "intro": "Acacia ixodes, commonly known as the broad-leaf acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its dense, thorned branches and compound leaves that are often bipinnate, giving it a feathery appearance. The plant produces yellow or pale yellow flowers in clusters, which are followed by flat, pod-like seed pods containing small, hard seeds. Acacia ixodes is adapted to survive in drought conditions, with deep roots and a capacity to fix nitrogen through symbiotic relationships with rhizobia. It plays an important role in local ecosystems and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ixodes"
    },
    "taxonomy_art_desc": "Acacia ixodes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as stomata and vascular tissues. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Fabales, which comprises plants with distinctive flowers that have five petals and include legumes, which are important for nitrogen fixation. Its family is Fabaceae, commonly known as the legume or pea family, recognized for their pod fruits and nitrogen-fixing capabilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their acicular leaves and often for their ability to thrive in arid environments. Its species is Acacia ixodes, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ixodes is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, sandy soils across these regions. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the climate conditions of the Australian interior. Acacia ixodes plays an important ecological role in supporting local wildlife and soil stability.",
    "distribution_introduced_art_desc": "Acacia ixodes was mainly introduced to areas with a warm, temperate climate and well-drained soils, particularly in regions where it can thrive in full sun. It is commonly found in disturbed habitats such as roadsides, waste areas, and agricultural lands. This plant has been introduced to several countries in the Mediterranean and parts of Europe due to its ornamental value and ability to withstand harsh conditions. Its rapid growth and adaptability have led to its establishment in native ecosystems, sometimes becoming invasive. However, it is also valued for its nitrogen-fixing properties and use in soil stabilization projects."
}
