{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucoptera",
    "plant_slug": "acacia-glaucoptera",
    "plant_name_scientific": "acacia glaucoptera",
    "intro": "Acacia glaucoptera, commonly known as the silver wattle, is a small to medium-sized evergreen shrub or tree native to southern Australia. It is characterized by its feathery, bipinnate leaves that are covered in a fine, silvery-white powder, giving it a distinctive appearance. The plant produces yellow globular flower heads that bloom in spring, attracting a variety of pollinators. Acacia glaucoptera is well adapted to dry, sandy soils and is drought-tolerant, making it suitable for arid and semi-arid environments. It is also valued for its ornamental appeal and is often used in landscaping and reforestation projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia glaucoptera"
    },
    "taxonomy_art_desc": "Acacia glaucoptera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive acorn-like seed pods and often sharp thorns. Its species is Acacia glaucoptera, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucoptera is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in sandy soils and is often seen in coastal and inland areas. It is well adapted to the arid and semi-arid climates of its native range. The plant is an important component of the local flora and plays a role in the ecosystem of Western Australia.",
    "distribution_introduced_art_desc": "Acacia glaucoptera was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, often thriving in disturbed soils. The plant is known for its rapid growth and ability to form dense thickets, which can outcompete native vegetation. Due to its invasive nature, it is considered a weed in some parts of its introduced range. Its distribution is largely limited by climatic conditions and human activity."
}
