{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia plectocarpa",
    "plant_slug": "acacia-plectocarpa",
    "plant_name_scientific": "acacia plectocarpa",
    "intro": "Acacia plectocarpa, commonly known as the silver wattle, is a deciduous shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that turn a striking silver-white color during the dry season. The plant produces yellow globular flower heads, which are clustered in dense, spherical inflorescences. Acacia plectocarpa is adapted to arid and semi-arid environments, with a deep root system that allows it to survive in drought conditions. It plays an important ecological role by providing nectar for native pollinators and habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia plectocarpa"
    },
    "taxonomy_art_desc": "Acacia plectocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose and citrus families. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in tropical and subtropical regions, known for their phyllodes and often used in traditional medicine. Its species is Acacia plectocarpa, a specific type of acacia native to Australia, recognized for its unique branching pattern and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia plectocarpa is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen in shrublands and along roadsides. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important role in local ecosystems and is a characteristic feature of the landscape in these regions.",
    "distribution_introduced_art_desc": "Acacia plectocarpa was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Queensland. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced to other parts of the world, including parts of Asia and the Pacific Islands. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
