{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia potosina",
    "plant_slug": "acacia-potosina",
    "plant_name_scientific": "acacia potosina",
    "intro": "Acacia potosina, commonly known as the Potosi acacia, is a shrub native to Mexico. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant has slender, branching stems and small, bipinnate leaves that are often covered in fine hairs. Its flowers are yellow and clustered in dense inflorescences, attracting pollinators such as bees and butterflies. Acacia potosina is adapted to arid environments and is often found in rocky soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia potosina is primarily native to northern Mexico, particularly in the states of Chihuahua, Coahuila, and Nuevo León. It is also found in parts of the southwestern United States, including Texas. This species thrives in arid and semi-arid environments, often growing in rocky soils and along canyons. It is commonly associated with desert ecosystems and is well adapted to drought conditions. Acacia potosina plays an important role in local biodiversity and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia potosina was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in arid and semi-arid regions, particularly in Texas, New Mexico, and Arizona. This plant thrives in well-drained soils and is often seen in rocky or desert landscapes. It is valued for its drought tolerance and ability to stabilize soil in degraded areas. Due to its hardy nature, it has become an important species in ecological restoration projects."
}
