{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subangularis",
    "plant_slug": "acacia-subangularis",
    "plant_name_scientific": "acacia subangularis",
    "intro": "Acacia subangularis, commonly known as the narrow-angled acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, angular branches and small, bipinnate leaves. The plant produces yellow, globular flower heads that bloom in spring, attracting various pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia subangularis is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subangularis is primarily native to northern Australia, particularly in the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions, often growing in sandy soils. This plant is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It is often seen in spinifex plains and other open habitats. Its distribution is also influenced by the availability of water and soil type.",
    "distribution_introduced_art_desc": "Acacia subangularis was mainly introduced to areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal regions and along roadsides. This plant is often used for erosion control due to its deep root system and ability to withstand drought. It has also been introduced as an ornamental plant because of its attractive foliage and ability to provide shade. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
