{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia convallium",
    "plant_slug": "acacia-convallium",
    "plant_name_scientific": "acacia convallium",
    "intro": "Acacia convallium, commonly known as the white wattle, is a shrub native to southern Africa. It is characterized by its slender, erect stems and bipinnate leaves composed of small, oval-shaped leaflets. The plant produces yellow flowers in cylindrical spikes, which are typically borne at the ends of the branches. It thrives in well-drained soils and is often found in coastal and sandy habitats. Acacia convallium is valued for its ornamental appeal and its ability to provide habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia convallium"
    },
    "taxonomy_art_desc": "Acacia convallium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have small, clustered flowers and are often legumes, known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their acorn-like seed pods and often used in landscaping and traditional medicine. Its species is Acacia convallium, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia convallium is primarily native to the Northern Territory. It is commonly found in arid and semi-arid regions within this area. The plant thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is closely linked to the environmental conditions of the Northern Territory.",
    "distribution_introduced_art_desc": "Acacia convallium was mainly introduced to control soil erosion and stabilize degraded lands in arid and semi-arid regions. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has been particularly beneficial in areas where traditional vegetation has been lost due to overgrazing or deforestation. However, it requires careful management to prevent it from becoming invasive in certain ecosystems."
}
