{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella var. glaberrima",
    "plant_slug": "acacia-pulchella-var-glaberrima",
    "plant_name_scientific": "acacia pulchella var. glaberrima",
    "intro": "Acacia pulchella var. glaberrima, commonly known as the smooth acacia, is a shrub native to the arid and semi-arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, clustered leaves that are typically gray-green in color. The plant produces yellow flowers in globular heads, which are often visited by bees and other pollinators. It is drought-tolerant and thrives in well-drained soils, making it suitable for xeriscaping. The wood is hard and used locally for various purposes, including construction and fuel.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pulchella"
    },
    "taxonomy_art_desc": "Acacia pulchella var. glaberrima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including the legume family. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic phyllodes and often used in various ecological and economic contexts. Its species is Acacia pulchella, a specific type within the Acacia genus, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella var. glaberrima is primarily native to Western Australia. This variant of the species is found in the arid and semi-arid regions of the state. It typically grows in sandy soils and is commonly seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of the region. Its distribution is largely confined to the southern and western parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia pulchella var. glaberrima was mainly introduced to areas with a Mediterranean climate, characterized by mild, wet winters and warm, dry summers. It thrives in well-drained soils and is often found in coastal regions and rocky outcrops. This variety is known for its ornamental value, particularly its fragrant yellow flowers. It has been cultivated in gardens and parks for its aesthetic appeal and ability to tolerate coastal conditions. However, it is considered an invasive species in some regions where it outcompetes native vegetation."
}
