{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia steedmanii",
    "plant_slug": "acacia-steedmanii",
    "plant_name_scientific": "acacia steedmanii",
    "intro": "Acacia steedmanii, commonly known as the coastal acacia, is a shrub or small tree native to the coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in clusters, which are followed by flat, woody pods containing seeds. It thrives in sandy or coastal soils and is adapted to saline and wind-prone environments. Acacia steedmanii plays a role in stabilizing coastal dunes and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia steedmanii"
    },
    "taxonomy_art_desc": "Acacia steedmanii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acicular leaves and often used in traditional medicine and as sources of timber. Its species is Acacia steedmanii, a specific type of acacia found in certain regions of Australia, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia steedmanii is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area known as the Geraldton - Wongan Hills region. This species typically grows in sandy soils and is often associated with coastal and inland sandplain habitats. It is a small to medium-sized shrub that thrives in well-drained environments. Acacia steedmanii is an important component of the local flora and is adapted to the semi-arid conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia steedmanii was mainly introduced to New Zealand. It was brought there during the 19th century as part of the European colonization efforts. This plant is now considered an invasive species in several regions of New Zealand. It spreads rapidly and can outcompete native vegetation, leading to ecological concerns. Its distribution has expanded beyond its original introduction sites due to its adaptability and reproductive capabilities."
}
