{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia daviesii",
    "plant_slug": "acacia-daviesii",
    "plant_name_scientific": "acacia daviesii",
    "intro": "Acacia daviesii, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, lacy appearance. The plant produces yellow flowers in spherical clusters, which bloom in late winter to early spring. Acacia daviesii is well adapted to arid and semi-arid environments, thriving in well-drained soils. It is also notable for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia daviesii"
    },
    "taxonomy_art_desc": "Acacia daviesii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Fabales, which consists of flowering plants with distinctive legume fruits and often symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acacia-like foliage and often used in traditional medicine. Its species is Acacia daviesii, a specific type of acacia found in certain regions, known for its unique morphological features and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia daviesii is primarily native to Victoria. It is found in the coastal regions of southeastern Australia, particularly in the state of Victoria. This plant thrives in sandy soils and is commonly found in heathlands and coastal dunes. It is well adapted to the temperate climate and seasonal rainfall patterns of the region. Acacia daviesii plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia daviesii was mainly introduced to areas with sandy or well-drained soils, often in arid or semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it suitable for regions like parts of Australia and the southwestern United States. This plant is commonly found in disturbed soils, such as along roadsides or in degraded landscapes. Its ability to fix nitrogen makes it valuable for soil rehabilitation and land stabilization. However, it can become invasive in some areas if not managed properly."
}
