{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia magnifica",
    "plant_slug": "acacia-magnifica",
    "plant_name_scientific": "acacia magnifica",
    "intro": "Acacia magnifica, commonly known as the flame acacia, is a striking tree native to southern Africa. It is characterized by its long, feathery leaves and clusters of bright yellow flowers that bloom throughout the warmer months. The plant is adapted to arid environments, with deep roots that help it survive in dry conditions. Its wood is hard and durable, making it valuable for construction and furniture. Additionally, the tree plays an important role in supporting local wildlife, providing food and shelter for various species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia magnifica is primarily native to eastern Australia, including regions of New South Wales and Queensland. It thrives in a variety of habitats, such as dry forests, woodlands, and coastal areas. This species is commonly found in sandy soils and is well adapted to arid and semi-arid climates. It plays an important ecological role by providing shelter and food for native wildlife. The plant is also known for its distinctive yellow flowers and is often used in landscaping due to its ornamental value.",
    "distribution_introduced_art_desc": "Acacia magnifica was mainly introduced to regions with warm, arid climates where it can thrive in well-drained soils. It is commonly found in parts of Australia, where it has been cultivated for its ornamental value and ecological benefits. The plant is often used in landscaping due to its striking appearance and ability to withstand drought conditions. However, in some areas, it has become invasive, outcompeting native vegetation. Its introduction has raised concerns about its impact on local ecosystems and biodiversity."
}
