{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia penninervis var. glauca",
    "plant_slug": "acacia-penninervis-var-glauca",
    "plant_name_scientific": "acacia penninervis var. glauca",
    "intro": "Acacia penninervis var. glauca, commonly known as the glaucous wattle, is a flowering plant native to Australia. It is characterized by its slender, often spindly growth habit and its distinctive, feathery foliage. The leaves are compound, consisting of multiple narrow, linear leaflets that give the plant a delicate appearance. It produces small, yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. This variety is noted for its pale blue-green foliage, which gives it its common name and makes it visually striking in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia penninervis var. glauca is primarily native to northern Australia, including parts of Queensland and the Northern Territory. This variant is commonly found in arid and semi-arid regions, often growing in sandy or rocky soils. It is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. The plant is often seen in open woodlands and along riverbanks in its natural habitat. Its distribution is largely confined to the tropical and subtropical zones of northern Australia.",
    "distribution_introduced_art_desc": "Acacia penninervis var. glauca was mainly introduced to areas with a warm, temperate climate and well-drained soils, particularly in regions of the Mediterranean and parts of southern Europe. It thrives in full sun and is often planted for its ornamental value due to its attractive foliage and yellow flowers. This variety is commonly found in urban landscapes and along roadsides where it provides erosion control and aesthetic appeal. However, its introduction has raised concerns about potential invasiveness in certain ecosystems. Despite its benefits, careful management is recommended to prevent it from becoming a weed in non-native environments."
}
