{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia caven var. dehiscens",
    "plant_slug": "acacia-caven-var-dehiscens",
    "plant_name_scientific": "acacia caven var. dehiscens",
    "intro": "Acacia caven var. dehiscens, commonly known as the spreading acacia, is a shrub or small tree native to South America. It features slender, often drooping branches and produces yellow flowers in dense, globular clusters. The plant has small, bipinnate leaves that are typically covered in fine hairs. Its seed pods are woody and split open when mature, dispersing the seeds. It is adapted to arid and semi-arid environments, making it a resilient species in dry landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia caven var. dehiscens is primarily native to northern South America, specifically found in countries such as Venezuela, Colombia, and parts of the Amazon Basin. This variant of Acacia caven thrives in tropical and subtropical regions with well-drained soils. It is commonly found in dry to semi-arid habitats, including savannas and forest edges. The plant is well adapted to the warm, humid climates of its native range. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia caven var. dehiscens was mainly introduced to South America, particularly in regions with tropical and subtropical climates. It has been widely adopted in countries such as Brazil, Argentina, and Paraguay due to its adaptability and rapid growth. This plant is often used for soil stabilization and as a source of timber and fuelwood. However, its introduction has raised concerns about potential invasiveness in native ecosystems. Its distribution is largely linked to human activities such as reforestation and land clearing."
}
