{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella rensonii",
    "plant_slug": "acaciella-rensonii",
    "plant_name_scientific": "acaciella rensonii",
    "intro": "Acaciella rensonii, commonly known as the Renson's acacia, is a flowering plant native to the arid regions of southern Africa. It is a small, shrub-like species that typically grows in rocky or sandy soils. The plant produces small, yellowish-green flowers that are clustered in dense inflorescences. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acaciella rensonii is adapted to withstand drought and high temperatures, making it a resilient plant in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella rensonii is primarily native to the Caribbean region, specifically the islands of Hispaniola and Cuba. It is found in the dry forest and scrubland habitats of these islands. This plant is adapted to the tropical climate and is often associated with rocky or limestone soils. Acaciella rensonii is a small shrub that plays a role in the local ecosystem by providing habitat and food for various insects and birds. Its limited distribution makes it a species of interest for conservation efforts.",
    "distribution_introduced_art_desc": "Acaciella rensonii was mainly introduced to areas with dry, rocky soils and low rainfall, typically found in arid and semi-arid regions. It thrives in environments where other plants struggle to survive due to its ability to tolerate extreme temperatures and poor soil conditions. The plant is often found in scrublands and along rocky outcrops, where it forms dense clusters. Its introduction has been noted in parts of Australia and South America, where it has adapted to local climates with minimal water requirements. However, its spread has raised concerns about its potential impact on native ecosystems."
}
