{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia robiniae",
    "plant_slug": "acacia-robiniae",
    "plant_name_scientific": "acacia robiniae",
    "intro": "Acacia robiniae, commonly known as the black acacia or robinia acacia, is a deciduous leguminous tree native to the southeastern United States. It is characterized by its compound leaves, which are trifoliate and have a feathery appearance. The plant produces small, yellow, pod-like fruits that contain seeds covered in a sticky, resinous substance. It has a deep root system that helps prevent soil erosion and is often used in reforestation efforts. Acacia robiniae is also valued for its hard, heavy wood and its ability to thrive in poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia robiniae"
    },
    "taxonomy_art_desc": "Acacia robiniae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of plants with flowers that have a distinctive structure, often including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acorn-like seed pods and often used in landscaping. Its species is Acacia robiniae, a specific type of acacia native to the United States, recognized for its ornamental value and ecological importance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia robiniae is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in a variety of habitats, including sandy soils and open woodlands. It is often associated with coastal and inland areas where it forms part of the local vegetation. Acacia robiniae plays an important ecological role in supporting native wildlife and maintaining biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acacia robiniae was mainly introduced to the United States as an ornamental plant and for its potential in soil stabilization and as a source of timber. It has since spread beyond its original introduction sites, becoming invasive in several regions. The plant thrives in a variety of soil types and is highly adaptable to different climates. Its rapid growth and prolific seed production contribute to its invasive nature. Due to its ecological impact, it is now considered a noxious weed in many areas."
}
