{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trispinosa",
    "plant_slug": "acacia-trispinosa",
    "plant_name_scientific": "acacia trispinosa",
    "intro": "Acacia trispinosa, commonly known as the three-spined acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, thorny stems and bipinnate leaves composed of small, oval leaflets. The plant produces yellow flowers in globular clusters, which are followed by flat, pod-like fruits containing edible seeds. It thrives in arid and semi-arid environments, often growing on rocky soils. Acacia trispinosa is valued for its role in stabilizing soil and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trispinosa is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the states of Western Australia, South Australia, and parts of Queensland. This species thrives in sandy soils and is often seen in shrublands and open woodlands. It is well adapted to withstand drought and high temperatures. Its distribution is also occasionally reported in some parts of New Guinea.",
    "distribution_introduced_art_desc": "Acacia trispinosa was mainly introduced to control soil erosion and as a source of timber and fuelwood in arid and semi-arid regions. It is commonly found in degraded lands and along roadsides where it forms dense thickets. The plant has spread widely due to its ability to thrive in poor soils and its rapid growth rate. It is considered an invasive species in some areas, outcompeting native vegetation. Its introduction has had both ecological and economic impacts depending on the region."
}
