{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia calderonii",
    "plant_slug": "acacia-calderonii",
    "plant_name_scientific": "acacia calderonii",
    "intro": "Acacia calderonii, commonly known as the Calderon's wattle, is a shrub native to the arid regions of western Australia. It is characterized by its slender, zigzagging stems and small, feathery leaves that are often covered in fine hairs. The plant produces yellow, fluffy flower heads that bloom in spring, attracting various pollinators. It is well adapted to dry conditions, with a deep root system that helps it survive in nutrient-poor soils. Acacia calderonii is often used in ecological restoration projects due to its hardiness and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia calderonii is primarily native to the arid and semi-arid regions of northern Mexico, particularly in the states of Chihuahua, Coahuila, and Durango. It thrives in rocky soils and is commonly found in desert scrub and grassland habitats. This species is adapted to extreme temperatures and low precipitation, making it a resilient plant in its native environment. It plays an important ecological role by providing shelter and food for local wildlife. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acacia calderonii was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it suitable for xeriscaping and erosion control. The plant is often used in landscaping due to its drought tolerance and attractive, feathery foliage. It has been introduced to several regions outside its native range, including parts of the southwestern United States and northern Mexico. However, its spread can sometimes lead to ecological concerns if it becomes invasive in non-native habitats."
}
