{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia consobrina",
    "plant_slug": "acacia-consobrina",
    "plant_name_scientific": "acacia consobrina",
    "intro": "Acacia consobrina, commonly known as the silky oaks, is a flowering plant native to Australia. It is a member of the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is known for its distinctive bipinnate leaves and yellow to golden flowers that bloom in spring. Acacia consobrina thrives in a variety of soil types but prefers well-drained soils. It is often used in landscaping due to its ornamental value and ability to provide shade.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia consobrina"
    },
    "taxonomy_art_desc": "Acacia consobrina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses vascular plants that include ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive acicular leaves and often used in traditional medicine. Its species is Acacia consobrina, a specific type of acacia found in certain regions, recognized for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia consobrina is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils and Mediterranean climates. This plant thrives in open habitats such as coastal dunes, woodlands, and rocky outcrops. It is well adapted to the dry and often harsh conditions of its native environment. Acacia consobrina plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acacia consobrina was mainly introduced to Australia as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since become naturalized in various parts of the country, particularly in the eastern and southern regions. The plant is often found in disturbed soils and along roadsides, where it can form dense thickets. Its rapid growth and seed dispersal have led to concerns about its potential invasiveness in certain ecosystems. Despite its ornamental value, management strategies are being developed to control its spread in sensitive areas."
}
