{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drummondii subsp. candolleana",
    "plant_slug": "acacia-drummondii-subsp-candolleana",
    "plant_name_scientific": "acacia drummondii subsp. candolleana",
    "intro": "Acacia drummondii subsp. candolleana, commonly known as the Drummond's wattle, is a shrub native to the arid regions of Australia. It features narrow, phyllodes that are typically linear to lanceolate in shape, often with a slight twist. The plant produces small, yellow globular flowers arranged in compact clusters, which bloom during the warmer months. It is well adapted to dry environments, with deep root systems that help it survive in nutrient-poor soils. The species is valued for its ornamental appeal and is often used in landscaping in suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia drummondii"
    },
    "taxonomy_art_desc": "Acacia drummondii subsp. candolleana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex structures like vascular tissues. Its class is Equisetopsida, which comprises a group of plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants with a distinctive fruit type called a legume and includes plants like peas and beans. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive flat, feathery leaves and often producing pods with seeds. Its species is Acacia drummondii, a specific type within the Acacia genus, which is further divided into subspecies, with subsp. candolleana being one of its recognized subspecies.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drummondii subsp. candolleana is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the Geraldton and Shark Bay areas. This subspecies thrives in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. The plant is an important component of the local flora and plays a role in the ecological balance of its habitat.",
    "distribution_introduced_art_desc": "Acacia drummondii subsp. candolleana was mainly introduced to South Australia as part of early botanical exploration and agricultural initiatives. It was brought to the region during the 19th century by botanists and settlers seeking drought-resistant plants for landscaping and land stabilization. The subspecies is known for its hardy nature and ability to thrive in arid and semi-arid environments, making it suitable for rehabilitation projects. It has since become established in several areas, though its spread is limited compared to other Acacia species. Its introduction has contributed to the ecological diversity of the region's flora."
}
