{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tomentosa",
    "plant_slug": "acacia-tomentosa",
    "plant_name_scientific": "acacia tomentosa",
    "intro": "Acacia tomentosa, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its silvery-white, woolly foliage that gives it its common name. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical inflorescences. Its bark is smooth and often peels in thin, papery layers. Acacia tomentosa is adapted to arid and semi-arid environments, making it a hardy and drought-tolerant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tomentosa is primarily native to eastern Australia, including regions in New South Wales, Queensland, and the Australian Capital Territory. It is commonly found in dry, open habitats such as woodlands, grasslands, and rocky outcrops. This species thrives in areas with low rainfall and well-drained soils. It is often associated with sandy or loamy soils and can tolerate drought conditions. Acacia tomentosa is an important component of the local flora and provides habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia tomentosa was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and rapid growth rate. It has been introduced to several countries in Africa and parts of Asia for ecological restoration purposes. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation."
}
