{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia westiana",
    "plant_slug": "acacia-westiana",
    "plant_name_scientific": "acacia westiana",
    "intro": "Acacia westiana, commonly known as the silky acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, branching stems and small, feathery leaves that are covered in fine hairs, giving it a silvery appearance. The plant produces yellow, globular flower heads that bloom in spring, attracting various pollinators such as bees and birds. Its seeds are encased in hard pods and are dispersed by wind, contributing to its adaptation to dry environments. Acacia westiana is often used in horticulture for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia westiana is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in savannahs, grasslands, and rocky outcrops where it thrives in well-drained soils. This species is well adapted to the hot and dry climate of its native habitat. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia westiana is also known for its distinctive yellow flowers and thorny branches, which are characteristic features of many acacia species.",
    "distribution_introduced_art_desc": "Acacia westiana was mainly introduced to areas with a Mediterranean climate, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal regions and inland areas with similar conditions. This plant is often used in landscaping due to its hardiness and ornamental value. However, it can become invasive in some regions if not managed properly. Its distribution has expanded beyond its native range due to human introduction and climate suitability."
}
