{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia roigii",
    "plant_slug": "acacia-roigii",
    "plant_name_scientific": "acacia roigii",
    "intro": "Acacia roigii, commonly known as the Guatemalan wattle, is a deciduous shrub native to Central America. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellow flowers arranged in cylindrical clusters, which attract pollinators such as bees and butterflies. Its leaves are typically bipinnate, with numerous small leaflets that help reduce water loss in arid conditions. Acacia roigii is adapted to tropical and subtropical climates, often growing in dry, rocky soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia roigii is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is commonly found in coastal areas and dry forests, particularly in countries such as Cuba, Hispaniola, and Puerto Rico. This plant thrives in tropical and subtropical climates with well-drained soils. It is often associated with dry, open habitats and is sometimes found in disturbed areas. Acacia roigii plays a role in local ecosystems and has been the subject of botanical studies due to its unique distribution and ecological significance.",
    "distribution_introduced_art_desc": "Acacia roigii was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and ability to thrive in dry conditions. It has since spread beyond its original introduction range, becoming naturalized in several areas across southern Europe. The plant is known for its rapid growth and adaptability, which contribute to its invasive potential in new environments. It often outcompetes native vegetation, leading to ecological concerns in regions where it has established itself. Efforts are being made to monitor and control its spread to mitigate its impact on local ecosystems."
}
