{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparia var. angustifoliola",
    "plant_slug": "acacia-riparia-var-angustifoliola",
    "plant_name_scientific": "acacia riparia var. angustifoliola",
    "intro": "Acacia riparia var. angustifoliola, commonly known as the narrow-leaf river acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It features slender, often spiny stems and narrow, linear leaves that reduce water loss, adapting to its harsh environment. The plant produces yellow globular flowers, which are typically clustered in dense inflorescences. It is well-suited for xeriscaping due to its drought tolerance and ability to thrive in poor soils. The species is also valued for its use in traditional medicine and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparia var. angustifoliola is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This variant of Acacia riparia is commonly found in sandy soils along riverbanks and in savanna ecosystems. It thrives in environments with low rainfall and is well adapted to withstand drought conditions. The plant is often seen in shrublands and along ephemeral watercourses in these regions. Its distribution is closely linked to the availability of water and the specific ecological conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia riparia var. angustifoliola was mainly introduced to areas with sandy or gravelly soils along riverbanks and dry streambeds. It thrives in arid and semi-arid regions, often forming dense thickets that stabilize soil and prevent erosion. This plant is commonly found in regions of Australia, particularly in the northern and western parts of the country. It is also introduced in some parts of Africa and the Middle East for its ability to tolerate harsh environmental conditions. Its rapid growth and hardiness make it a valuable species for ecological restoration projects."
}
