{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia parvipinnula",
    "plant_slug": "acacia-parvipinnula",
    "plant_name_scientific": "acacia parvipinnula",
    "intro": "Acacia parvipinnula, commonly known as the small-leaved acacia, is a small shrub native to Australia. It is characterized by its slender, wiry stems and small, narrow leaves arranged in clusters. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It is adapted to arid environments and is often found in sandy soils. Acacia parvipinnula is also known for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia parvipinnula"
    },
    "taxonomy_art_desc": "Acacia parvipinnula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and are often associated with nitrogen-fixing symbiosis. Its family is Fabaceae, commonly known as the legume family, characterized by pods and a wide variety of ecological and economic importance. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in various applications such as timber and medicine. Its species is Acacia parvipinnula, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia parvipinnula is primarily native to New South Wales. It is commonly found in the coastal regions and sandy soils of the state. This species thrives in dry, well-drained environments. It is often seen in open woodlands and heathlands. Its distribution is largely confined to the southern and western parts of New South Wales.",
    "distribution_introduced_art_desc": "Acacia parvipinnula was mainly introduced to New Zealand. It was introduced as an ornamental plant due to its attractive small leaves and yellow flowers. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in a variety of soil types and is highly resilient to environmental stress. Its rapid growth and ability to form dense thickets have led to concerns about its impact on local ecosystems."
}
