{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cockerellae",
    "plant_slug": "acacia-cockerellae",
    "plant_name_scientific": "acacia cockerellae",
    "intro": "Acacia cockerellae, commonly known as the Cockerell's wattle, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, wiry stems and small, yellow flowers that bloom in late winter to early spring. The plant produces small, flat pods that contain several seeds, which are dispersed by wind. Acacia cockerellae is adapted to survive in dry, sandy soils and can tolerate drought conditions. Its foliage is often used by local fauna, making it an important component of its ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cockerellae is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in areas with sandy soils and low rainfall. This species is adapted to survive in harsh, dry environments. It is often seen growing in shrublands and along the edges of mulga woodlands. Its distribution is limited to specific ecological zones within the southern and western parts of the state.",
    "distribution_introduced_art_desc": "Acacia cockerellae was mainly introduced to New Zealand as part of ornamental horticulture and soil stabilization efforts. It has since become naturalized in several regions, particularly in the North Island. The plant thrives in a variety of soil types but prefers well-drained conditions. It is commonly found in disturbed areas such as roadsides and riverbanks. Due to its rapid growth and ability to spread vegetatively, it has raised concerns regarding its potential to become invasive."
}
