{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia horrida subsp. benadirensis",
    "plant_slug": "acacia-horrida-subsp-benadirensis",
    "plant_name_scientific": "acacia horrida subsp. benadirensis",
    "intro": "Acacia horrida subsp. benadirensis, commonly known as the Benadire acacia, is a shrub or small tree native to southern Africa. It is characterized by its woody, thorny stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers in globular or cylindrical spikes, which are followed by flat, leathery pods containing seeds. It thrives in arid and semi-arid environments, often growing on rocky soils. This subspecies is valued for its hardiness and is sometimes used in traditional medicine and as a source of firewood.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia horrida subsp. benadirensis is primarily native to the arid and semi-arid regions of southern Africa, particularly in Namibia and southwestern Angola. This subspecies is commonly found in sandy soils and rocky outcrops, often in association with shrublands and grasslands. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native habitat. The plant is known for its distinctive spiny foliage and yellow flowers, which attract various pollinators. Due to its resilience, it plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia horrida subsp. benadirensis was mainly introduced to South Africa, particularly in the eastern and western regions. It has been documented in areas such as the Eastern Cape and Western Cape provinces. The plant is commonly found in rocky outcrops and sandy soils, often growing in dry and semi-arid environments. It is valued for its hardy nature and ability to thrive in poor soil conditions. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
