{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia melanoxylon var. obtusifolia",
    "plant_slug": "acacia-melanoxylon-var-obtusifolia",
    "plant_name_scientific": "acacia melanoxylon var. obtusifolia",
    "intro": "Acacia melanoxylon var. obtusifolia, commonly known as the narrow-leaved black wattle, is a shrub or small tree native to southern Australia. It is characterized by its dark, fissured bark and narrow, leathery leaves with a glossy upper surface. The plant produces yellow, spherical flower heads that appear in late winter to early spring. It is adapted to dry, well-drained soils and is often found in coastal and inland regions. The species is valued for its hard, dense wood and has been used in traditional and contemporary woodworking.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia melanoxylon var. obtusifolia is primarily native to southeastern Australia, including parts of New South Wales, Victoria, and Tasmania. This variant is commonly found in dry to semi-arid regions, particularly in woodland and shrubland habitats. It thrives in sandy or rocky soils and is often associated with eucalyptus forests. The plant is well adapted to the climate of these regions, showing resilience to drought and poor soil conditions. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acacia melanoxylon var. obtusifolia was mainly introduced to New Zealand. It was brought there for its ornamental value and potential for erosion control. The plant thrives in a variety of soil types and is drought-tolerant, making it adaptable to different environments. However, it has since become naturalized and is now considered a potential weed in some areas. Its introduction has raised concerns about its impact on native ecosystems."
}
