{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia foliosa",
    "plant_slug": "acacia-foliosa",
    "plant_name_scientific": "acacia foliosa",
    "intro": "Acacia foliosa, commonly known as the feathery wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, zigzagging stems and feathery, bipinnate leaves that give it a distinctive appearance. The plant produces yellow flowers in spring, which are clustered in cylindrical spikes. Acacia foliosa is adapted to survive in dry conditions, with deep roots and a low water requirement. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia foliosa is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the southern parts of the country, including Western Australia, South Australia, and parts of New South Wales. This plant thrives in sandy or rocky soils and is often seen in coastal and inland shrublands. It plays an important ecological role by providing habitat and food for various native animals. Its distribution is closely linked to the availability of water and suitable soil conditions in these dry environments.",
    "distribution_introduced_art_desc": "Acacia foliosa was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It thrives in open landscapes such as grasslands and disturbed soils, making it a common invader in agricultural and urban environments. The plant spreads primarily through seed dispersal by wind and animals, allowing it to colonize new areas rapidly. Its ability to tolerate poor soil conditions and withstand drought contributes to its success as an introduced species. However, it can outcompete native vegetation, leading to ecological concerns in certain regions."
}
