{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella var. denudata",
    "plant_slug": "acacia-pulchella-var-denudata",
    "plant_name_scientific": "acacia pulchella var. denudata",
    "intro": "Acacia pulchella var. denudata, commonly known as the smooth wattle, is a shrub native to eastern Australia. It is characterized by its slender, often glabrous stems and bipinnate leaves that are usually reduced to small, scale-like structures. The plant produces yellow flowers in globular or cylindrical inflorescences, which are typical of the Acacia genus. It thrives in sandy or loamy soils and is often found in coastal and inland regions. The smooth wattle is valued for its ornamental appeal and its ability to fix nitrogen, making it beneficial for soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella var. denudata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This variety is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. It thrives in environments with high temperatures and limited water availability. The plant is well adapted to the harsh conditions of its native habitat, displaying features such as small, leathery leaves and a robust root system. It plays an important role in the local ecosystem by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia pulchella var. denudata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, thriving in coastal and semi-arid environments. This plant is often used for ornamental purposes due to its attractive foliage and ability to withstand harsh conditions. However, it has also been reported to spread aggressively in some areas, potentially impacting native vegetation. Its introduction has raised concerns among conservationists regarding its ecological impact."
}
