{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elatior",
    "plant_slug": "acacia-elatior",
    "plant_name_scientific": "acacia elatior",
    "intro": "Acacia elatior, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are covered in fine, silvery hairs, giving it a distinctive appearance. The plant produces yellow globular flowers that bloom in spring, attracting various pollinators. Acacia elatior is often found in dry, sandy soils and is adapted to arid and semi-arid environments. It is also known for its ability to fix nitrogen, making it an important species in soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elatior is primarily native to eastern and southern Africa, including countries such as Tanzania, Kenya, Uganda, and South Africa. It thrives in a variety of habitats, including savannas, woodlands, and rocky outcrops. This species is commonly found in regions with a tropical or subtropical climate. It is well adapted to dry and semi-arid environments. Acacia elatior plays an important ecological role in its native range, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia elatior was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is known for its rapid growth and ability to withstand drought conditions, making it a common invasive species in some parts of the country. Its introduction has led to competition with native vegetation, raising concerns about its ecological impact. Despite its invasive tendencies, it is also valued for its ornamental qualities and use in traditional medicine."
}
