{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trinervata var. brevifolia",
    "plant_slug": "acacia-trinervata-var-brevifolia",
    "plant_name_scientific": "acacia trinervata var. brevifolia",
    "intro": "Acacia trinervata var. brevifolia, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its bipinnate leaves, which are finely divided and give the plant a feathery appearance. The plant produces yellow flowers in globular or cylindrical heads, typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and inland regions. Due to its ornamental value and ability to fix nitrogen, it is sometimes used in revegetation projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trinervata var. brevifolia is primarily native to the arid and semi-arid regions of northern Australia, including parts of Queensland, Western Australia, and the Northern Territory. It thrives in sandy soils and is commonly found in shrublands and open woodlands. This variety is well adapted to the harsh climate of these regions, tolerating drought and high temperatures. It plays an important ecological role by providing habitat and food for native wildlife. Its distribution is also influenced by its ability to fix nitrogen, which helps improve soil fertility in nutrient-poor environments.",
    "distribution_introduced_art_desc": "Acacia trinervata var. brevifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and KwaZulu-Natal provinces. This plant thrives in coastal and sandy soils, often growing along the edges of forests and in open woodlands. Its introduction has led to concerns about its potential invasiveness in some local ecosystems. Despite its ornamental value, it requires careful management to prevent ecological disruption."
}
