{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crombiei",
    "plant_slug": "acacia-crombiei",
    "plant_name_scientific": "acacia crombiei",
    "intro": "Acacia crombiei, commonly known as the Kimberley wattle, is a shrub or small tree native to the Kimberley region of Western Australia. It is characterized by its slender, often multi-branched form and phyllodes that are typically narrow and linear. The plant produces yellow flowers in winter, which are clustered in cylindrical inflorescences. It thrives in sandy or rocky soils and is adapted to arid and semi-arid environments. Acacia crombiei plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia crombiei"
    },
    "taxonomy_art_desc": "Acacia crombiei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure known as a papilionaceous corolla. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic phyllodes and often used in traditional medicine and as timber. Its species is Acacia crombiei, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crombiei is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in open habitats such as woodlands and grasslands. It is well adapted to the local climate and soil conditions. Its distribution is largely restricted to specific areas within Queensland.",
    "distribution_introduced_art_desc": "Acacia crombiei was mainly introduced to South Australia as a potential ornamental and for its ability to thrive in arid conditions. It was introduced to the region in the early 20th century by botanists and horticulturists interested in expanding the range of native flora for landscaping purposes. Despite its ornamental value, it has since become invasive in some areas, outcompeting native vegetation in disturbed soils. Its rapid growth and seed dispersal have led to its establishment in various habitats across the state. However, due to its ecological impact, it is now considered a weed in certain regions of South Australia."
}
