{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subrotata",
    "plant_slug": "acacia-subrotata",
    "plant_name_scientific": "acacia subrotata",
    "intro": "Acacia subrotata, commonly known as the narrow-leaf wattle, is a small shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features narrow, linear leaves that are often covered in fine hairs. It produces yellow flowers in winter, which are clustered in cylindrical spikes. Acacia subrotata is adapted to arid and semi-arid environments, making it a resilient species in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subrotata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in rocky outcrops and sandy soils. This species thrives in environments with low rainfall and high sunlight exposure. It is often seen growing along roadsides, in savannas, and on mountain slopes. Acacia subrotata is well adapted to the harsh conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia subrotata was mainly introduced to urban and suburban landscapes in southern Australia for its ornamental value and ability to thrive in dry conditions. It is commonly found in gardens, parks, and along roadsides due to its hardy nature and attractive foliage. However, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and seed dispersal make it a challenging species to control once established. Despite its benefits in landscaping, its ecological impact has led to increased management efforts in affected regions."
}
