{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amythethophylla",
    "plant_slug": "acacia-amythethophylla",
    "plant_name_scientific": "acacia amythethophylla",
    "intro": "Acacia amythethophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to the arid regions of Australia. It is characterized by its slender, often twisted branches and small, bipinnate leaves that are typically narrow and linear. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense inflorescences. It is adapted to drought conditions and can thrive in sandy or rocky soils. Acacia amythethophylla plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amythethophylla is primarily native to the arid and semi-arid regions of central and western Australia. It is commonly found in the states of Queensland, New South Wales, and South Australia. This species thrives in sandy or rocky soils and is often associated with shrublands and open woodlands. It is well adapted to the harsh climatic conditions of its native habitat. The plant plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia amythethophylla was mainly introduced to areas with low rainfall and sandy soils, particularly in the arid and semi-arid regions of Australia. It is commonly found in the Northern Territory, Western Australia, and South Australia. This plant is often used for erosion control due to its ability to thrive in harsh conditions. Its introduction has helped stabilize soils in degraded landscapes. However, it is considered a weed in some regions where it outcompetes native vegetation."
}
