{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia poilanei",
    "plant_slug": "acacia-poilanei",
    "plant_name_scientific": "acacia poilanei",
    "intro": "Acacia poilanei, commonly known as the Madagascar acacia, is a shrub or small tree native to Madagascar. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features bipinnate leaves with small, oval-shaped leaflets. It produces yellow flowers in clusters, which are followed by elongated, woody pods containing seeds. Acacia poilanei is adapted to arid and semi-arid environments, often growing in rocky soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia poilanei is primarily native to the southern regions of Africa, specifically Namibia and South Africa. It is commonly found in arid and semi-arid environments, such as savannas and rocky outcrops. This species thrives in well-drained soils and is adapted to the harsh climatic conditions of its native habitat. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its unique characteristics, it is also sometimes cultivated in botanical gardens and for ornamental purposes.",
    "distribution_introduced_art_desc": "Acacia poilanei was mainly introduced to areas with arid and semi-arid climates, particularly in regions of Africa and the Middle East. It thrives in well-drained soils and is often found in rocky or sandy habitats. This plant is commonly used for its hardy nature and ability to stabilize soil in degraded environments. It has been introduced for purposes such as erosion control and as a source of fodder for livestock. However, its spread can sometimes lead to ecological concerns in non-native regions."
}
