{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia jackesiana",
    "plant_slug": "acacia-jackesiana",
    "plant_name_scientific": "acacia jackesiana",
    "intro": "Acacia jackesiana, commonly known as the Jackes' acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-stemmed form and its distinctive, feathery leaves that are bipinnate, meaning they are divided into two sets of small leaflets. The plant produces yellow flowers in spikes, which bloom in spring and attract various pollinators. Acacia jackesiana is typically found in dry, open habitats such as woodlands and scrublands. It is valued for its ornamental appeal and its ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia jackesiana"
    },
    "taxonomy_art_desc": "Acacia jackesiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, commonly known as the legume family, which is characterized by pods as fruits and often contains nitrogen-fixing bacteria in root nodules. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, flat or triangular seed pods and often for their ability to thrive in arid environments. Its species is Acacia jackesiana, a specific type of acacia found in certain regions of Australia, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia jackesiana is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This species thrives in dry, open habitats such as woodlands and grasslands. It is commonly observed in the northern parts of Queensland. The plant is well adapted to the region's climate and soil conditions.",
    "distribution_introduced_art_desc": "Acacia jackesiana was mainly introduced to areas with well-drained soils and full sun exposure, typically in tropical and subtropical regions. It is commonly found in disturbed sites such as roadsides, abandoned fields, and degraded landscapes. The plant thrives in warm climates with moderate rainfall and is often used for soil stabilization and erosion control. Due to its rapid growth and adaptability, it has become an invasive species in some regions outside its native range. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
