{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegal var. rostrata",
    "plant_slug": "acacia-senegal-var-rostrata",
    "plant_name_scientific": "acacia senegal var. rostrata",
    "intro": "Acacia senegal var. rostrata, commonly known as the gum arabic tree, is a species native to the Sahel region of Africa. It is a deciduous shrub or small tree characterized by its thorny branches and compound leaves. The plant is renowned for producing a high-quality gum, known as acacia gum, which is used in food, pharmaceuticals, and industrial applications. Its flowers are yellow and clustered in spikes, and it thrives in arid and semi-arid environments. The tree plays an important ecological role in preventing soil erosion and supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegal var. rostrata is primarily native to the Sahel region of Africa, including countries such as Mali, Senegal, Nigeria, and Sudan. It thrives in dry, semi-arid environments and is commonly found in savannas and along riverbanks. This variant is well adapted to harsh climates with low rainfall and high temperatures. It plays an important ecological role in preventing soil erosion and providing habitat for various wildlife species. The plant is also valued for its gum production, which has economic significance in local communities.",
    "distribution_introduced_art_desc": "Acacia senegal var. rostrata was mainly introduced to areas with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Sudan, Chad, and Niger. This variety is valued for its gum production, which is used in various industries including pharmaceuticals and food. Its introduction has also contributed to soil stabilization and afforestation efforts in degraded lands. However, its spread can sometimes lead to competition with native vegetation if not managed properly."
}
