{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lambertiana",
    "plant_slug": "acacia-lambertiana",
    "plant_name_scientific": "acacia lambertiana",
    "intro": "Acacia lambertiana, commonly known as the Lambert's wattle, is a shrub native to the arid regions of western Australia. It is characterized by its feathery, bipinnate leaves and produces yellow flowers in spring. The plant is adapted to survive in dry conditions, with deep roots and a waxy cuticle to reduce water loss. It is often found in sandy soils and is an important component of local ecosystems. The plant is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lambertiana is primarily native to the arid regions of southwestern Australia. It is commonly found in the states of Western Australia, including the areas around the Nullarbor Plain and the Great Sandy Desert. This plant thrives in sandy or gravelly soils and is well adapted to the harsh, dry conditions of its native habitat. It is often found in open woodlands and shrublands, where it contributes to the local flora. Due to its resilience, it plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia lambertiana was mainly introduced to stabilize soil and prevent erosion in degraded lands. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. It has been introduced to several regions in Africa and parts of Asia for its ecological and economic benefits. However, its invasive potential in some areas requires careful management to prevent ecological disruption."
}
