{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stricta var. binervis",
    "plant_slug": "acacia-stricta-var-binervis",
    "plant_name_scientific": "acacia stricta var. binervis",
    "intro": "Acacia stricta var. binervis, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It features compound leaves with two pairs of opposite leaflets, giving it a feathery appearance. The plant produces yellow globular flowers that bloom in spring, attracting nectar-feeding birds and insects. It is often found in dry sclerophyll forests and is adapted to nutrient-poor soils. The species is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stricta var. binervis is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This variant is adapted to dry climates and can thrive in coastal and inland areas. It is often seen in spinifex grasslands and is a characteristic species of the inland desert zones. The plant plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia stricta var. binervis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coastal areas and in the fynbos biome. The plant is often cultivated for its ornamental value due to its attractive foliage and ability to thrive in harsh conditions. However, it has also been reported to spread into native vegetation, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact and management in local ecosystems."
}
