{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia zanzibarica var. microphylla",
    "plant_slug": "acacia-zanzibarica-var-microphylla",
    "plant_name_scientific": "acacia zanzibarica var. microphylla",
    "intro": "Acacia zanzibarica var. microphylla, commonly known as the Zanzibar umbrella tree, is a deciduous shrub or small tree native to the coastal regions of East Africa. It is characterized by its distinctive umbrella-shaped crown formed by its dense, spreading branches. The plant produces small, yellow flowers that are clustered in spherical heads, which are followed by elongated, flat seed pods. Its leaves are pinnately compound, consisting of several small, oval leaflets. This species is often cultivated for its ornamental value and is adapted to coastal and sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia zanzibarica var. microphylla is primarily native to the coastal regions of eastern Africa, specifically the island of Zanzibar and nearby areas of the mainland. It thrives in sandy soils and is commonly found in coastal dunes and along the shores. This variety is well adapted to the warm, humid climate and salt spray of its native habitat. It is an important component of the local vegetation and is often used in traditional practices. However, its distribution is limited and it is not widely found outside of its native range.",
    "distribution_introduced_art_desc": "Acacia zanzibarica var. microphylla was mainly introduced to specific regions of East Africa, particularly Tanzania and Kenya, for its ornamental value and potential use in reforestation. It is commonly found in coastal areas and near human settlements due to its adaptability to various soil types and climate conditions. The plant is often cultivated in gardens and as a decorative element in urban landscapes. Its introduction has raised concerns about its potential to become invasive in native ecosystems. Despite its benefits, its distribution remains limited compared to other Acacia species in the region."
}
