{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decipiens var. elongata",
    "plant_slug": "acacia-decipiens-var-elongata",
    "plant_name_scientific": "acacia decipiens var. elongata",
    "intro": "Acacia decipiens var. elongata, commonly known as the long-stemmed wattle, is a shrub or small tree native to Western Australia. It is characterized by its slender, branching stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow globular flowers in spring, which are clustered in dense, cylindrical inflorescences. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The species is valued for its ornamental appeal and its role in local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decipiens var. elongata is primarily native to the arid and semi-arid regions of southern Africa, including Namibia, Botswana, and parts of southwestern Angola. This variant is commonly found in savanna woodlands and rocky outcrops where it thrives in well-drained soils. It is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. The plant plays an important ecological role by providing shelter and food for local wildlife. Its distribution is closely linked to the specific environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia decipiens var. elongata was mainly introduced to South Africa, particularly in the Eastern Cape province. It was introduced as a potential ornamental plant due to its unique foliage and growth habit. However, it has since become an invasive species, outcompeting native vegetation in certain areas. Its spread has been facilitated by its ability to thrive in disturbed soils and its prolific seed production. Conservation efforts are now underway to control its spread and mitigate its impact on local ecosystems."
}
