{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegal var. samoryana",
    "plant_slug": "acacia-senegal-var-samoryana",
    "plant_name_scientific": "acacia senegal var. samoryana",
    "intro": "Acacia senegal var. samoryana, commonly known as the gum arabic tree, is a shrub or small tree native to the Sahel region of Africa. It is characterized by its straight, fissured bark and bipinnate leaves that are often covered in fine hairs. The plant produces yellowish-green flowers that are followed by long, slender pods containing a sticky, resinous gum known as gum arabic. This gum is widely used in food, pharmaceutical, and cosmetic industries due to its emulsifying and stabilizing properties. It thrives in arid and semi-arid environments and is well adapted to poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegal var. samoryana is primarily native to the Sahel region of Africa, including countries such as Senegal, Mali, Burkina Faso, and Niger. It thrives in semi-arid to arid environments, often found in savannas and along riverbanks. This variety is well adapted to the hot and dry climate of the region. It is commonly used for its gum arabic production and has cultural significance in local communities. The plant plays an important ecological role in stabilizing soil and providing habitat for various species.",
    "distribution_introduced_art_desc": "Acacia senegal var. samoryana was mainly introduced to areas in the Sahel region of Africa, particularly in countries like Mali, Burkina Faso, and Niger. It was introduced as a source of gum arabic, which is used in food, pharmaceuticals, and industrial products. The plant thrives in semi-arid environments and is often planted for its ecological and economic benefits. It has also been introduced to parts of the Middle East and southern Asia for similar reasons. Its introduction has helped support local livelihoods and land restoration efforts in these regions."
}
