{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sinaloensis",
    "plant_slug": "acacia-sinaloensis",
    "plant_name_scientific": "acacia sinaloensis",
    "intro": "Acacia sinaloensis, commonly known as the Sinaloa acacia, is a flowering plant native to Mexico. It belongs to the legume family, Fabaceae, and is characterized by its slender, branching stems and small, bipinnate leaves. The plant produces yellow flowers arranged in compact clusters, which are followed by pod-like fruits containing seeds. It is often found in dry, rocky habitats and is adapted to arid environments. Due to its ecological importance and unique morphology, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sinaloensis is primarily native to the tropical and subtropical regions of Mexico, particularly in the states of Sinaloa, Nayarit, and Jalisco. It thrives in dry to semi-arid environments, often found in limestone soils and rocky terrain. This species is commonly associated with coastal areas and can be found in the Mexican Pacific coast. It plays an important ecological role in stabilizing soils and providing habitat for various wildlife species. Acacia sinaloensis is also occasionally cultivated in other parts of the world for its ornamental and medicinal properties.",
    "distribution_introduced_art_desc": "Acacia sinaloensis was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for restoration projects in degraded landscapes. The plant is often used for soil stabilization due to its deep root system and ability to fix nitrogen. It has also been introduced as an ornamental plant in some parts of the world for its unique foliage and hardy nature. However, its introduction has raised concerns about potential invasiveness in non-native environments."
}
