{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia burrowii",
    "plant_slug": "acacia-burrowii",
    "plant_name_scientific": "acacia burrowii",
    "intro": "Acacia burrowii, commonly known as the burrowed acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its compound leaves, which are often reduced to small, scale-like structures, and its yellow, globular flower heads. The plant produces small, woody pods that contain several seeds, and it is well adapted to survive in harsh, dry environments. Acacia burrowii is often found in rocky soils and can thrive in areas with low rainfall. Its ecological importance includes providing habitat and food for various desert animals and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia burrowii"
    },
    "taxonomy_art_desc": "Acacia burrowii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns, horsetails, and their relatives, often possessing jointed stems and spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive flattened or spiny pods and often used in traditional medicine and for timber. Its species is Acacia burrowii, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia burrowii is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, sandy soils across these regions. This plant thrives in arid and semi-arid environments, often growing in open woodlands and grasslands. It is well adapted to the climate conditions of its native range. Acacia burrowii plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia burrowii was mainly introduced to stabilize soils and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh environmental conditions. The plant is also valued for its nitrogen-fixing capabilities, which improve soil fertility. However, its introduction has led to concerns about its potential to become invasive in certain ecosystems. It is now found in several regions across Africa and parts of the Middle East."
}
