{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ammophila",
    "plant_slug": "acacia-ammophila",
    "plant_name_scientific": "acacia ammophila",
    "intro": "Acacia ammophila, commonly known as the coastal acacia, is a shrub native to coastal areas of southern Africa. It is characterized by its slender, branching stems and small, feathery leaves that are adapted to reduce water loss in arid environments. The plant produces yellow flowers in clusters, which are followed by pod-like fruits containing seeds. It plays an important role in stabilizing sandy soils along coastal dunes. Acacia ammophila is also valued for its ability to provide habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ammophila"
    },
    "taxonomy_art_desc": "Acacia ammophila belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide range of growth forms. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in tropical and subtropical regions, known for their acacia-like foliage and sometimes thorny stems. Its species is Acacia ammophila, a specific type of acacia that is adapted to sandy environments and is often found in coastal dunes.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ammophila is primarily native to Queensland. It is commonly found in coastal dune habitats along the eastern coast of Australia. This plant thrives in sandy soils and is well adapted to saline and wind-blown environments. It plays an important role in stabilizing dunes and preventing erosion. Its distribution is largely restricted to the coastal regions of Queensland.",
    "distribution_introduced_art_desc": "Acacia ammophila was mainly introduced to stabilize sand dunes and prevent desertification in coastal and arid regions. It is commonly found in areas with saline or sandy soils, where it helps to reduce wind erosion. The plant thrives in harsh environments due to its deep root system and ability to fix nitrogen. Its introduction has been beneficial for land reclamation projects in several countries. However, it can also become invasive in some ecosystems if not managed properly."
}
