{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hamersleyensis",
    "plant_slug": "acacia-hamersleyensis",
    "plant_name_scientific": "acacia hamersleyensis",
    "intro": "Acacia hamersleyensis, commonly known as the Hamersley wattle, is a shrub or small tree native to Western Australia. It is characterized by its yellow flowers and feathery, bipinnate leaves. The plant is well adapted to arid and semi-arid environments, demonstrating drought tolerance. It plays a role in stabilizing soils and providing habitat for native wildlife. Its ecological significance makes it an important species in the region's flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hamersleyensis"
    },
    "taxonomy_art_desc": "Acacia hamersleyensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in various ecological and commercial contexts. Its species is Acacia hamersleyensis, a specific type of acacia native to Australia, known for its ecological significance in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hamersleyensis is primarily native to Western Australia. It is found in the northern regions of the state, particularly in the Pilbara and the Kimberley areas. This species thrives in arid and semi-arid environments, often growing on rocky outcrops and sandy soils. It is well adapted to the harsh climatic conditions of the region. The plant plays an important role in the local ecosystem and is a characteristic feature of the landscape in its native range.",
    "distribution_introduced_art_desc": "Acacia hamersleyensis was mainly introduced to areas with arid and semi-arid climates, particularly in Western Australia. It thrives in well-drained soils and is commonly found in rocky outcrops and sandy plains. This species is often used for erosion control and as a source of timber due to its hardy nature. Its introduction has helped stabilize degraded lands in the region. However, it is important to manage its spread to prevent potential ecological impacts."
}
