{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dissona",
    "plant_slug": "acacia-dissona",
    "plant_name_scientific": "acacia dissona",
    "intro": "Acacia dissona, commonly known as the narrow-leaf wattle, is a small to medium-sized shrub native to Western Australia. It is characterized by its narrow, feathery leaves and produces yellow flowers in late winter to early spring. The plant belongs to the Fabaceae family, known for its nitrogen-fixing capabilities, which enriches the soil. Acacia dissona is well adapted to arid and semi-arid environments, showing resistance to drought and poor soil conditions. It is also valued for its ornamental appeal and is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dissona"
    },
    "taxonomy_art_desc": "Acacia dissona belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, often featuring specialized structures like strobili. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include many legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorn-like branches and small, fern-like leaves. Its species is Acacia dissona, a specific type of acacia found in certain regions of Australia, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dissona is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This species is often associated with sandy soils and is part of the local flora in areas such as the Nullarbor Plain. It thrives in harsh environmental conditions typical of the region. Its distribution is largely confined to the southern and western parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia dissona was mainly introduced to South Africa, where it has become an invasive species. It was originally from Australia and was likely introduced through human activity, such as accidental transport with other plants or seeds. The plant thrives in disturbed areas and can outcompete native vegetation, leading to ecological concerns. It is commonly found in coastal and inland regions, particularly in sandy soils. Due to its rapid growth and ability to spread, it requires ongoing management to prevent further invasion."
}
