{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia comorensis",
    "plant_slug": "acacia-comorensis",
    "plant_name_scientific": "acacia comorensis",
    "intro": "Acacia comorensis, commonly known as the Comoros acacia, is a small evergreen tree native to the Comoros Islands in the Indian Ocean. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, showcasing drought-resistant features. It plays a role in local ecosystems by providing habitat and food for various species. Its wood is sometimes used for construction and fuel, though it is not as commercially valuable as other acacia species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia comorensis is primarily native to the Comoros Islands, an archipelago in the Indian Ocean. It is found in the tropical regions of these islands, particularly in coastal areas and lowland forests. The plant thrives in warm, humid climates with well-drained soils. It is commonly seen in both natural and cultivated environments across the Comoros. Its distribution is largely limited to this specific island group due to its ecological preferences and geographic isolation.",
    "distribution_introduced_art_desc": "Acacia comorensis was mainly introduced to control soil erosion and provide shade in degraded lands. It is commonly found in tropical and subtropical regions where it thrives in poor soils. The plant is valued for its fast growth and ability to fix nitrogen, making it useful in reforestation projects. However, its invasive potential has raised concerns in some areas where it outcompetes native vegetation. Its introduction has had both ecological and economic impacts depending on the region."
}
