{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia phlebophylla",
    "plant_slug": "acacia-phlebophylla",
    "plant_name_scientific": "acacia phlebophylla",
    "intro": "Acacia phlebophylla, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often grey-green leaves and produces yellow flowers in spring. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The narrow-leaf wattle is often used in revegetation projects due to its hardiness and ecological benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia phlebophylla"
    },
    "taxonomy_art_desc": "Acacia phlebophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their ability to thrive in moist environments. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower clusters and often used in traditional medicine. Its species is Acacia phlebophylla, a specific type of acacia found in certain regions of Australia, known for its unique leaf structure and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia phlebophylla is primarily native to Victoria. It is commonly found in the dry sclerophyll forests and woodlands of this region. This plant thrives in areas with well-drained soils and is often associated with rocky or sandy substrates. It is an important component of the local flora, contributing to the biodiversity of Victoria's ecosystems. Its distribution is largely confined to the southeastern part of the state.",
    "distribution_introduced_art_desc": "Acacia phlebophylla was mainly introduced to New Zealand. It was brought there for its ornamental value and its ability to thrive in various soil conditions. The plant has since spread beyond its original introduction sites, becoming established in several regions. It is often found in coastal and inland areas where it forms dense thickets. However, its invasive potential has raised concerns among land managers and conservationists."
}
