{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lasiocarpa var. sedifolia",
    "plant_slug": "acacia-lasiocarpa-var-sedifolia",
    "plant_name_scientific": "acacia lasiocarpa var. sedifolia",
    "intro": "Acacia lasiocarpa var. sedifolia, commonly known as the woolly acacia, is a shrub native to arid regions of Australia. It is characterized by its dense, grey-green foliage with soft, woolly hairs covering the leaves. The plant produces yellow, spherical flower heads that bloom in summer, attracting pollinators such as bees and birds. Its root system is deep and drought-tolerant, allowing it to thrive in harsh, sandy soils. The species is valued for its ornamental appeal and ability to stabilize soil in degraded landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lasiocarpa"
    },
    "taxonomy_art_desc": "Acacia lasiocarpa var. sedifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including clubmosses and horsetails, and is distinguished by their vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is known for its diverse floral structures. Its order is Fabales, which includes legumes and other plants that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Australia and other parts of the world, known for their unique phyllodes and ability to thrive in arid environments. Its species is Acacia lasiocarpa, a specific type of acacia characterized by its hairy foliage and is further differentiated by its varietal form, sedifolia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lasiocarpa var. sedifolia is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This variety thrives in arid and semi-arid environments, often growing on sandy soils. It is part of the larger Acacia genus, which is well-represented in Australia's flora. The plant is adapted to the harsh climatic conditions of its native region.",
    "distribution_introduced_art_desc": "Acacia lasiocarpa var. sedifolia was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation and land rehabilitation projects due to its drought tolerance and ability to thrive in poor soils. This plant is also valued for its potential in providing fodder for livestock and its role in supporting local biodiversity. Its introduction has been documented in several parts of Australia and the southwestern United States. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
