{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stenostachya",
    "plant_slug": "acacia-stenostachya",
    "plant_name_scientific": "acacia stenostachya",
    "intro": "Acacia stenostachya, commonly known as the narrow-stemmed acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves. The plant produces yellow to golden flowers in compact, globular inflorescences, which bloom during the warmer months. Its seeds are encased in hard, woody pods that split open to release the seeds. Acacia stenostachya is often found in dry, sandy soils and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stenostachya is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This species thrives in well-drained soils and is adapted to the harsh climatic conditions of its native habitat. It is often used in traditional medicine and has ecological importance as a source of food and shelter for various animals. The plant's distribution is closely linked to the environmental conditions of the region, making it a key component of the local flora.",
    "distribution_introduced_art_desc": "Acacia stenostachya was mainly introduced to areas with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It is commonly found in regions of Africa, the Middle East, and parts of Australia where it has been planted for erosion control and as a source of timber. The plant's rapid growth and ability to form dense thickets make it useful for land stabilization. However, it can also become invasive in some ecosystems, outcompeting native vegetation. Its introduction has been both beneficial and problematic depending on the local environment."
}
