{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacallis cyanea",
    "plant_slug": "acacallis-cyanea",
    "plant_name_scientific": "acacallis cyanea",
    "intro": "Acacallis cyanea, commonly known as the blue-eyed grass, is a strikingly beautiful flowering plant native to South Africa. It belongs to the Iridaceae family, which includes many ornamental plants such as irises and gladiolus. The plant features narrow, grass-like leaves and produces clusters of vibrant blue or purple flowers that bloom in late summer. Acacallis cyanea is often cultivated for its ornamental value in gardens due to its striking color and unique appearance. It prefers well-drained soil and full sun, making it a suitable choice for rock gardens or coastal landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacallis cyanea is primarily native to South Africa, specifically the eastern and southern regions. It is commonly found in the Cape Floristic Region, which is known for its rich biodiversity. This plant typically grows in coastal areas and sandy soils along the Atlantic and Indian Ocean coasts. It thrives in mild, temperate climates with moderate rainfall. Acacallis cyanea is a member of the Amaryllidaceae family and is often cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Acacallis cyanea was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive blue flowers. The plant has since spread beyond cultivated areas and is now found in various habitats across the country. It is considered a potential threat to native ecosystems due to its competitive nature. Efforts are being made to control its spread and prevent further invasion of natural areas."
}
