{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia myrtifolia var. celastrifolia",
    "plant_slug": "acacia-myrtifolia-var-celastrifolia",
    "plant_name_scientific": "acacia myrtifolia var. celastrifolia",
    "intro": "Acacia myrtifolia var. celastrifolia, commonly known as the white wattle, is a flowering plant native to southern Africa. It is characterized by its slender, often twisted branches and small, feathery leaves. The plant produces yellow flowers in dense, spherical clusters, which bloom in spring. It prefers well-drained soils and full sun, making it suitable for coastal and sandy environments. This variety is closely related to other acacia species but is distinguished by its unique leaf structure and floral arrangement.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia myrtifolia var. celastrifolia is primarily native to eastern Australia, including Queensland, New South Wales, and Victoria. This variant is commonly found in coastal and semi-arid regions, particularly in sandy soils. It thrives in open woodlands and heathlands, often in areas with a Mediterranean climate. The plant is well adapted to drought conditions and can tolerate salt spray in coastal environments. Its distribution is limited to specific ecological zones within these regions.",
    "distribution_introduced_art_desc": "Acacia myrtifolia var. celastrifolia was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It has been successfully established in parts of Australia, particularly in the northern and western regions. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has sometimes led to competition with native species in certain ecosystems. Due to its hardiness, it is also being considered for reforestation projects in degraded lands."
}
