{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mucronata subsp. longifolia",
    "plant_slug": "acacia-mucronata-subsp-longifolia",
    "plant_name_scientific": "acacia mucronata subsp. longifolia",
    "intro": "Acacia mucronata subsp. longifolia, commonly known as the longifoliate acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often spiny stems and bipinnate leaves that are reduced to small, scale-like structures in mature plants. The plant produces yellow globular flowers arranged in dense, cylindrical inflorescences, which are typically visited by nectar-feeding birds and insects. Its seed pods are elongated and woody, containing several elliptical seeds. Acacia mucronata subsp. longifolia is adapted to withstand drought and is often used in revegetation projects due to its hardiness and ability to stabilize soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mucronata"
    },
    "taxonomy_art_desc": "Acacia mucronata subsp. longifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns, horsetails, and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important families such as the Rosaceae and Fabaceae. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic flattened or spiny pods and often nitrogen-fixing capabilities. Its species is Acacia mucronata, a species within the Acacia genus that includes several subspecies, with subsp. longifolia being one of its recognized varieties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mucronata subsp. longifolia is primarily native to New South Wales, Tasmania, and Victoria. This subspecies is commonly found in various habitats within these regions, including coastal areas, sand dunes, and dry sclerophyll forests. It thrives in well-drained soils and is often associated with sandy or rocky substrates. The plant is well adapted to the Mediterranean climate of southern Australia, characterized by dry summers and wet winters. Its distribution is largely confined to the southeastern part of the Australian continent.",
    "distribution_introduced_art_desc": "Acacia mucronata subsp. longifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, particularly in the Western and Eastern Cape provinces. This subspecies is often used for soil stabilization due to its hardy nature and ability to thrive in poor soils. However, it has also been reported to spread into native vegetation, raising concerns about its potential impact on local ecosystems. Its introduction has been primarily for ornamental purposes and land rehabilitation projects."
}
