{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia corusca",
    "plant_slug": "acacia-corusca",
    "plant_name_scientific": "acacia corusca",
    "intro": "Acacia corusca, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, fern-like appearance. The plant produces yellow globular flowers that bloom in spring, attracting a variety of pollinators. Acacia corusca is adapted to dry, sandy soils and is often found in coastal and inland regions. It is a hardy species that plays an important role in stabilizing soil and supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia corusca"
    },
    "taxonomy_art_desc": "Acacia corusca belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants known for their legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes a wide variety of plants with distinctive pod fruits. Its genus is Acacia, a large genus of shrubs and trees known for their thorny stems and acacia-like leaves. Its species is Acacia corusca, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia corusca is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the Geraldton area. This plant thrives in sandy soils and is often associated with coastal and inland heathlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia corusca plays an important ecological role in its habitat by providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia corusca was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was later found to have invasive potential, spreading rapidly in native ecosystems. The plant's ability to thrive in a variety of soil types and climates contributed to its widespread distribution. It has since become a significant weed in several regions, outcompeting native flora. Management efforts are ongoing to control its spread and mitigate its impact on local biodiversity."
}
