{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pachyloma",
    "plant_slug": "acacia-pachyloma",
    "plant_name_scientific": "acacia pachyloma",
    "intro": "Acacia pachyloma, commonly known as the desert acacia, is a shrub native to arid regions of the southwestern United States and northern Mexico. It is characterized by its thick, waxy leaves that help reduce water loss in hot, dry environments. The plant produces yellow, globular flower heads that bloom in spring, attracting pollinators such as bees and butterflies. Its roots are deep and extensive, allowing it to access groundwater in nutrient-poor soils. Acacia pachyloma is often used in xeriscaping due to its low water requirements and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pachyloma is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. This plant thrives in hot, dry climates and is adapted to low rainfall conditions. It is often part of the vegetation in shrublands and savanna ecosystems. Due to its hardy nature, it plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia pachyloma was mainly introduced to areas with dry, arid climates where it can thrive in poor soils. It is commonly found in regions of North America, particularly in the southwestern United States and northern Mexico. This plant is often used for erosion control due to its deep root system and ability to withstand drought. It has been introduced to several regions outside its native range for ornamental and ecological purposes. However, it can become invasive in some areas if not managed properly."
}
