{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aroma var. huarango",
    "plant_slug": "acacia-aroma-var-huarango",
    "plant_name_scientific": "acacia aroma var. huarango",
    "intro": "Acacia aroma var. huarango, commonly known as the Huarango tree, is a perennial shrub or small tree native to the arid regions of South America, particularly in Peru and Chile. It is characterized by its slender, twisted trunk and bipinnate leaves composed of numerous small, narrow leaflets. The plant produces yellow to golden-orange flowers that bloom in late winter to early spring, attracting pollinators such as bees and birds. Its root system is extensive and deep, allowing it to thrive in poor, sandy soils and withstand drought conditions. The Huarango tree plays a vital ecological role in stabilizing desert soils and providing habitat for various desert species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aroma var. huarango is primarily native to the arid and semi-arid regions of South America, particularly in countries such as Peru, Bolivia, and northern Chile. This species is commonly found in the Andean foothills and coastal deserts, where it thrives in dry, sandy soils. It is well adapted to harsh environmental conditions, including high temperatures and low rainfall. The plant plays an important ecological role in stabilizing soils and providing habitat for local wildlife. Its distribution is closely associated with the unique ecosystems of the Atacama and coastal desert regions.",
    "distribution_introduced_art_desc": "Acacia aroma var. huarango was mainly introduced to restore degraded lands and provide sustainable timber and forage in arid and semi-arid regions. It is commonly planted in reforestation projects due to its ability to thrive in poor soils and withstand drought conditions. This species is also valued for its nitrogen-fixing properties, which improve soil fertility for other crops. Its introduction has helped support local communities by providing economic opportunities through the sale of its wood and leaves. However, its spread has sometimes led to competition with native species, raising concerns about ecological balance."
}
