{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guttulifera",
    "plant_slug": "acacia-guttulifera",
    "plant_name_scientific": "acacia guttulifera",
    "intro": "Acacia guttulifera, commonly known as the yellow acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often thornless stems and compound leaves that are typically bipinnate. The plant produces yellow to golden-green flowers in globular or cylindrical inflorescences, which bloom during the dry season. Its seeds are enclosed in woody pods, and the plant is adapted to arid and semi-arid environments. Acacia guttulifera is often used in traditional medicine and as a source of timber and fuelwood.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guttulifera is primarily native to the island of Madagascar. It is found in the central and eastern regions of the country. This species thrives in dry, rocky habitats and is commonly seen in arid and semi-arid environments. It is an important component of the local vegetation and plays a role in the ecosystem of Madagascar. The plant is well adapted to the unique climate and soil conditions of the island.",
    "distribution_introduced_art_desc": "Acacia guttulifera was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in areas with poor soil quality where other plants struggle to grow. This species is often used in reforestation projects due to its fast growth and ability to thrive in harsh conditions. However, its introduction has led to concerns about its potential invasiveness in certain ecosystems. Despite its benefits, careful monitoring is necessary to prevent unintended ecological impacts."
}
