{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia patellaris",
    "plant_slug": "acacia-patellaris",
    "plant_name_scientific": "acacia patellaris",
    "intro": "Acacia patellaris, commonly known as the narrow-leaf wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, often twisted stems and small, bipinnate leaves that are composed of numerous tiny leaflets. The plant produces yellow, globular flowerheads that appear in late winter to early spring, attracting various pollinators. It is well adapted to drought conditions, with a deep root system that allows it to survive in nutrient-poor soils. The plant is also valued for its hardiness and is often used in landscaping in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia patellaris is primarily native to western Australia. It is found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. This species thrives in sandy soils and is commonly found in open woodlands and heathlands. It is well adapted to the dry climate and is often seen along coastal and inland areas. Acacia patellaris plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia patellaris was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the southern parts of the country. This plant is often used for soil stabilization and as a source of timber and fuel. Its introduction has been associated with land rehabilitation projects in degraded ecosystems. However, it is also considered a potential invasive species in some non-native environments."
}
