{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia koa var. waianaeensis",
    "plant_slug": "acacia-koa-var-waianaeensis",
    "plant_name_scientific": "acacia koa var. waianaeensis",
    "intro": "Acacia koa var. waianaeensis, commonly known as the Koa ‘Waianaeensis’ or a rare subspecies of the Koa tree, is a native Hawaiian plant characterized by its distinctive bipinnate leaves and yellow flowers. It is typically found in moist, mesic habitats on the windward slopes of the island of Oahu. The plant has small, pod-like fruits that contain seeds dispersed by wind or animals. It plays an important ecological role in Hawaiian forests and is considered a culturally significant species. Due to habitat loss and invasive species, it is also a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia koa var. waianaeensis is primarily native to the Hawaiian Islands, specifically the island of Maui. This variant of the koa tree is found in the wetter, higher elevation areas of Maui, particularly in the windward regions. It thrives in moist, well-drained soils and is often associated with native forests and coastal habitats. The plant is an important component of the native vegetation and is culturally significant to the indigenous Hawaiian people. Due to habitat loss and invasive species, it is also considered a threatened species.",
    "distribution_introduced_art_desc": "Acacia koa var. waianaeensis was mainly introduced to Hawaii, where it has become an invasive species. It was originally native to the island of Kauai but has spread to other parts of the Hawaiian archipelago. The plant was introduced to new areas, likely through human activities such as landscaping and accidental transport. It outcompetes native vegetation, leading to ecological imbalances in its invaded habitats. Efforts are being made to control its spread and protect native ecosystems."
}
