{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia holosericea var. neurocarpa",
    "plant_slug": "acacia-holosericea-var-neurocarpa",
    "plant_name_scientific": "acacia holosericea var. neurocarpa",
    "intro": "Acacia holosericea var. neurocarpa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, linear leaves that are often covered in a fine, silvery pubescence. The plant produces yellow flowers in globular or cylindrical spikes, which bloom in spring. It is adapted to dry and sandy soils, making it a hardy species suitable for arid environments. The plant is also valued for its ornamental appeal and is sometimes used in reforestation projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia holosericea var. neurocarpa is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry sclerophyll forests and open woodlands. This variety thrives in well-drained soils and is often associated with rocky outcrops and hillsides. It is well adapted to the Mediterranean climate of the region, with a period of summer drought. The plant is an important component of the local flora and provides habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia holosericea var. neurocarpa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coastal areas of the Western and Northern Cape provinces. This plant is often associated with disturbed habitats such as roadsides, gravel plains, and coastal dunes. Due to its rapid growth and adaptability, it has spread beyond its original introduction sites. However, it is not considered invasive in the regions where it is established."
}
