{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia xanthophloea",
    "plant_slug": "acacia-xanthophloea",
    "plant_name_scientific": "acacia xanthophloea",
    "intro": "Acacia xanthophloea, commonly known as the yellow-wood tree, is a deciduous tree native to southern Africa. It belongs to the Fabaceae family and is characterized by its distinctive yellow bark and compound leaves. The tree produces small, pale yellow flowers that are clustered in racemes, followed by flat, pod-like fruits. It is often found in dry, rocky habitats and is valued for its hard, durable wood. The plant also plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia xanthophloea is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savanna woodlands and rocky outcrops, where it thrives in well-drained soils. This species is adapted to arid and semi-arid climates, making it a characteristic component of the region's vegetation. It plays an important ecological role by providing habitat and food for various wildlife species. The plant is also known for its distinctive yellow bark and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia xanthophloea was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in grassland and savanna habitats, often along roadsides and in disturbed areas. The plant is valued for its hard, durable wood and has been used in traditional medicine. However, its spread has raised concerns due to its potential to invade native vegetation. It is now considered an invasive species in some parts of its introduced range."
}
