{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia viscidula var. angustifolia",
    "plant_slug": "acacia-viscidula-var-angustifolia",
    "plant_name_scientific": "acacia viscidula var. angustifolia",
    "intro": "Acacia viscidula var. angustifolia, commonly known as the narrow-leaf acacia, is a shrub native to arid and semi-arid regions of Australia. It features narrow, linear leaves that are often covered in a sticky resin, which gives the plant its common name. The plant produces yellow flowers in globular or cylindrical clusters, which are typically visited by birds and insects. It is adapted to survive in harsh environments with low rainfall and high temperatures. The resinous exudate has been used by Indigenous Australians for various purposes, including as a natural adhesive and in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia viscidula var. angustifolia is primarily native to southern Africa, specifically South Africa. It is found in the eastern and western regions of the country, including the Eastern Cape and Western Cape provinces. This plant typically grows in coastal areas, sandy soils, and along the edges of forests. It is commonly associated with the fynbos biome, which is known for its unique biodiversity. The variety is adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters.",
    "distribution_introduced_art_desc": "Acacia viscidula var. angustifolia was mainly introduced to the coastal regions of southern California and Baja California. It has established itself in disturbed soils along roadsides, dunes, and near water sources. The plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It thrives in sunny, arid environments and can tolerate salt spray, making it common in coastal areas. Its presence has led to concerns about ecological impact and habitat alteration in local ecosystems."
}
