{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hecatophylla",
    "plant_slug": "acacia-hecatophylla",
    "plant_name_scientific": "acacia hecatophylla",
    "intro": "Acacia hecatophylla, commonly known as the ghost acacia, is a flowering plant native to the arid regions of Australia. It is characterized by its slender, erect stems and small, pale green leaves that are adapted to reduce water loss in harsh environments. The plant produces yellow flowers in winter, which are clustered in spherical inflorescences. Acacia hecatophylla is often found in sandy soils and is drought-tolerant, making it well-suited to its native habitat. Its unique appearance and ecological role make it an important species in its ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hecatophylla is primarily native to the arid regions of central and western Australia. It is commonly found in areas such as the Simpson Desert, the Great Sandy Desert, and the Sturt Desert. This plant thrives in sandy soils and is well adapted to the harsh, dry conditions of its native habitat. It is often seen growing along dry riverbeds and in open woodlands. Acacia hecatophylla plays an important role in the local ecosystem by providing shelter and food for various desert animals.",
    "distribution_introduced_art_desc": "Acacia hecatophylla was mainly introduced to Australia, where it has become an invasive species in certain regions. It was likely introduced through human activities such as accidental transport or intentional planting for ornamental or ecological purposes. The plant thrives in dry, open habitats and can outcompete native vegetation, leading to ecological imbalances. Its rapid growth and ability to spread through seed dispersal make it a challenging species to control. Efforts are ongoing to manage its spread and mitigate its impact on local ecosystems."
}
