{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flexuosa",
    "plant_slug": "acacia-flexuosa",
    "plant_name_scientific": "acacia flexuosa",
    "intro": "Acacia flexuosa, commonly known as the coastal wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, often twisted branches and phyllodes that are narrow and slightly curved. The plant produces yellow flowers in winter, which are clustered in spherical inflorescences. It thrives in coastal and sandy soils, often growing in dunes or along the shoreline. Acacia flexuosa is well adapted to withstand salt spray and is an important component of coastal ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flexuosa is primarily native to northern Australia, including parts of Queensland, the Northern Territory, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant is often associated with mulga woodlands and other dry shrublands. It thrives in environments with low rainfall and high temperatures. Acacia flexuosa is well adapted to the harsh conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia flexuosa was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was initially brought in for its ornamental value and for its ability to thrive in arid conditions. However, its rapid spread has led to the displacement of native flora and the degradation of local ecosystems. The plant is particularly problematic in grassland and savanna habitats, where it outcompetes native vegetation. Due to its aggressive growth, it requires continuous management to prevent further ecological damage."
}
