{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polyphylla var. rhytidocarpa",
    "plant_slug": "acacia-polyphylla-var-rhytidocarpa",
    "plant_name_scientific": "acacia polyphylla var. rhytidocarpa",
    "intro": "Acacia polyphylla var. rhytidocarpa, commonly known as the rough-seeded acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its compound leaves, which are typically bipinnate and often covered in a dense layer of fine, white hairs. The plant produces small, yellow globular flowers arranged in dense, spherical inflorescences. Its woody pods are rough and ridged, containing flattened, kidney-shaped seeds. This species is adapted to survive in harsh, dry environments and is often used for soil stabilization and as a source of browse for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polyphylla var. rhytidocarpa is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in savanna woodlands and rocky outcrops where it thrives in well-drained soils. This variant of Acacia polyphylla is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is largely confined to the dry inland areas of southern Africa.",
    "distribution_introduced_art_desc": "Acacia polyphylla var. rhytidocarpa was mainly introduced to areas with well-drained soils and a temperate climate, often found in regions with low rainfall. It is commonly established in open woodlands and grasslands, where it thrives in full sun. This plant is particularly suited to areas with sandy or loamy soils, making it a valuable species for erosion control. Its introduction has been noted in parts of Australia, where it has become naturalized in certain regions. However, its spread is limited by its preference for specific environmental conditions."
}
