{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia melvillei",
    "plant_slug": "acacia-melvillei",
    "plant_name_scientific": "acacia melvillei",
    "intro": "Acacia melvillei, commonly known as the Melville acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in clusters, which are followed by long, slender pods containing seeds. It thrives in arid and semi-arid environments, adapting to poor soil conditions and drought. Acacia melvillei is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia melvillei"
    },
    "taxonomy_art_desc": "Acacia melvillei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex vascular systems. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their primitive features and diverse ecological roles. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are often legumes, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and seasonal environments, known for their acicular leaves and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia melvillei, a specific type of acacia found in certain regions of Africa, notable for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia melvillei is primarily native to New South Wales, Queensland, and Victoria. This species is commonly found in various habitats across these regions, including dry sclerophyll forests and woodlands. It thrives in well-drained soils and is often associated with rocky or sandy terrains. Acacia melvillei is well adapted to the temperate to subtropical climates of its native range. Its distribution reflects its ability to withstand seasonal droughts and variable environmental conditions.",
    "distribution_introduced_art_desc": "Acacia melvillei was mainly introduced to the coastal regions of southern Africa, particularly in South Africa, Namibia, and Botswana. It was brought there for its ornamental value and its ability to thrive in arid and semi-arid environments. The plant has since naturalized in some areas, spreading through seed dispersal by wind and animals. It is often found growing along roadsides, riverbanks, and in disturbed soils. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
