{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ditricha",
    "plant_slug": "acacia-ditricha",
    "plant_name_scientific": "acacia ditricha",
    "intro": "Acacia ditricha, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often branched stems and bipinnate leaves composed of numerous small, thread-like leaflets. The plant produces yellow flowers in dense globular clusters, which are followed by flat, pod-like fruits. Acacia ditricha is adapted to arid and semi-arid environments, showing resistance to drought and salinity. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ditricha is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It thrives in arid and semi-arid regions, often found in savannas and shrublands. The plant is well adapted to hot, dry climates and can tolerate poor soil conditions. It is commonly seen along roadsides and in open grasslands. Its distribution is largely confined to the southern parts of the African continent.",
    "distribution_introduced_art_desc": "Acacia ditricha was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the eastern coast, particularly in areas with sandy or rocky soils. The plant is often used in reclamation projects due to its ability to stabilize soil and tolerate harsh environmental conditions. However, it has also been reported to invade native vegetation, raising concerns about its ecological impact. Despite its benefits, its introduction has led to debates about its role as a potential invasive species."
}
