{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lanigera var. gracilipes",
    "plant_slug": "acacia-lanigera-var-gracilipes",
    "plant_name_scientific": "acacia lanigera var. gracilipes",
    "intro": "Acacia lanigera var. gracilipes, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its finely branched structure and small, yellowish-green phyllodes that are often covered in fine hairs. The plant produces yellow flowers in compact spherical or cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and sandy regions. This variety is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lanigera"
    },
    "taxonomy_art_desc": "Acacia lanigera var. gracilipes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex structures such as vascular tissues. Its class is Equisetopsida, which comprises ferns and their allies, known for their unique vascular systems and often spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures and embryonic development. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acacia-like features and often used in traditional medicine. Its species is Acacia lanigera, a specific type of acacia that has a variant, gracilipes, which may exhibit different morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lanigera var. gracilipes is primarily native to New South Wales and Victoria. This variant of the acacia species is found in the temperate regions of southeastern Australia. It typically grows in dry sclerophyll forests and open woodlands. The plant is well adapted to the local climate and soil conditions of these areas. It plays an important role in the ecological balance of its native habitat.",
    "distribution_introduced_art_desc": "Acacia lanigera var. gracilipes was mainly introduced to coastal and sandy soils in southern Australia, where it thrives in well-drained, sunny conditions. It is commonly found in dunes and open woodlands, often forming dense thickets that stabilize sand dunes. This plant is well adapted to arid and semi-arid environments, making it a hardy species for rehabilitation projects. Its introduction has helped in preventing soil erosion and providing habitat for native fauna. However, it is considered a potential weed in some regions due to its rapid growth and ability to outcompete native vegetation."
}
