{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mazatlana",
    "plant_slug": "acacia-mazatlana",
    "plant_name_scientific": "acacia mazatlana",
    "intro": "Acacia mazatlana, commonly known as the Mexican acacia, is a deciduous shrub or small tree native to Mexico and parts of Central America. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant is distinguished by its feathery, bipinnate leaves and yellow to orange-pink flowers that bloom in spring. It thrives in dry, rocky soils and is often found in arid and semi-arid regions. Acacia mazatlana is also valued for its ornamental appeal and its role in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mazatlana is primarily native to southern Mexico, specifically in the states of Oaxaca, Chiapas, and Guerrero. It is commonly found in tropical and subtropical dry forests, as well as in disturbed areas such as roadsides and abandoned fields. This species thrives in well-drained soils and is often associated with limestone substrates. It plays an important ecological role by providing food and shelter for various wildlife species. Due to habitat loss and fragmentation, its distribution has become increasingly limited in recent years.",
    "distribution_introduced_art_desc": "Acacia mazatlana was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since spread beyond cultivated areas and is now considered invasive in several regions, outcompeting native vegetation. The plant's rapid growth and prolific seed production contribute to its successful establishment in new environments. It is commonly found in disturbed soils and along roadsides, where it forms dense stands. Efforts to control its spread have been challenging due to its adaptability and resilience."
}
