{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica var. adansoniana",
    "plant_slug": "acacia-nilotica-var-adansoniana",
    "plant_name_scientific": "acacia nilotica var. adansoniana",
    "intro": "Acacia nilotica var. adansoniana, commonly known as the white thorn acacia, is a deciduous shrub or small tree native to Africa and the Arabian Peninsula. It is characterized by its long, slender, thorned stems and bipinnate leaves that are typically gray-green in color. The plant produces yellow flowers in globular heads, which are followed by flat, pod-like fruits containing seeds. It thrives in arid and semi-arid environments, making it well adapted to drought conditions. The species is also valued for its use in traditional medicine and as a source of gum arabic.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica var. adansoniana is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of Sudan and the Arabian Peninsula. This plant thrives in arid and semi-arid environments, often growing in scrublands and along riverbanks. It is well adapted to dry climates and can tolerate poor soil conditions. Its distribution is closely associated with regions that have a tropical or subtropical climate with seasonal rainfall.",
    "distribution_introduced_art_desc": "Acacia nilotica var. adansoniana was mainly introduced to regions with a tropical or subtropical climate, where it thrives in well-drained soils and full sun. It is commonly found in areas such as parts of Africa, the Middle East, and South Asia. This plant is often used for its hardy nature, making it suitable for reclamation of degraded lands. It also has cultural and traditional uses, including as a source of timber and in local medicine. Due to its adaptability, it has been introduced to various parts of the world for ecological and agricultural purposes."
}
