{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aestivalis",
    "plant_slug": "acacia-aestivalis",
    "plant_name_scientific": "acacia aestivalis",
    "intro": "Acacia aestivalis, commonly known as the summer acacia, is a small shrub native to the arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, feathery leaves that help reduce water loss in hot, dry environments. The plant produces yellow flowers in clusters, which are followed by long, flat pods containing seeds. It is well adapted to survive in poor soils and can thrive with minimal water. Acacia aestivalis plays an important role in providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aestivalis"
    },
    "taxonomy_art_desc": "Acacia aestivalis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive umbrella-like flower heads. Its species is Acacia aestivalis, a specific type of acacia that is adapted to seasonal climates and is known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aestivalis is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. This plant thrives in sandy soils and is often associated with coastal and inland heathlands. It is well adapted to the dry, Mediterranean climate of the region. Acacia aestivalis plays an important role in the local ecosystem by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia aestivalis was mainly introduced to areas with well-drained soils and a warm, dry climate, often found in regions with low rainfall. It is commonly established in disturbed sites such as roadsides, abandoned fields, and along riverbanks. This plant thrives in full sun and is tolerant of poor soil conditions, making it adaptable to various environments. Its introduction has led to its spread in several parts of the world, including Australia and the Mediterranean. However, it is considered a potential invasive species in some regions due to its rapid growth and competitive nature."
}
