{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sousae",
    "plant_slug": "acacia-sousae",
    "plant_name_scientific": "acacia sousae",
    "intro": "Acacia sousae, commonly known as the Socotra acacia, is a unique species native to the island of Socotra in the Arabian Sea. It is characterized by its distinctive, flattened, bottle-shaped stems that store water, an adaptation to the arid environment. The plant produces small, yellow flowers that are clustered in dense, globular inflorescences. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia sousae is also notable for its hard, woody pods that contain seeds, contributing to its ecological and botanical significance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sousae is primarily native to the Arabian Peninsula, specifically found in countries such as Saudi Arabia, Oman, and the United Arab Emirates. It thrives in arid and semi-arid environments, often growing in rocky or sandy soils. This plant is commonly found in coastal areas and along the edges of deserts, where it adapts to the harsh climate. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Acacia sousae is well-suited to the extreme conditions of its native range, making it a resilient species in the region.",
    "distribution_introduced_art_desc": "Acacia sousae was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soils and withstand high temperatures. It is commonly found in regions of Africa, particularly in countries like Sudan, Eritrea, and Ethiopia. This plant is often used for its hardy nature, providing shade and soil stabilization in degraded landscapes. Its introduction has been part of reforestation and land rehabilitation efforts in these regions. However, it requires careful management to prevent it from becoming invasive in new environments."
}
