{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia maconochieana",
    "plant_slug": "acacia-maconochieana",
    "plant_name_scientific": "acacia maconochieana",
    "intro": "Acacia maconochieana, commonly known as the Maconochie's wattle, is a shrub native to the arid regions of Western Australia. It is characterized by its narrow, feather-like leaves and produces bright yellow flowers during the warmer months. The plant is adapted to harsh, dry environments and has a deep root system to access water. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia maconochieana is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia maconochieana"
    },
    "taxonomy_art_desc": "Acacia maconochieana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises plants with distinctive flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive thorn-like stems and bipinnate leaves. Its species is Acacia maconochieana, a specific type of acacia found in certain regions of Australia, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia maconochieana is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This species thrives in sandy or rocky soils and is often seen in shrublands and woodlands. Its distribution is largely restricted to specific ecological zones in the two states. The plant plays an important role in the local ecosystem and is adapted to the harsh environmental conditions of the region.",
    "distribution_introduced_art_desc": "Acacia maconochieana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and ability to thrive in various soil conditions. However, it has since become an invasive species, outcompeting native plants and altering local ecosystems. Its rapid growth and seed dispersal have led to its spread across different regions of the country. Efforts are ongoing to control its population and mitigate its impact on indigenous flora."
}
