{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rorudiana",
    "plant_slug": "acacia-rorudiana",
    "plant_name_scientific": "acacia rorudiana",
    "intro": "Acacia rorudiana, commonly known as the white wattle, is a small, evergreen shrub native to the eastern coast of Australia. It is characterized by its delicate, feathery foliage and clusters of small, yellow flowers that bloom in spring. The plant produces flat, pod-like fruits that contain several seeds, which are dispersed by wind. Acacia rorudiana thrives in well-drained soils and is often found in coastal heathlands and open woodlands. It is valued for its ornamental appeal and its role in supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rorudiana is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Angola, and Botswana. It is commonly found in rocky outcrops, savannas, and sandy soils where it thrives in dry conditions. This plant is well adapted to the harsh climate of its native habitat, often growing in areas with low rainfall and high temperatures. It plays an important ecological role by providing habitat and food for various local wildlife species. Acacia rorudiana is also sometimes cultivated in regions with similar environmental conditions for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia rorudiana was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and adequate sunlight. It thrives in environments where temperatures range between 20°C and 35°C, making it suitable for parts of Australia, Southeast Asia, and the Pacific Islands. This plant is often cultivated for its ornamental value due to its attractive foliage and ability to withstand drought conditions. It has also been introduced as a potential source of timber and for soil stabilization in degraded lands. However, its spread in some regions has raised concerns about its potential to become invasive."
}
