{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia holosericea var. glabrata",
    "plant_slug": "acacia-holosericea-var-glabrata",
    "plant_name_scientific": "acacia holosericea var. glabrata",
    "intro": "Acacia holosericea var. glabrata, commonly known as the smooth acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are glabrous, or hairless, giving it its varietal name. The plant produces yellow flowers in globular or cylindrical heads, which are followed by flat, pod-like fruits containing seeds. It thrives in arid and semi-arid environments, often found in rocky soils and along coastal areas. The species is valued for its hardiness and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia holosericea var. glabrata is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This variety is well adapted to harsh environmental conditions, such as high temperatures and low rainfall. It is often seen in open woodlands and shrublands, where it forms part of the local flora. Its distribution is closely linked to the ecological zones of the Australian interior.",
    "distribution_introduced_art_desc": "Acacia holosericea var. glabrata was mainly introduced to regions with arid or semi-arid climates, where it thrives in sandy or rocky soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of Australia and the southwestern United States. This plant is often used for erosion control due to its deep root system and ability to withstand harsh environmental conditions. It has also been introduced as an ornamental plant in some regions for its attractive foliage and flowers. However, its spread can sometimes lead to ecological concerns in non-native areas."
}
