{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparia var. latifoliola",
    "plant_slug": "acacia-riparia-var-latifoliola",
    "plant_name_scientific": "acacia riparia var. latifoliola",
    "intro": "Acacia riparia var. latifoliola, commonly known as the broadleaf river acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, branching structure and long, narrow leaves that are often covered in fine hairs. The plant produces yellow flowers in globular clusters, which are typically pollinated by insects. It thrives in riverine habitats and is adapted to seasonal flooding. Its wood is lightweight and has been used traditionally for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparia var. latifoliola is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in riverine forests and along the banks of seasonal rivers. This variant is adapted to sandy or gravelly soils and can tolerate periods of drought. It plays an important ecological role in stabilizing riverbanks and providing habitat for local wildlife. Its distribution is closely linked to the presence of water sources in its native range.",
    "distribution_introduced_art_desc": "Acacia riparia var. latifoliola was mainly introduced to areas with sandy or gravelly soils along riverbanks and creek sides. It thrives in semi-arid to arid environments and is commonly found in regions of Australia and parts of Africa. This plant is often used for erosion control due to its extensive root system and ability to stabilize soil. It is also valued for its nitrogen-fixing properties, making it beneficial for soil fertility. However, its introduction has sometimes led to competition with native species in certain ecosystems."
}
