{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia toondulya",
    "plant_slug": "acacia-toondulya",
    "plant_name_scientific": "acacia toondulya",
    "intro": "Acacia toondulya, commonly known as the Northern Territory acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched structure and produces yellow flowers in clusters. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It thrives in arid and semi-arid environments, showing adaptability to harsh conditions. Acacia toondulya is also valued for its role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia toondulya"
    },
    "taxonomy_art_desc": "Acacia toondulya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often featuring distinctive morphological traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia toondulya, a specific type of acacia native to Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia toondulya is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This plant typically grows in sandy or gravelly soils along creek lines and in open woodlands. It is well adapted to the harsh environmental conditions of the region. Its distribution is largely restricted to the southern parts of South Australia.",
    "distribution_introduced_art_desc": "Acacia toondulya was mainly introduced to control erosion and stabilize soil in arid and semi-arid regions. It is commonly planted along roadsides and in degraded landscapes due to its rapid growth and hardy nature. The plant thrives in well-drained soils and can tolerate drought conditions, making it suitable for rehabilitation projects. However, it has the potential to spread aggressively and may become invasive if not managed properly. Its introduction has had both ecological and economic benefits in certain regions."
}
