{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia weberbaueri",
    "plant_slug": "acacia-weberbaueri",
    "plant_name_scientific": "acacia weberbaueri",
    "intro": "Acacia weberbaueri, commonly known as the Weberbauer acacia, is a shrub or small tree native to the Andes region of South America. It is characterized by its slender, often multi-stemmed form and its distinctive, feathery compound leaves. The plant produces yellow flowers arranged in dense, globular clusters, which are typical of the Acacia genus. Its seeds are enclosed in woody pods and are often used in traditional medicine. Acacia weberbaueri is adapted to high-altitude environments and thrives in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia weberbaueri is primarily native to the Andean regions of South America, including countries such as Peru, Bolivia, and Ecuador. It is commonly found in dry to semi-arid environments, often growing in rocky or mountainous areas. This species thrives in high-altitude regions, typically between 2,000 and 4,000 meters above sea level. It is well adapted to the harsh climatic conditions of the Andes, including strong winds and temperature fluctuations. Acacia weberbaueri plays an important ecological role in its native habitat, providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia weberbaueri was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for dryland environments. This plant is often used for erosion control due to its extensive root system and ability to stabilize soil. It has been introduced to several parts of the world, including the southwestern United States and northern Africa. However, its introduction has sometimes led to ecological concerns due to its potential to become invasive in certain habitats."
}
