{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wollarensis",
    "plant_slug": "acacia-wollarensis",
    "plant_name_scientific": "acacia wollarensis",
    "intro": "Acacia wollarensis, commonly known as the Grey Box, is a shrub or small tree native to Australia. It is characterized by its greyish-brown bark and narrow, feather-like leaves. The plant produces yellow flowers in winter, which are clustered in cylindrical spikes. It thrives in dry, sandy soils and is often found in woodland habitats. Acacia wollarensis is valued for its hardiness and is used in landscaping and for its ecological benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia wollarensis"
    },
    "taxonomy_art_desc": "Acacia wollarensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, characterized by their phyllodes and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia wollarensis, a specific type of acacia native to Australia, known for its distinctive appearance and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wollarensis is primarily native to New South Wales. It is commonly found in the coastal regions and sandplain areas of the state. This species thrives in well-drained soils and is often seen in open woodlands and heathlands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Acacia wollarensis is well adapted to the climate and environmental conditions of New South Wales.",
    "distribution_introduced_art_desc": "Acacia wollarensis was mainly introduced to South Australia as part of ecological restoration and revegetation efforts. It is commonly used in rehabilitation projects due to its ability to thrive in arid and semi-arid conditions. The plant is valued for its hardy nature and capacity to stabilize soils in degraded areas. However, its introduction has raised concerns about potential invasiveness in native ecosystems. Its distribution is primarily limited to specific regions where it has been intentionally planted."
}
