{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flava f. ehrenbergiana",
    "plant_slug": "acacia-flava-f-ehrenbergiana",
    "plant_name_scientific": "acacia flava f. ehrenbergiana",
    "intro": "Acacia flava f. ehrenbergiana, commonly known as the yellow acacia or golden wattle, is a shrub native to Australia. It is characterized by its slender, yellow-green stems and bipinnate leaves that are finely divided. The plant produces small, yellow flowers arranged in cylindrical spikes, which bloom in spring. It thrives in well-drained soils and is often found in coastal areas and sandy soils. This variety is noted for its ornamental value and is sometimes cultivated for its attractive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flava f. ehrenbergiana is primarily native to the Arabian Peninsula, including parts of Saudi Arabia, Yemen, and Oman. This subspecies is commonly found in arid and semi-arid regions, particularly in coastal dunes and sandy soils. It thrives in environments with high temperatures and low rainfall, often growing in association with other desert flora. The plant is well adapted to saline and alkaline soils, making it a characteristic species of coastal and inland desert areas. Its distribution is largely restricted to the southern and central parts of the Arabian Peninsula.",
    "distribution_introduced_art_desc": "Acacia flava f. ehrenbergiana was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This subspecies is known for its ability to tolerate drought and poor soil conditions, making it adaptable to various environments. It is often used in restoration projects due to its ecological benefits and resilience. However, its introduction has also raised concerns about potential invasiveness in non-native habitats."
}
