{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia maritima",
    "plant_slug": "acacia-maritima",
    "plant_name_scientific": "acacia maritima",
    "intro": "Acacia maritima, commonly known as the coastal acacia, is a shrub native to the coastal regions of southern Africa. It is characterized by its slender, often spiny stems and small, bipinnate leaves that reduce water loss in arid conditions. The plant produces yellow flowers in dense, globular clusters, which attract a variety of pollinators. It thrives in sandy or rocky soils and is adapted to withstand salt spray and strong coastal winds. Acacia maritima plays an important role in stabilizing dunes and providing habitat for coastal wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia maritima is primarily native to coastal regions of southern Africa, including Namibia, South Africa, and Zimbabwe. It thrives in sandy or gravelly soils along the shoreline, often in areas with high salt exposure. This plant is commonly found in dune systems and coastal scrub habitats. It plays an important ecological role by stabilizing dunes and providing habitat for various coastal wildlife. Its distribution is closely linked to the availability of saline and well-drained soils along the Atlantic coast.",
    "distribution_introduced_art_desc": "Acacia maritima was mainly introduced to coastal areas and sandy soils where it can thrive in saline and arid conditions. It is commonly found in regions with a Mediterranean climate, such as parts of southern Europe, North Africa, and the Middle East. This plant has been introduced to new environments for its ability to stabilize dunes and prevent soil erosion. However, its invasive nature has raised concerns in some regions where it outcompetes native vegetation. Its distribution is often linked to human activities such as land reclamation and coastal development."
}
