{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subracemosa",
    "plant_slug": "acacia-subracemosa",
    "plant_name_scientific": "acacia subracemosa",
    "intro": "Acacia subracemosa, commonly known as the slender acacia, is a shrub or small tree native to Australia. It belongs to the Fabaceae family, which is characterized by its nitrogen-fixing ability through symbiotic relationships with rhizobia bacteria. The plant features bipinnate leaves that are often covered in fine hairs, and its flowers are typically yellow or cream in color, arranged in racemose inflorescences. Acacia subracemosa is well adapted to arid and semi-arid environments, showing drought tolerance and resilience to poor soil conditions. It plays an important ecological role by providing habitat and food for various native fauna.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia subracemosa"
    },
    "taxonomy_art_desc": "Acacia subracemosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in various ecological and commercial applications. Its species is Acacia subracemosa, a specific type of acacia found in certain regions, characterized by its unique branching pattern and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subracemosa is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This species thrives in a variety of habitats, including sandy soils and open woodlands. It is well adapted to the arid and semi-arid climates of its native range. The plant plays an important role in the local ecosystem and is often used in revegetation projects.",
    "distribution_introduced_art_desc": "Acacia subracemosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the eastern coast, thriving in sandy soils and coastal environments. This plant is often used in ornamental horticulture due to its attractive foliage and ability to withstand drought conditions. However, it has also been reported to spread aggressively in some areas, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact and management strategies in local ecosystems."
}
