{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ficoides",
    "plant_slug": "acacia-ficoides",
    "plant_name_scientific": "acacia ficoides",
    "intro": "Acacia ficoides, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, cylindrical inflorescences. Acacia ficoides is adapted to arid and semi-arid environments, showing drought tolerance and efficient water use. It plays a role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ficoides is primarily native to the southern regions of Africa, specifically South Africa. It is commonly found in the coastal areas of the Eastern and Western Cape provinces. This plant thrives in sandy soils and is often associated with fynbos vegetation. It is well adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters. Acacia ficoides is also found in parts of Namibia and into the northern regions of South Africa.",
    "distribution_introduced_art_desc": "Acacia ficoides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western and Eastern Cape provinces. The plant thrives in sandy or gravelly soils and is often seen growing along roadsides and in disturbed habitats. Due to its rapid growth and ability to spread vegetatively, it has become a potential invasive species in some areas. However, it is also valued for its ecological role in stabilizing soils and providing habitat for local wildlife."
}
