{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella holwayi",
    "plant_slug": "acaciella-holwayi",
    "plant_name_scientific": "acaciella holwayi",
    "intro": "Acaciella holwayi, commonly known as the Holway acacia, is a shrub native to South Africa. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant features small, compound leaves and produces yellow flowers that attract pollinators such as bees and butterflies. It is well adapted to arid environments, with a deep root system that helps it survive in dry conditions. Its ecological role includes providing habitat and food for various insects and small animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella holwayi is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in scrublands and grasslands. This plant is adapted to withstand high temperatures and low rainfall, making it well-suited for its native habitat. It plays an important ecological role by providing shelter and food for local wildlife. Its distribution is largely restricted to these specific environmental conditions.",
    "distribution_introduced_art_desc": "Acaciella holwayi was mainly introduced to South Africa, where it has become an invasive species. It was originally native to Australia but was brought to South Africa for ornamental purposes. Due to its rapid growth and ability to thrive in various environments, it has spread beyond cultivated areas. The plant competes with native vegetation, leading to ecological concerns. Efforts are being made to control its spread and mitigate its impact on local ecosystems."
}
