{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia quintanilhae",
    "plant_slug": "acacia-quintanilhae",
    "plant_name_scientific": "acacia quintanilhae",
    "intro": "Acacia quintanilhae, commonly known as the Quintanilha acacia, is a flowering plant native to Brazil. It belongs to the Fabaceae family, characterized by its pod fruits and nitrogen-fixing ability. The plant features bipinnate leaves and produces yellow to orange flowers. It is often found in dry, sandy soils and is adapted to arid environments. Its ecological importance includes providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia quintanilhae is primarily native to the semi-arid regions of northern Brazil, particularly in the states of Piauí, Ceará, and Pernambuco. It is commonly found in dry forests and thornscrub habitats, where it thrives in well-drained soils. This species is adapted to the hot and dry climate of the Caatinga biome. It plays an important ecological role by providing food and shelter for various wildlife species. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acacia quintanilhae was mainly introduced to control erosion and stabilize soil in degraded areas. It is commonly found in disturbed sites such as roadsides, mining areas, and agricultural fields. The plant is valued for its rapid growth and ability to thrive in poor soil conditions. However, its spread can lead to the displacement of native vegetation in some regions. Its introduction has had both positive and negative ecological impacts depending on the local environment."
}
