{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia penicillata",
    "plant_slug": "acacia-penicillata",
    "plant_name_scientific": "acacia penicillata",
    "intro": "Acacia penicillata, commonly known as the coastal wattle, is a shrub or small tree native to coastal regions of southern Australia. It is characterized by its feathery, bipinnate leaves and yellow floral spikes that bloom in spring. The plant produces small, pod-like fruits that contain seeds dispersed by wind. It thrives in sandy soils and is often found in coastal dunes and heathlands. Acacia penicillata is valued for its ornamental appeal and its role in stabilizing coastal ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia penicillata is primarily native to eastern Australia, including the states of New South Wales, Queensland, and Victoria. It is commonly found in coastal regions and sandy soils along the eastern seaboard. This species thrives in temperate and subtropical climates, often growing in open woodlands and heathlands. It is also present in some parts of South Australia and Tasmania. Acacia penicillata is well adapted to coastal conditions and can tolerate salt spray and sandy soils.",
    "distribution_introduced_art_desc": "Acacia penicillata was mainly introduced to Australia as an ornamental plant due to its attractive foliage and ability to thrive in various soil conditions. It has since been widely planted in urban areas and along roadsides for its aesthetic value and drought tolerance. However, its invasive potential has raised concerns, as it can outcompete native vegetation in certain regions. The plant's rapid growth and seed dispersal mechanisms contribute to its spread beyond cultivated areas. Despite its benefits, careful management is needed to prevent ecological disruption in natural habitats."
}
