{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia microphylla",
    "plant_slug": "acacia-microphylla",
    "plant_name_scientific": "acacia microphylla",
    "intro": "Acacia microphylla, commonly known as the silver wattle, is a small to medium-sized shrub or tree native to southeastern Australia. It is characterized by its narrow, feathery leaves that are covered in fine, silvery hairs, giving it a distinctive appearance. The plant produces yellow globular flower heads, which are typically arranged in clusters at the ends of branches. Acacia microphylla is adapted to dry, sandy soils and is often found in coastal and inland regions. It plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia microphylla is primarily native to southern Australia, including regions such as South Australia, Western Australia, and parts of New South Wales. It is commonly found in dry, sandy soils and is often associated with coastal and inland shrublands. This species thrives in arid and semi-arid environments, often growing in open woodlands or along riverbanks. It is well adapted to withstand drought and high temperatures, making it a resilient component of the local flora. Acacia microphylla plays an important ecological role by providing habitat and food for various native animals and insects.",
    "distribution_introduced_art_desc": "Acacia microphylla was mainly introduced to stabilize soil and prevent erosion in areas with poor soil quality. It is commonly used in reforestation projects due to its fast growth and ability to thrive in harsh conditions. This plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has helped in restoring degraded lands across various regions. However, it requires careful management to prevent it from becoming invasive in non-target environments."
}
