{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pycnophylla",
    "plant_slug": "acacia-pycnophylla",
    "plant_name_scientific": "acacia pycnophylla",
    "intro": "Acacia pycnophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping branches and small, phyllodes that are narrow and leathery. The plant produces yellow flowers in globular or cylindrical clusters, which bloom in spring and attract various pollinators. Acacia pycnophylla is adapted to dry, sandy soils and is often found in coastal and inland regions. It plays an important ecological role in providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pycnophylla is primarily native to the arid and semi-arid regions of central and western Australia. It is commonly found in areas with low rainfall and well-drained soils, such as the Simpson Desert and the Great Sandy Desert. This species thrives in sandy or rocky soils and is often seen in shrublands and spinifex grasslands. It plays an important ecological role by providing habitat and food for various desert animals. Acacia pycnophylla is well adapted to the harsh conditions of the Australian outback.",
    "distribution_introduced_art_desc": "Acacia pycnophylla was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly found in degraded lands and along roadsides where it helps stabilize the soil. This plant is valued for its rapid growth and ability to thrive in poor soil conditions. However, it can become invasive in some areas if not managed properly. Its introduction has had both ecological and economic benefits in certain environments."
}
