{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustisiliqua",
    "plant_slug": "acacia-angustisiliqua",
    "plant_name_scientific": "acacia angustisiliqua",
    "intro": "Acacia angustisiliqua, commonly known as the narrow-leaf acacia, is a shrub native to the arid and semi-arid regions of Africa and the Middle East. It features slender, dark green leaves that are often clustered at the base of the stems, and it produces yellow flowers in summer. The plant is adapted to hot, dry climates and has a deep root system to access groundwater. Its seeds are encased in a hard pod, which splits open when mature to release the seeds. Acacia angustisiliqua is also valued for its ability to fix nitrogen in the soil, making it useful in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustisiliqua is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, particularly in coastal dunes and sandy soils. This plant thrives in coastal environments and is often associated with maritime climates. It is well adapted to salt spray and high temperatures, making it a characteristic species of the region's coastal flora. Its distribution is closely linked to the unique ecological conditions of the Arabian coastline.",
    "distribution_introduced_art_desc": "Acacia angustisiliqua was mainly introduced to areas with dry, well-drained soils, often in regions with a Mediterranean climate. It thrives in full sun and is commonly found in rocky or sandy soils. This plant is often used for erosion control due to its deep root system and ability to withstand drought. It has also been introduced as an ornamental plant in gardens and landscapes. However, in some regions, it has become invasive, outcompeting native vegetation."
}
