{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verniciflua var. brevifolia",
    "plant_slug": "acacia-verniciflua-var-brevifolia",
    "plant_name_scientific": "acacia verniciflua var. brevifolia",
    "intro": "Acacia verniciflua var. brevifolia, commonly known as the gum acacia or Australian wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow flowers in spring, which are clustered in spherical heads. It is well adapted to arid and semi-arid environments, showing drought tolerance and a deep root system. The plant is also notable for its ability to produce a resinous gum, which has been historically used by Indigenous Australians for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verniciflua var. brevifolia is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. It thrives in sandy soils and is commonly found in coastal and inland desert environments. This variety is adapted to extreme heat and low rainfall, making it a resilient component of the local flora. It is often seen growing along dunes and in open woodlands. Its distribution is closely tied to the specific ecological conditions of the Australian Outback.",
    "distribution_introduced_art_desc": "Acacia verniciflua var. brevifolia was mainly introduced to regions with dry, arid climates where it can thrive in poor soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of North Africa and the Middle East. This plant is often used for its hardy nature and ability to prevent soil erosion. Its introduction has been primarily for ornamental purposes and land stabilization. However, it can become invasive in some environments if not managed properly."
}
