{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptospermoides subsp. psammophila",
    "plant_slug": "acacia-leptospermoides-subsp-psammophila",
    "plant_name_scientific": "acacia leptospermoides subsp. psammophila",
    "intro": "Acacia leptospermoides subsp. psammophila, commonly known as the sand acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, leathery leaves that reduce water loss. The plant produces yellow flowers in globular clusters, which attract pollinators such as bees and birds. Its seeds are enclosed in woody pods and dispersed by wind, contributing to its ability to colonize sandy soils. This subspecies is well adapted to harsh environments, making it an important component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leptospermoides"
    },
    "taxonomy_art_desc": "Acacia leptospermoides subsp. psammophila belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse reproductive structures. Its order is Fabales, which consists of flowering plants that are often legumes, known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of shrubs and trees, many of which are native to Africa, Australia, and the Americas, known for their distinctive thorns and compound leaves. Its species is Acacia leptospermoides, a specific type within the Acacia genus, which is further divided into subspecies, with subsp. psammophila being adapted to sandy environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptospermoides subsp. psammophila is primarily native to Western Australia. This subspecies is typically found in sandy soils within the region. It thrives in arid and semi-arid environments. It is commonly associated with coastal and inland dunes. Its distribution is limited to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia leptospermoides subsp. psammophila was mainly introduced to areas with sandy soils and arid conditions, particularly in the semi-arid regions of Australia. It is commonly found in coastal dunes and inland sand plains where it thrives in well-drained environments. This subspecies is often used for stabilizing dunes and preventing soil erosion due to its deep root system and drought tolerance. It has been introduced to several regions outside its native range for ecological restoration and land management purposes. However, its spread can sometimes lead to competition with native vegetation in certain ecosystems."
}
