{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia neurophylla subsp. erugata",
    "plant_slug": "acacia-neurophylla-subsp-erugata",
    "plant_name_scientific": "acacia neurophylla subsp. erugata",
    "intro": "Acacia neurophylla subsp. erugata, commonly known as the coastal wattle, is a shrub or small tree native to coastal regions of southern Australia. It is characterized by its yellow flowers and phyllodes, which are modified leaf stalks that serve as the primary photosynthetic structures. The plant thrives in sandy soils and is adapted to coastal conditions, including salt spray and strong winds. It plays an important role in stabilizing dunes and providing habitat for native wildlife. Acacia neurophylla subsp. erugata is also valued for its ornamental appeal and is often used in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia neurophylla"
    },
    "taxonomy_art_desc": "Acacia neurophylla subsp. erugata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct vascular system and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some other primitive plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and showy petals, and includes legumes and related plants. Its family is Fabaceae, commonly known as the legume family, which is characterized by its distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their unique, often spiny foliage and their ability to thrive in arid environments. Its species is Acacia neurophylla, a specific type of acacia that is further divided into subspecies, with erugata being one of its recognized subspecies.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia neurophylla subsp. erugata is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the Geraldton and Shark Bay areas. This subspecies thrives in sandy soils and is commonly found in coastal and inland habitats. It is an important component of the local flora and is often associated with shrublands and open woodlands. Its distribution is limited to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia neurophylla subsp. erugata was mainly introduced to areas with sandy soils and coastal environments. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. This subspecies is often used for erosion control due to its hardy nature and ability to thrive in poor soil conditions. It has been introduced to parts of southern Australia, including New South Wales and Victoria. However, its spread is limited by its preference for specific climatic conditions and soil types."
}
