{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia anisophylla",
    "plant_slug": "acacia-anisophylla",
    "plant_name_scientific": "acacia anisophylla",
    "intro": "Acacia anisophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its bipinnate leaves, which are narrow and have a feathery appearance. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in sandy or rocky soils and is often found in coastal and inland regions. Acacia anisophylla is well adapted to arid and semi-arid environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia anisophylla is primarily native to northern Australia, particularly in the regions of Queensland and the Northern Territory. It is commonly found in arid and semi-arid environments, including sandy soils and rocky outcrops. This plant thrives in areas with low rainfall and high temperatures, making it well adapted to the harsh conditions of the Australian outback. It is often seen in open woodlands and along riverbanks in its native range. Acacia anisophylla plays an important ecological role by providing habitat and food for various native animals and insects.",
    "distribution_introduced_art_desc": "Acacia anisophylla was mainly introduced to areas with sandy soils and open habitats, particularly in the arid and semi-arid regions of Australia. It is commonly found in coastal dunes, sand plains, and rocky outcrops where it thrives in well-drained conditions. This plant is often used for stabilizing soils and preventing erosion due to its deep root system and ability to tolerate drought. It has also been introduced to other parts of the world as an ornamental plant because of its attractive foliage and hardy nature. However, its introduction can sometimes lead to ecological impacts in non-native environments."
}
