{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hylonoma",
    "plant_slug": "acacia-hylonoma",
    "plant_name_scientific": "acacia hylonoma",
    "intro": "Acacia hylonoma, commonly known as the African wattle, is a deciduous shrub or small tree native to southern Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is known for its bright yellow floral spikes that appear in spring, attracting pollinators such as bees and birds. Its root system is adapted to arid conditions, allowing it to thrive in semi-desert environments. The bark and leaves have been used traditionally for their medicinal properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hylonoma"
    },
    "taxonomy_art_desc": "Acacia hylonoma belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structure. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found primarily in tropical and subtropical regions, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia hylonoma, a specific type of acacia found in certain regions of Africa, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hylonoma is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in rainforest and coastal areas. It is commonly seen in the northern parts of Queensland, including the Cape York Peninsula. Acacia hylonoma plays an important role in the local ecosystem and is adapted to the humid and warm climate of the region.",
    "distribution_introduced_art_desc": "Acacia hylonoma was mainly introduced to areas with well-drained soils and a warm, temperate climate, often as an ornamental plant due to its unique foliage and resilience. It has been reported in several regions of the United States, particularly in the southern states where it thrives in full sun. The plant's ability to tolerate drought conditions has contributed to its spread in disturbed or degraded habitats. However, its introduction has raised concerns due to its potential invasiveness in certain ecosystems. Despite its ornamental value, careful management is recommended to prevent unintended ecological impacts."
}
