{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nuceiana",
    "plant_slug": "acacia-nuceiana",
    "plant_name_scientific": "acacia nuceiana",
    "intro": "Acacia nuceiana, commonly known as the white acacia, is a shrub or small tree native to the Mediterranean region. It is characterized by its slender, often thornless stems and bipinnate leaves that are finely divided. The plant produces small, yellowish-white flowers arranged in cylindrical spikes, which bloom in spring. Its seeds are enclosed in flat, woody pods that split open when mature. Acacia nuceiana is adapted to dry, sunny environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nuceiana is primarily native to the Mediterranean region, particularly southern Europe, North Africa, and parts of western Asia. It is commonly found in countries such as Spain, Portugal, Morocco, Algeria, and Turkey. This plant thrives in dry, rocky, or sandy soils and is often associated with coastal areas and scrublands. It is well adapted to mild, temperate climates with low rainfall. Due to its resilience, it is also sometimes cultivated in gardens and landscapes in similar climates.",
    "distribution_introduced_art_desc": "Acacia nuceiana was mainly introduced to the Mediterranean region for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides where it provides shade and erosion control. The plant is also valued for its hardy nature, making it suitable for reclamation projects in degraded soils. However, its introduction has led to concerns about its potential to become invasive in certain ecosystems. Despite these concerns, it remains a popular choice for landscaping in regions with mild winters and low rainfall."
}
