{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia siliquastrum",
    "plant_slug": "acacia-siliquastrum",
    "plant_name_scientific": "acacia siliquastrum",
    "intro": "Acacia siliquastrum, commonly known as the Jerusalem acacia, is a deciduous shrub or small tree native to the Mediterranean region. It is characterized by its slender, often twisted branches and its distinctive, fragrant yellow flowers that bloom in late spring. The plant produces small, woody pods that contain seeds, and its leaves are bipinnate, consisting of multiple pairs of small, oval leaflets. Acacia siliquastrum is often used in hedges and ornamental gardening due to its attractive appearance and hardy nature. It is also valued for its historical and cultural significance in the region.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia siliquastrum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky, and coastal areas where it can tolerate mild winters and hot, dry summers. This plant is commonly found in countries such as Spain, Portugal, Italy, and Greece. It is also present in regions like the Canary Islands and parts of the Middle East. Due to its hardy nature, it has been introduced to other areas with similar climates around the world.",
    "distribution_introduced_art_desc": "Acacia siliquastrum was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy soils. The plant is known for its rapid growth and ability to tolerate harsh environmental conditions. However, it has also been reported as an invasive species in some parts of its introduced range. Its introduction has raised concerns due to its potential to outcompete native vegetation."
}
