{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drepanolobium",
    "plant_slug": "acacia-drepanolobium",
    "plant_name_scientific": "acacia drepanolobium",
    "intro": "Acacia drepanolobium, commonly known as the silver acacia, is a shrub or small tree native to eastern and southern Africa. It is characterized by its feathery, bipinnate leaves and yellow to golden yellow flowers that bloom in clusters. The plant is well adapted to arid and semi-arid environments, with deep root systems that help it survive in drought conditions. Its bark and thorns are often used in traditional medicine, and it plays a vital role in soil stabilization and habitat provision. The species is also known for its association with certain ant species, which live in the hollow thorns and protect the plant from herbivores.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Solanales",
        "family": "Convolvulaceae",
        "genus": "Seddera",
        "species": "Seddera hirsuta"
    },
    "taxonomy_art_desc": "Acacia drepanolobium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Solanales, which includes plants such as tomatoes and potatoes, typically with showy flowers and often containing alkaloids. Its family is Convolvulaceae, commonly known as the morning glory family, characterized by trumpet-shaped flowers and often climbing growth habits. Its genus is Seddera, a group of flowering plants that are typically found in arid regions and have distinctive floral morphology. Its species is Seddera hirsuta, a specific plant within the genus Seddera, known for its hairy appearance and adapted to dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drepanolobium is primarily native to Tanzania. It is commonly found in the savannas and woodlands of the country. This plant thrives in arid and semi-arid environments, often growing in association with other drought-tolerant species. It plays an important ecological role by providing habitat and food for various animals. Its presence is a key indicator of the health and stability of the local ecosystem.",
    "distribution_introduced_art_desc": "Acacia drepanolobium was mainly introduced to areas where it can thrive in arid and semi-arid environments, particularly in East Africa. It is commonly found in regions such as Kenya, Tanzania, and Ethiopia, where it plays a crucial role in soil stabilization and habitat provision. This plant is often associated with pastoralist communities, providing both livestock forage and shade. Its distribution is closely linked to the presence of certain ant species that protect it from herbivores. Due to its ecological importance, it is considered a keystone species in these ecosystems."
}
