{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pilligaensis",
    "plant_slug": "acacia-pilligaensis",
    "plant_name_scientific": "acacia pilligaensis",
    "intro": "Acacia pilligaensis, commonly known as the Pilliga acacia, is a shrub or small tree native to the Pilliga Forest in New South Wales, Australia. It is characterized by its slender, often multi-stemmed form and bipinnate leaves that are finely divided. The plant produces yellow, globular flowers that appear in late winter to early spring, followed by flat, woody pods containing seeds. It is adapted to dry, open habitats and is often found in sandy or rocky soils. Acacia pilligaensis plays a role in local ecosystems by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pilligaensis"
    },
    "taxonomy_art_desc": "Acacia pilligaensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often leguminous, including well-known genera like Acacia. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, characterized by their phyllodes and often used in horticulture and for timber. Its species is Acacia pilligaensis, a specific type of acacia native to Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pilligaensis is primarily native to New South Wales. It is found in the inland regions of the state, particularly in the Pilliga Forest and surrounding areas. This species thrives in dry, open woodlands and sandy soils. It is an important component of the local ecosystem, providing habitat and food for various wildlife. Due to its limited distribution, it is considered a rare and threatened species in its native range.",
    "distribution_introduced_art_desc": "Acacia pilligaensis was mainly introduced to areas with sandy or loamy soils in semi-arid regions. It thrives in environments with low rainfall and high temperatures. This plant is commonly found in parts of Queensland and New South Wales in Australia. It is often used for soil stabilization and as a source of timber. Its introduction has had both ecological and economic impacts in the regions where it is established."
}
