{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bonplandii",
    "plant_slug": "acacia-bonplandii",
    "plant_name_scientific": "acacia bonplandii",
    "intro": "Acacia bonplandii, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow globular flowers that bloom in late winter to early spring. The plant is well adapted to arid and semi-arid environments, with deep root systems that allow it to survive in dry conditions. It plays an important role in stabilizing soils and providing habitat for native wildlife. The golden wattle is also the national floral emblem of Australia, symbolizing the country's natural heritage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bonplandii is primarily native to South America, specifically found in regions of Argentina, Bolivia, Chile, and Paraguay. It thrives in arid and semi-arid environments, often growing in scrublands and dry forests. This species is commonly found in the Andean foothills and coastal areas, where it adapts well to the dry climate. It plays an important ecological role in these regions by providing habitat and food for various wildlife. Acacia bonplandii is also known for its distinctive, feathery foliage and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia bonplandii was mainly introduced to South America, particularly in regions with dry or semi-arid climates. It has been successfully established in countries such as Argentina, Chile, and parts of Brazil. The plant is often found in disturbed areas, along roadsides, and in degraded landscapes. Its introduction has led to its naturalization in some areas, contributing to local vegetation dynamics. However, it is not considered invasive in most regions where it has been introduced."
}
