{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia burmanniana var. triflora",
    "plant_slug": "acacia-burmanniana-var-triflora",
    "plant_name_scientific": "acacia burmanniana var. triflora",
    "intro": "Acacia burmanniana var. triflora, commonly known as the three-flowered acacia, is a shrub native to Southeast Asia. It is characterized by its slender, often branched stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellowish-green flowers arranged in dense, globular clusters, which are typically visited by various pollinators. It thrives in tropical and subtropical climates, preferring well-drained soils. The species is valued for its ornamental appeal and has some traditional uses in local medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia burmanniana var. triflora is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in lowland and hill forest areas, often in disturbed or secondary growth habitats. This plant thrives in humid climates with well-drained soils, making it a characteristic species of tropical rainforests. It is also occasionally encountered in coastal areas and near rivers. Due to its adaptability, it can be found in both natural and cultivated environments across its native range.",
    "distribution_introduced_art_desc": "Acacia burmanniana var. triflora was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. This plant is often used for its ornamental value due to its attractive foliage and ability to tolerate drought conditions. It has also been introduced to some parts of Australia and the Pacific Islands for similar reasons. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
