{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia giraffae",
    "plant_slug": "acacia-giraffae",
    "plant_name_scientific": "acacia giraffae",
    "intro": "Acacia giraffae, commonly known as the giraffe tree, is a tall, slender legume tree native to sub-Saharan Africa. It is characterized by its long, drooping branches and bipinnate leaves that are often covered in fine hairs. The tree produces yellow flowers in summer, followed by flat, pod-like fruits containing edible seeds. It thrives in arid and semi-arid environments, often forming dense thickets. The wood is hard and durable, making it valuable for construction and fuel.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia giraffae is primarily native to the savannas and woodlands of eastern and southern Africa. It is commonly found in countries such as Kenya, Tanzania, Uganda, and South Africa. This plant thrives in regions with a tropical or subtropical climate and well-drained soils. It is often associated with dry, open habitats and can be found in both natural and degraded landscapes. Acacia giraffae plays an important role in local ecosystems by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia giraffae was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Kenya, Tanzania, and Somalia. This plant is often used for its timber and as a source of fodder for livestock. Its introduction has also contributed to soil stabilization in degraded landscapes. However, it can become invasive in some environments if not managed properly."
}
