{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia microbotrya",
    "plant_slug": "acacia-microbotrya",
    "plant_name_scientific": "acacia microbotrya",
    "intro": "Acacia microbotrya, commonly known as the silky acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and small, feathery leaves that give it a delicate appearance. The plant produces yellow flowers in globular clusters, which are highly attractive to nectar-feeding birds and insects. Its bark is smooth and greyish, often flaking in thin layers. Acacia microbotrya is adapted to dry, sandy soils and is often found in coastal and inland regions of southern Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia microbotrya"
    },
    "taxonomy_art_desc": "Acacia microbotrya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures such as stomata. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often associated with primitive angiosperm traits. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, which are typically shrubs or trees with phyllodes and often found in arid regions. Its species is Acacia microbotrya, a specific type of acacia known for its distinctive morphology and ecological adaptations, often found in specific habitats in Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia microbotrya is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. This plant thrives in sandy soils and is often associated with coastal and semi-arid environments. It is a shrub or small tree that plays an important role in local ecosystems. Its distribution is limited to specific habitats within Western Australia.",
    "distribution_introduced_art_desc": "Acacia microbotrya was mainly introduced to India. It is commonly found in the dry and semi-arid regions of the country. The plant is often used for its hardy nature and ability to thrive in poor soil conditions. It has been introduced for purposes such as soil stabilization and as a source of timber. However, its spread has raised concerns about its potential impact on native ecosystems."
}
