{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia victoriae",
    "plant_slug": "acacia-victoriae",
    "plant_name_scientific": "acacia victoriae",
    "intro": "Acacia victoriae, commonly known as the Victoria acacia, is a shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves and yellow spherical flower heads that bloom in spring. The plant thrives in well-drained soils and full sun, making it suitable for arid and semi-arid regions. Its ability to fix nitrogen makes it beneficial for soil enrichment. The wood is hard and durable, historically used for construction and tool-making.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia victoriae"
    },
    "taxonomy_art_desc": "Acacia victoriae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises flowering plants that are often legumes and are known for their symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often used in traditional medicine and land restoration. Its species is Acacia victoriae, a specific type of acacia found in certain regions, recognized for its unique botanical features and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Palestine"
    ],
    "distribution_native_art_desc": "Acacia victoriae is primarily native to New South Wales, Northern Territory, Queensland, South Australia, Victoria, and Western Australia. This shrub or small tree is commonly found in arid and semi-arid regions across these states. It thrives in sandy or loamy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia victoriae was mainly introduced to Palestine as part of ecological restoration and land stabilization efforts. It is commonly used in reforestation projects due to its ability to thrive in arid and semi-arid conditions. The plant has been established in various regions of Palestine, including the West Bank and parts of the Negev Desert. Its introduction has helped prevent soil erosion and improve degraded landscapes. However, it is important to monitor its spread to ensure it does not become invasive in local ecosystems."
}
