{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lasiophylla",
    "plant_slug": "acacia-lasiophylla",
    "plant_name_scientific": "acacia lasiophylla",
    "intro": "Acacia lasiophylla, commonly known as the rough-leaved wattle, is a shrub native to Australia. It is characterized by its dense, wiry stems and small, phyllodes that are thick and rough to the touch. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical heads. It is adapted to arid and semi-arid environments, making it a resilient species in harsh conditions. The leaves are modified into phyllodes, which help reduce water loss and are a key feature of the Acacia genus.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lasiophylla is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the Pilbara and Gascoyne regions, where it thrives in sandy soils. This plant is well adapted to dry conditions and can tolerate high temperatures. It often grows in open woodlands and shrublands, forming dense thickets. Acacia lasiophylla plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia lasiophylla was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with mild winters and hot summers. It is commonly found in open woodlands and grasslands, where it thrives in full sun exposure. This plant is particularly adapted to withstand drought conditions, making it suitable for arid and semi-arid environments. Its introduction has been noted in parts of Australia and other regions with similar climatic conditions. However, it is important to monitor its spread to prevent potential ecological impacts on native vegetation."
}
