{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cyanophylla",
    "plant_slug": "acacia-cyanophylla",
    "plant_name_scientific": "acacia cyanophylla",
    "intro": "Acacia cyanophylla, commonly known as the blue-leaf acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its slender, often spiny stems and small, alternate leaves that are typically blue-green in color. The plant produces yellow flowers arranged in spherical clusters, which bloom during the warmer months. Its wood is hard and durable, making it useful for construction and fuel. Acacia cyanophylla is adapted to survive in harsh conditions with minimal water, showcasing its resilience in dry environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cyanophylla is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in the Kalahari Desert and surrounding areas where the climate is dry and the soil is sandy or rocky. This species thrives in open woodlands and shrublands, often growing along riverbanks or in areas with seasonal rainfall. Its ability to withstand drought makes it well adapted to the harsh conditions of its native habitat. Acacia cyanophylla plays an important ecological role by providing shelter and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia cyanophylla was mainly introduced to areas with sandy or loamy soils and a warm, dry climate. It thrives in regions with low rainfall and full sun exposure. This plant is often found in coastal and inland dunes, where it helps stabilize the soil. Its introduction has been associated with ecological restoration projects in arid and semi-arid zones. However, it can become invasive in some environments if not managed properly."
}
