{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wightii",
    "plant_slug": "acacia-wightii",
    "plant_name_scientific": "acacia wightii",
    "intro": "Acacia wightii, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and bipinnate leaves that are finely divided. The plant produces yellow globular flowers that appear in late winter to early spring. Acacia wightii is adapted to arid and semi-arid environments, making it drought-tolerant. It plays an important ecological role by providing nectar for honeybees and other pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wightii is primarily native to the Indian subcontinent, including countries such as India, Nepal, and Bhutan. It is commonly found in arid and semi-arid regions, particularly in the Thar Desert and other dry areas of Rajasthan. This plant thrives in sandy soils and is often seen growing along roadsides and in open woodlands. It is well adapted to high temperatures and low rainfall, making it a resilient species in harsh environments. Acacia wightii is also known for its ability to fix nitrogen, which helps improve soil fertility in its native habitat.",
    "distribution_introduced_art_desc": "Acacia wightii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It has been widely planted for its ability to stabilize soils and provide shade in degraded landscapes. This species is commonly found in regions of Australia, parts of Africa, and the Middle East. Its introduction has sometimes led to the displacement of native vegetation due to its rapid growth and adaptability. However, it is also valued for its ecological and economic benefits in certain environments."
}
