{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia alata var. platyptera",
    "plant_slug": "acacia-alata-var-platyptera",
    "plant_name_scientific": "acacia alata var. platyptera",
    "intro": "Acacia alata var. platyptera, commonly known as the flat-leaf wattle, is a shrub native to Western Australia. It features slender, often spindly stems with small, flat, green leaves that are arranged in a spiral pattern. The plant produces yellow, fluffy inflorescences that bloom during the warmer months, attracting nectar-feeding birds and insects. It is adapted to arid and semi-arid environments, with a deep root system for water retention. This variety is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia alata"
    },
    "taxonomy_art_desc": "Acacia alata var. platyptera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and a wide variety of floral structures. Its order is Fabales, which includes plants known for their legumes and symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia alata, a specific type within the Acacia genus, distinguished by its slender, branching form and small, yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia alata var. platyptera is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the area around Perth. This variety thrives in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the dry and Mediterranean climate of the region. The plant is an important component of the local flora and is often found in open woodlands and heathlands.",
    "distribution_introduced_art_desc": "Acacia alata var. platyptera was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This species is often used for soil stabilization and as a source of firewood due to its hardy nature. However, it can also pose a threat to native vegetation by outcompeting local plant species. Its introduction has led to both ecological and economic impacts in the region."
}
