{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tumida var. pubescens",
    "plant_slug": "acacia-tumida-var-pubescens",
    "plant_name_scientific": "acacia tumida var. pubescens",
    "intro": "Acacia tumida var. pubescens, commonly known as the hairy acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often branched stems and bipinnate leaves that are covered in fine, soft hairs, giving it a fuzzy appearance. The plant produces yellow flowers in globular or cylindrical inflorescences, which are typically followed by flat, pod-like fruits. It is well adapted to drought conditions, with deep roots and a capacity to fix nitrogen through symbiotic relationships with rhizobia. This species is often used in traditional medicine and as a source of fodder for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tumida var. pubescens is primarily native to northern Australia, including parts of Queensland and the Northern Territory. This variety is commonly found in arid and semi-arid regions, often growing in sandy or rocky soils. It is well adapted to the harsh environmental conditions of the Australian outback. The plant is often associated with shrublands and open woodlands. Its distribution is largely restricted to the inland areas of northern Australia.",
    "distribution_introduced_art_desc": "Acacia tumida var. pubescens was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly used in reforestation and land rehabilitation projects due to its hardy nature and ability to thrive in poor soil conditions. This plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped restore biodiversity in arid and semi-arid regions. However, it requires careful management to prevent potential invasiveness in non-native environments."
}
