{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia galioides var. leioclada",
    "plant_slug": "acacia-galioides-var-leioclada",
    "plant_name_scientific": "acacia galioides var. leioclada",
    "intro": "Acacia galioides var. leioclada, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It features slender, upright stems and small, bipinnate leaves that are narrow and often covered in fine hairs. The plant produces yellow, globular flower heads that appear in late winter to early spring. It is well adapted to dry, sandy soils and is often found in coastal and inland regions. The species is valued for its ornamental appeal and is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia galioides var. leioclada is primarily native to the arid and semi-arid regions of South Africa, particularly in the Eastern and Western Cape provinces. This variety thrives in sandy or gravelly soils and is commonly found in shrublands and coastal areas. It is well adapted to the hot, dry climate and can tolerate periods of drought. The plant is often seen growing in open woodlands and along the edges of fynbos vegetation. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acacia galioides var. leioclada was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Cape Province and parts of the Eastern Cape. This plant thrives in sandy or gravelly soils and is often seen in coastal and mountainous areas. Its introduction has led to some ecological concerns due to its invasive potential in certain habitats. It is widely used in horticulture for its ornamental value and ability to tolerate drought conditions."
}
