{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia orbifolia",
    "plant_slug": "acacia-orbifolia",
    "plant_name_scientific": "acacia orbifolia",
    "intro": "Acacia orbifolia, commonly known as the orbifoliate wattle, is a shrub or small tree native to Australia. It is characterized by its distinctive, orb-shaped phyllodes that are typically light green to yellowish in color. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical or cylindrical inflorescences. Acacia orbifolia is adapted to dry, sandy soils and is often found in coastal regions. It is an important species for both ecological and horticultural purposes due to its hardiness and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia orbifolia"
    },
    "taxonomy_art_desc": "Acacia orbifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive arrangement. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive thorned stems and flower heads. Its species is Acacia orbifolia, a specific type of acacia characterized by its orb-shaped leaves and is commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia orbifolia is primarily native to Western Australia. It is commonly found in the south-west region of the state, particularly in areas with sandy soils. This plant thrives in dry, open habitats such as heathlands and coastal dunes. It is well adapted to the Mediterranean climate of the region, with its small, waxy leaves helping to reduce water loss. Acacia orbifolia plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia orbifolia was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland areas where it can establish itself quickly. Its introduction has sometimes led to competition with native vegetation in certain ecosystems. It is often used for ornamental purposes due to its unique foliage and adaptability."
}
