{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lanei",
    "plant_slug": "acacia-lanei",
    "plant_name_scientific": "acacia lanei",
    "intro": "Acacia lanei, commonly known as the coastal acacia, is a shrub native to coastal regions of southern Africa. It is characterized by its slender, branching stems and small, bipinnate leaves that are adapted to reduce water loss in arid environments. The plant produces yellow flowers in compact, globular inflorescences, which attract a variety of pollinators. Its seed pods are elongated and woody, containing numerous small, hard seeds. Acacia lanei plays an important role in stabilizing coastal dunes and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lanei"
    },
    "taxonomy_art_desc": "Acacia lanei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia lanei, a specific type of acacia found in certain regions, known for its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lanei is primarily native to Western Australia. It is found in the arid and semi-arid regions of the state, particularly in the Pilbara and Gascoyne regions. This plant thrives in sandy soils and is commonly seen in spinifex plains and rocky outcrops. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Acacia lanei is well adapted to the harsh climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia lanei was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its rapid growth and ability to spread through seed dispersal have made it a significant ecological concern."
}
