{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pluriglandulosa",
    "plant_slug": "acacia-pluriglandulosa",
    "plant_name_scientific": "acacia pluriglandulosa",
    "intro": "Acacia pluriglandulosa, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often silver-gray branches and its distinctive, feathery foliage. The plant produces yellow globular flower heads that appear in spring, attracting a variety of pollinators. Its small, flat pods contain seeds that are dispersed by wind, contributing to its ecological role in arid and semi-arid regions. Acacia pluriglandulosa is also valued for its ornamental appeal and its ability to thrive in poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pluriglandulosa is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, growing in savannas, grasslands, and rocky outcrops. This plant thrives in well-drained soils and is adapted to withstand drought conditions. It is often seen along roadsides and in open woodlands where it forms part of the local vegetation. Its distribution is closely linked to the climate and soil conditions of the region.",
    "distribution_introduced_art_desc": "Acacia pluriglandulosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is valued for its hardiness and ability to withstand drought conditions. However, it has also been reported to spread aggressively, potentially outcompeting native vegetation. Its introduction has raised concerns about its impact on local ecosystems."
}
