{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia multipinnata",
    "plant_slug": "acacia-multipinnata",
    "plant_name_scientific": "acacia multipinnata",
    "intro": "Acacia multipinnata, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its slender, wiry branches and bipinnate leaves that are finely divided. The plant produces yellow globular flowers, which are typically arranged in dense clusters. Acacia multipinnata is well adapted to arid and semi-arid environments, showing drought tolerance. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia multipinnata is primarily native to northern Australia, including regions such as Queensland, the Northern Territory, and Western Australia. It thrives in arid and semi-arid environments, often found in sandplain and lateritic soils. This plant is commonly associated with dry woodlands and shrublands, where it contributes to the local ecosystem. Its distribution extends into parts of New Guinea and some islands in the Indo-Pacific region. Acacia multipinnata is well adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia multipinnata was mainly introduced to Australia as a potential ornamental and for its potential use in soil stabilization. It was also considered for its ability to thrive in arid and semi-arid conditions, making it a candidate for land reclamation projects. However, its introduction has raised concerns due to its potential invasiveness and impact on native ecosystems. Despite its benefits, it is now classified as a weed in several regions of Australia. Its spread has been monitored closely to prevent ecological disruption."
}
