{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia semlikiensis",
    "plant_slug": "acacia-semlikiensis",
    "plant_name_scientific": "acacia semlikiensis",
    "intro": "Acacia semlikiensis, commonly known as the Semliki acacia, is a shrub or small tree native to the tropical regions of Africa. It is characterized by its slender, branching structure and produces small, yellowish flowers that bloom in clusters. The plant has phyllodes, which are modified leaf stalks that function as leaves, and these are typically narrow and pointed. Acacia semlikiensis is adapted to grow in dry, sandy soils and is often found in savanna and woodland habitats. It plays a role in local ecosystems by providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia semlikiensis is primarily native to the tropical rainforests of eastern Africa, particularly in the Democratic Republic of the Congo and the northern regions of Uganda. It is commonly found in the Semliki River Basin, where the climate is humid and the vegetation is dense. This species thrives in lowland areas with high rainfall and is often associated with swampy or wetland habitats. It is an important component of the local ecosystem, providing food and shelter for various wildlife species. Due to its restricted habitat, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acacia semlikiensis was mainly introduced to regions with tropical and subtropical climates, particularly in areas with well-drained soils and adequate sunlight. It is commonly found in savannas, woodlands, and along riverbanks in parts of Africa. This plant has been introduced to several countries, including Tanzania, Uganda, and Kenya, where it has adapted well to local conditions. Its rapid growth and ability to thrive in poor soil make it a valuable species for erosion control and land rehabilitation. However, it can also become invasive in some areas if not managed properly."
}
