{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ancistrophylla",
    "plant_slug": "acacia-ancistrophylla",
    "plant_name_scientific": "acacia ancistrophylla",
    "intro": "Acacia ancistrophylla, commonly known as the narrow-leaf wattle, is a small shrub native to the arid and semi-arid regions of Australia. It features slender, often spiny stems and narrow, feathery leaves that help reduce water loss in its harsh environment. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. It is well adapted to drought and can thrive in poor soils, making it a resilient component of its ecosystem. The species is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ancistrophylla"
    },
    "taxonomy_art_desc": "Acacia ancistrophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, which includes plants with flowers that typically have five petals and are often associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and the ability to fix nitrogen through root nodules. Its genus is Acacia, a large genus of shrubs and trees known for their unique leaf structures and often used in traditional medicine and land restoration. Its species is Acacia ancistrophylla, a specific type of acacia found in certain regions of Australia, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ancistrophylla is primarily native to South Australia, Victoria, and Western Australia. This species is commonly found in arid and semi-arid regions within these states. It typically grows in sandy or gravelly soils, often in open woodlands or shrublands. The plant is well adapted to the dry climate and can tolerate poor soil conditions. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia ancistrophylla was mainly introduced to South Australia and parts of Western Australia. It is commonly found in coastal and semi-arid regions, often growing in sandy or gravelly soils. This plant is typically found in open woodlands and shrublands, where it forms dense thickets. It is well adapted to dry conditions and can tolerate salt spray, making it suitable for coastal areas. However, it is considered a potential weed in some regions due to its rapid growth and ability to spread aggressively."
}
