{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sericata",
    "plant_slug": "acacia-sericata",
    "plant_name_scientific": "acacia sericata",
    "intro": "Acacia sericata, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branched stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow to orange globular inflorescences, which are composed of numerous small, fragrant flowers. Acacia sericata is adapted to arid and semi-arid environments, often growing on rocky soils. It is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sericata"
    },
    "taxonomy_art_desc": "Acacia sericata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods as fruits and often having nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive thorned stems and often bipinnate leaves, commonly found in arid environments. Its species is Acacia sericata, a specific type of acacia known for its silky-hairy leaves and is typically found in certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sericata is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This plant thrives in dry, sandy soils and is often seen in shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia sericata plays an important role in the local ecosystem by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia sericata was mainly introduced to control soil erosion and for its ornamental value in landscaping. It is commonly found in disturbed soils and along roadsides in regions with a Mediterranean climate. This plant has adapted well to dry conditions and can thrive in areas with low rainfall. Its rapid growth and ability to fix nitrogen make it useful for soil stabilization. However, it can become invasive if not managed properly."
}
