{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chapmanii subsp. chapmanii",
    "plant_slug": "acacia-chapmanii-subsp-chapmanii",
    "plant_name_scientific": "acacia chapmanii subsp. chapmanii",
    "intro": "Acacia chapmanii subsp. chapmanii, commonly known as the Chapman's wattle, is a small shrub native to the arid regions of southern Australia. It is characterized by its slender, zigzagging stems and bipinnate leaves composed of numerous small, needle-like leaflets. The plant produces yellow globular flower heads that appear in late winter to early spring, attracting nectar-feeding birds and insects. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. The species is often used in rehabilitation projects due to its resilience and ability to stabilize soil in degraded landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chapmanii"
    },
    "taxonomy_art_desc": "Acacia chapmanii subsp. chapmanii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as ornamental plants. Its species is Acacia chapmanii, a specific type of acacia found in certain regions of Africa, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chapmanii subsp. chapmanii is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in areas characterized by sandy soils and Mediterranean climates. This subspecies is commonly associated with coastal and near-coastal habitats, including dunes and heathlands. It thrives in well-drained soils and is often found in open woodlands and shrublands. The plant is well adapted to the dry and sunny conditions typical of its native range.",
    "distribution_introduced_art_desc": "Acacia chapmanii subsp. chapmanii was mainly introduced to South Africa, where it is commonly found in the coastal regions of the Eastern and Western Cape provinces. It thrives in sandy soils and is often found along the shoreline, where it plays a role in stabilizing dunes and preventing erosion. This subspecies is well adapted to coastal conditions, including salt spray and strong winds. It is also used in local landscaping due to its hardy nature and attractive foliage. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
