{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stipuligera subsp. glabrifolia",
    "plant_slug": "acacia-stipuligera-subsp-glabrifolia",
    "plant_name_scientific": "acacia stipuligera subsp. glabrifolia",
    "intro": "Acacia stipuligera subsp. glabrifolia, commonly known as the smooth-leaved wattle, is a shrub native to eastern Australia. It is characterized by its slender, often multi-branched stems and pinnate leaves with small, reduced stipules. The plant produces yellow flowers in globular or cylindrical clusters, typical of the Acacia genus. It thrives in a variety of soil types but prefers well-drained conditions. The subspecies is distinguished by its glabrous (smooth) leaflets and reduced stipules, setting it apart from other acacia species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stipuligera subsp. glabrifolia is primarily native to the western regions of Australia, specifically in the states of Western Australia and South Australia. It is commonly found in arid and semi-arid environments, including shrublands and open woodlands. This subspecies thrives in well-drained soils and is often associated with coastal and inland dunes. It is adapted to withstand drought and high temperatures, making it a resilient component of the local flora. Its distribution is limited to specific ecological zones where it plays a role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia stipuligera subsp. glabrifolia was mainly introduced to regions with a Mediterranean climate, characterized by dry summers and wet winters. It thrives in well-drained soils and is commonly found in coastal and inland areas with mild temperatures. This subspecies is often cultivated for its ornamental value due to its attractive foliage and ability to tolerate drought conditions. It has been introduced to parts of California, Oregon, and other regions in the United States. However, its spread is limited by its preference for specific environmental conditions and its relatively slow growth rate."
}
