{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia montana",
    "plant_slug": "acacia-montana",
    "plant_name_scientific": "acacia montana",
    "intro": "Acacia montana, commonly known as the mountain acacia, is a shrub native to the mountainous regions of South America. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow floral spikes. The plant is adapted to high-altitude environments, often growing in rocky or well-drained soils. Its flowers are important for pollinators, and its seeds are encased in hard pods. Acacia montana is valued for its ecological role and has limited commercial use.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia montana"
    },
    "taxonomy_art_desc": "Acacia montana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its distinctive fruit type and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often for their ability to fix nitrogen. Its species is Acacia montana, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia montana is primarily native to New South Wales, Queensland, South Australia, and Victoria. It is commonly found in dry sclerophyll forests and woodlands across these regions. This plant thrives in well-drained soils and is often associated with rocky or sandy substrates. It is well adapted to the semi-arid to temperate climates of its native range. Acacia montana plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia montana was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing capabilities, which improve soil fertility. Its introduction has helped in restoring degraded lands across various parts of Australia. However, it has also been noted to spread aggressively, sometimes becoming invasive in non-native environments."
}
