{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dallachiana",
    "plant_slug": "acacia-dallachiana",
    "plant_name_scientific": "acacia dallachiana",
    "intro": "Acacia dallachiana, commonly known as the desert wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, zigzagging stems and clusters of small, yellow flowers that bloom in spring. The plant has bipinnate leaves, which are divided into numerous small leaflets, allowing it to reduce water loss in harsh environments. Acacia dallachiana is well adapted to drought and poor soil conditions, making it a resilient component of desert ecosystems. Its nectar-rich flowers also serve as an important food source for native pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dallachiana"
    },
    "taxonomy_art_desc": "Acacia dallachiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinctive morphology and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia dallachiana, a specific type of acacia found in certain regions, noted for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dallachiana is primarily native to New South Wales and Victoria. This species is commonly found in the dry, inland regions of these states. It thrives in sandy or gravelly soils and is often seen in open woodlands and grasslands. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia dallachiana was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. This plant is also valued for its drought tolerance and capacity to fix nitrogen, improving soil fertility. It has been introduced to several countries in the Middle East and parts of Africa. However, its introduction has raised concerns about potential invasiveness in some ecosystems."
}
