{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia uncifera",
    "plant_slug": "acacia-uncifera",
    "plant_name_scientific": "acacia uncifera",
    "intro": "Acacia uncifera, commonly known as the narrow-leaved wattle, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often spiny stems and narrow, linear leaves that reduce water loss in harsh environments. The plant produces yellow flowers in compact, spherical clusters, which attract a variety of pollinators such as bees and birds. Its seeds are enclosed in woody pods and are adapted for dispersal by wind or animals. Acacia uncifera is well-suited to dry climates and is often used in ecological restoration projects due to its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia uncifera"
    },
    "taxonomy_art_desc": "Acacia uncifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes and have a symbiotic relationship with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive thorn-like structures and ability to thrive in arid environments. Its species is Acacia uncifera, a specific type of acacia known for its narrow leaves and is commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia uncifera is primarily native to Queensland. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy soils and is often associated with dry woodland and shrubland habitats. It plays an important ecological role in stabilizing soil and providing shelter for native wildlife. Acacia uncifera is well adapted to the harsh environmental conditions of Queensland's inland areas.",
    "distribution_introduced_art_desc": "Acacia uncifera was mainly introduced to areas with arid or semi-arid climates due to its ability to thrive in harsh conditions. It has been widely planted for its hardy nature and potential for soil stabilization. The plant is often used in reclamation projects to prevent erosion in degraded lands. However, its introduction has sometimes led to ecological concerns due to its invasive tendencies in certain regions. Its distribution is now expanding beyond its original range in Africa."
}
