{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia burbidgeae",
    "plant_slug": "acacia-burbidgeae",
    "plant_name_scientific": "acacia burbidgeae",
    "intro": "Acacia burbidgeae, commonly known as the Burridge acacia, is a shrub or small tree native to South Africa. It is characterized by its slender, zigzagging branches and small, leathery leaves that are often clustered at the ends of the stems. The plant produces yellow flowers in globular or cylindrical inflorescences, which bloom during the summer months. Acacia burbidgeae is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for rocky or sandy soils. It is often used in landscaping for its ornamental value and ability to thrive in challenging conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia burbidgeae"
    },
    "taxonomy_art_desc": "Acacia burbidgeae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by its floral structures. Its order is Fabales, which includes legumes and related plants, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa and Australia, known for their distinctive phyllodes and often used for timber or as ornamental plants. Its species is Acacia burbidgeae, a specific type of acacia native to Australia, recognized for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia burbidgeae is primarily native to New South Wales and Queensland in Australia. This species is commonly found in dry sclerophyll forests and woodland habitats. It thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Acacia burbidgeae is often associated with sandy or rocky soils in these areas. Its distribution is largely confined to the eastern part of Australia, where it plays an important ecological role.",
    "distribution_introduced_art_desc": "Acacia burbidgeae was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It has since become naturalized in various regions, particularly in the North Island, where it thrives in disturbed soils and open habitats. Despite its aesthetic appeal, it is considered a potential weed in some areas due to its ability to spread rapidly. The plant's introduction has raised concerns about its impact on native ecosystems and biodiversity. Efforts are ongoing to monitor and manage its distribution to prevent ecological disruption."
}
