{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia baueri subsp. aspera",
    "plant_slug": "acacia-baueri-subsp-aspera",
    "plant_name_scientific": "acacia baueri subsp. aspera",
    "intro": "Acacia baueri subsp. aspera, commonly known as the rough acacia, is a shrub or small tree native to southern Africa. It is characterized by its grey-green, narrow, and often thorn-bearing leaves. The plant produces yellow spherical flowers that appear in winter, followed by flat, woody pods containing seeds. It thrives in arid and semi-arid environments, often growing on rocky soils. The subspecies is distinguished by its rough, hairy stems and leaves compared to other acacia species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia baueri"
    },
    "taxonomy_art_desc": "Acacia baueri subsp. aspera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often exhibiting complex structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic pod-like fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorn-like branches and small, fragrant flowers. Its species is Acacia baueri, a specific type within the Acacia genus, which is further divided into subspecies, with subsp. aspera being one of its recognized variants.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia baueri subsp. aspera is primarily native to New South Wales. It is commonly found in the arid and semi-arid regions of the state. This subspecies thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. Its distribution is largely restricted to the inland areas of New South Wales.",
    "distribution_introduced_art_desc": "Acacia baueri subsp. aspera was mainly introduced to areas with well-drained soils and a Mediterranean climate, particularly in southern Australia. It is commonly found in coastal regions and sandy soils where it thrives in full sun. This subspecies is often used in landscaping due to its drought tolerance and ornamental value. Its introduction has led to its establishment in both natural and cultivated environments. However, it is important to monitor its spread to prevent potential ecological impacts."
}
