{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drepanocarpa subsp. latifolia",
    "plant_slug": "acacia-drepanocarpa-subsp-latifolia",
    "plant_name_scientific": "acacia drepanocarpa subsp. latifolia",
    "intro": "Acacia drepanocarpa subsp. latifolia, commonly known as the broad-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are broad and often have a silvery underside. The plant produces yellow floral spikes that bloom in spring, attracting various pollinators. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The plant is also valued for its ornamental appeal and is used in landscaping and reforestation projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia drepanocarpa"
    },
    "taxonomy_art_desc": "Acacia drepanocarpa subsp. latifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, a group that includes ferns and their allies, known for their diverse forms and ecological adaptations. Its subclass is Magnoliidae, which encompasses a wide range of flowering plants, including many economically important species. Its order is Fabales, a group of flowering plants that includes legumes and other plants with distinctive floral structures. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia drepanocarpa, a specific type of acacia that includes the subspecies latifolia, which is distinguished by its broader leaves and specific geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drepanocarpa subsp. latifolia is primarily native to Northern Territory, Queensland, and Western Australia. This subspecies is commonly found in arid and semi-arid regions across these areas. It thrives in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia drepanocarpa subsp. latifolia was mainly introduced to areas with well-drained soils and a warm, temperate climate, often in regions where it is used for soil stabilization and as a source of timber. It thrives in full sun and is commonly found in coastal and inland areas with moderate rainfall. This subspecies is particularly valued for its hardiness and ability to grow in poor soil conditions. It has been introduced to several parts of Australia and other regions with similar climatic conditions. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
