{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fecunda",
    "plant_slug": "acacia-fecunda",
    "plant_name_scientific": "acacia fecunda",
    "intro": "Acacia fecunda, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its bright yellow flowers, which are clustered in spherical inflorescences. The plant has bipinnate leaves composed of numerous small leaflets. It thrives in a variety of soil types but prefers well-drained soils. Acacia fecunda is also known for its ability to fix nitrogen, making it an important plant in ecological restoration efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia fecunda"
    },
    "taxonomy_art_desc": "Acacia fecunda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is distinguished by its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their acacia-like appearance and often used for timber and traditional medicine. Its species is Acacia fecunda, a specific type of acacia that is likely found in specific habitats and may have unique ecological roles.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fecunda is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often seen in coastal and inland areas. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia fecunda plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia fecunda was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low to moderate rainfall. This plant thrives in full sun and is often used for erosion control due to its extensive root system. It has been introduced to several parts of Australia and the United States. Its rapid growth and adaptability make it a popular choice for reforestation and landscaping projects."
}
