{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gordonii",
    "plant_slug": "acacia-gordonii",
    "plant_name_scientific": "acacia gordonii",
    "intro": "Acacia gordonii, commonly known as the Gordon acacia, is a deciduous shrub or small tree native to eastern and southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, opposite leaflets. The plant produces yellow flowers in clusters, which are followed by long, narrow pods containing seeds. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia gordonii is also valued for its role in soil stabilization and as a source of timber and traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gordonii"
    },
    "taxonomy_art_desc": "Acacia gordonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive characteristics and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are often legumes, characterized by their unique fruit type, the legume. Its family is Fabaceae, commonly known as the legume or bean family, which is recognized for its nitrogen-fixing ability and distinctive pod fruits. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and seasonal environments, known for their thorn-like stems and fluffy flower heads. Its species is Acacia gordonii, a specific type of acacia native to East Africa, characterized by its slender branches and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gordonii is primarily native to New South Wales. It is commonly found in the coastal regions and sandy soils of the state. This species thrives in dry, open habitats such as dunes and heathlands. It is well adapted to the Mediterranean climate of the area, with hot, dry summers and mild, wet winters. Acacia gordonii plays an important role in the local ecosystem, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia gordonii was mainly introduced to areas with a tropical and subtropical climate, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Kenya, Uganda, and Tanzania. This plant is often used for its valuable timber and as a source of fuelwood. Additionally, it plays an important role in soil stabilization and provides habitat for various wildlife species. Its introduction has also been associated with afforestation efforts in some parts of its range."
}
