{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stellata",
    "plant_slug": "acacia-stellata",
    "plant_name_scientific": "acacia stellata",
    "intro": "Acacia stellata, commonly known as the star acacia, is a shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are typically bipinnate and covered in fine hairs. The plant produces yellow flowers in globular inflorescences, which are highly attractive to pollinators such as bees and birds. Acacia stellata is adapted to arid environments, with deep roots that allow it to survive in dry conditions. It is also valued for its hard, durable wood and has been used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stellata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry and hot climates. This plant is well adapted to withstand drought conditions and is often seen growing along roadsides and in disturbed soils. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia stellata is also known for its distinctive star-shaped leaves and yellow flowers, which make it a notable plant in its native range.",
    "distribution_introduced_art_desc": "Acacia stellata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy soils. The plant is known for its distinctive star-shaped leaves and yellow flowers, which make it a popular ornamental species. However, it has also been reported to spread aggressively in some areas, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact and management in local ecosystems."
}
