{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia robbertsei",
    "plant_slug": "acacia-robbertsei",
    "plant_name_scientific": "acacia robbertsei",
    "intro": "Acacia robbertsei, commonly known as the Robberts' acacia, is a shrub or small tree native to South Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features straight, often thorned stems and bipinnate leaves with small, oval-shaped leaflets. It produces yellow flowers in clusters, which are followed by long, narrow seed pods. Acacia robbertsei is adapted to arid environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia robbertsei is primarily native to South Africa, specifically the Western Cape Province. It is commonly found in fynbos vegetation, which is a unique biome characterized by its rich biodiversity and Mediterranean climate. This plant thrives in well-drained soils and is often found in coastal and mountainous regions. It is adapted to the region's seasonal rainfall patterns and can tolerate periods of drought. Acacia robbertsei plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia robbertsei was mainly introduced to South Africa, where it has been established in certain regions. It is commonly found in areas with sandy or gravelly soils, particularly in the Western Cape. The plant is often used for ornamental purposes due to its distinctive appearance and ability to thrive in dry conditions. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
