{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia delicatula",
    "plant_slug": "acacia-delicatula",
    "plant_name_scientific": "acacia delicatula",
    "intro": "Acacia delicatula, commonly known as the slender wattle, is a small shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its narrow, feathery leaves. The plant produces yellow flowers in spherical or cylindrical clusters, which are typical of the acacia genus. Acacia delicatula is often found in arid and semi-arid regions, where it adapts well to harsh environmental conditions. Its seeds are enclosed in woody pods and can remain dormant in the soil for extended periods.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia delicatula"
    },
    "taxonomy_art_desc": "Acacia delicatula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and a symbiotic relationship with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often complex inflorescences. Its species is Acacia delicatula, a specific type of acacia known for its delicate appearance and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia delicatula is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. The plant thrives in sandy or rocky soils and is often seen in shrublands and woodland habitats. It plays an important ecological role by providing habitat and food for local wildlife. Its distribution is closely linked to the environmental conditions of the regions it inhabits.",
    "distribution_introduced_art_desc": "Acacia delicatula was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for stabilizing soil and preventing erosion due to its deep root system. It is also valued for its ornamental qualities, making it a popular choice for landscaping in dry environments. However, its introduction has sometimes led to competition with native species in certain ecosystems."
}
