{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia applanata",
    "plant_slug": "acacia-applanata",
    "plant_name_scientific": "acacia applanata",
    "intro": "Acacia applanata, commonly known as the flat-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its flat, narrow leaves and yellow flowers that bloom in clusters. The plant is part of the legume family, Fabaceae, and has a deep root system that helps it survive in arid conditions. Acacia applanata is often found in sandy soils and is adapted to coastal and inland environments. Its seeds are enclosed in pods and are an important food source for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia applanata"
    },
    "taxonomy_art_desc": "Acacia applanata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often featuring unique structures like strobili. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five parts and include legumes, which are known for nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or bean family, characterized by pod fruits and nitrogen-fixing symbiosis with rhizobia. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive thorn-like stems and acicular leaves. Its species is Acacia applanata, a specific type of acacia found in certain regions, characterized by its flattened, leaf-like structures and adapted to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia applanata is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the area known as the Geraldton area. This plant thrives in sandy soils and is often associated with coastal and inland habitats. It is a small shrub that plays an important role in the local ecosystem. Acacia applanata is well adapted to the arid and semi-arid conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia applanata was mainly introduced to areas with sandy or gravelly soils, particularly in regions with a Mediterranean climate. It thrives in well-drained soils and full sun exposure, making it suitable for coastal and inland environments. This plant is often used in reforestation and erosion control due to its hardy nature and ability to withstand drought. It has been introduced to several countries in the Mediterranean and parts of Australia for its ecological and ornamental value. However, in some regions, it has become invasive, outcompeting native vegetation."
}
