{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia centrophylla",
    "plant_slug": "acacia-centrophylla",
    "plant_name_scientific": "acacia centrophylla",
    "intro": "Acacia centrophylla, commonly known as the narrow-leaf wattle, is a shrub native to southeastern Australia. It is characterized by its feathery, yellow flowers that bloom in late summer and early autumn. The plant has thin, wiry stems and narrow, bipinnate leaves that are often covered in fine hairs. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia centrophylla is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Jamaica"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia centrophylla is primarily native to Jamaica. It is commonly found in the island's dry limestone regions and coastal areas. This plant thrives in well-drained soils and is often seen in open woodlands and savannas. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its presence is a key indicator of the unique biodiversity found in Jamaica's dry forest habitats.",
    "distribution_introduced_art_desc": "Acacia centrophylla was mainly introduced to New Zealand as part of ecological restoration efforts and for its ornamental value. It is commonly found in coastal and urban areas where it thrives in well-drained soils. The plant is known for its ability to fix nitrogen, which makes it useful in rehabilitating degraded land. However, it has also been classified as an environmental weed due to its potential to invade native ecosystems. Its distribution is now widespread across various regions of New Zealand."
}
