{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustissima var. chisosiana",
    "plant_slug": "acacia-angustissima-var-chisosiana",
    "plant_name_scientific": "acacia angustissima var. chisosiana",
    "intro": "Acacia angustissima var. chisosiana, commonly known as the Chisos acacia, is a shrub or small tree native to the Chisos Mountains in Texas. It is characterized by its narrow, feather-like leaves and produces yellow, globular flower heads. The plant is adapted to arid and rocky environments, showcasing drought tolerance and efficient water use. Its bark is often fissured, and it has a woody, twisted trunk. This variety is part of the legume family, capable of nitrogen fixation, which benefits soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustissima var. chisosiana is primarily native to the Chisos Mountains in West Texas, specifically in the Big Bend region. This variety is found in the Chisos Mountains, which are part of the Chihuahuan Desert ecosystem. It thrives in rocky soils and is commonly found in canyons and along stream banks. The plant is adapted to the arid and semi-arid conditions of the region. It is a shrub or small tree that plays an important role in the local flora and habitat.",
    "distribution_introduced_art_desc": "Acacia angustissima var. chisosiana was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its hardy nature and ability to thrive in poor soil conditions. This plant is also valued for its drought tolerance and can contribute to the establishment of vegetation in degraded landscapes. Its introduction has helped in restoring ecological balance in areas affected by desertification. However, it is important to monitor its spread to prevent potential invasiveness in native ecosystems."
}
