{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trineura",
    "plant_slug": "acacia-trineura",
    "plant_name_scientific": "acacia trineura",
    "intro": "Acacia trineura, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves composed of numerous small, needle-like leaflets. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and semi-arid regions. Acacia trineura is also valued for its ornamental appeal and ability to fix nitrogen, benefiting soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia trineura"
    },
    "taxonomy_art_desc": "Acacia trineura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its vascular system and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which includes legumes and related plants, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa, Australia, and the Americas, known for their distinctive phyllodes and often used for timber or as ornamental plants. Its species is Acacia trineura, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trineura is primarily native to New South Wales, South Australia, and Victoria. This plant is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. Acacia trineura is well adapted to the climate and soil conditions of its native range. Its distribution reflects its ability to survive in harsh, low-resource environments.",
    "distribution_introduced_art_desc": "Acacia trineura was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond cultivated areas and is now found in various habitats, including disturbed soils and coastal regions. The plant's rapid growth and ability to colonize open spaces have led to its classification as an environmental weed in some regions. Its introduction has raised concerns about its impact on native ecosystems and biodiversity. Management efforts are ongoing to control its spread and mitigate its ecological effects."
}
