{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia venusta",
    "plant_slug": "acacia-venusta",
    "plant_name_scientific": "acacia venusta",
    "intro": "Acacia venusta, commonly known as the golden wattle, is a flowering plant native to Australia. It is characterized by its distinctive yellow flowers and bipinnate leaves. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. Acacia venusta thrives in a variety of soil types but prefers well-drained conditions. It is often cultivated for its ornamental value and is a symbol of Australian national identity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia venusta is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the northern and central parts of the country, including the Northern Territory, Queensland, and Western Australia. This species thrives in sandy soils and is often seen in dry woodlands and shrublands. It is well adapted to the harsh conditions of its native habitat, including high temperatures and low rainfall. Acacia venusta plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia venusta was mainly introduced to coastal and sandy areas for its ornamental value and ability to stabilize dunes. It is commonly found in regions with well-drained soils and full sun exposure. The plant is known for its fragrant yellow flowers and its capacity to thrive in harsh environmental conditions. Due to its rapid growth and adaptability, it has been used in erosion control and landscaping projects. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
