{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia runciformis",
    "plant_slug": "acacia-runciformis",
    "plant_name_scientific": "acacia runciformis",
    "intro": "Acacia runciformis, commonly known as the umbrella acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive, flat, umbrella-like crown formed by its dense, spreading branches. The plant produces yellow flowers in summer, which are clustered in spherical inflorescences. Its leaves are bipinnate, meaning they are divided into small, feathery leaflets. Acacia runciformis is well adapted to arid environments and is often used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia runciformis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy soils and is commonly found in savannas and shrublands. This plant is well adapted to dry conditions and can survive in areas with low rainfall. It is often seen growing along roadsides and in open grasslands. Its distinctive rounded leaves and yellow flowers make it a notable species in its native habitat.",
    "distribution_introduced_art_desc": "Acacia runciformis was mainly introduced to areas with warm, arid climates and well-drained soils, often as an ornamental or for erosion control. It thrives in regions with full sun exposure and moderate to high levels of rainfall. The plant is commonly found in coastal and inland regions of Australia, as well as in parts of Southeast Asia. Its rapid growth and ability to spread through seed dispersal have made it a potential invasive species in some environments. Due to its adaptability, it has been introduced to various regions outside its native range for agricultural or landscaping purposes."
}
