{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia furcatispina",
    "plant_slug": "acacia-furcatispina",
    "plant_name_scientific": "acacia furcatispina",
    "intro": "Acacia furcatispina, commonly known as the broad-leaf acacia, is a shrub or small tree native to southern Africa. It features slender, often multi-branched stems with a greyish bark that becomes fissured with age. The plant produces small, yellow flowers arranged in dense, spherical inflorescences, which are typical of the Acacia genus. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia furcatispina is adapted to arid and semi-arid environments, making it a resilient plant in regions with limited rainfall.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia furcatispina is primarily native to northern Australia, including parts of Queensland, Western Australia, and the Northern Territory. It is commonly found in arid and semi-arid regions, particularly in sandy soils and open woodlands. This species thrives in environments with low rainfall and high temperatures. It is often associated with coastal and inland dune systems. Its distribution is also extended to some parts of New Guinea.",
    "distribution_introduced_art_desc": "Acacia furcatispina was mainly introduced to South Africa for its ornamental value and potential for soil stabilization. It is commonly found in coastal areas and sandy soils, where it thrives in well-drained conditions. The plant is also used in reforestation projects due to its fast growth rate and ability to withstand harsh environmental conditions. However, it has been identified as an invasive species in some regions, outcompeting native vegetation. Its introduction has led to ecological concerns, prompting management strategies to control its spread."
}
