{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dineura",
    "plant_slug": "acacia-dineura",
    "plant_name_scientific": "acacia dineura",
    "intro": "Acacia dineura, commonly known as the silky oak, is a tropical tree native to Australia. It is characterized by its distinctive, feathery leaves that are covered in fine, silky hairs, giving it a soft appearance. The plant produces yellow, globular flowers that bloom in clusters, attracting various pollinators such as bees and birds. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its spread in suitable habitats. The tree is valued for its hard, durable wood and is often used in landscaping and for its ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dineura is primarily native to eastern Australia, including the states of Queensland, New South Wales, and Victoria. It is commonly found in dry sclerophyll forests and open woodlands. This species thrives in regions with a temperate to subtropical climate. It prefers well-drained soils and is often associated with rocky or sandy substrates. Acacia dineura plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia dineura was mainly introduced to areas with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soil conditions. It has been planted in various parts of Australia, particularly in regions where it is used for soil stabilization and as a source of timber. However, its introduction has led to concerns about its invasive potential in some ecosystems. The plant's rapid growth and ability to form dense thickets can outcompete native vegetation. Despite its ecological impacts, Acacia dineura is valued for its hardiness and multiple uses in agriculture and land management."
}
