{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassuloides",
    "plant_slug": "acacia-crassuloides",
    "plant_name_scientific": "acacia crassuloides",
    "intro": "Acacia crassuloides, commonly known as the dwarf acacia or stone flower, is a shrub native to southern Africa. It is characterized by its dense, compact growth habit and small, rounded leaves that are often covered in a fine layer of white wax. The plant produces yellow flowers in clusters, which bloom in late winter to early spring. It is well adapted to arid and semi-arid environments, thriving in well-drained soils. Due to its drought tolerance and ornamental appearance, it is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia crassuloides"
    },
    "taxonomy_art_desc": "Acacia crassuloides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and commercial contexts. Its species is Acacia crassuloides, a specific type of acacia known for its compact growth and adaptations to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassuloides is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species typically grows in rocky outcrops and sandy soils. It is well adapted to the arid and semi-arid climates of its native habitat. The plant is often seen in coastal and inland areas where it thrives in well-drained conditions.",
    "distribution_introduced_art_desc": "Acacia crassuloides was mainly introduced to control erosion and as an ornamental plant in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its hardy nature. The plant has a dense root system that helps stabilize soil and prevent further degradation. Its small, dense foliage makes it suitable for windbreaks and habitat restoration projects. However, it can become invasive in some areas if not managed properly."
}
