{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata var. pendula",
    "plant_slug": "acacia-armata-var-pendula",
    "plant_name_scientific": "acacia armata var. pendula",
    "intro": "Acacia armata var. pendula, commonly known as the weeping acacia, is a variant of the native Australian acacia species. It is characterized by its drooping, feathery foliage that gives it a distinctive, ornamental appearance. The plant produces yellow flowers in winter, which are clustered in cylindrical spikes. It is a hardy shrub or small tree that thrives in well-drained soils and full sun. Its unique form makes it a popular choice for landscaping in arid and semi-arid regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata var. pendula is primarily native to the arid and semi-arid regions of southern Australia, particularly in Western Australia and South Australia. It is commonly found in areas with sandy soils and is often associated with coastal and inland dunes. This variety is known for its distinctive pendulous branches and yellow flowers, which make it a notable feature in its native habitat. It thrives in environments with low rainfall and high temperatures. The plant plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia armata var. pendula was mainly introduced to South Australia for its ornamental value and adaptability to arid conditions. It is commonly found in gardens and along roadsides due to its distinctive weeping habit and drought tolerance. The plant has become naturalized in some areas, posing a potential risk to native vegetation. Its rapid growth and ability to thrive in poor soils contribute to its spread. Proper management is recommended to prevent it from becoming invasive in local ecosystems."
}
