{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucocarpa",
    "plant_slug": "acacia-glaucocarpa",
    "plant_name_scientific": "acacia glaucocarpa",
    "intro": "Acacia glaucocarpa, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, grey-green phyllodes and yellow flower spikes that appear in spring. The plant is well adapted to arid and semi-arid environments, with a deep root system for water uptake. It produces small, woody pods that contain flattened seeds. The species is often used in reforestation projects due to its hardiness and ability to stabilize soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia glaucocarpa"
    },
    "taxonomy_art_desc": "Acacia glaucocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is notable for its primitive floral structures. Its order is Fabales, which includes legumes and other plants with distinctive flower structures and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found primarily in arid and tropical regions, known for their unique foliage and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia glaucocarpa, a specific type of acacia found in certain regions of Australia, recognized for its distinctive blue-gray foliage and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucocarpa is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This species typically grows in open woodlands and along riverbanks. It thrives in well-drained soils and is often associated with dry or semi-arid environments. The plant is well adapted to the climate and ecological conditions of Queensland.",
    "distribution_introduced_art_desc": "Acacia glaucocarpa was mainly introduced to South Africa, where it has been widely planted for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides, particularly in the Western Cape and Eastern Cape provinces. The plant is well adapted to the local climate and requires minimal water, making it a popular choice for landscaping. However, its invasive potential has raised concerns in some areas, leading to calls for controlled planting. Despite its benefits, it is important to manage its spread to prevent ecological disruption."
}
