{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nuperrima subsp. cassitera",
    "plant_slug": "acacia-nuperrima-subsp-cassitera",
    "plant_name_scientific": "acacia nuperrima subsp. cassitera",
    "intro": "Acacia nuperrima subsp. cassitera, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping branches and phyllodes that are narrow and linear. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in sandy or gravelly soils and is commonly found in coastal and inland regions. The species is valued for its ornamental appeal and its ability to withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nuperrima subsp. cassitera is primarily native to northern Australia, including parts of Queensland and the Northern Territory. This subspecies thrives in arid and semi-arid regions, often found in sandy soils and open woodlands. It is commonly associated with coastal and inland dune systems, where it plays a role in stabilizing sand dunes. The plant is well adapted to harsh environmental conditions, including high temperatures and low rainfall. Its distribution is largely restricted to the tropical and subtropical zones of northern Australia.",
    "distribution_introduced_art_desc": "Acacia nuperrima subsp. cassitera was mainly introduced to South Africa, particularly in the Eastern Cape and Western Cape provinces. It is commonly found in coastal areas and along the edges of fynbos vegetation. This subspecies is often cultivated for its ornamental value due to its distinctive foliage and ability to thrive in coastal conditions. It has also been introduced to other regions with similar climates, such as parts of Australia and New Zealand. However, its spread is limited by its preference for specific soil and climatic conditions."
}
