{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dacrydioides",
    "plant_slug": "acacia-dacrydioides",
    "plant_name_scientific": "acacia dacrydioides",
    "intro": "Acacia dacrydioides, commonly known as the golden wattle, is a flowering plant native to Australia. It is characterized by its distinctive yellow flowers and feathery leaves. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. It thrives in a variety of habitats, including woodlands and open grasslands. Acacia dacrydioides plays an important ecological role and is also a symbol of Australia's natural heritage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dacrydioides"
    },
    "taxonomy_art_desc": "Acacia dacrydioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for their nitrogen-fixing ability. Its family is Fabaceae, commonly known as the legume or bean family, characterized by pods and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as a source of timber. Its species is Acacia dacrydioides, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dacrydioides is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in dry, sandy soils and is often associated with coastal and inland dunes. It is an important component of the local flora in these areas. The plant is well adapted to the arid and semi-arid conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia dacrydioides was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and adaptability to various soil types. It has since become naturalized in several regions, particularly in coastal and disturbed areas. The plant is known for its ability to thrive in harsh environmental conditions, which has contributed to its spread. However, its introduction has raised concerns about its potential impact on native ecosystems. Despite its ornamental value, management efforts are ongoing to control its spread in sensitive habitats."
}
