{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scapuliformis",
    "plant_slug": "acacia-scapuliformis",
    "plant_name_scientific": "acacia scapuliformis",
    "intro": "Acacia scapuliformis, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features slender, often upright stems with small, narrow leaves that are usually alternate. Its flowers are typically yellow and arranged in spikes, attracting various pollinators. Acacia scapuliformis is adapted to dry environments and can thrive in sandy or rocky soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scapuliformis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and along rocky outcrops in these areas. This plant thrives in hot, dry climates and is well adapted to low rainfall conditions. It is often seen in grassland and savanna habitats. Its distribution is largely restricted to the southwestern part of the African continent.",
    "distribution_introduced_art_desc": "Acacia scapuliformis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, thriving in coastal and semi-arid environments. The plant is often associated with disturbed habitats such as roadsides, gravelly soils, and abandoned farmlands. Its introduction has led to concerns about its potential invasiveness in some areas. Despite its spread, it is not considered a major weed in the regions where it is established."
}
