{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oxyphylla var. subnuda",
    "plant_slug": "acacia-oxyphylla-var-subnuda",
    "plant_name_scientific": "acacia oxyphylla var. subnuda",
    "intro": "Acacia oxyphylla var. subnuda, commonly known as the narrow-leaved wattle, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, often spiny stems and narrow, linear leaves that are typically covered in fine hairs. The plant produces yellow floral spikes, which are typical of the Acacia genus and attract a variety of pollinators. It is adapted to harsh, dry environments and is often found in rocky or sandy soils. Due to its hardy nature, it is sometimes cultivated as an ornamental plant in drought-tolerant gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oxyphylla var. subnuda is primarily native to the arid and semi-arid regions of Southwestern Australia. It is commonly found in the states of Western Australia, particularly in the areas of the Goldfields-Eureka and Murchison regions. This plant thrives in sandy soils and is often associated with open woodlands and shrublands. It is well adapted to the harsh environmental conditions of its native habitat, including high temperatures and low rainfall. Its distribution is largely restricted to the coastal and inland areas of the southwest of the country.",
    "distribution_introduced_art_desc": "Acacia oxyphylla var. subnuda was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the coastal and inland areas of the Eastern and Western Cape provinces. The plant thrives in sandy or gravelly soils and is often seen in disturbed habitats such as roadsides and agricultural fields. It is valued for its hardy nature and ability to withstand drought conditions. However, its spread has raised concerns about its potential impact on local ecosystems."
}
