{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciopsis conzattii",
    "plant_slug": "acaciopsis-conzattii",
    "plant_name_scientific": "acaciopsis conzattii",
    "intro": "Acaciopsis conzattii, commonly known as the Conzatti's acacia, is a small, evergreen shrub native to the arid regions of southern Africa. It belongs to the Fabaceae family, which is characterized by its leguminous properties and often nitrogen-fixing abilities. The plant features compound leaves with small, oval-shaped leaflets and produces yellow to orange flowers that bloom in spring. It is adapted to survive in dry conditions, with a deep root system that helps it access underground water. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciopsis conzattii is primarily native to the island of Socotra, which is located in the Arabian Sea. This unique plant is found in the arid and semi-arid regions of Socotra, where it has adapted to the extreme climate conditions. It is commonly found in rocky and coastal areas, as well as in dry forests and shrublands. Due to its limited distribution, it is considered a rare and endemic species to the island. Its presence highlights the ecological diversity of Socotra, which is known for its endemic flora.",
    "distribution_introduced_art_desc": "Acaciopsis conzattii was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and drought tolerance. It has been cultivated in gardens and landscaped areas, particularly in southern Europe and parts of North Africa. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. The plant's rapid growth and ability to spread through seed dispersal by animals and wind have led to its presence in natural habitats. Despite its aesthetic value, careful management is required to prevent its spread into native plant communities."
}
