{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wickhamii subsp. wickhamii",
    "plant_slug": "acacia-wickhamii-subsp-wickhamii",
    "plant_name_scientific": "acacia wickhamii subsp. wickhamii",
    "intro": "Acacia wickhamii subsp. wickhamii, commonly known as the Wicking's wickhamia, is a shrub native to Western Australia. It is characterized by its dense, cylindrical stems and bipinnate leaves that are covered in fine, soft hairs. The plant produces yellow globular flowers in spring, which are arranged in compact clusters. It thrives in well-drained soils and is adapted to arid and semi-arid environments. This subspecies is often used in landscaping due to its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia wickhamii"
    },
    "taxonomy_art_desc": "Acacia wickhamii subsp. wickhamii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their close relatives. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have leaves with pinnate venation and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped or flat-topped inflorescences and often used in traditional medicine. Its species is Acacia wickhamii, a specific variety of acacia native to Australia, known for its unique ecological and horticultural significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wickhamii subsp. wickhamii is primarily native to the Northern Territory and Western Australia. This subspecies is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen along riverbanks and in open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia wickhamii subsp. wickhamii was mainly introduced to South Australia. It is commonly found in the arid and semi-arid regions of the state. This subspecies is often grown as an ornamental plant due to its attractive foliage and drought tolerance. It prefers well-drained soils and full sun exposure. However, it can become invasive in certain areas if not managed properly."
}
