{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elata",
    "plant_slug": "acacia-elata",
    "plant_name_scientific": "acacia elata",
    "intro": "Acacia elata, commonly known as the tall wattle, is a shrub or small tree native to Australia. It belongs to the Fabaceae family and is characterized by its slender, often multi-branched stems and feathery foliage. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the acacia genus. Its seeds are encased in hard pods, and the plant is adapted to arid and semi-arid environments. Acacia elata is often used in landscaping due to its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia elata"
    },
    "taxonomy_art_desc": "Acacia elata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often with primitive features. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities, often with symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their phyllodes and often used for timber or as ornamental plants. Its species is Acacia elata, a specific type of acacia characterized by its slender branches and small, delicate leaves, typically found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [
        "California",
        "Cape Provinces",
        "India",
        "Jawa",
        "Kenya",
        "New Zealand North",
        "New Zealand South",
        "Sri Lanka",
        "Uganda",
        "Victoria",
        "Western Australia",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acacia elata is primarily native to New South Wales. It is commonly found in the dry, inland regions of the state, particularly in the Murray-Darling Basin. This plant thrives in sandy or loamy soils and is often associated with open woodlands and grasslands. It is well adapted to the semi-arid and arid climates of the region. Acacia elata plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia elata was mainly introduced to California, Cape Provinces, India, Jawa, Kenya, New Zealand North, New Zealand South, Sri Lanka, Uganda, Victoria, Western Australia, and Zimbabwe. It has been established in these regions, often as an ornamental or for soil stabilization. The plant's introduction is likely due to its adaptability to various climates and soils. It is commonly found in coastal and inland areas where it thrives in full sun. Its presence in these locations highlights its successful spread beyond its native range."
}
