{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella villosa",
    "plant_slug": "acaciella-villosa",
    "plant_name_scientific": "acaciella villosa",
    "intro": "Acaciella villosa, commonly known as the hairy acaciella, is a shrub native to the arid and semi-arid regions of South America. It is characterized by its woody stems covered in dense, white, velvety hairs, which help reduce water loss in its harsh environment. The plant produces small, yellow flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. Its leaves are simple, alternate, and have a leathery texture, adapted to conserve moisture. Acaciella villosa is often used in local traditional medicine for its purported healing properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella villosa"
    },
    "taxonomy_art_desc": "Acaciella villosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which comprises flowering plants known for their legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acaciella, a small group of flowering plants native to South America, typically characterized by their shrub-like growth and compound leaves. Its species is Acaciella villosa, a specific plant within the genus Acaciella, known for its hairy stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Colombia",
        "Costa Rica",
        "Ecuador",
        "El Salvador",
        "Guatemala",
        "Honduras",
        "Jamaica",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua",
        "Panamá",
        "Peru",
        "Venezuela"
    ],
    "distribution_introduced": [
        "Cuba"
    ],
    "distribution_native_art_desc": "Acaciella villosa is primarily native to Belize, Colombia, Costa Rica, Ecuador, El Salvador, Guatemala, Honduras, Jamaica, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, Nicaragua, Panamá, Peru, and Venezuela. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in a variety of habitats, including dry forests, savannas, and rocky areas. Acaciella villosa is often associated with disturbed soils and can be found in both natural and human-altered environments. Its wide distribution reflects its adaptability to different ecological conditions throughout Central and South America.",
    "distribution_introduced_art_desc": "Acaciella villosa was mainly introduced to Cuba. It is a shrub native to South America, specifically Brazil. The introduction to Cuba likely occurred through human activity, such as accidental transport or intentional cultivation. It has since become established in certain regions of the island. However, its ecological impact and distribution in Cuba are still being studied."
}
