{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mahrana",
    "plant_slug": "acacia-mahrana",
    "plant_name_scientific": "acacia mahrana",
    "intro": "Acacia mahrana, commonly known as the white acacia, is a flowering plant native to the Arabian Peninsula. It is a small shrub that typically grows in arid and semi-arid environments. The plant produces yellow flowers that are clustered in spherical inflorescences, which bloom in spring. Its leaves are bipinnate, consisting of numerous small, feather-like leaflets. Acacia mahrana is known for its hardy nature and ability to thrive in harsh, dry conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mahrana is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, particularly in coastal dunes and sandy soils. This plant thrives in coastal environments and is often seen along the shores of the Red Sea and the Gulf of Aden. It plays an important ecological role in stabilizing dunes and providing habitat for local wildlife. Acacia mahrana is well adapted to the harsh climate of its native range, with features such as deep root systems and waxy leaves to reduce water loss.",
    "distribution_introduced_art_desc": "Acacia mahrana was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its ornamental value and its ability to thrive in arid conditions. However, its rapid growth and spread have led to ecological concerns. It outcompetes native vegetation and alters soil chemistry, affecting local biodiversity. Efforts are being made to control its spread through mechanical removal and biological control methods."
}
