{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latipes subsp. latipes",
    "plant_slug": "acacia-latipes-subsp-latipes",
    "plant_name_scientific": "acacia latipes subsp. latipes",
    "intro": "Acacia latipes subsp. latipes, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often sparsely branched stems and narrow, phyllodes that are typically light green to grey-green in color. The plant produces yellow flowers in globular or cylindrical inflorescences, which appear during the warmer months. It is adapted to arid and semi-arid environments, often found in sandy or rocky soils. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardy nature and attractive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia latipes"
    },
    "taxonomy_art_desc": "Acacia latipes subsp. latipes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and the production of legume-like pods. Its species is Acacia latipes, a specific type within the Acacia genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latipes subsp. latipes is primarily native to Western Australia. It is found in the southern and southwestern regions of the state. This subspecies thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is commonly observed in shrublands and open woodlands. Its distribution is largely confined to the coastal and interior areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia latipes subsp. latipes was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in coastal and inland areas, particularly in the Western and Eastern Cape provinces. The plant thrives in a variety of soil types but prefers well-drained soils and full sun exposure. Its rapid growth and ability to form dense thickets have led to its classification as a problematic weed in some ecosystems. Due to its adaptability, it has spread beyond its original introduction range, posing challenges for local biodiversity."
}
