{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia erythrocalyx",
    "plant_slug": "acacia-erythrocalyx",
    "plant_name_scientific": "acacia erythrocalyx",
    "intro": "Acacia erythrocalyx, commonly known as the red-fruited acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow flowers arranged in dense, globular inflorescences, followed by reddish, woody pods that contain edible seeds. It thrives in well-drained soils and is adapted to seasonal droughts, making it a resilient species in arid environments. Acacia erythrocalyx is also valued for its ornamental appeal and traditional uses in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia erythrocalyx is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and Queensland. It thrives in arid and semi-arid environments, often found in open woodlands and along riverbanks. This species is well adapted to dry climates and can tolerate poor soil conditions. It plays an important ecological role in its native habitat by providing food and shelter for various wildlife species. The plant is also known for its distinctive red or orange flowers, which bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia erythrocalyx was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is known for its distinctive red flowers and is often used in ornamental horticulture. However, it has also been reported to spread aggressively in some environments, raising concerns about its potential invasiveness. Despite its beauty, its ecological impact remains a topic of ongoing study."
}
