{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia baueri subsp. baueri",
    "plant_slug": "acacia-baueri-subsp-baueri",
    "plant_name_scientific": "acacia baueri subsp. baueri",
    "intro": "Acacia baueri subsp. baueri, commonly known as the silver wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, zigzagging branches and feathery, bipinnate leaves. The plant produces yellow globular flower heads that appear in spring, adding ornamental value. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The species is also valued for its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia baueri"
    },
    "taxonomy_art_desc": "Acacia baueri subsp. baueri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for having vascular tissues. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia baueri, a specific type of acacia found in arid regions, known for its adaptations to drought and its ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia baueri subsp. baueri is primarily native to New South Wales and Queensland. This subspecies is commonly found in the arid and semi-arid regions of these states. It typically grows in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia baueri subsp. baueri was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the eastern and western parts of the country, particularly in areas with a Mediterranean climate. This subspecies is often used in reforestation projects due to its hardiness and ability to thrive in poor soils. However, it has also been reported to spread beyond its intended areas, sometimes becoming invasive. Its introduction has had both ecological and economic impacts on local plant communities."
}
