{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia purpusii",
    "plant_slug": "acacia-purpusii",
    "plant_name_scientific": "acacia purpusii",
    "intro": "Acacia purpusii, commonly known as the white wattle, is a small evergreen shrub native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late spring. The plant produces flat, pod-like fruits that contain several seeds. It is often found in coastal areas and sandy soils, thriving in well-drained conditions. Acacia purpusii is valued for its ornamental appeal and its ability to stabilize soil in arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia purpusii is primarily native to the coastal regions of eastern Australia, including Queensland and New South Wales. It thrives in sandy soils along the coastline and is commonly found in dunes and heathlands. This species is well adapted to the harsh coastal environment, including salt spray and strong winds. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. Acacia purpusii is also sometimes cultivated in gardens for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia purpusii was mainly introduced to areas where it can thrive in arid and semi-arid environments, often as an ornamental or for soil stabilization. It has been introduced to several regions outside its native range, including parts of Africa, the Middle East, and Australia. The plant is valued for its hardy nature and ability to withstand drought conditions. However, its introduction has sometimes led to ecological concerns due to its potential for invasive growth. Despite these issues, it remains a popular choice for landscaping in regions with limited water resources."
}
