{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia borleae",
    "plant_slug": "acacia-borleae",
    "plant_name_scientific": "acacia borleae",
    "intro": "Acacia borleae, commonly known as the Bornean acacia, is a shrub native to the islands of Borneo and Sumatra. It is characterized by its slender, often spiny branches and bipinnate leaves that are compound and divided into small, delicate leaflets. The plant produces small, yellowish flowers arranged in globular heads, which are followed by flat, pod-like seed pods containing minute, hard seeds. Acacia borleae thrives in tropical rainforests and is adapted to humid, shaded environments. It plays a role in local ecosystems and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia borleae is primarily native to the Arabian Peninsula, specifically found in countries such as Saudi Arabia, Yemen, and Oman. It thrives in arid and semi-arid environments, often growing in rocky or sandy soils. This plant is commonly found in coastal areas and inland deserts, adapting well to the harsh climate of its native region. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its resilience, it is also sometimes cultivated in other parts of the world with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acacia borleae was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It has been successfully established in parts of Australia, South Africa, and the southwestern United States. This plant is often used for erosion control and as a windbreak due to its hardy nature. However, it can become invasive in some areas if not managed properly. Its introduction has had both ecological and economic impacts depending on the local environment."
}
