{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rendlei",
    "plant_slug": "acacia-rendlei",
    "plant_name_scientific": "acacia rendlei",
    "intro": "Acacia rendlei, commonly known as the yellow acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, branching structure and phyllodes that are typically yellow to golden in color. The plant produces small, yellow flowers arranged in dense, cylindrical clusters, which bloom during the rainy season. Acacia rendlei is adapted to survive in low-nutrient soils and can tolerate drought conditions. It plays an important role in local ecosystems by providing food and shelter for various animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rendlei"
    },
    "taxonomy_art_desc": "Acacia rendlei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some ferns, known for their ancient lineage and unique structural features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive umbrella-like foliage and nitrogen-fixing properties. Its species is Acacia rendlei, a specific type of acacia native to certain regions of Australia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rendlei is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy or gravelly soils. This plant thrives in dry, open habitats such as woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia rendlei plays an important ecological role in supporting local wildlife and stabilizing soil in its environment.",
    "distribution_introduced_art_desc": "Acacia rendlei was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces. This plant thrives in dry, sandy soils and is often seen in coastal fynbos vegetation. It is known for its distinctive yellow flowers and ability to fix nitrogen, which can affect local ecosystems. Due to its invasive potential, it is sometimes considered a weed in agricultural areas."
}
