{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia castanostegia",
    "plant_slug": "acacia-castanostegia",
    "plant_name_scientific": "acacia castanostegia",
    "intro": "Acacia castanostegia, commonly known as the red acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, branching structure and phyllodes that are typically reddish in color, often with a smooth or slightly hairy surface. The plant produces yellow globular flower heads, which are clustered in dense, spherical inflorescences. It thrives in well-drained soils and is often found in coastal and sandy habitats. The species is valued for its ornamental appeal and is used in some traditional medicinal practices.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia castanostegia"
    },
    "taxonomy_art_desc": "Acacia castanostegia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have leaves with pinnate venation and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive acorn-like seeds. Its species is Acacia castanostegia, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia castanostegia is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species typically grows in sandy soils and is often associated with coastal and inland dune environments. It is well adapted to the arid and semi-arid conditions of its native habitat. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia castanostegia was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread beyond cultivated areas and is now considered an environmental weed in some regions. The plant's rapid growth and ability to thrive in disturbed habitats contribute to its invasive potential. It is particularly problematic in coastal and riparian zones where it can outcompete native vegetation. Management efforts focus on early detection and control to prevent further spread."
}
