{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pinetorum",
    "plant_slug": "acacia-pinetorum",
    "plant_name_scientific": "acacia pinetorum",
    "intro": "Acacia pinetorum, commonly known as the mountain acacia, is a shrub or small tree native to the mountainous regions of South America. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in dense, spherical clusters, which are followed by flat, leathery pods containing seeds. Acacia pinetorum thrives in well-drained soils and is adapted to dry, high-altitude environments. It plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pinetorum is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. It thrives in sandy soils and is commonly found in coastal dunes and inland shrublands. This species is well adapted to the hot, dry climate and can tolerate salt spray in coastal areas. It plays an important ecological role by providing habitat and food for native wildlife. Acacia pinetorum is also sometimes cultivated in gardens for its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia pinetorum was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low rainfall and full sun exposure. This plant is often used in landscaping due to its drought tolerance and attractive foliage. It has been introduced to several parts of the United States, including California and Texas. However, it can become invasive in certain environments if not properly managed."
}
