{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bromilowiana",
    "plant_slug": "acacia-bromilowiana",
    "plant_name_scientific": "acacia bromilowiana",
    "intro": "Acacia bromilowiana, commonly known as the narrow-leaf acacia, is a shrub native to southern Africa. It is characterized by its slender, often twisted branches and small, fern-like leaves. The plant produces yellow flowers in globular or cylindrical clusters, which attract various pollinators. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia bromilowiana is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia bromilowiana"
    },
    "taxonomy_art_desc": "Acacia bromilowiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in various ecological and economic contexts. Its species is Acacia bromilowiana, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bromilowiana is primarily native to Western Australia. It is found in the southern and southwestern regions of the state. This species typically grows in dry, sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native range. The plant plays an important ecological role in its habitat by providing food and shelter for local wildlife.",
    "distribution_introduced_art_desc": "Acacia bromilowiana was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It was first brought to the country in the late 19th century by European settlers who were interested in cultivating exotic species. Despite its aesthetic appeal, the plant has since become invasive in some regions, outcompeting native vegetation. Its rapid growth and ability to thrive in various soil types have contributed to its spread. Conservation efforts are now underway to control its population and protect local ecosystems."
}
