{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amambayensis",
    "plant_slug": "acacia-amambayensis",
    "plant_name_scientific": "acacia amambayensis",
    "intro": "Acacia amambayensis, commonly known as the Paraguay acacia, is a shrub or small tree native to South America, particularly Paraguay and Brazil. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to dry and semi-arid environments, making it resilient to drought conditions. It plays a role in local ecosystems by providing habitat and food for various insects and animals. Additionally, its wood and bark have been used traditionally by indigenous communities for medicinal and practical purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amambayensis is primarily native to the Gran Chaco region of South America. It is found in countries such as Paraguay, Bolivia, Argentina, and Brazil. This plant thrives in dry, seasonal tropical and subtropical climates. It is commonly found in savannas and open woodlands. Its distribution is closely associated with specific ecological conditions in the Chaco biome.",
    "distribution_introduced_art_desc": "Acacia amambayensis was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and sufficient sunlight. It is commonly found in South America, especially in countries like Paraguay, Argentina, and Bolivia. This plant is often used for its hardy nature and ability to thrive in degraded or disturbed landscapes. Its introduction has been primarily for ornamental purposes and as a source of timber. However, it has also raised concerns regarding its potential invasiveness in certain ecosystems."
}
