{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia conspicua",
    "plant_slug": "acacia-conspicua",
    "plant_name_scientific": "acacia conspicua",
    "intro": "Acacia conspicua, commonly known as the showy acacia, is a flowering plant native to parts of Australia. It is characterized by its slender, erect stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellow or golden flowers that bloom in dense, globular clusters, making it visually striking. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia conspicua is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia conspicua is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in well-drained soils. This species is adapted to hot, dry climates and can tolerate periods of drought. It plays an important ecological role by providing habitat and food for various animals. Acacia conspicua is also known for its distinctive yellow flowers, which bloom during the rainy season.",
    "distribution_introduced_art_desc": "Acacia conspicua was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since spread beyond cultivated areas and is now found in various habitats, including coastal dunes and disturbed soils. The plant is considered invasive in some regions, outcompeting native species for resources. Its rapid growth and ability to form dense thickets make it a challenging weed to control. Efforts are ongoing to manage its spread and mitigate its impact on local ecosystems."
}
