{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mimica var. mimica",
    "plant_slug": "acacia-mimica-var-mimica",
    "plant_name_scientific": "acacia mimica var. mimica",
    "intro": "Acacia mimica var. mimica, commonly known as the mimosa acacia, is a shrub native to arid and semi-arid regions of Africa. It is characterized by its bipinnate leaves, which are typically small and feathery, and its yellow globular flowers that bloom in spring. The plant is well adapted to dry conditions, with deep roots that allow it to survive in nutrient-poor soils. It is often used in traditional medicine and as a source of fodder for livestock. Its rapid growth and ability to colonize disturbed areas make it an important pioneer species in ecological restoration.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mimica"
    },
    "taxonomy_art_desc": "Acacia mimica var. mimica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of plants with flowers that typically have five petals and include legumes and related families. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acicular leaves and often used in various ecological and economic contexts. Its species is Acacia mimica, a specific variety within the Acacia genus, noted for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mimica var. mimica is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. This variety thrives in sandy soils and is commonly found in coastal and inland regions. It is often associated with shrublands and woodlands in the Mediterranean climate zone of Western Australia. The plant is well adapted to the local climate and is a characteristic component of the native flora in this region.",
    "distribution_introduced_art_desc": "Acacia mimica var. mimica was mainly introduced to Australia as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond cultivated areas and is now considered a weed in several regions, particularly in the southeastern parts of the country. The plant thrives in a variety of soil types but prefers well-drained soils and full sun. Its rapid growth and ability to form dense thickets make it a competitive species in native ecosystems. Management efforts often focus on early detection and control to prevent further spread."
}
