{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aemula subsp. aemula",
    "plant_slug": "acacia-aemula-subsp-aemula",
    "plant_name_scientific": "acacia aemula subsp. aemula",
    "intro": "Acacia aemula subsp. aemula, commonly known as the slender wattle, is a shrub native to southeastern Australia. It is characterized by its narrow, linear leaves and yellow globular flowers that appear in late winter to early spring. The plant typically grows in sandy or rocky soils and is often found in coastal regions. It is a member of the Fabaceae family, which includes many legumes known for their nitrogen-fixing abilities. The subspecies is distinguished by its slender growth habit and smaller leaves compared to other acacia species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aemula"
    },
    "taxonomy_art_desc": "Acacia aemula subsp. aemula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have legumes as fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods as fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive foliage and often used for timber or as ornamental plants. Its species is Acacia aemula, a specific subspecies of Acacia known for its unique morphology and ecological adaptations within its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aemula subsp. aemula is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This subspecies thrives in dry, sandy soils and is often found in shrublands and woodland habitats. It is well adapted to the arid and semi-arid climates of its native range. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia aemula subsp. aemula was mainly introduced to South Africa, where it has been widely cultivated for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides, particularly in the Western Cape region. This subspecies is known for its distinctive yellow flowers and small, fern-like leaves, making it a popular choice for landscaping. However, it has also been reported to naturalize in some areas, raising concerns about its potential impact on native flora. Its introduction has contributed to the diversity of plant species in certain regions, though its ecological effects are still being studied."
}
