{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia montigena",
    "plant_slug": "acacia-montigena",
    "plant_name_scientific": "acacia montigena",
    "intro": "Acacia montigena, commonly known as the mountain acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, bipinnate leaves that are adapted to reduce water loss. The plant produces yellow flowers in compact, globular inflorescences, which are an important food source for pollinators such as bees and birds. Its woody pods contain seeds that are dispersed by wind, contributing to its survival in harsh environments. Acacia montigena is also valued for its hardy nature and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia montigena is primarily native to the island of Madagascar. It is found in the dry deciduous forests and spiny forests of the eastern and southern regions of the island. This species thrives in arid and semi-arid environments, often growing in rocky soils. It is an important component of the local ecosystem and is adapted to the unique climate of Madagascar. The plant is also known for its distinctive appearance and ecological significance in the region.",
    "distribution_introduced_art_desc": "Acacia montigena was mainly introduced to stabilize soil and prevent erosion in degraded lands. It is commonly used in reforestation projects due to its fast growth and deep root system. The plant thrives in arid and semi-arid environments, making it suitable for rehabilitation of degraded ecosystems. It is also valued for its ability to fix nitrogen, improving soil fertility over time. However, its introduction has raised concerns about potential invasiveness in non-native regions."
}
