{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia declinata",
    "plant_slug": "acacia-declinata",
    "plant_name_scientific": "acacia declinata",
    "intro": "Acacia declinata, commonly known as the slender wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow globular flower heads that bloom in spring, attracting various pollinators. Acacia declinata is adapted to arid and semi-arid environments, making it resilient to drought conditions. Its seeds are encased in hard pods and are often dispersed by wind or animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia declinata"
    },
    "taxonomy_art_desc": "Acacia declinata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes and have a symbiotic relationship with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, many of which are native to Australia. Its species is Acacia declinata, a specific type of acacia known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia declinata is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often associated with coastal and inland areas. It is well adapted to the dry and arid conditions of its native habitat. Acacia declinata plays an important role in the local ecosystem and is part of the diverse flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia declinata was mainly introduced to control erosion and stabilize soil in degraded areas. It is commonly used in reclamation projects due to its rapid growth and deep root system. The plant thrives in arid and semi-arid environments, making it suitable for rehabilitation of mining sites and degraded lands. However, its invasive nature can lead to the displacement of native flora if not managed properly. It is often planted in coastal and inland regions where soil stabilization is critical."
}
