{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella angulosa",
    "plant_slug": "acaciella-angulosa",
    "plant_name_scientific": "acaciella angulosa",
    "intro": "Acaciella angulosa, commonly known as the angular acacia, is a shrub native to South America, particularly found in regions of Argentina, Bolivia, and Paraguay. It belongs to the Fabaceae family, which is characterized by its leguminous properties and often nitrogen-fixing abilities. The plant features small, yellow flowers clustered in dense inflorescences, and its leaves are compound, typically with three leaflets. Acaciella angulosa is adapted to arid and semi-arid environments, making it a resilient species in dry climates. Its ecological role includes providing habitat and food for various insects and small animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella angulosa is primarily native to northern South America, specifically found in countries such as Venezuela, Colombia, and parts of Brazil. It thrives in tropical and subtropical regions, often growing in dry, open habitats like savannas and rocky areas. This plant is commonly found in the Llanos and Amazonian regions, where it adapts to seasonal droughts and high temperatures. It plays an important ecological role in its native habitat by providing shelter and food for local wildlife. Due to its limited distribution, it is considered a regionally significant species within its range.",
    "distribution_introduced_art_desc": "Acaciella angulosa was mainly introduced to the Pacific Islands, particularly in regions such as Hawaii, Tahiti, and the Cook Islands. It was brought there for its ornamental value due to its unique foliage and ability to thrive in coastal environments. The plant is often found growing along shorelines and in disturbed soils, where it can establish itself quickly. Its introduction has raised concerns due to its potential to become invasive in native ecosystems. Despite its beauty, careful management is needed to prevent it from outcompeting local flora."
}
