{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella var. magna",
    "plant_slug": "acacia-pulchella-var-magna",
    "plant_name_scientific": "acacia pulchella var. magna",
    "intro": "Acacia pulchella var. magna, commonly known as the giant silver acacia, is a striking shrub or small tree native to the arid regions of southern Africa. It is characterized by its long, slender, silver-gray leaves that are often covered in fine hairs, giving it a distinctive appearance. The plant produces yellow flowers in dense, globular clusters, which bloom in late winter or early spring. Its woody stems are often branched and can grow quite tall, making it a notable feature in its native habitat. This species is adapted to drought conditions and thrives in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella var. magna is primarily native to the southwestern United States and northern Mexico. It is commonly found in regions such as Arizona, New Mexico, and Texas. This plant thrives in arid and semi-arid environments, often growing in rocky soils and open woodlands. It is particularly adapted to the harsh climate conditions of the desert and scrubland ecosystems. Its distribution is closely linked to the presence of limestone and other alkaline soils.",
    "distribution_introduced_art_desc": "Acacia pulchella var. magna was mainly introduced to ornamental horticulture and landscaping due to its attractive, feathery foliage and ability to thrive in arid conditions. It is commonly used in drought-tolerant gardens and as a decorative plant in regions with warm climates. The plant's rapid growth and adaptability make it a popular choice for erosion control and as a living fence. However, it has also been reported to spread aggressively in some areas, potentially displacing native vegetation. Its introduction has raised concerns about its impact on local ecosystems in non-native regions."
}
