{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia antunesii",
    "plant_slug": "acacia-antunesii",
    "plant_name_scientific": "acacia antunesii",
    "intro": "Acacia antunesii, commonly known as the Antunes' acacia, is a flowering plant native to the arid regions of southern Africa. It is a shrub or small tree that typically grows in sandy or rocky soils, adapting well to harsh environmental conditions. The plant produces small, yellow flowers arranged in compact globular heads, which are characteristic of many acacia species. Its leaves are bipinnate, consisting of multiple small leaflets, and it has a distinctive, spiny thorn structure. Acacia antunesii plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia antunesii is primarily native to the coastal regions of southern Africa, specifically South Africa. It is commonly found in the Eastern Cape and KwaZulu-Natal provinces. This plant thrives in sandy soils along the shoreline and in dune environments. It is well adapted to the warm, humid climate of these areas. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acacia antunesii was mainly introduced to South Africa, where it has been found growing in coastal and inland regions. It is commonly found in sandy soils along the western and southern coasts. The plant has been reported in several provinces including KwaZulu-Natal, Eastern Cape, and Western Cape. It is often used in reclamation projects due to its ability to stabilize soil and tolerate harsh environmental conditions. However, its introduction has raised concerns about potential ecological impacts on native vegetation."
}
