{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drepanocarpa",
    "plant_slug": "acacia-drepanocarpa",
    "plant_name_scientific": "acacia drepanocarpa",
    "intro": "Acacia drepanocarpa, commonly known as the coastal wattle, is a shrub or small tree native to coastal regions of southern and western Australia. It is characterized by its slender, often twisted branches and feathery, bipinnate leaves that are typically green or bluish-green. The plant produces yellow globular flower heads that bloom in spring, attracting a variety of pollinators. Its seeds are encased in woody pods and are dispersed by wind, contributing to its ability to colonize sandy or rocky coastal soils. Acacia drepanocarpa is well adapted to salty air and wind, making it a hardy species in harsh coastal environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia drepanocarpa"
    },
    "taxonomy_art_desc": "Acacia drepanocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in various ecological and commercial applications. Its species is Acacia drepanocarpa, a particular species within the Acacia genus that is native to Australia and is recognized for its ecological significance and unique adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drepanocarpa is primarily native to Northern Territory, Queensland, and Western Australia. This shrub or small tree is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen along roadsides and in open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia drepanocarpa was mainly introduced to control soil erosion and stabilize degraded lands, particularly in arid and semi-arid regions. It is commonly used for afforestation and rehabilitation of mined or deforested areas due to its rapid growth and deep root system. The plant is also valued for its ability to fix nitrogen, improving soil fertility over time. Its introduction has been widespread in Australia, South Africa, and parts of Asia for environmental restoration projects. However, it can become invasive in some regions if not managed properly."
}
