{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia robynsiana",
    "plant_slug": "acacia-robynsiana",
    "plant_name_scientific": "acacia robynsiana",
    "intro": "Acacia robynsiana, commonly known as the yellow-wood acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and its distinctive yellow to golden-green foliage. The plant produces small, yellow flowers arranged in compact, globular clusters, which are highly attractive to pollinators. Its bark is smooth and pale, often exfoliating to reveal a lighter inner layer. Acacia robynsiana is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia robynsiana is primarily native to northern Australia, including parts of Queensland, the Northern Territory, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandplains and sandy soils. This species thrives in coastal and inland areas with a warm, dry climate. It is often seen in open woodlands and shrublands, where it forms dense thickets. Acacia robynsiana is well adapted to the harsh environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia robynsiana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. The plant is often associated with disturbed habitats such as roadsides, riverbanks, and agricultural areas. Due to its rapid growth and ability to spread through seeds, it has become a potential invasive species in some areas. However, it is also valued for its ornamental qualities and is used in local horticulture."
}
