{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mulganeura",
    "plant_slug": "acacia-mulganeura",
    "plant_name_scientific": "acacia mulganeura",
    "intro": "Acacia mulganeura, commonly known as the malleefowl acacia, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its grey-green, narrow, and often twisted leaves. The plant produces small, yellow flowers that are clustered in spherical heads, followed by flat, pod-like fruits. It is well adapted to arid and semi-arid environments, with a deep root system that allows it to survive in poor soils. Acacia mulganeura plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mulganeura"
    },
    "taxonomy_art_desc": "Acacia mulganeura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their floral structures. Its order is Fabales, which consists of flowering plants with a distinctive floral morphology, including legumes and vetches, and is known for nitrogen-fixing capabilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with pod fruits and often forms symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, characterized by their acicular (needle-like) phyllodes and often used in landscaping and traditional medicine. Its species is Acacia mulganeura, a specific type of wattle native to Australia, known for its ecological importance and adaptability to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mulganeura is primarily native to the Northern Territory, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions within these states. It thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia mulganeura was mainly introduced to South Australia for its potential as a soil stabilizer and for its ability to provide shade and forage for livestock. It is commonly found in coastal regions and sandy soils, where it thrives in well-drained conditions. The plant has been used in revegetation projects due to its hardy nature and rapid growth. However, it can become invasive in certain areas, outcompeting native vegetation. Its introduction has had both ecological and agricultural impacts in the region."
}
