{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia patula",
    "plant_slug": "acacia-patula",
    "plant_name_scientific": "acacia patula",
    "intro": "Acacia patula, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spikes. The plant is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system. It produces pods that contain seeds, which are dispersed by wind. Acacia patula is often used in horticulture for its ornamental value and ability to thrive in challenging soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia patula is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It is commonly found in savannas, grasslands, and along riverbanks. This species thrives in regions with a tropical or subtropical climate and is well adapted to dry conditions. It is often used for its hard wood and as a source of animal forage. Acacia patula plays an important ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia patula was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation and land rehabilitation projects due to its rapid growth and drought tolerance. The plant thrives in well-drained soils and can withstand high temperatures and low rainfall. It is also valued for its ability to fix nitrogen, improving soil fertility. However, its invasive potential in some areas requires careful management to prevent ecological disruption."
}
