{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegal var. laeta",
    "plant_slug": "acacia-senegal-var-laeta",
    "plant_name_scientific": "acacia senegal var. laeta",
    "intro": "Acacia senegal var. laeta, commonly known as the pale acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its slender, often twisted branches and bipinnate leaves that are gray-green in color. The plant produces yellow flowers followed by elongated, woody pods containing a gum resin, which is harvested for commercial use. It thrives in sandy soils and is drought-tolerant, making it well adapted to harsh environments. The species is also valued for its role in traditional medicine and as a source of fodder for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegal var. laeta is primarily native to the Sahel region of Africa, including countries such as Senegal, Mali, Burkina Faso, and Niger. It thrives in semi-arid to arid environments, often found in savannas and sandy soils. This variety is well adapted to the harsh climatic conditions of the region, including high temperatures and limited rainfall. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Additionally, it is valued for its gum arabic production, which is used in food, pharmaceutical, and industrial applications.",
    "distribution_introduced_art_desc": "Acacia senegal var. laeta was mainly introduced to regions with arid and semi-arid climates where it can thrive in sandy or loamy soils. It is commonly found in parts of Africa, the Middle East, and India, where it is used for its gum arabic production. This variety is valued for its ability to withstand drought conditions and its role in soil stabilization. Additionally, it provides habitat and food for various wildlife species. Its introduction has also contributed to local economies through agricultural and industrial applications."
}
