{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens var. pauciglandulosa",
    "plant_slug": "acacia-decurrens-var-pauciglandulosa",
    "plant_name_scientific": "acacia decurrens var. pauciglandulosa",
    "intro": "Acacia decurrens var. pauciglandulosa, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often drooping branches and small, yellow flowers arranged in cylindrical spikes. The leaves are bipinnate, with numerous small, thread-like leaflets. This variety is distinguished by its reduced number of glands compared to other acacia species. It thrives in well-drained soils and is often found in coastal and sandy environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens var. pauciglandulosa is primarily native to northern Australia, including regions of Queensland, the Northern Territory, and Western Australia. This variant is commonly found in arid and semi-arid environments, often growing in sandy soils and rocky outcrops. It is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. The plant is often seen in coastal and inland areas where it forms part of the local vegetation. Its distribution is closely associated with the ecological zones of the northern parts of the Australian continent.",
    "distribution_introduced_art_desc": "Acacia decurrens var. pauciglandulosa was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions with seasonal rainfall. It is commonly found in coastal and inland dunes, as well as on rocky outcrops and sandy soils. This plant has been introduced to parts of Australia, particularly in the southern and western regions, where it thrives in disturbed and open habitats. Its introduction has led to its establishment in both natural and agricultural landscapes. However, it is considered a potential weed in some areas due to its rapid growth and ability to spread vegetatively."
}
