{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cloncurrensis",
    "plant_slug": "acacia-cloncurrensis",
    "plant_name_scientific": "acacia cloncurrensis",
    "intro": "Acacia cloncurrensis, commonly known as the coastal acacia, is a shrub or small tree native to coastal regions of southern Africa. It is characterized by its slender, often multi-stemmed form and bipinnate leaves that are finely divided. The plant produces yellow, globular flower heads that bloom in spring, attracting various pollinators. It thrives in sandy or gravelly soils and is adapted to coastal conditions with high salt exposure. Acacia cloncurrensis is often used in coastal stabilization due to its hardy nature and ability to withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cloncurrensis is primarily native to the coastal regions of southern Western Australia. It is commonly found in sandy soils along the southern coast, including areas such as the Swan Coastal Plain. This species thrives in arid and semi-arid environments, often growing in open woodlands or shrublands. It is well adapted to the harsh conditions of the region, including high salinity and low rainfall. Acacia cloncurrensis plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia cloncurrensis was mainly introduced to New Zealand as part of ornamental planting and for its potential use in land stabilization. It has since spread beyond its original planting sites, becoming naturalized in various habitats across the country. The plant thrives in a range of soil types and is particularly common in coastal and disturbed areas. Due to its rapid growth and ability to form dense thickets, it is considered a potential weed in some regions. However, its impact on native ecosystems is still being studied."
}
