{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tetraneura",
    "plant_slug": "acacia-tetraneura",
    "plant_name_scientific": "acacia tetraneura",
    "intro": "Acacia tetraneura, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, showcasing drought-resistant features. Its root system helps prevent soil erosion, making it valuable in ecological restoration. The plant also has a symbiotic relationship with nitrogen-fixing bacteria, enhancing soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tetraneura"
    },
    "taxonomy_art_desc": "Acacia tetraneura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, which includes shrubs and trees commonly found in arid and tropical regions, known for their distinctive thorn-like structures and nitrogen-fixing capabilities. Its species is Acacia tetraneura, a specific type of acacia native to Australia, recognized for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tetraneura is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This plant thrives in coastal and inland environments, often growing in shrublands and woodland habitats. It is well adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters. Acacia tetraneura plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia tetraneura was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was initially brought there for its ornamental value and potential for soil stabilization. However, its rapid growth and ability to outcompete native vegetation have led to ecological concerns. The plant thrives in disturbed areas and can spread aggressively through its seed pods. Due to its invasive nature, it is now considered a weed in several parts of the country."
}
