{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia zapatensis",
    "plant_slug": "acacia-zapatensis",
    "plant_name_scientific": "acacia zapatensis",
    "intro": "Acacia zapatensis, commonly known as the Zapatilla acacia, is a shrub native to the dry regions of Mexico. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant features compound leaves with small, oval-shaped leaflets and produces yellow flowers that are clustered in spherical inflorescences. Acacia zapatensis is adapted to arid environments, exhibiting drought resistance and a deep root system. It plays a role in local ecosystems by providing habitat and food for various insects and animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia zapatensis is primarily native to the arid and semi-arid regions of northern Mexico, particularly in the states of Chihuahua, Coahuila, and Durango. It thrives in rocky soils and is commonly found in desert scrublands and along riverbanks. This species is well adapted to the harsh climate of the Sonoran and Chihuahuan Deserts. It plays an important ecological role by providing shelter and food for local wildlife. Due to its limited range, it is considered a rare and endemic plant in these regions.",
    "distribution_introduced_art_desc": "Acacia zapatensis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Mexico, particularly in the states of Jalisco and Nayarit. This plant is often used for its hardy nature and ability to provide shade and forage for livestock. Its introduction has also been noted in parts of the southwestern United States. However, its spread has raised concerns about potential ecological impacts in non-native environments."
}
