{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cyanophylla var. dorrienii",
    "plant_slug": "acacia-cyanophylla-var-dorrienii",
    "plant_name_scientific": "acacia cyanophylla var. dorrienii",
    "intro": "Acacia cyanophylla var. dorrienii, commonly known as the Dorrien's acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, yellowish-green leaves that are clustered at the base of the stems. The plant produces pale yellow to cream-colored flowers in dense, globular clusters, which appear during the warmer months. Its bark is typically smooth and may exude a milky sap when damaged. This species is adapted to arid and semi-arid environments, making it resilient to drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cyanophylla var. dorrienii is primarily native to the arid and semi-arid regions of southwestern Western Australia. This variant is found in areas characterized by low rainfall and sandy or rocky soils. It is commonly associated with shrublands and open woodlands in the Geraldton and Shark Bay regions. The plant thrives in coastal and inland dunes, often forming part of the local vegetation in these harsh environments. Its distribution is limited to specific ecological zones where it has adapted to the extreme climatic conditions.",
    "distribution_introduced_art_desc": "Acacia cyanophylla var. dorrienii was mainly introduced to specific regions in Western Australia, particularly in the Geraldton area. It is commonly found in sandy soils along coastal dunes and inland heathlands. This variety is known for its distinctive blue-green foliage and is often used in ecological restoration projects. Its introduction has helped stabilize soil and provide habitat for native wildlife. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
