{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polystachya",
    "plant_slug": "acacia-polystachya",
    "plant_name_scientific": "acacia polystachya",
    "intro": "Acacia polystachya, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, grey-green stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in dense, feathery clusters, which bloom in spring. It is well adapted to arid and semi-arid environments, thriving in well-drained soils. Acacia polystachya is also valued for its ornamental appeal and ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia polystachya"
    },
    "taxonomy_art_desc": "Acacia polystachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are often legumes, characterized by their unique fruit type and nitrogen-fixing capabilities. Its family is Fabaceae, commonly known as the legume or pea family, recognized for their pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees primarily found in arid and tropical regions, known for their distinctive phyllodes and nitrogen-fixing abilities. Its species is Acacia polystachya, a specific type of acacia native to certain regions of Africa, characterized by its dense foliage and adaptability to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polystachya is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This plant thrives in a variety of habitats, including open woodlands and rocky areas. It is well adapted to the local climate and soil conditions of Queensland. Its distribution is largely restricted to the northern and central parts of the state.",
    "distribution_introduced_art_desc": "Acacia polystachya was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for land stabilization due to its deep root system and ability to withstand drought conditions. It has also been introduced to other parts of the world, including parts of Africa and the Middle East, for similar ecological and agricultural purposes. However, its spread can sometimes lead to invasive behavior in non-native environments."
}
