{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia meiantha",
    "plant_slug": "acacia-meiantha",
    "plant_name_scientific": "acacia meiantha",
    "intro": "Acacia meiantha, commonly known as the narrow-leaved wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are narrow and feathery in appearance. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in savanna and woodland habitats. Acacia meiantha is valued for its ornamental qualities and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia meiantha"
    },
    "taxonomy_art_desc": "Acacia meiantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissue and true roots. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used in various ecological and commercial contexts. Its species is Acacia meiantha, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia meiantha is primarily native to New South Wales. It is commonly found in the coastal regions and adjacent inland areas of the state. This plant typically grows in dry, sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the local climate and can thrive in areas with low rainfall. Acacia meiantha plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia meiantha was mainly introduced to regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal areas and open woodlands. This plant is often used for soil stabilization and as an ornamental species due to its distinctive foliage and yellow flowers. Its introduction has sometimes led to ecological concerns due to its potential invasiveness in non-native habitats. Acacia meiantha is native to southern Africa but has been widely cultivated in other parts of the world."
}
