{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia intsioides",
    "plant_slug": "acacia-intsioides",
    "plant_name_scientific": "acacia intsioides",
    "intro": "Acacia intsioides, commonly known as the African bristlepod, is a shrub or small tree native to sub-Saharan Africa. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant features compound leaves with small, paired leaflets and produces yellow to brown pod-like fruits. It thrives in arid and semi-arid environments, often found in savannas and woodland areas. The species is valued for its ecological role and has traditional uses in various regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia intsioides is primarily native to the tropical regions of Africa, particularly in countries such as Sudan, South Sudan, and the Democratic Republic of the Congo. It thrives in dry, savanna-like environments and is commonly found in areas with seasonal rainfall. This species is well adapted to arid and semi-arid conditions, often growing in open woodlands and along riverbanks. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia intsioides is also known for its hard, durable wood, which has been used traditionally by local communities.",
    "distribution_introduced_art_desc": "Acacia intsioides was mainly introduced to South America, particularly in Brazil, as a potential source of timber and for its ability to thrive in degraded soils. It has been planted in various regions for reforestation and land restoration projects due to its fast growth rate and drought tolerance. However, its introduction has raised concerns about its potential to become invasive, as it can outcompete native species and alter local ecosystems. Despite these risks, it remains a widely used species in agroforestry systems in the region. Its distribution is now expanding beyond its original range, prompting further ecological studies."
}
