{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. lanceolata",
    "plant_slug": "acacia-longifolia-var-lanceolata",
    "plant_name_scientific": "acacia longifolia var. lanceolata",
    "intro": "Acacia longifolia var. lanceolata, commonly known as the narrow-leaf wattles, is a shrub or small tree native to southern Australia. It features compound leaves with narrow, lance-shaped phyllodes that are usually bright green and slightly hairy. The plant produces yellow globular flowers in late winter to early spring, which are arranged in dense, cylindrical spikes. It thrives in well-drained soils and is drought-tolerant, making it suitable for coastal and sandy environments. The species is also valued for its ornamental appeal and ability to fix nitrogen in the soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. lanceolata is primarily native to southern Australia, including the states of South Australia, Victoria, and Tasmania. It is commonly found in coastal areas, sandy soils, and heathlands. This variety is particularly adapted to dry, sunny environments and is often part of the understory in open woodlands. It thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. The plant is also occasionally found in New Zealand, where it has been introduced and naturalized.",
    "distribution_introduced_art_desc": "Acacia longifolia var. lanceolata was mainly introduced to Australia as an ornamental plant due to its attractive foliage and hardy nature. It has since become naturalized in several regions, particularly in coastal and semi-arid areas. The plant is known for its rapid growth and ability to thrive in disturbed soils, which contributes to its invasive potential in some ecosystems. It is commonly found in South Australia, Victoria, and parts of Western Australia. However, its spread has raised concerns among land managers due to its impact on native flora and fauna."
}
