{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia diptera var. erioptera",
    "plant_slug": "acacia-diptera-var-erioptera",
    "plant_name_scientific": "acacia diptera var. erioptera",
    "intro": "Acacia diptera var. erioptera, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its distinctive phyllodes, which are flattened, leaf-like structures that reduce water loss in arid environments. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. Its bark is often smooth and greyish, and it is adapted to thrive in dry, sandy soils. This species is valued for its ornamental appeal and its role in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia diptera var. erioptera is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variety is commonly found in savanna and grassland habitats where it thrives in well-drained soils. It is often associated with rocky outcrops and dry shrublands, adapting well to the harsh environmental conditions of its native range. The plant plays an important role in local ecosystems by providing shelter and food for various wildlife species. Its distribution is limited to specific areas where it can tolerate low rainfall and high temperatures.",
    "distribution_introduced_art_desc": "Acacia diptera var. erioptera was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant's rapid growth and nitrogen-fixing properties make it a valuable addition to degraded landscapes. However, its introduction has raised concerns about potential invasiveness in certain ecosystems. It is now widely cultivated in several countries across Africa and the Middle East."
}
