{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farnesiana var. brachicarpa",
    "plant_slug": "acacia-farnesiana-var-brachicarpa",
    "plant_name_scientific": "acacia farnesiana var. brachicarpa",
    "intro": "Acacia farnesiana var. brachicarpa, commonly known as the sweet acacia or the honey acacia, is a shrub or small tree native to the Mediterranean region. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in summer. The plant produces pods containing seeds, which are often used in traditional medicine. It is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid environments. Its nectar is a valuable food source for bees, contributing to honey production.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farnesiana var. brachicarpa is primarily native to the southern United States, including Texas, New Mexico, and Arizona, as well as parts of northern Mexico. It thrives in arid and semi-arid environments, often found in desert scrublands and along rocky soils. This variety is adapted to hot, dry climates and can tolerate poor soil conditions. It is commonly seen in regions with low rainfall and high sunlight exposure. The plant plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia farnesiana var. brachicarpa was mainly introduced to the southeastern United States, particularly in Florida and Texas, as an ornamental plant due to its attractive appearance and adaptability to various soil types. It has also been introduced to parts of California and the Caribbean, where it has established itself in disturbed habitats and along roadsides. This plant is often found in dry to mesic environments, thriving in full sun and well-drained soils. Its introduction has led to concerns about its potential invasiveness in some regions. Despite its ornamental value, it is important to monitor its spread to prevent ecological impacts."
}
