{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sarcophylla",
    "plant_slug": "acacia-sarcophylla",
    "plant_name_scientific": "acacia sarcophylla",
    "intro": "Acacia sarcophylla, commonly known as the coastal wattle, is a shrub or small tree native to southern Australia. It is characterized by its woody, cylindrical stems and phyllodes that are often reddish-brown in color. The plant produces yellow flowers in late winter to early spring, which are clustered in dense, cylindrical spikes. It is well adapted to coastal environments, tolerating salt spray and sandy soils. Acacia sarcophylla plays an important role in stabilizing dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sarcophylla is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the Pilbara, Gascoyne, and Mid West regions. This plant thrives in sandy soils and is often associated with granite outcrops. It is well adapted to the harsh, dry climate of its native habitat. Acacia sarcophylla plays an important ecological role in providing shelter and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia sarcophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western and Eastern Cape provinces. The plant thrives in well-drained soils and is often seen growing along roadsides and in open woodlands. Due to its hardy nature, it has spread beyond its original introduction sites. However, its ecological impact remains a subject of ongoing study."
}
