{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia attenuata",
    "plant_slug": "acacia-attenuata",
    "plant_name_scientific": "acacia attenuata",
    "intro": "Acacia attenuata, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, drooping branches and small, yellow pea-like flowers. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. It thrives in well-drained soils and is often found in coastal areas and sandy soils. Acacia attenuata is valued for its ornamental appeal and its role in providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia attenuata"
    },
    "taxonomy_art_desc": "Acacia attenuata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and a specific arrangement of stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia attenuata, a specific type of acacia found in certain regions, recognized by its slender, drooping branches and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia attenuata is primarily native to Queensland. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen along coastal areas and inland dunes. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Acacia attenuata is well adapted to the harsh climate of Queensland's interior.",
    "distribution_introduced_art_desc": "Acacia attenuata was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is often used for erosion control due to its deep root system. It is also valued for its ornamental qualities and ability to fix nitrogen in the soil. However, it can become invasive in some environments if not properly managed."
}
