{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia undulifolia",
    "plant_slug": "acacia-undulifolia",
    "plant_name_scientific": "acacia undulifolia",
    "intro": "Acacia undulifolia, commonly known as the wavy-leaf acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its feathery, bipinnate leaves that have a wavy or undulating appearance, giving it its common name. The plant produces yellow globular flowers that bloom in late winter to early spring, attracting various pollinators. Acacia undulifolia is well adapted to drought and can thrive in poor soils, making it a resilient species in harsh environments. It is also valued for its hardy nature and is sometimes used in landscaping in suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia undulifolia"
    },
    "taxonomy_art_desc": "Acacia undulifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that often have compound leaves and flowers with a distinct structure. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used in various ecological and economic contexts. Its species is Acacia undulifolia, a specific type of acacia found in certain regions, recognized by its unique leaf shape and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia undulifolia is primarily native to New South Wales. It is commonly found in the coastal and inland regions of the state. This plant thrives in sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the dry and semi-arid climates of New South Wales. Acacia undulifolia plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia undulifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, particularly in the Western Cape. The plant is known for its distinctive wavy leaf margins and yellow flowers, which make it a popular ornamental species. However, it has also been reported as an invasive species in some parts of its range. Its introduction has raised concerns due to its potential to outcompete native vegetation."
}
