{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia etilis",
    "plant_slug": "acacia-etilis",
    "plant_name_scientific": "acacia etilis",
    "intro": "Acacia etilis, commonly known as the silver wattle, is a flowering plant native to Australia. It is characterized by its feathery, bipinnate leaves and yellow globular flower heads that appear in spring. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. It thrives in well-drained soils and is often found in coastal and sandy regions. The silver wattle is also valued for its ornamental appeal and ecological importance in supporting native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia etilis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and woodland habitats. This species is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for various animals. Acacia etilis is also known for its distinctive yellow flowers and thorny stems.",
    "distribution_introduced_art_desc": "Acacia etilis was mainly introduced to areas with warm, dry climates and well-drained soils, often as a source of timber and fuelwood. It is commonly found in regions of Australia, Southeast Asia, and parts of Africa where it has been planted for its hardy nature and economic value. The plant thrives in full sun and is tolerant of drought conditions, making it suitable for reforestation and land rehabilitation projects. Its introduction has sometimes led to ecological concerns due to its potential to become invasive in certain environments. Despite these challenges, Acacia etilis remains an important species in agroforestry and ecological restoration efforts."
}
