{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verrucifera",
    "plant_slug": "acacia-verrucifera",
    "plant_name_scientific": "acacia verrucifera",
    "intro": "Acacia verrucifera, commonly known as the hairy acacia, is a tropical shrub or small tree native to the Arabian Peninsula and parts of the Indian Ocean. It is characterized by its compound leaves, which are often covered in fine, fuzzy hairs, giving it its common name. The plant produces small, yellow flowers that are clustered in spherical inflorescences, followed by flat, pod-like fruits containing seeds. Acacia verrucifera is well adapted to arid and coastal environments, often thriving in sandy soils. It is also known for its ability to fix nitrogen, contributing to soil fertility in nutrient-poor areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verrucifera is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It thrives in coastal and sandy environments, often found along the shores and dunes. This species is well adapted to arid and semi-arid climates with high salinity and strong winds. It plays an important ecological role in stabilizing dunes and providing habitat for various organisms. Acacia verrucifera is also commonly used in traditional practices and for its hard, durable wood.",
    "distribution_introduced_art_desc": "Acacia verrucifera was mainly introduced to stabilize sand dunes and prevent coastal erosion in arid and semi-arid regions. It is commonly found in areas with saline or alkaline soils, where it thrives due to its tolerance to harsh environmental conditions. The plant's rapid growth and ability to fix nitrogen make it a valuable species for land rehabilitation projects. However, its invasive nature can lead to the displacement of native vegetation if not managed properly. Its distribution is primarily along coastal and inland sandy areas in regions such as the Middle East, North Africa, and parts of Australia."
}
