{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latisiliqua",
    "plant_slug": "acacia-latisiliqua",
    "plant_name_scientific": "acacia latisiliqua",
    "intro": "Acacia latisiliqua, commonly known as the narrow-leaved acacia, is a shrub native to the arid regions of Australia. It is characterized by its slender, grey-green stems and narrow, linear leaves that reduce water loss in harsh environments. The plant produces small, yellow flowers clustered in spikes, which attract pollinators such as bees and birds. Its root system is deep and extensive, allowing it to access groundwater in dry conditions. Acacia latisiliqua is adapted to survive in low-nutrient soils and can tolerate extreme temperatures and drought.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latisiliqua is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy soils and is commonly found in savannas and shrublands. This plant is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. Acacia latisiliqua is also sometimes cultivated for its ornamental value and as a source of timber.",
    "distribution_introduced_art_desc": "Acacia latisiliqua was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This plant is often used for reclamation projects due to its drought tolerance and rapid growth. Its introduction has helped in restoring degraded lands across several countries in Africa and the Middle East. However, it has also raised concerns about its potential invasiveness in some ecosystems."
}
