{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia depauperata",
    "plant_slug": "acacia-depauperata",
    "plant_name_scientific": "acacia depauperata",
    "intro": "Acacia depauperata, commonly known as the slender acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its slender, multi-branched stems and small, compound leaves that are often reduced to spines. The plant produces yellow flowers in clusters, which are typical of the Acacia genus. It is well adapted to drought conditions, with deep roots that allow it to access groundwater. Acacia depauperata plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia depauperata is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, including the Kalahari Desert and the Succulent Karoo biome. This plant thrives in sandy or gravelly soils and is often seen growing along roadsides and in open savannas. It is well adapted to hot, dry climates and can withstand periods of drought. Acacia depauperata plays an important ecological role by providing habitat and food for various desert wildlife species.",
    "distribution_introduced_art_desc": "Acacia depauperata was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for rehabilitation of degraded lands. This plant is often used in reforestation projects due to its ability to fix nitrogen and improve soil fertility. Its introduction has helped in stabilizing soils and preventing erosion in various parts of Australia and the Mediterranean. However, it is important to monitor its spread to prevent potential ecological impacts on native vegetation."
}
