{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia blayana",
    "plant_slug": "acacia-blayana",
    "plant_name_scientific": "acacia blayana",
    "intro": "Acacia blayana, commonly known as the Blayana wattle, is a shrub native to Western Australia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid environments, featuring a deep root system for water absorption. It plays a role in soil stabilization and provides habitat for local wildlife. Acacia blayana is also valued for its ornamental appeal in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia blayana"
    },
    "taxonomy_art_desc": "Acacia blayana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct alternation of generations and specialized structures for water transport. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns, horsetails, and their allies, often featuring specialized reproductive structures. Its subclass is Magnoliidae, a group of flowering plants known for their primitive floral structures and a wide range of growth forms. Its order is Fabales, which includes plants that are typically legumes, often with distinctive flowers and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their phyllodes and often used for timber or ornamental purposes. Its species is Acacia blayana, a specific type of acacia that is native to certain regions and is distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia blayana is primarily native to New South Wales. It is found in the coastal regions of the state, particularly in the southern and central areas. This species thrives in sandy soils and is often seen in heathlands and open woodlands. It is well adapted to the temperate climate of the region. Acacia blayana plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia blayana was mainly introduced to areas with sandy soils and arid climates, particularly in regions of Australia and parts of Southeast Asia. It is commonly found in coastal dunes and open woodlands where it thrives in well-drained conditions. This plant has been introduced for its ability to stabilize soil and prevent erosion, making it valuable in ecological restoration projects. However, its rapid growth and adaptability have led to concerns about its potential to become invasive in non-native environments. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
