{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia browniana var. glaucescens",
    "plant_slug": "acacia-browniana-var-glaucescens",
    "plant_name_scientific": "acacia browniana var. glaucescens",
    "intro": "Acacia browniana var. glaucescens, commonly known as the glaucous acacia, is a shrub or small tree native to parts of Africa. It is characterized by its slender, often spiny stems and small, bipinnate leaves that are covered in a waxy, bluish-white coating. The plant produces yellow flowers in compact, globular clusters, which are typical of the Acacia genus. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. The species is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia browniana"
    },
    "taxonomy_art_desc": "Acacia browniana var. glaucescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes and other related families. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia browniana, a specific type within the Acacia genus, which is further differentiated by its varietal form, glaucescens, indicating a bluish-gray appearance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia browniana var. glaucescens is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in areas with sandy or gravelly soils. This variety thrives in coastal and inland regions, often in heathlands and open woodlands. It is well adapted to the dry and sunny conditions typical of its native habitat. The plant is part of the broader Acacia species that are commonly found in the flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia browniana var. glaucescens was mainly introduced to the Pacific Islands for its ornamental value and potential use in reforestation efforts. It is commonly found in coastal areas and disturbed sites due to its adaptability to various soil types. The plant thrives in full sun and is drought-tolerant, making it suitable for landscaping in tropical and subtropical regions. However, its introduction has raised concerns about potential invasiveness in native ecosystems. It is often cultivated in gardens and public spaces for its unique foliage and resilience."
}
