{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oligoneura",
    "plant_slug": "acacia-oligoneura",
    "plant_name_scientific": "acacia oligoneura",
    "intro": "Acacia oligoneura, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, feathery leaves and yellow floral spikes that bloom in spring. The plant is part of the legume family, Fabaceae, and has a deep root system that helps prevent soil erosion. Its flowers attract a variety of pollinators, including bees and birds. The wood of Acacia oligoneura is hard and durable, making it useful for construction and fuel.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia oligoneura"
    },
    "taxonomy_art_desc": "Acacia oligoneura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive umbrella-like flower heads and often used in traditional medicine and as sources of timber. Its species is Acacia oligoneura, a specific type of acacia native to Australia, characterized by its small size, slender leaves, and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oligoneura is primarily native to the Northern Territory and Western Australia. This plant is commonly found in arid and semi-arid regions of these areas. It thrives in sandy soils and is often seen in open woodlands and shrublands. Acacia oligoneura is well adapted to the harsh climate of its native range. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia oligoneura was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly used in reforestation projects due to its fast growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, its introduction has raised concerns about potential invasiveness in certain ecosystems. It is widely planted in arid and semi-arid regions across Australia and parts of Southeast Asia."
}
