{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia unispinosa",
    "plant_slug": "acacia-unispinosa",
    "plant_name_scientific": "acacia unispinosa",
    "intro": "Acacia unispinosa, commonly known as the slender acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its narrow, spiny stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow to golden-yellow inflorescences, which are clusters of small, fragrant flowers. Acacia unispinosa is well adapted to drought conditions, with deep roots that allow it to survive in nutrient-poor soils. It plays an important ecological role by providing food and shelter for various desert wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia unispinosa is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry and hot conditions. This plant is well adapted to the harsh climate of its native habitat, with its spiny structure providing protection from herbivores. It plays an important ecological role by offering shelter and food to various wildlife species. Acacia unispinosa is also sometimes cultivated in other parts of the world for its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia unispinosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This plant is often used for erosion control due to its deep root system and ability to withstand drought. However, it can become invasive in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns in parts of its range."
}
