{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heterochroa",
    "plant_slug": "acacia-heterochroa",
    "plant_name_scientific": "acacia heterochroa",
    "intro": "Acacia heterochroa, commonly known as the yellow acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and compound leaves that are typically bipinnate. The plant produces yellowish-green flowers in globular or cylindrical inflorescences, which are highly attractive to pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia heterochroa is often used in ornamental horticulture due to its unique appearance and ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia heterochroa"
    },
    "taxonomy_art_desc": "Acacia heterochroa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have primitive floral structures and are often found in tropical and subtropical regions. Its order is Fabales, which includes plants with characteristic flowers and legumes, many of which have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often for their ability to fix nitrogen. Its species is Acacia heterochroa, a specific type of acacia known for its unique leaf structure and habitat preferences in certain regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heterochroa is primarily native to Western Australia. It is commonly found in the coastal and inland regions of the state. This plant thrives in sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the dry and arid conditions of its native habitat. Acacia heterochroa plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia heterochroa was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It has since spread beyond cultivation and is now considered an environmental weed in several regions. The plant thrives in a variety of soil types and can tolerate both drought and frost, contributing to its invasive potential. It is commonly found in disturbed areas, along roadsides, and in forest margins. Its rapid growth and ability to form dense thickets pose a threat to native ecosystems and biodiversity."
}
