{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia varia",
    "plant_slug": "acacia-varia",
    "plant_name_scientific": "acacia varia",
    "intro": "Acacia varia, commonly known as the variable acacia, is a shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are often bipinnate and covered in fine, silky hairs. The plant produces small, yellow flowers arranged in cylindrical spikes, which bloom in spring. Its seeds are enclosed in pod-like fruits that split open when mature. Acacia varia is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia varia"
    },
    "taxonomy_art_desc": "Acacia varia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a distinctive structure, including many legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in arid regions, known for their distinctive phyllodes and ability to thrive in harsh environments. Its species is Acacia varia, a specific type of acacia found in certain regions of Australia, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia varia is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils and a Mediterranean climate. This species thrives in coastal and inland habitats, including woodlands and heathlands. It is well adapted to the dry conditions typical of its native range. Acacia varia plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia varia was mainly introduced to regions with warm, arid climates where it can thrive in well-drained soils. It is commonly found in parts of Australia, Africa, and the Middle East, where it has been cultivated for its ornamental value and drought resistance. The plant's introduction has sometimes led to ecological concerns due to its ability to spread rapidly in new environments. It is often used in landscaping and reforestation projects because of its hardiness and ability to fix nitrogen. However, its invasive potential requires careful management in non-native areas."
}
