{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia viminalis",
    "plant_slug": "acacia-viminalis",
    "plant_name_scientific": "acacia viminalis",
    "intro": "Acacia viminalis, commonly known as the white acacia, is a shrub or small tree native to the Mediterranean region. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are compound and feathery in appearance. The plant produces yellow flowers in globular clusters, which are typically followed by flat, pod-like fruits. Acacia viminalis is well adapted to arid and semi-arid environments, making it a hardy species suitable for dry climates. It is also valued for its use in traditional medicine and as a source of natural fibers.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia viminalis is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, particularly in coastal areas and sandy soils. This plant thrives in hot, dry climates and is often seen growing along the edges of deserts and in coastal dunes. It is well adapted to the harsh environmental conditions of its native habitat. Acacia viminalis is also occasionally found in parts of North Africa and the Middle East.",
    "distribution_introduced_art_desc": "Acacia viminalis was mainly introduced to areas with arid or semi-arid climates, particularly in regions where it can thrive in well-drained soils. It is commonly found in parts of Africa, the Middle East, and Southwestern Asia. This plant is often used for its hardy nature and ability to provide shade and fuelwood. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. It is also valued for its role in traditional practices and land stabilization."
}
