{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eremophiloides",
    "plant_slug": "acacia-eremophiloides",
    "plant_name_scientific": "acacia eremophiloides",
    "intro": "Acacia eremophiloides, commonly known as the desert acacia, is a shrub native to arid regions of the southwestern United States and northern Mexico. It is characterized by its small, feathery leaves and yellow flowers that bloom in clusters. The plant has a deep root system that allows it to thrive in dry, sandy soils. Its wood is hard and durable, making it useful for various applications. Acacia eremophiloides plays an important role in stabilizing soil and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia eremophiloides"
    },
    "taxonomy_art_desc": "Acacia eremophiloides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their thorny stems and distinctive flower clusters. Its species is Acacia eremophiloides, a specific type of acacia native to Australia, known for its hardy nature and ability to thrive in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eremophiloides is primarily native to Queensland. It is found in the arid and semi-arid regions of the state, particularly in the Channel Country and the Simpson Desert areas. This plant thrives in sandy or gravelly soils and is commonly found in open woodlands and shrublands. It is well adapted to the harsh, dry conditions of the Queensland interior. Its distribution is largely restricted to the central and western parts of the state.",
    "distribution_introduced_art_desc": "Acacia eremophiloides was mainly introduced to areas with well-drained soils and a semi-arid climate, typically found in regions with low rainfall and high temperatures. It is commonly found in disturbed sites such as roadsides, degraded lands, and agricultural fields. This plant has a spreading habit and forms dense thickets, which can lead to the displacement of native vegetation. Its introduction has been associated with ecological changes in invaded habitats, affecting local biodiversity. Due to its rapid growth and adaptability, it is considered an invasive species in several regions outside its native range."
}
