{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lozanoi",
    "plant_slug": "acacia-lozanoi",
    "plant_name_scientific": "acacia lozanoi",
    "intro": "Acacia lozanoi, commonly known as the Lozán acacia, is a shrub or small tree native to the arid regions of South America. It is characterized by its slender, often branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in compact, globular clusters, which are typical of the Acacia genus. It is adapted to drought conditions, with a deep root system that allows it to survive in nutrient-poor soils. Acacia lozanoi plays a role in stabilizing soil in its native habitat and provides shelter for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lozanoi is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. This plant is well adapted to hot, dry climates and can survive with minimal water. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia lozanoi is also sometimes referred to as the \"camel thorn\" due to its ability to withstand harsh environmental conditions.",
    "distribution_introduced_art_desc": "Acacia lozanoi was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions with low rainfall. It thrives in environments where it can establish itself along rocky outcrops or in open grasslands. This plant is often introduced for its ornamental value due to its unique foliage and ability to withstand harsh conditions. However, it can become invasive in certain ecosystems if not managed properly. Its introduction has raised concerns about its potential impact on native flora in non-native habitats."
}
