{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia insularum",
    "plant_slug": "acacia-insularum",
    "plant_name_scientific": "acacia insularum",
    "intro": "Acacia insularum, commonly known as the Socotra acacia, is a unique flowering plant native to the Arabian Peninsula and the island of Socotra. It is characterized by its distinctive, flat, thorn-like leaves and yellow, globular flower heads. The plant belongs to the Fabaceae family, which includes legumes, and it has adapted to arid and semi-arid environments. Acacia insularum is notable for its ecological and cultural significance in its native regions. Its seeds are often used in traditional practices and for local crafts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia insularum is primarily native to the island of Socotra, located in the Arabian Sea. This unique plant thrives in the arid and semi-arid environments of Socotra, which is known for its endemic flora. It is commonly found in coastal areas and rocky habitats across the island. Due to its limited geographic range, it is considered a rare and vulnerable species. Its distribution is restricted to Socotra, making it a significant part of the island's ecological diversity.",
    "distribution_introduced_art_desc": "Acacia insularum was mainly introduced to stabilize soil and provide shade in degraded areas. It is commonly found in regions with low rainfall and poor soil quality. The plant has been successfully established in several coastal and inland areas. Its rapid growth and ability to fix nitrogen make it valuable for ecological restoration. However, it can become invasive if not managed properly."
}
