{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia barakulensis",
    "plant_slug": "acacia-barakulensis",
    "plant_name_scientific": "acacia barakulensis",
    "intro": "Acacia barakulensis, commonly known as the Karakul acacia, is a shrub or small tree native to Central Asia. It is characterized by its compound leaves, which are typically bipinnate, and its yellow, globular flower heads. The plant produces long, flat pods that contain seeds with a hard coat. It thrives in arid and semi-arid environments, often found in sandy soils. Acacia barakulensis is valued for its hardy nature and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia barakulensis"
    },
    "taxonomy_art_desc": "Acacia barakulensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often thorn-like structures, commonly found in arid and semi-arid regions. Its species is Acacia barakulensis, a specific type of acacia native to certain regions of Central Asia, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia barakulensis is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This species typically grows in open woodlands and grasslands. It is well adapted to the local climate and soil conditions. Its distribution is limited to specific areas within Queensland.",
    "distribution_introduced_art_desc": "Acacia barakulensis was mainly introduced to regions with semi-arid to arid climates, particularly in Central Asia and parts of the Middle East. It thrives in well-drained soils and is often found in shrublands and rocky areas. This plant is commonly used for soil stabilization and as a source of timber and fodder. Its introduction has helped in reclaiming degraded lands in certain areas. However, it is considered invasive in some regions where it outcompetes native vegetation."
}
