{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia intermedia",
    "plant_slug": "acacia-intermedia",
    "plant_name_scientific": "acacia intermedia",
    "intro": "Acacia intermedia, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spiny stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in spring, which are clustered in cylindrical inflorescences. Acacia intermedia is adapted to arid and semi-arid environments, showing resistance to drought. It plays an important role in local ecosystems and is sometimes used in horticulture for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia intermedia is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in savanna and woodland habitats, often found in areas with well-drained soils. This species is also present in parts of the Arabian Peninsula and the Indian subcontinent. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia intermedia is commonly used in traditional medicine and for its hard, durable wood.",
    "distribution_introduced_art_desc": "Acacia intermedia was mainly introduced to regions with dry or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for arid and tropical environments. This plant is often used for soil stabilization and as a source of timber and fuelwood in its native range. Its introduction has also been noted in parts of southern Africa and Australia, where it has adapted well to local conditions. However, its spread can sometimes lead to ecological concerns due to its ability to outcompete native vegetation."
}
