{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis",
    "plant_slug": "acacia-tortilis",
    "plant_name_scientific": "acacia tortilis",
    "intro": "Acacia tortilis, commonly known as the umbrella thorn acacia, is a deciduous shrub or small tree native to Africa. It is characterized by its distinctive umbrella-shaped crown formed by its long, drooping branches. The plant has phyllodes, which are flattened leaf stalks that function as leaves, reducing water loss in arid environments. Its yellow flowers are produced in dense, globular clusters and attract various pollinators. Acacia tortilis is well adapted to hot, dry climates and plays an important ecological role in its habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon grandiflorum"
    },
    "taxonomy_art_desc": "Acacia tortilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a unique structure known as a rhizome and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which consists of flowering plants that typically have showy flowers and includes families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants known for their showy, lantern-shaped flowers and are often cultivated for ornamental purposes. Its species is Abutilon grandiflorum, a specific type of Abutilon known for its large, colorful flowers and is widely appreciated in horticulture.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis is primarily native to Tanzania. It is commonly found in the savannas and rocky areas of the country. This plant thrives in arid and semi-arid environments, adapting well to the harsh climate. It plays an important role in the local ecosystem by providing food and shelter for various animals. Its presence is a key indicator of the region's ecological health.",
    "distribution_introduced_art_desc": "Acacia tortilis was mainly introduced to areas with arid or semi-arid climates, where it thrives in regions with low rainfall and high temperatures. It is commonly found in savannas, woodlands, and rocky soils across sub-Saharan Africa. This plant plays a vital role in preventing soil erosion and providing habitat for various wildlife species. Its ability to fix nitrogen makes it an important pioneer species in degraded landscapes. Additionally, it has been introduced to some parts of the Middle East and India for its ecological and economic benefits."
}
