{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia suma",
    "plant_slug": "acacia-suma",
    "plant_name_scientific": "acacia suma",
    "intro": "Acacia suma, commonly known as the white acacia, is a shrub or small tree native to parts of Africa and the Middle East. It is characterized by its slender, often thornless stems and bipinnate leaves that are composed of numerous small, oval leaflets. The plant produces yellow, spherical flower heads that bloom in summer, attracting pollinators such as bees and birds. Its seeds are encased in a hard, woody pod, and the plant is adapted to arid and semi-arid environments. Acacia suma is also valued for its use in traditional medicine and as a source of timber and charcoal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia suma is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with well-drained soils. This plant thrives in open habitats like grasslands, savannas, and forest edges. It is also known to grow in disturbed areas and along roadsides. Acacia suma is often used in traditional medicine and as a source of timber and fodder.",
    "distribution_introduced_art_desc": "Acacia suma was mainly introduced to control soil erosion and for its utility in land rehabilitation. It is commonly planted in degraded lands to stabilize soil and prevent further erosion. The plant is also valued for its ability to thrive in arid and semi-arid environments. Its introduction has helped in restoring vegetation cover in areas affected by desertification. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
