{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia viridis",
    "plant_slug": "acacia-viridis",
    "plant_name_scientific": "acacia viridis",
    "intro": "Acacia viridis, commonly known as the green acacia, is a shrub native to Australia. It is characterized by its slender, erect stems and small, greenish-yellow flowers that appear in clusters. The plant has bipinnate leaves, which are divided into numerous small leaflets. It thrives in well-drained soils and is often found in arid or semi-arid regions. Acacia viridis is also known for its ability to fix nitrogen, making it an important species in soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia viridis is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in arid and semi-arid regions, often found in savannas and rocky outcrops. This species is well adapted to dry climates and can tolerate poor soil conditions. It is commonly seen in woodland areas and along riverbanks in its native range. Acacia viridis plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia viridis was mainly introduced to areas with warm, dry climates and well-drained soils, often as an ornamental or for erosion control. It thrives in regions with full sun exposure and is commonly found in coastal and inland dunes. Due to its rapid growth and ability to tolerate poor soil conditions, it has been widely planted in arid and semi-arid regions. However, its invasive potential has raised concerns in some areas where it outcompetes native vegetation. Proper management is necessary to prevent its spread in ecosystems where it is not native."
}
