{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sieberiana var. sing",
    "plant_slug": "acacia-sieberiana-var-sing",
    "plant_name_scientific": "acacia sieberiana var. sing",
    "intro": "Acacia sieberiana var. sing, commonly known as the yellow acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often thornless stems and bipinnate leaves that are alternate and composed of numerous small leaflets. The plant produces yellow to golden flowers in globular or cylindrical clusters, which bloom in the dry season. Its seeds are encased in woody pods and are dispersed by wind or animals. The plant is adapted to arid and semi-arid environments, making it a hardy species in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sieberiana var. sing is primarily native to tropical and subtropical regions of Africa, including countries such as Sudan, South Sudan, Ethiopia, and parts of the Democratic Republic of the Congo. It thrives in savanna and woodland habitats, often growing in well-drained soils. This variant is commonly found in dry to semi-arid environments, where it plays an important ecological role. It is also occasionally reported in parts of southern Arabia and the Middle East. The plant is well adapted to high temperatures and low rainfall conditions.",
    "distribution_introduced_art_desc": "Acacia sieberiana var. sing was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. This species is often cultivated for its ornamental value and its ability to withstand drought conditions. It has been introduced to various ecological zones for reforestation and soil stabilization purposes. However, its introduction has sometimes led to concerns about its potential invasiveness in certain environments."
}
