{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia erubescens",
    "plant_slug": "acacia-erubescens",
    "plant_name_scientific": "acacia erubescens",
    "intro": "Acacia erubescens, commonly known as the red acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are feathery in appearance. The plant produces yellow flowers in globular or cylindrical heads, which are followed by flat, pod-like fruits. It thrives in well-drained soils and is often found in savanna and woodland habitats. The plant is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia erubescens is primarily native to northern Australia, including regions of Western Australia, Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, such as coastal dunes, sandy soils, and open woodlands. This plant thrives in well-drained soils and is adapted to withstand high temperatures and low rainfall. It plays an important ecological role by providing habitat and food for various native animals. Acacia erubescens is also known for its distinctive red flowers, which bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia erubescens was mainly introduced to urban and suburban landscapes in southern Africa for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides where it provides shade and erosion control. The plant is also used in reforestation projects due to its rapid growth and nitrogen-fixing properties. However, it has become an invasive species in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns in regions where it is not native."
}
