{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obtusa",
    "plant_slug": "acacia-obtusa",
    "plant_name_scientific": "acacia obtusa",
    "intro": "Acacia obtusa, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, dark green leaves that are typically narrow and elliptical in shape. The plant produces yellow flowers in globular clusters, which bloom in spring and attract a variety of pollinators. Acacia obtusa is adapted to arid and semi-arid environments, making it a resilient species in dry climates. It is often used in landscaping due to its ornamental value and ability to thrive in poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obtusa is primarily native to eastern Australia, including regions such as New South Wales and Queensland. It is commonly found in dry, open forests and woodlands, often on sandy or gravelly soils. This plant thrives in areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is also occasionally found in coastal regions and on the edges of heathlands. Acacia obtusa is well adapted to fire-prone environments and plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia obtusa was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in areas with poor soil quality and arid conditions. The plant has been widely used in reforestation projects due to its fast growth and ability to thrive in harsh environments. Its introduction has helped stabilize soils and improve biodiversity in affected regions. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
