{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia phlebopetala var. pubescens",
    "plant_slug": "acacia-phlebopetala-var-pubescens",
    "plant_name_scientific": "acacia phlebopetala var. pubescens",
    "intro": "Acacia phlebopetala var. pubescens, commonly known as the hairy wattle, is a shrub native to Australia. It is characterized by its yellow floral spikes and small, feathery leaves. The plant features glandular hairs on its stems and leaves, giving it a fuzzy appearance. It thrives in well-drained soils and is often found in coastal and sandy environments. This variety is valued for its ornamental appeal and ability to withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia phlebopetala"
    },
    "taxonomy_art_desc": "Acacia phlebopetala var. pubescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees in the legume family, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia phlebopetala, a specific type of acacia that has a variant known as var. pubescens, distinguished by its hairy or pubescent characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia phlebopetala var. pubescens is primarily native to Western Australia. This variant of the species is found in the southern and southwestern regions of the state. It typically grows in sandy soils and is commonly associated with coastal and inland areas. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in the local flora and is often found in shrublands and open woodlands.",
    "distribution_introduced_art_desc": "Acacia phlebopetala var. pubescens was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for xerophytic environments. This plant is often used for soil stabilization and as a source of fodder for livestock. Its introduction has been primarily for ecological restoration and land rehabilitation projects. However, it requires careful management to prevent potential invasiveness in non-native habitats."
}
