{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia deanei subsp. deanei",
    "plant_slug": "acacia-deanei-subsp-deanei",
    "plant_name_scientific": "acacia deanei subsp. deanei",
    "intro": "Acacia deanei subsp. deanei, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted stems and bipinnate leaves composed of numerous small, needle-like leaflets. The plant produces yellow globular flower heads, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, open habitats. Acacia deanei subsp. deanei is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia deanei"
    },
    "taxonomy_art_desc": "Acacia deanei subsp. deanei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and some modern seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive arrangement of petals. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of flowering plants known for their thorned stems and often bipinnate leaves, commonly found in arid and tropical regions. Its species is Acacia deanei, a specific variety within the Acacia genus that is native to certain parts of Australia and is recognized for its ecological and botanical significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [
        "New Guinea"
    ],
    "distribution_native_art_desc": "Acacia deanei subsp. deanei is primarily native to New South Wales, Queensland, and Victoria. This subspecies is commonly found in the eastern regions of Australia, particularly in areas with sandy or loamy soils. It thrives in a variety of habitats, including woodlands, grasslands, and coastal regions. The plant is well adapted to the temperate to subtropical climates of these states. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia deanei subsp. deanei was mainly introduced to New Guinea. It is commonly found in coastal and lowland areas, particularly in disturbed habitats such as roadsides and open woodlands. This subspecies is well adapted to tropical and subtropical climates, thriving in well-drained soils. It is often used for its hardy nature and ability to withstand drought conditions. Its introduction has had both ecological and economic impacts in the region."
}
