{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cylindriflora",
    "plant_slug": "acacia-cylindriflora",
    "plant_name_scientific": "acacia cylindriflora",
    "intro": "Acacia cylindriflora, commonly known as the cylindrical-flowered wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and small, yellow floral spikes that appear in late winter to early spring. The leaves are phyllodes, which are flattened leaf stalks that function as the primary photosynthetic organs. The plant produces small, pod-like fruits that contain several seeds, which are dispersed by wind. Acacia cylindriflora is well adapted to arid and semi-arid environments, showing resilience to drought and heat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cylindriflora is primarily native to the northern regions of Western Australia. It is commonly found in the Pilbara and Gascoyne regions, where it thrives in arid and semi-arid environments. This species is adapted to sandy soils and can tolerate high temperatures and low rainfall. It is often seen in open woodlands and along river systems in its native range. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia cylindriflora was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in coastal and inland areas. This plant thrives in sandy soils and is often seen in fynbos vegetation. Its introduction has led to concerns about its potential invasiveness in some ecosystems. Despite its ornamental value, it requires careful management to prevent spread into native habitats."
}
