{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dunnii",
    "plant_slug": "acacia-dunnii",
    "plant_name_scientific": "acacia dunnii",
    "intro": "Acacia dunnii, commonly known as the yellow wattle, is a shrub or small tree native to Australia. It is characterized by its bright yellow floral spikes that appear during the spring and summer seasons. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. Acacia dunnii thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. It is also valued for its ornamental appeal and has been introduced to other regions for landscaping purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dunnii"
    },
    "taxonomy_art_desc": "Acacia dunnii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex reproductive structures. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Fabales, which includes legumes and related plants, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Australia and other parts of the world, known for their thorny stems and pod-like fruits. Its species is Acacia dunnii, a specific type of acacia found in Australia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dunnii is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. Its distribution is closely associated with the unique climatic conditions of the region. Acacia dunnii plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia dunnii was mainly introduced to New Zealand. It was brought there during the 19th century as part of the introduction of exotic plant species for ornamental and horticultural purposes. The plant has since become naturalized in certain regions, particularly in the North Island. It thrives in a variety of soil types but prefers well-drained soils and full sun. However, it is considered a potential environmental weed in some areas due to its ability to spread rapidly."
}
