{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glandulicarpa",
    "plant_slug": "acacia-glandulicarpa",
    "plant_name_scientific": "acacia glandulicarpa",
    "intro": "Acacia glandulicarpa, commonly known as the glandular acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its compound leaves, which are typically bipinnate and have a feathery appearance. The plant produces yellow flowers in clustered inflorescences, which are often followed by flat, pod-like fruits. Acacia glandulicarpa is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. It is also known for its ability to fix nitrogen, contributing to soil fertility in its native habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia glandulicarpa"
    },
    "taxonomy_art_desc": "Acacia glandulicarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral morphology. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and numerous stamens, and includes legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Australia and other parts of Africa, known for their phyllodes and unique floral structures. Its species is Acacia glandulicarpa, a specific type of acacia found in certain regions of Australia, distinguished by its glandular features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia glandulicarpa is primarily native to South Australia and Victoria. This species is commonly found in the arid and semi-arid regions of these states. It typically grows in open woodlands, along riverbanks, and on rocky outcrops. The plant is well adapted to the dry climate and poor soils of its native habitat. It plays an important ecological role in supporting local wildlife and stabilizing soil in these environments.",
    "distribution_introduced_art_desc": "Acacia glandulicarpa was mainly introduced to India. It has been established in various regions across the country, particularly in areas with suitable climatic conditions. The plant is often found in disturbed sites such as roadsides, wastelands, and along riverbanks. Its introduction has led to its naturalization in certain parts of the ecosystem. However, its impact on native flora and fauna is still being studied."
}
