{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia argentea",
    "plant_slug": "acacia-argentea",
    "plant_name_scientific": "acacia argentea",
    "intro": "Acacia argentea, commonly known as silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, wiry stems and bipinnate leaves that are covered in a fine, silvery-white bloom. The plant produces yellow globular flower heads, which are arranged in dense, cylindrical clusters. It thrives in well-drained soils and is often found in dry, open habitats. Acacia argentea is known for its ornamental value and is sometimes cultivated for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia argentea is primarily native to tropical and subtropical regions of Africa, including countries such as Sudan, Ethiopia, Kenya, and Tanzania. It is commonly found in savanna woodlands and along riverbanks, where it thrives in well-drained soils. This plant is also present in parts of the Arabian Peninsula and the Indian subcontinent. It plays an important role in local ecosystems by providing food and shelter for various wildlife species. Due to its adaptability, it is sometimes introduced to other regions for ornamental or ecological purposes.",
    "distribution_introduced_art_desc": "Acacia argentea was mainly introduced to regions with tropical and subtropical climates, particularly in parts of Africa, Asia, and the Pacific. It thrives in well-drained soils and is often found in savannas, coastal areas, and disturbed sites. The plant is valued for its hardy nature and ability to withstand drought conditions. It has been introduced for use in reforestation, soil stabilization, and as a source of timber and fodder. However, its invasive potential in some areas raises concerns about ecological impacts."
}
