{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cuthbertsonii subsp. linearis",
    "plant_slug": "acacia-cuthbertsonii-subsp-linearis",
    "plant_name_scientific": "acacia cuthbertsonii subsp. linearis",
    "intro": "Acacia cuthbertsonii subsp. linearis, commonly known as the linear acacia, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, often multi-branched stems and small, linear leaves that are typically arranged in dense clusters. The plant produces yellow globular flowerheads that appear in late winter to early spring, attracting nectar-feeding birds and insects. It is well adapted to dry conditions, with deep root systems that allow it to thrive in nutrient-poor soils. This subspecies is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cuthbertsonii"
    },
    "taxonomy_art_desc": "Acacia cuthbertsonii subsp. linearis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive bipinnate leaves and yellow or white flowers. Its species is Acacia cuthbertsonii, a specific type of acacia that is further divided into subspecies, with subsp. linearis being one of its recognized varieties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cuthbertsonii subsp. linearis is primarily native to Western Australia. This subspecies is found in the southern and western regions of the state. It typically grows in sandy or gravelly soils in open habitats. The plant is commonly seen in coastal and inland areas. Its distribution is limited to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia cuthbertsonii subsp. linearis was mainly introduced to South Australia and parts of Western Australia. It is commonly found in sandy soils along coastal regions and in dunes. This subspecies is known for its slender, linear leaves and yellow flowering spikes. It is often used in revegetation projects due to its hardiness and ability to stabilize sand dunes. However, it is considered a potential weed in some areas where it can spread rapidly."
}
