{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia comans",
    "plant_slug": "acacia-comans",
    "plant_name_scientific": "acacia comans",
    "intro": "Acacia comans, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in summer. The plant produces long, flat pods that contain seeds, and it is often found in dry, rocky habitats. Acacia comans is drought-tolerant and thrives in well-drained soils. It plays an important role in local ecosystems and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia comans"
    },
    "taxonomy_art_desc": "Acacia comans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose family. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are predominantly found in Australia and are known for their unique, often spiny foliage. Its species is Acacia comans, a specific type of acacia native to Australia, characterized by its shrub-like appearance and specific ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia comans is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the coastal and near-coastal areas. This plant thrives in sandy soils and is often associated with coastal heath and shrubland habitats. It is a hardy species that can tolerate dry conditions and is part of the local flora in the region. Acacia comans plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia comans was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces. The plant thrives in sandy or gravelly soils and is often seen in coastal and inland fynbos vegetation. Due to its adaptability, it has spread beyond its original introduction sites. However, it is not considered invasive in most areas where it is established."
}
