{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia curbeloi",
    "plant_slug": "acacia-curbeloi",
    "plant_name_scientific": "acacia curbeloi",
    "intro": "Acacia curbeloi, commonly known as the desert wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, wiry stems and small, yellow flowers that bloom in clusters. The plant has phyllodes, which are flattened leaf-like structures that reduce water loss and help it survive in dry conditions. Acacia curbeloi is adapted to low rainfall and high temperatures, making it a hardy species in harsh environments. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia curbeloi is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and South Africa. It is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. This plant thrives in environments with low rainfall and high sunlight exposure. It is well adapted to the harsh conditions of its native habitat. Due to its resilience, it plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia curbeloi was mainly introduced to new environments as an ornamental plant due to its unique appearance and hardy nature. It is commonly found in regions with arid or semi-arid climates, where it thrives in well-drained soils. The plant's introduction has led to its establishment in several non-native areas, sometimes becoming invasive. Its rapid growth and ability to colonize disturbed sites contribute to its spread. Conservation efforts are being considered to manage its impact on native ecosystems."
}
