{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella var. subsessilis",
    "plant_slug": "acacia-pulchella-var-subsessilis",
    "plant_name_scientific": "acacia pulchella var. subsessilis",
    "intro": "Acacia pulchella var. subsessilis, commonly known as the narrow-leaved wattle, is a shrub native to Western Australia. It features small, bright yellow flowers that appear in late winter to early spring. The leaves are narrow and slightly twisted, giving the plant a distinctive appearance. It thrives in well-drained soils and is often found in coastal and sandy habitats. This variety is valued for its ornamental appeal and ability to attract native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella var. subsessilis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils and rocky outcrops within these regions. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of the savanna and desert ecosystems. The plant is often seen growing along roadsides and in open grasslands. Its distribution is closely tied to the availability of well-drained soil and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acacia pulchella var. subsessilis was mainly introduced to New Zealand. It was brought there during the 19th century as an ornamental plant due to its attractive appearance. However, it has since become naturalized and is now found growing in various habitats across the country. The plant is considered a potential weed in some regions because of its ability to spread rapidly. It is often found in disturbed soils and can thrive in a range of environmental conditions."
}
