{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia orites",
    "plant_slug": "acacia-orites",
    "plant_name_scientific": "acacia orites",
    "intro": "Acacia orites, commonly known as the silver acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, pale green or yellowish leaves that are typically reduced to spines. The plant produces yellow globular flowers that bloom in late summer, attracting various pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by wind. Acacia orites is well-suited to harsh environments and is often used in traditional medicine and for soil stabilization.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia orites"
    },
    "taxonomy_art_desc": "Acacia orites belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-shaped acorns and nitrogen-fixing capabilities. Its species is Acacia orites, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia orites is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, sandy soils across these regions. This plant thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the climate conditions of the Australian interior. Acacia orites plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia orites was mainly introduced to control soil erosion and provide shade in degraded lands. It is commonly found in arid and semi-arid regions where it forms dense thickets. The plant has been widely planted in Australia and parts of Africa for its hardy nature and ability to thrive in poor soils. Its introduction has helped in restoring degraded ecosystems and supporting livestock grazing. However, it can sometimes become invasive if not managed properly."
}
