{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tumida var. kulparn",
    "plant_slug": "acacia-tumida-var-kulparn",
    "plant_name_scientific": "acacia tumida var. kulparn",
    "intro": "Acacia tumida var. kulparn, commonly known as the kulparn wattle, is a small to medium-sized shrub native to Western Australia. It features feathery, bipinnate leaves that are grey-green in color, giving it a distinctive appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical inflorescences. It is well adapted to sandy soils and is often found in coastal and inland areas. The kulparn wattle is also valued for its ornamental appeal and ecological benefits in local ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tumida"
    },
    "taxonomy_art_desc": "Acacia tumida var. kulparn belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their thorny stems and often compound leaves. Its species is Acacia tumida, a specific type of acacia that is further divided into the variety kulparn, which exhibits unique morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tumida var. kulparn is primarily native to the Northern Territory and Western Australia. This variety of acacia is typically found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is commonly seen in open woodlands and shrublands. The plant is well adapted to the harsh environmental conditions of its native range. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia tumida var. kulparn was mainly introduced to South Australia as a hardy ornamental plant for its attractive foliage and drought tolerance. It is commonly found in gardens and along roadsides where it thrives in well-drained soils. The plant is valued for its ability to withstand harsh environmental conditions, making it suitable for arid and semi-arid regions. However, it has also been reported to spread into native vegetation, raising concerns about its potential as an invasive species. Its introduction has led to increased interest in its ecological impact and management strategies."
}
