{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guymeri",
    "plant_slug": "acacia-guymeri",
    "plant_name_scientific": "acacia guymeri",
    "intro": "Acacia guymeri, commonly known as the Guymer's wattle, is a small shrub native to the arid regions of Western Australia. It is characterized by its slender, wiry stems and compound leaves composed of numerous small, paired leaflets. The plant produces yellow flowers in summer, which are clustered in cylindrical spikes, attracting nectar-feeding birds and insects. Acacia guymeri is adapted to survive in harsh, dry conditions with deep root systems and waxy leaf coatings to reduce water loss. It plays an important ecological role in stabilizing sandy soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia guymeri"
    },
    "taxonomy_art_desc": "Acacia guymeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia guymeri, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guymeri is primarily native to Queensland. It is found in the eastern part of the state, particularly in the tropical and subtropical regions. This plant typically grows in coastal areas and lowland rainforests. It is adapted to the warm and humid climate of Queensland. Acacia guymeri is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acacia guymeri was mainly introduced to South Africa, where it has been used for erosion control and as a source of timber. It is also found in other parts of southern Africa, including Namibia and Botswana. The plant thrives in arid and semi-arid environments, making it well-suited for rehabilitation of degraded lands. Its introduction has had both positive and negative ecological impacts, including competition with native species. Due to its hardy nature, it is often planted in reforestation projects across the region."
}
