{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rurrenabaqueana",
    "plant_slug": "acacia-rurrenabaqueana",
    "plant_name_scientific": "acacia rurrenabaqueana",
    "intro": "Acacia rurrenabaqueana, commonly known as the Rurrenabaque acacia, is a tree native to the Amazon rainforest of Bolivia. It is characterized by its slender, straight trunk and bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers arranged in cylindrical clusters, which are followed by flat, pod-like fruits. It is adapted to the humid and nutrient-poor soils of the region, and it plays a role in providing habitat and food for various wildlife. Due to its unique appearance and ecological importance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rurrenabaqueana is primarily native to the Amazon Basin, specifically in parts of northern Brazil, western French Guiana, and northern Bolivia. This species is commonly found in the understory of humid tropical forests. It thrives in areas with high rainfall and well-drained soils. The plant is often associated with secondary growth and disturbed habitats within the region. Its distribution is limited to specific ecological niches within this geographic range.",
    "distribution_introduced_art_desc": "Acacia rurrenabaqueana was mainly introduced to specific regions in Bolivia, particularly in the departments of Santa Cruz and Tarija, where it has been cultivated for its ornamental and ecological value. This plant is known for its ability to thrive in tropical and subtropical climates, making it suitable for reforestation and soil stabilization projects. It has also been introduced to other parts of South America, including parts of Brazil and Peru, as part of conservation and afforestation initiatives. Due to its resilience and rapid growth, it has become an important species in restoring degraded lands. However, its introduction has raised concerns about its potential impact on native ecosystems if not managed properly."
}
