{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella laevis",
    "plant_slug": "acaciella-laevis",
    "plant_name_scientific": "acaciella laevis",
    "intro": "Acaciella laevis, commonly known as the smooth acacia, is a small shrub native to arid and semi-arid regions of South America. It is characterized by its simple, smooth, and often hairless leaves, which are typically alternate and elliptical in shape. The plant produces small, yellowish flowers arranged in compact clusters, which are followed by woody pods containing flattened seeds. Acaciella laevis is adapted to survive in harsh, dry environments, with deep root systems that help it access water from deeper soil layers. It is also noted for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella laevis is primarily native to the Caribbean region, including parts of Cuba, Hispaniola, and the Bahamas. It is commonly found in coastal areas and dry forests, where it thrives in sandy or well-drained soils. This plant is adapted to the warm, tropical climate and is often associated with limestone substrates. It plays an important role in the local ecosystem by providing habitat and food for various species. Due to habitat loss and environmental changes, its distribution has become limited in some areas.",
    "distribution_introduced_art_desc": "Acaciella laevis was mainly introduced to urban and disturbed areas due to its adaptability and rapid growth. It is commonly found along roadsides, in vacant lots, and in areas with poor soil conditions. This plant has been reported in several regions of South America, including Argentina, Brazil, and Uruguay. Its introduction is often associated with human activities such as land clearing and landscaping. However, it is considered a potential invasive species in some areas where it can outcompete native vegetation."
}
