{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chaconensis",
    "plant_slug": "acacia-chaconensis",
    "plant_name_scientific": "acacia chaconensis",
    "intro": "Acacia chaconensis, commonly known as the Chacon's acacia, is a flowering plant native to South America, particularly found in Argentina and Chile. It belongs to the Fabaceae family, which is characterized by its pod fruits and often nitrogen-fixing abilities. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are bipinnate, meaning they are divided into small, feather-like segments, and it produces yellow flowers in globular or cylindrical inflorescences. Acacia chaconensis is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chaconensis is primarily native to South America, specifically found in countries such as Brazil, Bolivia, Paraguay, and Argentina. It is commonly found in dry to semi-arid regions, particularly in the subtropical and tropical areas of these countries. This species is often associated with savannas, grasslands, and rocky outcrops where it thrives in well-drained soils. It plays an important ecological role in its native habitat by providing shelter and food for various animals. Due to its adaptability, it is also sometimes cultivated in other regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acacia chaconensis was mainly introduced to the Mediterranean region for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and landscaped areas where it provides shade and visual interest. The plant is also used in reforestation projects due to its fast growth rate and nitrogen-fixing properties. However, it has become invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
