{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pubirhachis",
    "plant_slug": "acacia-pubirhachis",
    "plant_name_scientific": "acacia pubirhachis",
    "intro": "Acacia pubirhachis, commonly known as the hairy wattle, is a shrub native to Australia. It is characterized by its slender, often twisted stems and small, yellow flowers arranged in spikes. The leaves are bipinnate, with numerous tiny leaflets that give the plant a feathery appearance. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid environments. The plant is also valued for its ornamental appeal and ability to fix nitrogen in the soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pubirhachis"
    },
    "taxonomy_art_desc": "Acacia pubirhachis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and complex multicellular structures. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia pubirhachis, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pubirhachis is primarily native to New Guinea and Queensland. This species is commonly found in the tropical and subtropical regions of these areas. It thrives in open woodlands and disturbed soils, often in coastal and inland habitats. The plant is well adapted to the humid and warm climate of its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia pubirhachis was mainly introduced to Australia as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond cultivation and is now considered invasive in several regions, particularly in Queensland and New South Wales. The plant thrives in a variety of soil types but prefers well-drained soils and full sun. Its rapid growth and ability to form dense thickets make it a significant ecological threat. Management efforts focus on early detection and control to prevent further spread."
}
