{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sarmentosa",
    "plant_slug": "acacia-sarmentosa",
    "plant_name_scientific": "acacia sarmentosa",
    "intro": "Acacia sarmentosa, commonly known as the coastal acacia, is a shrub native to coastal regions of southern Africa. It is characterized by its slender, often prostrate stems that form dense mats, which help stabilize sandy soils. The plant produces small, yellow flowers arranged in globular clusters, which attract pollinators such as bees and birds. Its leaves are bipinnate, consisting of multiple pairs of small, oval leaflets. Acacia sarmentosa is adapted to saline and arid conditions, making it a hardy species for coastal environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sarmentosa is primarily native to eastern Australia, including Queensland, New South Wales, and Victoria. It is commonly found in dry, open habitats such as grasslands, heathlands, and rocky outcrops. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is often associated with sandy or loamy soils and can tolerate poor soil conditions. Acacia sarmentosa is an important component of the local flora and provides habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia sarmentosa was mainly introduced to control erosion and for its ornamental value in certain regions. It is commonly found in disturbed soils and along roadsides where it thrives in dry, sunny conditions. This plant has been introduced to parts of the United States, particularly in the southwestern states. Its rapid growth and ability to colonize open areas make it a useful plant for land stabilization. However, it can also become invasive in some environments if not managed properly."
}
