{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subalata",
    "plant_slug": "acacia-subalata",
    "plant_name_scientific": "acacia subalata",
    "intro": "Acacia subalata, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often silver-gray stems and bipinnate leaves that are finely divided. The plant produces yellow globular flowers in late summer, which are followed by flat, leathery pods. Acacia subalata thrives in well-drained soils and is adapted to dry, sunny environments. It is often found in coastal and inland regions of southern Australia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subalata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in savanna woodlands and rocky outcrops where it thrives in well-drained soils. This plant is adapted to dry climates and can survive in areas with low rainfall and high temperatures. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia subalata is also known for its hardy nature, making it a resilient component of the local flora.",
    "distribution_introduced_art_desc": "Acacia subalata was mainly introduced to areas with well-drained soils and a temperate to subtropical climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It has been successfully established in parts of Australia and the United States. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
