{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ignorata",
    "plant_slug": "acacia-ignorata",
    "plant_name_scientific": "acacia ignorata",
    "intro": "Acacia ignorata, commonly known as the white wattle, is a small shrub native to the arid regions of Australia. It is characterized by its slender, often spiny stems and small, pale yellow flowers that bloom in winter. The plant produces flat, pod-like fruits that contain several seeds, which are dispersed by wind. Acacia ignorata is adapted to survive in dry, sandy soils and can endure periods of drought. Its foliage is often used by native animals, and it plays a role in stabilizing sandy soils in its habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ignorata is primarily native to northern Australia, including the Northern Territory, Western Australia, and Queensland. It thrives in arid and semi-arid regions, often found in sandy soils and open woodlands. This species is well adapted to the harsh conditions of the Australian outback, including high temperatures and low rainfall. It is commonly seen in coastal and inland areas where it forms part of the local flora. Acacia ignorata plays an important ecological role by providing habitat and food for various native animals and insects.",
    "distribution_introduced_art_desc": "Acacia ignorata was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is often found in sandy or rocky soils, making it adaptable to harsh environments. This plant is commonly used for erosion control due to its extensive root system. It thrives in regions with low rainfall and can tolerate high temperatures. Its introduction has been noted in several parts of Australia and the southwestern United States."
}
