{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia × tristis",
    "plant_slug": "acacia-×-tristis",
    "plant_name_scientific": "acacia × tristis",
    "intro": "Acacia × tristis, commonly known as the weeping acacia, is a hybrid species resulting from the cross between Acacia aneura and Acacia longifolia. It is a small, deciduous tree or shrub characterized by its drooping, feathery foliage that gives it a distinctive, ornamental appearance. The plant produces yellow, globular flower heads that bloom in spring, attracting various pollinators. It thrives in well-drained soils and is often found in coastal and semi-arid regions of southern Australia. Due to its unique form and adaptability, it is cultivated for ornamental purposes in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia × tristis"
    },
    "taxonomy_art_desc": "Acacia × tristis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants with characteristic features such as legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, known for its distinctive pod fruits and nitrogen-fixing symbiosis with bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their characteristic phyllodes and often used for timber and fodder. Its species is Acacia × tristis, a hybrid species resulting from the cross between Acacia aneura and Acacia longifolia, commonly found in arid regions of Australia and known for its hardy nature and ecological importance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia × tristis is primarily native to Victoria. It is a hybrid species that occurs naturally in the region. This plant is commonly found in various habitats within Victoria, including coastal areas and dry sclerophyll forests. It is well adapted to the local climate and soil conditions. Its presence highlights the biodiversity of Victoria's native flora.",
    "distribution_introduced_art_desc": "Acacia × tristis was mainly introduced to areas where its ornamental value and hardiness make it suitable for landscaping and erosion control. It is commonly found in regions with temperate to subtropical climates, particularly in parts of Australia and the United States. This hybrid species is often used in gardens and along roadsides due to its ability to thrive in various soil types. However, it can become invasive in some environments if not managed properly. Its introduction has raised concerns about its potential impact on native ecosystems."
}
