{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ataxantha",
    "plant_slug": "acacia-ataxantha",
    "plant_name_scientific": "acacia ataxantha",
    "intro": "Acacia ataxantha, commonly known as the white wattle, is a shrub native to Australia. It is characterized by its slender, branching structure and small, yellowish-green flowers that appear in clusters. The plant produces flat, oval pods that contain seeds coated in a sticky, resinous substance. Acacia ataxantha thrives in arid and semi-arid environments, often found in sandy soils. Its botanical features make it an important component of local ecosystems and a subject of study in plant ecology.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ataxantha is primarily native to eastern Australia, including Queensland, New South Wales, and Victoria. It is commonly found in dry, open habitats such as woodlands, grasslands, and rocky areas. This plant thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is well adapted to nutrient-poor soils and can withstand periods of drought. Acacia ataxantha plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia ataxantha was mainly introduced to areas with sandy or gravelly soils, often in arid or semi-arid regions. It thrives in environments with low rainfall and high temperatures. This plant is commonly found in coastal dunes and inland sand plains. Its introduction has led to its establishment in several regions outside its native range. It is considered an invasive species in some areas where it outcompetes native vegetation."
}
