{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oswaldii var. abbreviata",
    "plant_slug": "acacia-oswaldii-var-abbreviata",
    "plant_name_scientific": "acacia oswaldii var. abbreviata",
    "intro": "Acacia oswaldii var. abbreviata, commonly known as the narrow-leaved wattle, is a shrub native to New Zealand. It features feathery, bipinnate leaves that are shorter and more compact compared to other acacia species. The plant produces yellow globular flowers in early to mid-spring, attracting nectar-feeding birds and insects. It thrives in well-drained soils and is often found in coastal and inland scrub habitats. Due to its ornamental value and ecological importance, it is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oswaldii var. abbreviata is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This plant thrives in sandy or rocky soils and is commonly found in savanna and shrubland habitats. It is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native environment. The distribution of this variety is closely linked to the availability of well-drained soil and sufficient sunlight. Due to its hardy nature, it plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia oswaldii var. abbreviata was mainly introduced to New Zealand. It was brought there as part of the broader introduction of Acacia species for ornamental and agricultural purposes. This variety is characterized by its shorter, more compact growth form compared to other Acacia species. It has since become naturalized in certain areas, particularly in coastal and disturbed habitats. However, its spread is limited compared to other invasive Acacia species in the region."
}
