{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia somalensis",
    "plant_slug": "acacia-somalensis",
    "plant_name_scientific": "acacia somalensis",
    "intro": "Acacia somalensis, commonly known as the Somali acacia, is a shrub or small tree native to the Horn of Africa. It is characterized by its long, slender, and often twisted branches, which are typically covered in a dense layer of light yellow or brownish bark. The plant produces small, greenish-yellow flowers that bloom in clusters, followed by flat, pod-like fruits containing seeds. Its leaves are bipinnate, meaning they are divided into small, feather-like leaflets, which help reduce water loss in arid environments. Acacia somalensis is well adapted to dry climates and is often found in savannas and rocky areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia somalensis is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is commonly found in dry, arid, and semi-arid regions, often growing in savannas and along coastal areas. This plant thrives in sandy or rocky soils and is well adapted to the harsh climate of its native habitat. It plays an important ecological role by providing food and shelter for various wildlife species. Additionally, it is used locally for its timber, gum, and as a source of fuel.",
    "distribution_introduced_art_desc": "Acacia somalensis was mainly introduced to areas with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in regions of East Africa, including Somalia, Kenya, and Ethiopia, where it has been planted for its ecological and economic benefits. This plant is often used for soil stabilization, providing shade, and as a source of timber and fodder. Its introduction has also supported local communities by offering sustainable resources. However, it requires careful management to prevent it from becoming invasive in new environments."
}
