{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wickhamii subsp. cassitera",
    "plant_slug": "acacia-wickhamii-subsp-cassitera",
    "plant_name_scientific": "acacia wickhamii subsp. cassitera",
    "intro": "Acacia wickhamii subsp. cassitera, commonly known as the Cassitera acacia, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, multi-branched stems and small, pale green phyllodes that are often covered in fine hairs. The plant produces yellow flowers in globular or cylindrical clusters, which attract various pollinators. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. This subspecies is also valued for its ecological role in providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia wickhamii"
    },
    "taxonomy_art_desc": "Acacia wickhamii subsp. cassitera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its primitive floral structures. Its order is Fabales, which consists of flowering plants that typically have small, clustered flowers and include legumes and other nitrogen-fixing plants. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and their ability to fix nitrogen. Its species is Acacia wickhamii, a specific type of acacia that includes the subspecies cassitera, which is adapted to specific environmental conditions and exhibits unique morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wickhamii subsp. cassitera is primarily native to Queensland. This subspecies is found in the tropical and subtropical regions of the state. It typically grows in sandy soils and is commonly associated with coastal and inland areas. The plant is well adapted to the local climate and environmental conditions. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia wickhamii subsp. cassitera was mainly introduced to South Australia and Western Australia. It is commonly found in sandy soils along coastal areas and in open woodlands. This subspecies is known for its ability to thrive in arid and semi-arid environments. It has been used in ecological restoration projects due to its hardiness and adaptability. However, it is considered a potential weed in some regions where it can spread aggressively."
}
