{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paradoxa",
    "plant_slug": "acacia-paradoxa",
    "plant_name_scientific": "acacia paradoxa",
    "intro": "Acacia paradoxa, commonly known as the devil's claw, is a strikingly unique plant native to southern Africa. It is characterized by its long, twisted, claw-like seed pods that give it its common name. The plant features feathery, bipinnate leaves and produces yellow flowers that bloom in winter. Acacia paradoxa is adapted to arid environments, with deep roots that allow it to survive in drought conditions. Its distinctive appearance and ecological importance make it a notable species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia paradoxa"
    },
    "taxonomy_art_desc": "Acacia paradoxa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises ferns and their allies, known for their spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia paradoxa, a specific type of acacia found in certain regions, notable for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [
        "California",
        "Cape Provinces",
        "Chile Central",
        "DR Congo",
        "India",
        "New Zealand North",
        "New Zealand South",
        "Northern Provinces",
        "Palestine",
        "Tasmania",
        "Western Australia"
    ],
    "distribution_native_art_desc": "Acacia paradoxa is primarily native to New South Wales, Queensland, South Australia, and Victoria. This species is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands or on rocky outcrops. The plant is well adapted to the harsh climatic conditions of its native range. Its distribution reflects its ability to survive in low-resource environments.",
    "distribution_introduced_art_desc": "Acacia paradoxa was mainly introduced to California, Cape Provinces, Chile Central, DR Congo, India, New Zealand North, New Zealand South, Northern Provinces, Palestine, Tasmania, and Western Australia. It has been widely cultivated for its ornamental value and potential use in erosion control. The plant thrives in a variety of climates, making it adaptable to different regions. However, its introduction has raised concerns about its potential to become invasive in some areas. It is commonly found in both urban and rural landscapes across these regions."
}
