{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acoma",
    "plant_slug": "acacia-acoma",
    "plant_name_scientific": "acacia acoma",
    "intro": "Acacia acoma, commonly known as the desert acacia, is a shrub native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its slender, branching structure and small, bipinnate leaves that reduce water loss. The plant produces yellowish or pale green flowers, which are clustered in spherical inflorescences. Its seeds are enclosed in pod-like fruits that split open when mature. Acacia acoma is well adapted to harsh environments, making it a resilient component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia acoma"
    },
    "taxonomy_art_desc": "Acacia acoma belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, a group of flowering plants that includes legumes and related families, known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acicular leaves and often being used in traditional medicine and as sources of timber. Its species is Acacia acoma, a specific type of acacia found in certain regions, recognized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acoma is primarily native to Western Australia. It is found in the southern and southwestern regions of the state. This plant typically grows in sandy or gravelly soils within open woodlands and heathlands. It is well adapted to the dry and arid conditions of its native habitat. Acacia acoma plays an important role in the local ecosystem by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia acoma was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia and parts of Southeast Asia. This plant is often used for its hardy nature and ability to stabilize soil in degraded landscapes. Its introduction has sometimes led to ecological concerns due to its competitive growth. However, it is also valued for its ornamental qualities and potential in reforestation projects."
}
