{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heterophylla var. latifolia",
    "plant_slug": "acacia-heterophylla-var-latifolia",
    "plant_name_scientific": "acacia heterophylla var. latifolia",
    "intro": "Acacia heterophylla var. latifolia, commonly known as the broad-leafed wattle, is a shrub or small tree native to Western Australia. It is characterized by its compound leaves, which are typically alternate and consist of multiple pairs of narrow, linear leaflets. The plant produces yellow, fluffy flowers in late winter to early spring, which are arranged in cylindrical spikes. It thrives in well-drained soils and is often found in coastal and sandy environments. This variety is noted for its adaptability and is sometimes cultivated for ornamental purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heterophylla var. latifolia is primarily native to eastern Australia, including the states of Queensland, New South Wales, and Victoria. It is commonly found in dry sclerophyll forests and woodland habitats. This variety is adapted to well-drained soils and is often associated with rocky or sandy substrates. It thrives in regions with a Mediterranean climate, characterized by dry summers and wet winters. The plant is an important component of the native flora in these areas, contributing to biodiversity and ecological stability.",
    "distribution_introduced_art_desc": "Acacia heterophylla var. latifolia was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is often found in coastal and sandy soils, making it suitable for dune stabilization. It has been introduced to several parts of Australia, including New South Wales and Victoria. Due to its hardy nature, it is sometimes used in landscaping and erosion control."
}
