{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sekhukhuniensis",
    "plant_slug": "acacia-sekhukhuniensis",
    "plant_name_scientific": "acacia sekhukhuniensis",
    "intro": "Acacia sekhukhuniensis, commonly known as the Khomani acacia, is a shrub native to the Kalahari Desert in southern Africa. It is characterized by its slender, multi-branched stems and small, pale green leaves that are often covered in a fine layer of white wax. The plant produces yellow flowers during the rainy season, which are followed by elongated, flat pods containing seeds. It is adapted to arid conditions, with deep roots that allow it to access groundwater. Acacia sekhukhuniensis plays an important ecological role in stabilizing sandy soils and providing habitat for various desert species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sekhukhuniensis is primarily native to South Africa, specifically the eastern and northeastern regions. It is found in the provinces of Mpumalanga and Limpopo. This species thrives in rocky outcrops and dry, sandy soils. It is commonly associated with the escarpment regions and is part of the fynbos vegetation type. Acacia sekhukhuniensis is an important component of the local flora and is adapted to the semi-arid climate of its native habitat.",
    "distribution_introduced_art_desc": "Acacia sekhukhuniensis was mainly introduced to South Africa, particularly in the Eastern Cape and Lesotho regions. It is commonly found in rocky outcrops and mountainous areas where it thrives in well-drained soils. This species is often used for erosion control due to its deep root system and ability to withstand drought conditions. Its introduction has helped stabilize soil in degraded landscapes. However, it is considered a potential invasive species in some areas, requiring careful management to prevent its spread."
}
