{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nellyrenza",
    "plant_slug": "acacia-nellyrenza",
    "plant_name_scientific": "acacia nellyrenza",
    "intro": "Acacia nellyrenza, commonly known as Nelly's acacia, is a shrub or small tree native to eastern Africa. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is well adapted to arid and semi-arid environments, making it a resilient species in dry regions. Its seeds are often used in traditional medicine, and the plant can also serve as a source of fodder for livestock. Acacia nellyrenza plays an important ecological role in stabilizing soil and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nellyrenza is primarily native to the island of Madagascar. It is found in the eastern part of the country, particularly in the dry deciduous forest and spiny forest ecosystems. This species thrives in arid and semi-arid environments, often growing in rocky soils. It is commonly observed in the regions of Anosibe-Anatso and Toliara. Acacia nellyrenza plays an important role in the local flora and is adapted to the unique climate and soil conditions of Madagascar.",
    "distribution_introduced_art_desc": "Acacia nellyrenza was mainly introduced to South Africa as an ornamental plant due to its unique appearance and hardy nature. It has since spread beyond its original cultivation areas, establishing itself in various habitats across the region. The plant is particularly adapted to arid and semi-arid environments, which has contributed to its successful establishment. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, careful management is recommended to prevent unintended ecological impacts."
}
