{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella houghii",
    "plant_slug": "acaciella-houghii",
    "plant_name_scientific": "acaciella houghii",
    "intro": "Acaciella houghii, commonly known as the Hough's acaciella, is a shrub native to the arid regions of southern Africa. It belongs to the Fabaceae family, which is characterized by its nitrogen-fixing abilities through symbiotic relationships with rhizobia bacteria. The plant has small, bipinnate leaves and produces yellow to orange flowers that are clustered in inflorescences. It is adapted to survive in harsh, dry environments with minimal water availability. Acaciella houghii is often used in traditional medicine and is valued for its ecological role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella houghii is primarily native to the Caribbean islands, particularly the Greater Antilles. It is found in countries such as Cuba, Hispaniola, and Jamaica. This species typically grows in moist, shaded forest understories. It is commonly associated with limestone soils and is often found in humid tropical environments. Due to its restricted habitat, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acaciella houghii was mainly introduced to the Hawaiian Islands. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in disturbed soils and can spread rapidly in coastal and lowland habitats. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
