{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cochliacantha f. houghii",
    "plant_slug": "acacia-cochliacantha-f-houghii",
    "plant_name_scientific": "acacia cochliacantha f. houghii",
    "intro": "Acacia cochliacantha f. houghii, commonly known as the Hough's acacia, is a flowering plant native to South Africa. It belongs to the Fabaceae family, characterized by its pod-bearing fruits and nitrogen-fixing abilities. The plant features bipinnate leaves and produces yellow to orange flowers arranged in dense, globular inflorescences. It is often found in rocky or sandy soils and is adapted to arid environments. Its botanical structure supports its role in ecological systems, providing food for various insects and animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cochliacantha f. houghii is primarily native to southern Africa, specifically South Africa. It is found in the Eastern Cape and Western Cape provinces. This plant thrives in coastal and mountainous regions with a Mediterranean climate. It is commonly found in fynbos vegetation, which is characteristic of the region. Its distribution is limited to specific areas due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Acacia cochliacantha f. houghii was mainly introduced to specific regions for its ornamental value and potential for soil stabilization. It is commonly found in areas with dry to semi-arid climates, where it thrives in well-drained soils. This introduction has been primarily driven by horticultural interests and ecological restoration projects. However, its spread has raised concerns due to its potential invasiveness in certain environments. Careful management is recommended to prevent unintended ecological impacts."
}
