{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subtilinervis",
    "plant_slug": "acacia-subtilinervis",
    "plant_name_scientific": "acacia subtilinervis",
    "intro": "Acacia subtilinervis, commonly known as the fine-veined acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It is characterized by its slender, often thornless stems and bipinnate leaves with finely divided, thread-like leaflets. The plant produces yellow to golden yellow globular flowers arranged in dense, cylindrical inflorescences. Its pods are flat, linear, and contain several seeds enclosed in a fibrous mesh. Acacia subtilinervis is adapted to dry environments and is often found in savannas and woodland areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia subtilinervis"
    },
    "taxonomy_art_desc": "Acacia subtilinervis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and showy petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia subtilinervis, a specific type of acacia with finely veined leaves and typically found in arid or semi-arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subtilinervis is primarily native to New South Wales and Victoria. This species is commonly found in the temperate regions of southeastern Australia. It thrives in a variety of soil types but is often associated with dry, open habitats. The plant is well adapted to the local climate and can tolerate periods of drought. It plays an important role in the local ecosystem and is often seen in native gardens and conservation areas.",
    "distribution_introduced_art_desc": "Acacia subtilinervis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It has also been introduced to parts of Southeast Asia for ornamental purposes. However, its introduction has raised concerns about its potential to become invasive in new ecosystems."
}
