{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparia var. media",
    "plant_slug": "acacia-riparia-var-media",
    "plant_name_scientific": "acacia riparia var. media",
    "intro": "Acacia riparia var. media, commonly known as the narrowleaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and narrow, lance-shaped leaves. The plant produces yellow flowers in spikes, which bloom in spring and attract pollinators such as bees and birds. It thrives in well-drained soils and is often found in coastal and inland regions. The species is valued for its ornamental appeal and its role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparia var. media is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in riverine and floodplain habitats, where it thrives in sandy or gravelly soils. This variant is well adapted to drought conditions and can tolerate periodic flooding, making it a characteristic component of riparian ecosystems. It is often seen along the banks of rivers and seasonal watercourses in these regions. Its distribution is closely linked to the availability of water, which shapes its natural habitat and ecological role.",
    "distribution_introduced_art_desc": "Acacia riparia var. media was mainly introduced to stabilize riverbanks and prevent soil erosion in arid and semi-arid regions. It is commonly used in ecological restoration projects due to its ability to thrive in harsh environmental conditions. This plant is also valued for its rapid growth and adaptability to various soil types. Its introduction has helped in reclaiming degraded lands along waterways. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
