{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia strombulifera",
    "plant_slug": "acacia-strombulifera",
    "plant_name_scientific": "acacia strombulifera",
    "intro": "Acacia strombulifera, commonly known as the strombulifera acacia, is a shrub native to southern Africa. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, showcasing drought-resistant features. Its pods contain seeds that are dispersed by wind, aiding in its spread across suitable habitats. Acacia strombulifera plays a role in stabilizing soils and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia strombulifera is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia, Angola, and Botswana. It is commonly found in sandy soils and shrublands, often growing in association with other drought-resistant plants. This species is well adapted to hot, dry climates and can tolerate poor soil conditions. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife. Due to its resilience, it is also occasionally cultivated in other parts of the world for ornamental or practical purposes.",
    "distribution_introduced_art_desc": "Acacia strombulifera was mainly introduced to control soil erosion and as a source of timber and fodder in arid and semi-arid regions. It is commonly found in countries such as Kenya, Tanzania, and Somalia where it has been planted for its hardy nature and rapid growth. However, its introduction has led to the displacement of native vegetation and altered local ecosystems. The plant's ability to thrive in poor soils makes it a valuable but sometimes invasive species. Its distribution is now expanding beyond its original range due to human activities and climate change."
}
