{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farnesiana subsp. pinetorum",
    "plant_slug": "acacia-farnesiana-subsp-pinetorum",
    "plant_name_scientific": "acacia farnesiana subsp. pinetorum",
    "intro": "Acacia farnesiana subsp. pinetorum, commonly known as the honey mesquite, is a shrub or small tree native to the Mediterranean region and parts of southern Europe. It is characterized by its compound leaves, which are typically divided into several pairs of oval-shaped leaflets. The plant produces yellow flowers that are grouped in dense clusters, followed by flat, pod-like fruits containing seeds. It is adapted to dry, rocky soils and is often found in coastal areas and open woodlands. The species is known for its ability to fix nitrogen, making it valuable in soil enrichment and ecological restoration.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farnesiana subsp. pinetorum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky, and coastal environments, often found in scrublands and along cliffs. This subspecies is well adapted to arid and semi-arid climates, making it a common sight in regions with mild, wet winters and hot, dry summers. It is also found in some areas of the Middle East and northern Africa. Due to its hardy nature, it has been introduced to other parts of the world, including the United States and Australia.",
    "distribution_introduced_art_desc": "Acacia farnesiana subsp. pinetorum was mainly introduced to the southeastern United States, particularly in Florida and Texas, as an ornamental plant due to its attractive foliage and ability to thrive in various soil conditions. It has since spread beyond its initial introduction range, becoming naturalized in several regions across the southeastern U.S. This subspecies is known for its rapid growth and ability to form dense thickets, which can outcompete native vegetation. Its introduction has led to concerns about its invasive potential in some areas. Despite its ornamental value, land managers often classify it as a noxious weed due to its ecological impact."
}
