{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dentifera var. intermedia",
    "plant_slug": "acacia-dentifera-var-intermedia",
    "plant_name_scientific": "acacia dentifera var. intermedia",
    "intro": "Acacia dentifera var. intermedia, commonly known as the narrow-leaf acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its bipinnate leaves, which are often narrow and have a feathery appearance. The plant produces yellow globular flowers that bloom in summer, attracting various pollinators. Its bark is typically smooth and grayish, and it can grow in a variety of soil types, though it prefers well-drained conditions. The species is sometimes used in traditional medicine and for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dentifera var. intermedia is primarily native to the coastal regions of southern Australia, including the states of South Australia and Western Australia. This variety is commonly found in sandy soils along the coastline, particularly in areas with a Mediterranean climate. It thrives in dry, sunny conditions and is often seen growing in dunes or on rocky outcrops. The plant is well adapted to the harsh coastal environment, with its small, leathery leaves reducing water loss. It plays an important ecological role in stabilizing dunes and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia dentifera var. intermedia was mainly introduced to areas with well-drained soils and a temperate climate, often as an ornamental or for erosion control. It thrives in regions with moderate rainfall and full sun exposure, making it suitable for arid and semi-arid environments. This plant is commonly found in disturbed soils, along roadsides, and in urban landscapes due to its adaptability. Its introduction has sometimes led to naturalization in certain regions, raising concerns about its potential invasiveness. Proper management is recommended to prevent its spread in native ecosystems."
}
