{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia halliana",
    "plant_slug": "acacia-halliana",
    "plant_name_scientific": "acacia halliana",
    "intro": "Acacia halliana, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are covered in fine, silky hairs, giving it a silvery appearance. The plant produces yellow globular flowers that bloom in late winter to early spring. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The acacia is also known for its ability to fix nitrogen in the soil, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia halliana"
    },
    "taxonomy_art_desc": "Acacia halliana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing capabilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pods as fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species found in Australia and other parts of the world. Its species is Acacia halliana, a specific type of acacia native to Australia, known for its unique ecological and botanical characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia halliana is primarily native to New South Wales, South Australia, and Victoria. This species is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands or along riverbanks. The plant is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia halliana was mainly introduced to areas with sandy soils and coastal environments. It is commonly found in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. This plant has been introduced to several parts of California and the Pacific Northwest in the United States. It thrives in well-drained soils and full sunlight, making it a popular choice for erosion control and landscaping. However, its rapid growth and adaptability have led to concerns about its potential to become invasive in certain ecosystems."
}
