{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia filifolia",
    "plant_slug": "acacia-filifolia",
    "plant_name_scientific": "acacia filifolia",
    "intro": "Acacia filifolia, commonly known as the silky acacia, is a small evergreen shrub native to southern Africa. It is characterized by its slender, thread-like leaves that give it its common name. The plant produces yellow flowers in pendant clusters, which bloom in spring and attract various pollinators. Acacia filifolia is often used in ornamental gardening due to its elegant appearance and drought tolerance. It prefers well-drained soil and full sun, making it suitable for coastal and Mediterranean climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia filifolia"
    },
    "taxonomy_art_desc": "Acacia filifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acorn-like pods and often used in traditional medicine and land restoration. Its species is Acacia filifolia, a specific type of acacia found in certain regions, known for its delicate foliage and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia filifolia is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid zones. This plant thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important ecological role in its native habitat. Acacia filifolia is well adapted to the harsh environmental conditions of Western Australia.",
    "distribution_introduced_art_desc": "Acacia filifolia was mainly introduced to regions with arid or semi-arid climates where it can thrive in poor soils. It is commonly found in areas of Australia, particularly in the Northern Territory and Queensland. The plant is often used for its hardy nature and ability to provide shade and erosion control. Its introduction has sometimes led to ecological concerns due to its potential to become invasive. It is valued for its ecological and ornamental benefits in suitable environments."
}
