{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catechu var. baumii",
    "plant_slug": "acacia-catechu-var-baumii",
    "plant_name_scientific": "acacia catechu var. baumii",
    "intro": "Acacia catechu var. baumii, commonly known as the black acacia, is a deciduous shrub or small tree native to parts of Africa and Asia. It is characterized by its slender, often thornless branches and bipinnate leaves that are finely divided. The plant produces yellow flowers followed by flat, pod-like fruits containing small, dark seeds. It is valued for its hard, heavy wood and for its use in traditional medicine. The bark and leaves are also used to produce tannins and have been historically used in dyeing and leather tanning.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catechu var. baumii is primarily native to Southeast Asia, including countries such as India, Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland and hill areas. This variant is often associated with dry deciduous forests and is well adapted to warm, humid climates. It thrives in well-drained soils and is sometimes cultivated for its timber and traditional uses. The plant plays an important ecological role in its native habitats, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia catechu var. baumii was mainly introduced to regions with warm climates and well-drained soils, often as an ornamental or for its hardy characteristics. It is commonly found in areas with moderate to high rainfall, such as parts of Southeast Asia and the Pacific Islands. The plant thrives in full sun and is adaptable to various soil types, making it a popular choice for landscaping. Its introduction has been primarily for horticultural purposes rather than agricultural use. However, it can sometimes become invasive in certain environments if not managed properly."
}
