{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia myrtifolia var. angustifolia",
    "plant_slug": "acacia-myrtifolia-var-angustifolia",
    "plant_name_scientific": "acacia myrtifolia var. angustifolia",
    "intro": "Acacia myrtifolia var. angustifolia, commonly known as the narrow-leaf golden wattle, is a shrub or small tree native to Australia. It features feathery, bipinnate leaves that are narrow and often covered in fine hairs. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense inflorescences. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The species is valued for its ornamental appeal and its role in stabilizing soil in native landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia myrtifolia var. angustifolia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variant is commonly found in savannas, rocky outcrops, and dry shrublands where it thrives in well-drained soils. It is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. The plant is often used as a source of wood and for its hardy, nitrogen-fixing properties. Its distribution is closely linked to the ecological conditions of the southern African landscape.",
    "distribution_introduced_art_desc": "Acacia myrtifolia var. angustifolia was mainly introduced to urban and suburban landscapes in southern Australia for its ornamental value and hardy nature. It is commonly found in gardens and along roadsides due to its ability to thrive in dry conditions. The plant is valued for its attractive foliage and small yellow flowers that bloom in spring. However, it has also been reported to spread into natural areas, raising concerns about its potential invasiveness. Its distribution is largely limited to regions with Mediterranean climates where it can establish successfully."
}
