{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lutea var. moniliformis",
    "plant_slug": "acacia-lutea-var-moniliformis",
    "plant_name_scientific": "acacia lutea var. moniliformis",
    "intro": "Acacia lutea var. moniliformis, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its yellow flowers, which are clustered in spherical heads, and its bipinnate leaves composed of numerous small leaflets. The plant is often found in dry, sandy soils and is adapted to arid and semi-arid environments. It plays an important role in local ecosystems and is also cultivated for ornamental purposes. The species is notable for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lutea var. moniliformis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variant is commonly found in savannas and grasslands where it thrives in well-drained soils. It is often associated with rocky outcrops and coastal areas, particularly in the Namib Desert and the Skeleton Coast region. The plant is well adapted to dry conditions and can withstand high temperatures and limited rainfall. Its distribution is closely linked to specific ecological zones that provide the necessary environmental conditions for its growth.",
    "distribution_introduced_art_desc": "Acacia lutea var. moniliformis was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in degraded lands and has been used in reclamation projects due to its hardy nature. The plant thrives in well-drained soils and can tolerate drought conditions, making it suitable for rehabilitation efforts. Its rapid growth and ability to fix nitrogen contribute to soil improvement. However, it has also been reported to spread aggressively, potentially displacing native vegetation in some areas."
}
