{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amboensis",
    "plant_slug": "acacia-amboensis",
    "plant_name_scientific": "acacia amboensis",
    "intro": "Acacia amboensis, commonly known as the African milk tree, is a deciduous shrub or small tree native to tropical Africa. It is characterized by its feathery, bipinnate leaves and produces yellow, globular flower heads. The plant is known for its milky sap, which is used in traditional medicine and as a natural adhesive. It thrives in dry, sandy soils and is often found in savanna and woodland habitats. Acacia amboensis plays an important ecological role by providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amboensis is primarily native to Madagascar. It is found in the eastern and southern parts of the island, particularly in dry deciduous forests and coastal areas. This plant thrives in arid and semi-arid environments, often growing on rocky soils. It is an important component of the local flora and is adapted to the unique climate of Madagascar. The species is also known for its distinctive, flat, thorn-like leaves and its role in providing habitat for various wildlife.",
    "distribution_introduced_art_desc": "Acacia amboensis was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and drought tolerance. It has since become naturalized in various regions, particularly in the Western and Eastern Cape provinces. The plant is also used in reforestation projects because of its ability to thrive in poor soil conditions. However, its spread has raised concerns due to its potential to become invasive in certain ecosystems. Despite its benefits, careful management is required to prevent it from outcompeting native vegetation."
}
