{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia producta",
    "plant_slug": "acacia-producta",
    "plant_name_scientific": "acacia producta",
    "intro": "Acacia producta, commonly known as the slender acacia, is a flowering plant native to southern Africa. It is a small, shrub-like species that typically grows in dry, sandy soils. The plant produces yellow flowers in clusters, which are often followed by long, narrow pods. Its leaves are bipinnate, consisting of numerous small leaflets. Acacia producta is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia producta"
    },
    "taxonomy_art_desc": "Acacia producta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia producta, a specific type of acacia found in certain regions of Australia, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia producta is primarily native to the Northern Territory. It is commonly found in arid and semi-arid regions within this area. The plant thrives in sandy or rocky soils and is often seen along roadsides and in open woodlands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is largely restricted to the northern parts of Australia, particularly in the Northern Territory.",
    "distribution_introduced_art_desc": "Acacia producta was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was first brought to the country in the 19th century by European settlers who admired its unique foliage and flowering habits. Despite its ornamental value, it has since become a weed in certain areas, particularly in coastal and disturbed habitats. The plant spreads rapidly through seed dispersal by wind and animals, making it difficult to control once established. Its introduction has raised concerns about its impact on native ecosystems and biodiversity."
}
