{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia grasbyi",
    "plant_slug": "acacia-grasbyi",
    "plant_name_scientific": "acacia grasbyi",
    "intro": "Acacia grasbyi, commonly known as the Desert Acacia, is a shrub or small tree native to arid regions of Australia. It is characterized by its slender, twisted branches and small, feathery leaves that help reduce water loss in hot, dry climates. The plant produces yellow flowers in summer, which are clustered in globular heads and attract various pollinators. Its woody seed pods contain edible seeds that have been used by Indigenous Australians for food and other purposes. Acacia grasbyi is well adapted to survive in nutrient-poor soils and can withstand extreme temperatures and drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia grasbyi"
    },
    "taxonomy_art_desc": "Acacia grasbyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, which is characterized by pods as fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species native to Australia and other regions. Its species is Acacia grasbyi, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia grasbyi is primarily native to New South Wales, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions across these states. It thrives in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the dry climate and can withstand periods of drought. Its distribution reflects its ecological preference for these specific geographic areas.",
    "distribution_introduced_art_desc": "Acacia grasbyi was mainly introduced to areas with sandy or gravelly soils, particularly in arid and semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it well-suited for degraded or disturbed lands. This plant is often found in coastal dunes and inland sandy plains where it helps stabilize soil and prevent erosion. Its introduction has been primarily for land rehabilitation and as a source of timber and fuelwood. However, it can become invasive in some regions if not managed properly."
}
