{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia thailandica",
    "plant_slug": "acacia-thailandica",
    "plant_name_scientific": "acacia thailandica",
    "intro": "Acacia thailandica, commonly known as Thai acacia, is a shrub or small tree native to Southeast Asia, particularly Thailand. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow floral spikes. The plant is well adapted to tropical and subtropical climates, often growing in dry or semi-arid regions. It has small, pod-like fruits that contain seeds, and its roots can fix nitrogen, contributing to soil fertility. The plant is also valued for its ornamental appeal and has traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia thailandica is primarily native to southern Thailand, particularly in the southern regions such as Narathiwat, Yala, and Pattani. It is commonly found in coastal areas and lowland forests where the climate is warm and humid. This species thrives in sandy or clay soils and is often associated with mangrove ecosystems. It plays an important role in local biodiversity and is sometimes used in traditional medicine. Due to habitat loss, its distribution has become restricted in some areas.",
    "distribution_introduced_art_desc": "Acacia thailandica was mainly introduced to areas with warm, dry climates and well-drained soils, often found in regions with seasonal rainfall. It is commonly found in tropical and subtropical regions, particularly in parts of Southeast Asia, including Thailand, Malaysia, and parts of India. This plant is often used for its hardy nature and ability to thrive in harsh conditions, making it suitable for reforestation and soil stabilization projects. Its introduction has been driven by its ecological benefits and potential for commercial use, such as in ornamental gardening and timber production. However, its spread has also raised concerns about potential invasiveness in certain environments."
}
