{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tenuifolia var. veraensis",
    "plant_slug": "acacia-tenuifolia-var-veraensis",
    "plant_name_scientific": "acacia tenuifolia var. veraensis",
    "intro": "Acacia tenuifolia var. veraensis, commonly known as the narrow-leaved wattle, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, feathery foliage and yellow floral spikes that bloom in spring. The plant produces small, pod-like fruits that contain seeds dispersed by wind. It thrives in well-drained soils and is adapted to withstand drought conditions. Its ornamental value makes it a popular choice for xeriscaping in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tenuifolia var. veraensis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This plant thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. It is well adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. The plant plays an important role in local ecosystems by providing food and shelter for various wildlife species. Its distribution is largely limited to the specific environmental conditions of southern Africa.",
    "distribution_introduced_art_desc": "Acacia tenuifolia var. veraensis was mainly introduced to regions with warm, arid climates and well-drained soils, where it thrives in full sun. It is commonly found in coastal areas and sandy soils, making it suitable for erosion control and landscaping. This plant is often used in xeriscaping due to its drought tolerance and ability to grow with minimal water. It has been introduced to several parts of the Mediterranean, southern United States, and parts of Australia. However, its invasive potential in some areas has raised concerns among environmentalists."
}
