{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brunioides subsp. brunioides",
    "plant_slug": "acacia-brunioides-subsp-brunioides",
    "plant_name_scientific": "acacia brunioides subsp. brunioides",
    "intro": "Acacia brunioides subsp. brunioides, commonly known as the coastal acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are covered in fine, soft hairs. The plant produces yellow globular flowers arranged in dense, spherical inflorescences, which bloom during the warmer months. It thrives in coastal and sandy soils, often growing in dune environments. The species is adapted to withstand salt spray and moderate drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia brunioides"
    },
    "taxonomy_art_desc": "Acacia brunioides subsp. brunioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissues and true roots. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their unique foliage and ecological importance. Its species is Acacia brunioides, a specific type of acacia found in certain regions, distinguished by its morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brunioides subsp. brunioides is primarily native to New South Wales and Queensland. This subspecies is commonly found in the subtropical and tropical regions of these states. It thrives in a variety of habitats, including open forests, woodlands, and rocky areas. The plant is well adapted to the local climate and soil conditions of the region. It plays an important ecological role in supporting local wildlife and biodiversity.",
    "distribution_introduced_art_desc": "Acacia brunioides subsp. brunioides was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions of southern Africa. It thrives in full sun and is commonly found in open woodlands and rocky outcrops. This subspecies is known for its drought tolerance and ability to grow in poor soil conditions. It has been introduced for ornamental purposes due to its distinctive foliage and hardy nature. However, it is important to monitor its spread to prevent potential invasiveness in new environments."
}
