{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia calyculata",
    "plant_slug": "acacia-calyculata",
    "plant_name_scientific": "acacia calyculata",
    "intro": "Acacia calyculata, commonly known as the yellow acacia, is a shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves and produces small, yellow flowers in rounded clusters. The plant is well adapted to arid and semi-arid environments, making it drought-tolerant. Its flowers are often visited by bees and other pollinators, contributing to its ecological importance. The plant is also valued for its hard, durable wood and has been used traditionally in various applications.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia calyculata"
    },
    "taxonomy_art_desc": "Acacia calyculata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of plants with compound leaves and flowers that have a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia calyculata, a specific type of acacia found in certain regions, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia calyculata is primarily native to Queensland. It is commonly found in the eastern regions of the state, particularly in areas with sandy soils. This plant thrives in open habitats such as woodlands, grasslands, and coastal dunes. It is well adapted to the tropical and subtropical climates of Queensland. Acacia calyculata plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia calyculata was mainly introduced to New Zealand. It was brought there for its ornamental value and potential for soil stabilization. The plant has since spread into native ecosystems, posing a threat to biodiversity. It is considered an invasive species in several regions of New Zealand. Its rapid growth and ability to form dense thickets make it difficult to control."
}
