{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia incongesta",
    "plant_slug": "acacia-incongesta",
    "plant_name_scientific": "acacia incongesta",
    "intro": "Acacia incongesta, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and narrow, feathery leaves. The plant produces yellow globular flowers that appear in late winter to early spring, attracting nectar-feeding birds and insects. Acacia incongesta is adapted to dry, sandy soils and is often found in coastal and inland regions. Its wood is lightweight and has been traditionally used by Indigenous Australians for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia incongesta"
    },
    "taxonomy_art_desc": "Acacia incongesta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which includes vascular plants with a diverse range of morphological features, including some primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its primitive floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes and are characterized by the presence of compound leaves and pods as fruits. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its nitrogen-fixing ability and diverse ecological roles. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and their ability to thrive in arid environments. Its species is Acacia incongesta, a specific type of acacia native to Australia, characterized by its dense foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia incongesta is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the areas of the Geraldton and Esperance districts. This plant thrives in sandy soils and is often associated with coastal and inland dune environments. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia incongesta plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia incongesta was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It has since spread beyond cultivated areas and is now considered a weed in some regions. The plant thrives in a variety of soil types and is tolerant of both drought and poor soil conditions. Its rapid growth and ability to form dense thickets make it a potential threat to native ecosystems. Efforts are ongoing to manage its spread and prevent further invasion of natural habitats."
}
