{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adenogonia",
    "plant_slug": "acacia-adenogonia",
    "plant_name_scientific": "acacia adenogonia",
    "intro": "Acacia adenogonia, commonly known as the yellow acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often thorned stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow to orange globular flower heads, which are clustered in dense, rounded inflorescences. Acacia adenogonia is well adapted to drought conditions, with deep root systems and the ability to fix atmospheric nitrogen through symbiotic bacteria in its root nodules. It plays an important role in stabilizing soil and providing forage for wildlife in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia adenogonia"
    },
    "taxonomy_art_desc": "Acacia adenogonia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that share a common ancestor and are characterized by their complex cellular structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and their allies, known for their spore-producing reproductive structures and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that typically have primitive floral structures and are often found in tropical and temperate regions. Its order is Fabales, which includes plants with showy flowers and often nitrogen-fixing capabilities, such as legumes. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and land restoration. Its species is Acacia adenogonia, a specific type of acacia found in certain regions of Africa, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adenogonia is primarily native to Western Australia. It is found in the coastal and inland regions of the state, particularly in areas with sandy or loamy soils. This species thrives in a variety of habitats, including woodlands, heathlands, and open grassy areas. It is well adapted to the dry and semi-arid climates typical of much of Western Australia. The plant plays an important ecological role in supporting local wildlife and stabilizing soil in its native range.",
    "distribution_introduced_art_desc": "Acacia adenogonia was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. The plant thrives in disturbed soils and is often used in reclamation projects. Its ability to fix nitrogen makes it beneficial for soil improvement. However, it can become invasive in some environments if not managed properly."
}
