{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oxycedrus",
    "plant_slug": "acacia-oxycedrus",
    "plant_name_scientific": "acacia oxycedrus",
    "intro": "Acacia oxycedrus, commonly known as the Mediterranean acacia, is a shrub or small tree native to the Mediterranean region. It is characterized by its slender, often thorned branches and bipinnate leaves that are fragrant and finely divided. The plant produces yellow flowers in dense, spherical clusters, which are followed by small, woody pods containing seeds. Acacia oxycedrus is adapted to dry, rocky soils and is often found in coastal and mountainous areas. It has historical uses in traditional medicine and as a source of tannins.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia oxycedrus"
    },
    "taxonomy_art_desc": "Acacia oxycedrus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their spore reproduction and often possessing vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes legumes and related plants that are known for their ability to fix atmospheric nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia oxycedrus, a specific type of acacia known for its hardy nature and historical use in various applications.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oxycedrus is primarily native to New South Wales, South Australia, and Victoria. This species is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands or along riverbanks. The plant is well adapted to the climate of these areas, showing resilience to drought and heat. It plays an important ecological role in the local flora and fauna.",
    "distribution_introduced_art_desc": "Acacia oxycedrus was mainly introduced to regions with Mediterranean climates, characterized by mild, wet winters and hot, dry summers. It thrives in well-drained soils and is often found in coastal areas and mountainous regions. This plant is commonly used for ornamental purposes due to its unique foliage and ability to withstand drought conditions. It has also been introduced as a potential source of timber and fuelwood in some parts of the world. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
