{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hyaloneura",
    "plant_slug": "acacia-hyaloneura",
    "plant_name_scientific": "acacia hyaloneura",
    "intro": "Acacia hyaloneura, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and small, bipinnate leaves that are covered in fine, silvery hairs. The plant produces yellow globular flower heads, which are clustered in spikes, typically blooming in spring. Acacia hyaloneura is well adapted to arid and semi-arid environments, showing drought tolerance and resilience. It plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hyaloneura"
    },
    "taxonomy_art_desc": "Acacia hyaloneura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and other related families. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive leaf structures and often used in traditional medicine. Its species is Acacia hyaloneura, a specific type of acacia found in certain regions, known for its unique characteristics and ecological roles.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hyaloneura is primarily native to the Northern Territory and Queensland of Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species is often associated with spinifex grasslands and is well adapted to harsh environmental conditions. It plays an important role in stabilizing soil and providing habitat for native wildlife. Acacia hyaloneura is a shrub or small tree that can grow up to 2 meters in height.",
    "distribution_introduced_art_desc": "Acacia hyaloneura was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in a variety of soil conditions. It has since spread beyond cultivation and is now considered a potential weed in some regions. The plant is particularly invasive in areas with disturbed soils and can outcompete native vegetation. Its rapid growth and seed dispersal mechanisms contribute to its successful establishment in new environments. However, its impact on local ecosystems is still being studied to determine its ecological significance."
}
