{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegal var. leiorachis",
    "plant_slug": "acacia-senegal-var-leiorachis",
    "plant_name_scientific": "acacia senegal var. leiorachis",
    "intro": "Acacia senegal var. leiorachis, commonly known as the gum arabic acacia, is a shrub or small tree native to the Sahel region of Africa. It is characterized by its slender, often thornless branches and bipinnate leaves that are typically small and delicate. The plant produces yellow flowers followed by elongated pods containing a viscous gum, which is harvested for its economic value. It thrives in arid and semi-arid environments, adapting well to poor soil conditions. This variety is closely related to other acacia species but is distinguished by its unique pod structure and gum composition.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegal var. leiorachis is primarily native to the Sahel region of Africa, including countries such as Senegal, Mali, Niger, and Burkina Faso. It thrives in semi-arid and arid environments, often found in sandy soils and along riverbanks. This variety is well adapted to the harsh climatic conditions of the region, including high temperatures and limited rainfall. It plays an important ecological role in preventing soil erosion and providing habitat for local wildlife. Additionally, it is used traditionally for its gum production and as a source of wood and fodder.",
    "distribution_introduced_art_desc": "Acacia senegal var. leiorachis was mainly introduced to regions where its unique traits, such as its ability to thrive in arid conditions and its valuable gum production, make it beneficial for local economies and ecosystems. It has been successfully established in parts of Africa, particularly in countries like Sudan and Ethiopia, where it contributes to soil stabilization and provides resources for both people and wildlife. The plant's introduction has also supported traditional practices and industries reliant on its gum arabic. However, its spread requires careful management to prevent potential ecological impacts. Overall, it serves as an important example of how introduced species can offer both ecological and economic benefits."
}
