{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia divaricata",
    "plant_slug": "acacia-divaricata",
    "plant_name_scientific": "acacia divaricata",
    "intro": "Acacia divaricata, commonly known as the weeping acacia, is a shrub or small tree native to southern Africa. It is characterized by its drooping, feathery foliage that gives it a distinctive, elegant appearance. The plant produces yellow flowers in winter, which are followed by long, flat pods containing seeds. It thrives in well-drained soils and is often found in coastal and sandy areas. Acacia divaricata is also valued for its hardy nature and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia divaricata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savannas, grasslands, and rocky outcrops. This species thrives in regions with a subtropical climate and is often associated with dry, well-drained soils. It is an important component of the local flora and plays a role in supporting wildlife. Acacia divaricata is also known for its distinctive yellow flowers and thorny branches.",
    "distribution_introduced_art_desc": "Acacia divaricata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy soils. The plant is known for its ability to withstand drought and poor soil conditions, which contributes to its successful establishment. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns, prompting management efforts in certain regions."
}
