{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pteroclada",
    "plant_slug": "acacia-pteroclada",
    "plant_name_scientific": "acacia pteroclada",
    "intro": "Acacia pteroclada, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, branching habit and phyllodes that are narrow and often recurved. The plant produces yellow flowers in globular heads, which are typically clustered at the ends of branches. Its bark is smooth and grayish, while its leaves are modified into phyllodes, a common adaptation in acacia species. Acacia pteroclada is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pteroclada is primarily native to the arid and semi-arid regions of Africa, particularly in countries such as Sudan, South Sudan, Eritrea, and Ethiopia. It is commonly found in sandy soils and rocky areas, often growing in association with other drought-tolerant plants. This species is well adapted to harsh environmental conditions, including high temperatures and limited rainfall. It plays an important ecological role in stabilizing soils and providing habitat for various wildlife species. Acacia pteroclada is also occasionally found in parts of the Arabian Peninsula.",
    "distribution_introduced_art_desc": "Acacia pteroclada was mainly introduced to areas with dry, rocky soils and semi-arid climates. It is commonly found in regions such as Australia, South Africa, and parts of the Middle East. This plant thrives in well-drained soils and can tolerate high levels of salt and drought. It is often used for soil stabilization and as a source of timber and fuel. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments."
}
