{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heteroneura var. heteroneura",
    "plant_slug": "acacia-heteroneura-var-heteroneura",
    "plant_name_scientific": "acacia heteroneura var. heteroneura",
    "intro": "Acacia heteroneura var. heteroneura, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It features bipinnate leaves that are narrow and linear, with each leaflet being very small and delicate. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, open habitats. The plant is valued for its ornamental appeal and is sometimes used in landscaping due to its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia heteroneura"
    },
    "taxonomy_art_desc": "Acacia heteroneura var. heteroneura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with pea-like structures and include legumes. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia heteroneura, a specific variety within the Acacia genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heteroneura var. heteroneura is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the York Peninsula. This plant thrives in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. The species plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia heteroneura var. heteroneura was mainly introduced to areas with a warm, temperate to subtropical climate, characterized by well-drained soils and moderate rainfall. It thrives in regions with full sun exposure and is commonly found in coastal and inland areas of southeastern Australia. This plant is often used in landscaping due to its drought tolerance and attractive foliage. It has been introduced to parts of New Zealand and the United States, particularly in southern California and Texas. However, its spread is limited by its specific soil and climate requirements."
}
