{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macrothyrsa",
    "plant_slug": "acacia-macrothyrsa",
    "plant_name_scientific": "acacia macrothyrsa",
    "intro": "Acacia macrothyrsa, commonly known as the large-thorned acacia, is a shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are typically bipinnate and covered in fine hairs. The plant produces yellow flowers arranged in cylindrical spikes, which are followed by flat, pod-like fruits. Its thorny stems provide structural support and defense against herbivores. Acacia macrothyrsa is often found in dry, rocky habitats and is adapted to arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macrothyrsa is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savanna and woodland habitats, where it thrives in well-drained soils. This species is adapted to arid and semi-arid environments, making it a resilient component of the local flora. It is often seen in open grasslands and along riverbanks, contributing to the ecological diversity of these regions. The plant plays an important role in providing habitat and forage for local wildlife.",
    "distribution_introduced_art_desc": "Acacia macrothyrsa was mainly introduced to South Africa, particularly in the Eastern Cape province. It was introduced for its ornamental value and potential for soil stabilization. The plant thrives in dry, sandy soils and is commonly found in coastal areas. It is also used in traditional medicine for its various healing properties. However, it has become invasive in some regions, outcompeting native vegetation."
}
