{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis f. raddiana",
    "plant_slug": "acacia-tortilis-f-raddiana",
    "plant_name_scientific": "acacia tortilis f. raddiana",
    "intro": "Acacia tortilis f. raddiana, commonly known as the umbrella thorn acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its dense, umbrella-like crown of thorny branches, which provides shade and shelter for various animals. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves, adapted to reduce water loss in dry environments. It produces yellow flowers followed by woody pods containing seeds, which are dispersed by animals and wind. The acacia is well adapted to harsh climates and plays an important ecological role in its habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis f. raddiana is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of the Arabian Peninsula, particularly in Yemen and Oman. This plant thrives in arid and semi-arid environments, often growing in rocky soils and along coastal areas. It is commonly associated with coastal dunes and is well adapted to withstand high temperatures and limited rainfall. Its distribution is closely linked to regions with a Mediterranean climate characterized by dry summers and wet winters.",
    "distribution_introduced_art_desc": "Acacia tortilis f. raddiana was mainly introduced to regions where it can thrive in arid and semi-arid environments, particularly in parts of Africa and the Middle East. It is commonly found in areas with low rainfall and high temperatures, where it plays a vital role in stabilizing soil and providing habitat for local wildlife. This plant is often used for its hard, durable wood and its ability to fix nitrogen, making it valuable for both ecological and agricultural purposes. Its introduction has helped in combating desertification and supporting sustainable land use in vulnerable ecosystems. However, its spread must be carefully managed to prevent it from becoming invasive in non-native areas."
}
