{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia serra",
    "plant_slug": "acacia-serra",
    "plant_name_scientific": "acacia serra",
    "intro": "Acacia serra, commonly known as the serrated acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It is characterized by its compound leaves, which are often feathery and arranged in pairs. The plant produces yellow to golden flowers that are typically clustered in rounded or cylindrical inflorescences. Acacia serra is adapted to dry environments and has a deep root system to access water. It is also known for its ability to fix nitrogen, making it valuable in soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia serra is primarily native to southern Africa, particularly South Africa, Namibia, and Botswana. It thrives in arid and semi-arid regions, often found in rocky outcrops and sandy soils. This plant is well adapted to hot, dry climates and can tolerate poor soil conditions. It is commonly seen in savannas and along rocky hillsides. Acacia serra plays an important ecological role by providing habitat and food for various local wildlife species.",
    "distribution_introduced_art_desc": "Acacia serra was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and potential for livestock forage. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems. It is now found in several regions where it was originally not native."
}
