{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia phaeocalyx",
    "plant_slug": "acacia-phaeocalyx",
    "plant_name_scientific": "acacia phaeocalyx",
    "intro": "Acacia phaeocalyx, commonly known as the black wattle, is a flowering plant native to Australia. It is characterized by its dark, woody pods and small, yellow flowers that bloom in clusters. The plant has bipinnate leaves, which are divided into many small leaflets. It is known for its rapid growth and is often used in reforestation projects. The bark and leaves of Acacia phaeocalyx have been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia phaeocalyx"
    },
    "taxonomy_art_desc": "Acacia phaeocalyx belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and association with nitrogen-fixing symbiotic bacteria. Its species is Acacia phaeocalyx, a specific type of acacia known for its unique calyx coloration and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia phaeocalyx is primarily native to Western Australia. It is commonly found in the sandy soils of the southern and western regions of the state. This species thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the dry climate and can tolerate poor soil conditions. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia phaeocalyx was mainly introduced to areas with a warm, dry climate and well-drained soils, particularly in regions of Australia and parts of Southeast Asia. It is often found in disturbed or open habitats such as roadsides, riverbanks, and degraded forests. The plant has been introduced for its ability to thrive in poor soil conditions and its potential for erosion control. Its rapid growth and adaptability have made it a common invasive species in some regions. However, it is also valued for its ornamental qualities and use in traditional medicine."
}
