{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia volubilis",
    "plant_slug": "acacia-volubilis",
    "plant_name_scientific": "acacia volubilis",
    "intro": "Acacia volubilis, commonly known as the weeping acacia, is a shrub or small tree native to southern Africa. It is characterized by its drooping, feathery foliage and yellow flowers that bloom in spring. The plant has thin, flexible branches that often trail or hang down, giving it a unique appearance. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia volubilis is often used in landscaping for its ornamental value and ability to provide shade.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia volubilis"
    },
    "taxonomy_art_desc": "Acacia volubilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their close relatives. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their primitive floral structures and diverse morphological features. Its order is Fabales, which includes legumes and related plants known for their ability to fix atmospheric nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, which is distinguished by its characteristic pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, which are typically shrubs or trees with phyllodes instead of leaves. Its species is Acacia volubilis, a climbing shrub native to Australia, known for its twining stems and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia volubilis is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often seen in coastal and inland areas. It is well adapted to the arid and semi-arid climates of its native range. Acacia volubilis is an important part of the local flora and ecosystem in Western Australia.",
    "distribution_introduced_art_desc": "Acacia volubilis was mainly introduced to areas with well-drained soils and moderate climates, often as an ornamental or for soil stabilization. It thrives in regions with full sun exposure and can tolerate drought conditions once established. The plant is commonly found in disturbed soils, such as along roadsides or in degraded landscapes. Its rapid growth and ability to fix nitrogen make it a useful species for ecological restoration projects. However, it can become invasive in certain environments if not managed properly."
}
