{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kalgoorliensis",
    "plant_slug": "acacia-kalgoorliensis",
    "plant_name_scientific": "acacia kalgoorliensis",
    "intro": "Acacia kalgoorliensis, commonly known as the Kalgoorlie wattle, is a shrub or small tree native to Western Australia. It is characterized by its slender, erect stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellow globular flowers in summer, which are clustered in dense, spherical inflorescences. It thrives in arid and semi-arid environments, often found on rocky soils and in open woodlands. Acacia kalgoorliensis is well adapted to drought and can tolerate poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia kalgoorliensis"
    },
    "taxonomy_art_desc": "Acacia kalgoorliensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by the pod-like fruits and nitrogen-fixing abilities of many species. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia kalgoorliensis, a specific type of acacia native to Australia, known for its ecological importance and adaptation to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kalgoorliensis is primarily native to Western Australia. It is found in the arid and semi-arid regions of the state, particularly in the Pilbara and Goldfields areas. This plant typically grows in sandy soils and is adapted to the harsh, dry conditions of its native habitat. It is often seen in open woodlands and along riverbanks. Acacia kalgoorliensis plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia kalgoorliensis was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions such as Western Australia and parts of South Africa. It is commonly used in landscaping and soil stabilization due to its hardiness and ability to thrive in arid conditions. The plant has been introduced to various parts of the world, including the United States and Mediterranean countries, where it is cultivated for ornamental purposes. However, its introduction has raised concerns about potential invasiveness in some non-native environments. Despite its benefits, careful management is necessary to prevent ecological disruption in new habitats."
}
