{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guarensis",
    "plant_slug": "acacia-guarensis",
    "plant_name_scientific": "acacia guarensis",
    "intro": "Acacia guarensis, commonly known as the Brazilian acacia, is a shrub or small tree native to South America, particularly Brazil. It belongs to the legume family, Fabaceae, and is characterized by its bipinnate leaves and yellow flowers. The plant is adapted to tropical and subtropical climates and is often found in dry, sandy soils. Acacia guarensis is also valued for its hard, durable wood and its ability to fix nitrogen, making it beneficial for soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guarensis is primarily native to the Atlantic Forest biome in southeastern Brazil. It is found in the states of Paraná, Santa Catarina, and Rio Grande do Sul. This species typically grows in moist, well-drained soils within humid tropical and subtropical environments. It is often found in secondary forests and along riverbanks. Acacia guarensis plays an important ecological role in these regions by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia guarensis was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with seasonal rainfall. It thrives in open habitats such as savannas, grasslands, and rocky outcrops. The plant is commonly used for its nitrogen-fixing properties, making it valuable for soil enrichment and land rehabilitation. Its introduction has also been noted in some parts of South America and the Mediterranean region. However, its spread is limited by its preference for specific environmental conditions."
}
