{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia coriacea subsp. coriacea",
    "plant_slug": "acacia-coriacea-subsp-coriacea",
    "plant_name_scientific": "acacia coriacea subsp. coriacea",
    "intro": "Acacia coriacea subsp. coriacea, commonly known as the rough wattle, is a shrub or small tree native to southern Africa. It is characterized by its dark, ridged bark and compound leaves composed of multiple small, oval-shaped leaflets. The plant produces yellow flowers in cylindrical spikes, which are typical of the Acacia genus. It is well adapted to arid and semi-arid environments, often growing in sandy or rocky soils. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia coriacea"
    },
    "taxonomy_art_desc": "Acacia coriacea subsp. coriacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have a characteristic floral arrangement and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods as fruits and often containing nitrogen-fixing symbiotic bacteria in their root systems. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are native to Australia and include both trees and shrubs. Its species is Acacia coriacea, a specific type of acacia that is known for its rough, leathery leaves and is commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia coriacea subsp. coriacea is primarily native to the Northern Territory and Western Australia. This subspecies is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy or rocky soils and is well adapted to the harsh environmental conditions. The plant is often seen in shrublands and along riverbanks. Its distribution reflects its ability to thrive in low-resource environments.",
    "distribution_introduced_art_desc": "Acacia coriacea subsp. coriacea was mainly introduced to South Africa, where it has become naturalized in various regions. It is commonly found in grassland and savanna habitats, often along roadsides and in disturbed areas. This subspecies is valued for its hardy nature and ability to thrive in arid and semi-arid conditions. It has also been introduced to other parts of southern Africa, including Namibia and Botswana. However, its spread is often limited by its preference for well-drained soils and moderate rainfall."
}
