{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cowaniana",
    "plant_slug": "acacia-cowaniana",
    "plant_name_scientific": "acacia cowaniana",
    "intro": "Acacia cowaniana, commonly known as the white wattle, is a small, deciduous shrub native to Western Australia. It is characterized by its slender, multi-branched stems and small, phyllodes that are typically pale green to white in color. The plant produces yellow globular flower heads during the summer months, which are clustered in dense spherical inflorescences. It thrives in well-drained soils and is often found in coastal and sandy habitats. Acacia cowaniana is valued for its ornamental appeal and its ability to tolerate drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cowaniana"
    },
    "taxonomy_art_desc": "Acacia cowaniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails, and is distinguished by the presence of jointed stems and spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which consists of flowering plants with a distinctive pod-like fruit and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its unique fruit type and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive phyllodes and often for their ability to fix nitrogen. Its species is Acacia cowaniana, a specific type of acacia found in certain regions of Australia, characterized by its specific morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cowaniana is primarily native to Western Australia. It is found in the southern and central regions of the state, particularly in areas with sandy soils. This species thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the harsh climatic conditions of the region. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia cowaniana was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in various soil conditions. It was also introduced for soil stabilization and as a potential source of timber and honey production. However, its rapid growth and invasive tendencies have led to its classification as a noxious weed in several regions. The plant has spread extensively in coastal and inland areas, outcompeting native species and altering local ecosystems. Management efforts focus on controlling its spread through mechanical removal and chemical treatments."
}
