{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia boorabbinensis",
    "plant_slug": "acacia-boorabbinensis",
    "plant_name_scientific": "acacia boorabbinensis",
    "intro": "Acacia boorabbinensis, commonly known as the Boorabbin wattle, is a small to medium-sized shrub or tree native to Western Australia. It is characterized by its slender, zigzagging branches and yellow flowers that appear in globular heads during the spring and summer seasons. The plant has phyllodes, which are flattened leaf stalks that serve as the primary means of photosynthesis. It thrives in sandy soils and is often found in open woodlands and heathlands. Acacia boorabbinensis is also valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia boorabbinensis is primarily native to the southwestern region of Western Australia. It is commonly found in the areas around the Fitzgerald River National Park and the Leeuwin-Naturaliste Ridge. This species thrives in sandy soils and is often associated with coastal and near-coastal environments. It is part of the larger Acacia family, known for its ecological importance in arid and semi-arid regions. The plant is well adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia boorabbinensis was mainly introduced to specific regions of Western Australia, particularly in the Geraldton and Kalgoorlie areas. It is commonly found in sandy soils and is often associated with coastal and inland dunes. This plant is well adapted to arid and semi-arid environments, making it a hardy species for reclamation projects. It is also used in landscaping due to its attractive yellow flowers and drought tolerance. However, its introduction has raised concerns about potential ecological impacts in native habitats."
}
