{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennata var. canescens",
    "plant_slug": "acacia-pennata-var-canescens",
    "plant_name_scientific": "acacia pennata var. canescens",
    "intro": "Acacia pennata var. canescens, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are covered in fine, silvery hairs, giving it a distinctive appearance. The plant produces yellow globular flowers that bloom in spring, attracting a variety of pollinators. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia pennata var. canescens is also valued for its ornamental qualities and its ability to fix nitrogen, making it beneficial for soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennata var. canescens is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and shrubland ecosystems. This variety is well adapted to drought conditions and can withstand high temperatures. It is often seen growing along roadsides, in rocky outcrops, and in open grasslands. Its ecological importance includes providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia pennata var. canescens was mainly introduced to control soil erosion and for its ornamental value in horticulture. It is commonly used in landscaping due to its hardy nature and ability to thrive in arid conditions. This plant has been introduced to various regions in Australia and parts of the Pacific Islands. It is often planted along roadsides and in degraded lands to stabilize the soil. However, it has also been reported to spread aggressively in some areas, raising concerns about its ecological impact."
}
