{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia auratiflora",
    "plant_slug": "acacia-auratiflora",
    "plant_name_scientific": "acacia auratiflora",
    "intro": "Acacia auratiflora, commonly known as the golden-flowered acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces bright yellow flowers arranged in spherical or cylindrical heads, which are highly attractive to pollinators. Its flowers are typically visited by bees and birds, contributing to its ecological importance. Acacia auratiflora is adapted to arid and semi-arid environments, making it a resilient species in dry climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia auratiflora"
    },
    "taxonomy_art_desc": "Acacia auratiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and flowering plants. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants with a distinctive type of inflorescence and includes legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia auratiflora, a specific type of acacia known for its yellow flowers and adapted to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia auratiflora is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in areas with sandy soils. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the climate of the region, with its small leaves and yellow flowers helping it conserve water. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia auratiflora was mainly introduced to South Africa, where it has been widely planted for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides due to its attractive yellow flowers and hardy nature. However, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and seed dispersal make it a challenging species to control. Despite its ecological impact, it remains popular for its aesthetic appeal and resilience."
}
