{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia viscosa",
    "plant_slug": "acacia-viscosa",
    "plant_name_scientific": "acacia viscosa",
    "intro": "Acacia viscosa, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often thorny stems and small, yellow flowers that bloom in clusters. The plant produces flat, leathery pods that contain seeds, and its leaves are typically bipinnate, meaning they are divided into two sets of smaller leaflets. Acacia viscosa is adapted to arid environments and is often found in coastal and inland regions of Australia. It plays a role in stabilizing soils and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia viscosa is primarily native to Australia, where it is found across a wide range of regions. It is commonly distributed in the arid and semi-arid zones of the continent, including parts of Western Australia, South Australia, and the Northern Territory. This plant thrives in sandy or rocky soils and is often found in open woodlands, shrublands, and coastal areas. It is well adapted to the harsh conditions of the Australian interior, including high temperatures and low rainfall. Acacia viscosa is also known by the common name \"coastal wattle\" due to its frequent occurrence along coastal regions.",
    "distribution_introduced_art_desc": "Acacia viscosa was mainly introduced to areas with dry and semi-arid climates, particularly in regions of Australia, parts of Africa, and some parts of the Middle East. It thrives in well-drained soils and is often found in disturbed or degraded landscapes. The plant is commonly used for soil stabilization and as a source of timber and fodder. Its rapid growth and adaptability have made it a valuable species in ecological restoration projects. However, it can also become invasive in certain environments if not managed properly."
}
