{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cliftoniana",
    "plant_slug": "acacia-cliftoniana",
    "plant_name_scientific": "acacia cliftoniana",
    "intro": "Acacia cliftoniana, commonly known as the Clifton's acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, multi-branched stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow, globular flower heads that are clustered in dense, spherical inflorescences. It is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for rocky or sandy soils. Acacia cliftoniana is also valued for its role in local ecosystems and traditional uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cliftoniana is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and South Africa. It is commonly found in rocky outcrops, sandy soils, and dry shrublands. This species thrives in environments with low rainfall and high temperatures. It is well adapted to the harsh conditions of the Namib Desert and adjacent areas. Acacia cliftoniana plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia cliftoniana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, often growing in sandy or rocky soils. The plant is known for its ability to thrive in arid and semi-arid environments, making it adaptable to various ecological conditions. It is sometimes used in reforestation projects due to its fast growth rate and nitrogen-fixing capabilities. However, its introduction has raised concerns about its potential to become invasive in some areas."
}
