{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ayersiana var. latifolia",
    "plant_slug": "acacia-ayersiana-var-latifolia",
    "plant_name_scientific": "acacia ayersiana var. latifolia",
    "intro": "Acacia ayersiana var. latifolia, commonly known as the broad-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are broad and feathery in appearance. The plant produces yellow globular flower heads, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and sandy areas. This variety is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive foliage and flowers.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ayersiana var. latifolia is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the Nullarbor Plain and surrounding areas, including parts of the Great Victoria Desert. This variety thrives in sandy soils and is often seen along coastal dunes and inland shrublands. It is well adapted to the harsh climate with its deep root system and ability to withstand drought. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia ayersiana var. latifolia was mainly introduced to South Africa, where it has been cultivated for ornamental purposes due to its attractive foliage and hardy nature. It is commonly found in gardens and along roadsides in regions with a Mediterranean climate. The plant thrives in well-drained soils and full sun, making it suitable for coastal and semi-arid environments. However, it has also been reported to naturalize in some areas, raising concerns about its potential invasive tendencies. Despite its ornamental value, its ecological impact remains a topic of ongoing study."
}
