{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia caroleae",
    "plant_slug": "acacia-caroleae",
    "plant_name_scientific": "acacia caroleae",
    "intro": "Acacia caroleae, commonly known as the Carolinian acacia, is a shrub native to the island of Carola in the South Pacific. It belongs to the Fabaceae family, characterized by its pod fruits and nitrogen-fixing abilities. The plant features bipinnate leaves and produces yellow to golden flowers, which attract pollinators such as bees and birds. It thrives in coastal and sandy soils, often growing in shaded or semi-shaded environments. Due to its limited distribution, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia caroleae"
    },
    "taxonomy_art_desc": "Acacia caroleae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found primarily in arid regions, known for their characteristic thorned stems and compound leaves. Its species is Acacia caroleae, a specific type of acacia found in certain regions of Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia caroleae is primarily native to New South Wales and Queensland in Australia. This species is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. The plant is well adapted to the climate of these areas, with features that help it conserve water. Its distribution is closely linked to the specific ecological conditions of New South Wales and Queensland.",
    "distribution_introduced_art_desc": "Acacia caroleae was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has been associated with both ecological benefits and potential invasiveness in certain environments. Due to its adaptability, it has been planted in various parts of the world where it can tolerate high temperatures and low rainfall."
}
