{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. alpina",
    "plant_slug": "acacia-longifolia-var-alpina",
    "plant_name_scientific": "acacia longifolia var. alpina",
    "intro": "Acacia longifolia var. alpina, commonly known as the Alpine acacia, is a shrub native to the alpine regions of southern Europe. It is characterized by its slender, zigzagging stems and small, feathery leaves that are adapted to cold and harsh environments. The plant produces yellow flowers in late spring, which are arranged in compact spikes and attract pollinators such as bees and butterflies. It is often found in rocky soils and open habitats, thriving in high-altitude areas with limited nutrients. Due to its hardy nature, it is sometimes used in ecological restoration projects in arid or disturbed landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. alpina is primarily native to the southern and western regions of Australia. It is commonly found in the coastal areas of Western Australia, particularly in the south-western part of the state. This variety thrives in sandy soils and is often associated with coastal heathlands and dunes. It is also present in parts of South Australia and the Riverland region. The plant is well adapted to the Mediterranean climate of these regions, characterized by dry summers and wet winters.",
    "distribution_introduced_art_desc": "Acacia longifolia var. alpina was mainly introduced to stabilize soils and for ornamental purposes in regions with Mediterranean climates. It has been established in parts of southern Europe, including Italy, Spain, and France. The plant thrives in well-drained soils and full sun, making it suitable for coastal and rocky areas. However, it can become invasive in some environments, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in certain regions."
}
