{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia falcifolia",
    "plant_slug": "acacia-falcifolia",
    "plant_name_scientific": "acacia falcifolia",
    "intro": "Acacia falcifolia, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in globular clusters, which bloom in spring. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia falcifolia is well-suited to dry environments and is often found in sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia falcifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This species is well adapted to the harsh climatic conditions of its native habitat, including high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia falcifolia is also known for its distinctive, sickle-shaped leaves and yellow flowers, which make it a notable plant in its native environment.",
    "distribution_introduced_art_desc": "Acacia falcifolia was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in arid and semi-arid regions where it establishes quickly and forms dense thickets. The plant is valued for its nitrogen-fixing ability, which improves soil fertility in poor soils. However, it can become invasive in some areas, outcompeting native vegetation. Its introduction has had both beneficial and problematic ecological impacts depending on the local environment."
}
