{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stricta",
    "plant_slug": "acacia-stricta",
    "plant_name_scientific": "acacia stricta",
    "intro": "Acacia stricta, commonly known as the rigid acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, upright growth habit and produces small, yellow flowers in clusters. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic structures. It thrives in well-drained soils and is often found in dry, open habitats. Acacia stricta is also notable for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stricta"
    },
    "taxonomy_art_desc": "Acacia stricta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their unique, often thorned appearance and ability to thrive in arid environments. Its species is Acacia stricta, a specific type of acacia known for its upright growth habit and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "South Australia",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [
        "India",
        "Jawa"
    ],
    "distribution_native_art_desc": "Acacia stricta is primarily native to New South Wales, Queensland, South Australia, Tasmania, and Victoria. It is commonly found in dry, sandy soils across these regions. This plant typically grows in open woodlands and shrublands. It is well adapted to the semi-arid and temperate climates of its native range. Acacia stricta plays an important ecological role in supporting local wildlife and soil stabilization.",
    "distribution_introduced_art_desc": "Acacia stricta was mainly introduced to India and Jawa. It is a shrub or small tree that thrives in arid and semi-arid environments. The plant is known for its hardy nature and ability to withstand harsh climatic conditions. It has been introduced for purposes such as soil stabilization and as a source of timber. However, its spread has raised concerns about its potential impact on native ecosystems."
}
