{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cunninghamii",
    "plant_slug": "acacia-cunninghamii",
    "plant_name_scientific": "acacia cunninghamii",
    "intro": "Acacia cunninghamii, commonly known as the yellow wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, yellow floral spikes that bloom in spring, attracting pollinators such as bees and birds. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. It thrives in well-drained soils and is often found in dry, open habitats. Acacia cunninghamii is also valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cunninghamii is primarily native to southeastern Australia, including parts of New South Wales and Victoria. It is commonly found in dry, open habitats such as woodlands, heathlands, and rocky outcrops. This species thrives in well-drained soils and is often associated with Mediterranean climate zones. It is also present in South Australia and Tasmania, where it grows in similar environmental conditions. Acacia cunninghamii is well adapted to the region's climate and plays an important role in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia cunninghamii was mainly introduced to urban and suburban areas in southeastern Australia, particularly in New South Wales and Victoria. It is commonly found along roadsides, in parks, and on the edges of agricultural land. This plant is valued for its hardy nature, ability to thrive in poor soils, and its attractive, feathery foliage. However, it has also been noted to spread aggressively in some environments, potentially outcompeting native vegetation. Its introduction has led to both ecological and horticultural significance in the region."
}
