{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catenulata subsp. occidentalis",
    "plant_slug": "acacia-catenulata-subsp-occidentalis",
    "plant_name_scientific": "acacia catenulata subsp. occidentalis",
    "intro": "Acacia catenulata subsp. occidentalis, commonly known as the western acacia, is a shrub native to southern Australia. It is characterized by its slender, multi-branched stems and small, bean-like pods. The plant produces yellow flowers in winter, which are clustered in dense, spherical inflorescences. Its leaves are bipinnate, consisting of numerous tiny, needle-like leaflets. It thrives in well-drained soils and is often found in coastal and semi-arid regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia catenulata"
    },
    "taxonomy_art_desc": "Acacia catenulata subsp. occidentalis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees, many of which are native to Australia and are known for their distinctive, often thorned appearance. Its species is Acacia catenulata, a specific type within the Acacia genus, with the subspecies occidentalis being a variant found in western regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catenulata subsp. occidentalis is primarily native to Western Australia. It is found in the southern and southwestern regions of the state. This subspecies typically grows in dry, sandy soils and is adapted to arid and semi-arid environments. It is commonly seen in shrublands and open woodlands. The plant is well-suited to the climate and soil conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia catenulata subsp. occidentalis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, particularly in the Western Cape. This subspecies is valued for its hardy nature and ability to thrive in arid conditions. It has been used in ornamental horticulture and for soil stabilization in degraded landscapes. However, its introduction has raised concerns about its potential to become invasive in local ecosystems."
}
