{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia smilacifolia",
    "plant_slug": "acacia-smilacifolia",
    "plant_name_scientific": "acacia smilacifolia",
    "intro": "Acacia smilacifolia, commonly known as the sweet acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its compound leaves, which are often arranged in a spiral pattern along the stems. The plant produces yellow to golden yellow flowers that bloom in summer, attracting various pollinators. Its bark is smooth and grayish, and it has a woody, aromatic scent. Acacia smilacifolia is often used in traditional medicine and for its ornamental value in landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia smilacifolia is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in savanna and woodland habitats, often found in areas with well-drained soils. This species is also present in parts of southern Arabia and the Horn of Africa. It is commonly found in open grasslands and along riverbanks. Due to its adaptability, it can sometimes be found in disturbed or human-modified landscapes.",
    "distribution_introduced_art_desc": "Acacia smilacifolia was mainly introduced to areas with disturbed soils and arid conditions, often as part of reforestation or land rehabilitation efforts. It is commonly found in regions with low rainfall and poor soil quality, where it establishes itself quickly due to its drought tolerance. The plant is also used in agroforestry systems for its ability to fix nitrogen and improve soil fertility. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation. Its distribution is now expanding beyond its original range due to human activities and climate change."
}
