{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia caracasana",
    "plant_slug": "acacia-caracasana",
    "plant_name_scientific": "acacia caracasana",
    "intro": "Acacia caracasana, commonly known as the Caracas acacia, is a shrub or small tree native to tropical regions of South America. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is known for its ability to fix nitrogen in the soil, making it beneficial for soil enrichment. It thrives in well-drained soils and is often found in dry, open habitats. The acacia's thorned stems and clustered flowers make it a distinctive and recognizable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia caracasana is primarily native to South America, particularly in the countries of Brazil, Colombia, Ecuador, and Peru. It is commonly found in tropical and subtropical regions, growing in a variety of habitats such as savannas, forests, and along riverbanks. This species thrives in areas with well-drained soils and a warm climate, often in regions with seasonal rainfall. It is an important plant in local ecosystems, providing food and shelter for various wildlife species. Its distribution is largely restricted to the western part of the continent, where it plays a significant ecological role.",
    "distribution_introduced_art_desc": "Acacia caracasana was mainly introduced to ornamental horticulture and reforestation projects due to its attractive foliage and ability to thrive in various soil conditions. It is commonly found in tropical and subtropical regions where it is used for landscaping and soil stabilization. The plant has also been introduced to some areas outside its native range, including parts of the southern United States and Southeast Asia. Its rapid growth and adaptability make it a popular choice for erosion control and green space development. However, in certain regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
