{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia incanicarpa",
    "plant_slug": "acacia-incanicarpa",
    "plant_name_scientific": "acacia incanicarpa",
    "intro": "Acacia incanicarpa, commonly known as the grey acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, pale green or greyish leaves. The plant produces yellow flowers in globular clusters, which are followed by long, narrow pods containing seeds. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. The species is known for its drought tolerance and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia incanicarpa"
    },
    "taxonomy_art_desc": "Acacia incanicarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have a distinctive floral structure with a single carpel and is well-known for its leguminous plants. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often for their ability to thrive in arid environments. Its species is Acacia incanicarpa, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia incanicarpa is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the harsh climate of the region. The plant plays an important role in the local ecosystem and is a characteristic feature of the landscape.",
    "distribution_introduced_art_desc": "Acacia incanicarpa was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and central parts of the country. This plant is often used for its hardy nature and ability to stabilize soil in degraded landscapes. Its introduction has also been noted in some parts of Southeast Asia and the Pacific Islands. Due to its adaptability, it has become an important species in ecological restoration projects."
}
