{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sclerophylla var. sclerophylla",
    "plant_slug": "acacia-sclerophylla-var-sclerophylla",
    "plant_name_scientific": "acacia sclerophylla var. sclerophylla",
    "intro": "Acacia sclerophylla var. sclerophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, linear leaves and yellow flowers that appear in globular clusters. The plant is adapted to arid and semi-arid environments, featuring small, tough leaves to reduce water loss. It plays an important role in stabilizing soils and providing habitat for native wildlife. The species is often used in landscaping due to its hardy nature and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sclerophylla"
    },
    "taxonomy_art_desc": "Acacia sclerophylla var. sclerophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure called a vexillum. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia sclerophylla, a specific variety within the Acacia genus, adapted to arid environments with hard, leathery leaves.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sclerophylla var. sclerophylla is primarily native to New South Wales, South Australia, Victoria, and Western Australia. This plant is commonly found in dry, rocky, and sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. The species is well adapted to the harsh climatic conditions of the Australian interior. Its distribution reflects its ability to survive in low-nutrient and water-stressed habitats.",
    "distribution_introduced_art_desc": "Acacia sclerophylla var. sclerophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas with well-drained soils. This plant is often used for erosion control due to its hardy nature and ability to thrive in harsh conditions. However, it has also been reported to spread aggressively in some environments. Its introduction has raised concerns about its potential impact on native flora in invaded areas."
}
