{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rupicola",
    "plant_slug": "acacia-rupicola",
    "plant_name_scientific": "acacia rupicola",
    "intro": "Acacia rupicola, commonly known as the rock acacia, is a shrub native to southern Africa. It is characterized by its slender, wiry stems and small, pale yellow flowers that bloom in winter. The plant produces flat, bean-like pods that contain edible seeds, which are a food source for various animals. Acacia rupicola thrives in rocky, well-drained soils and is adapted to arid and semi-arid environments. It plays an important role in stabilizing soil and providing habitat in its native ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rupicola"
    },
    "taxonomy_art_desc": "Acacia rupicola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their complex vascular systems and often spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which comprises plants with a common ancestor and includes legumes, which are known for nitrogen-fixing capabilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing root nodules. Its genus is Acacia, a large genus of shrubs and trees in the Fabaceae family, commonly known as wattles, with distinctive phyllodes and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia rupicola, a specific type of acacia found in rocky habitats, characterized by its hardy growth and adaptations to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rupicola is primarily native to South Australia and Victoria. It is commonly found in rocky outcrops and dry, open habitats within these regions. This plant thrives in arid and semi-arid environments, often growing on limestone or sandstone formations. It is well adapted to the harsh climatic conditions of the Australian interior. Its distribution is limited to specific areas where it can establish and persist due to its ecological requirements.",
    "distribution_introduced_art_desc": "Acacia rupicola was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant's deep root system helps improve soil structure and retain moisture. It is also valued for its hardy nature and minimal maintenance requirements. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
