{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia deltoidea var. pungens",
    "plant_slug": "acacia-deltoidea-var-pungens",
    "plant_name_scientific": "acacia deltoidea var. pungens",
    "intro": "Acacia deltoidea var. pungens, commonly known as the umbrella thorn acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its flat, fan-shaped leaves and long, slender, thorned stems. The plant produces yellow flowers in winter, which are followed by flat, pod-like fruits containing seeds. It thrives in arid and semi-arid environments, often found in savannas and along riverbanks. Its ecological importance includes providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia deltoidea var. pungens is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It thrives in arid and semi-arid regions, often found in savannas and rocky outcrops. This variant is particularly adapted to withstand high temperatures and low rainfall. It is commonly seen along roadsides and in open woodland areas. Its distribution is closely linked to the availability of well-drained soils and sufficient sunlight.",
    "distribution_introduced_art_desc": "Acacia deltoidea var. pungens was mainly introduced to control soil erosion and as a windbreak in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soils and withstand drought conditions. The plant's rapid growth and hardy nature make it a popular choice for land stabilization efforts. However, its introduction has sometimes led to the displacement of native vegetation in certain areas. Despite its benefits, careful management is required to prevent it from becoming invasive in new environments."
}
