{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia janzenii",
    "plant_slug": "acacia-janzenii",
    "plant_name_scientific": "acacia janzenii",
    "intro": "Acacia janzenii, commonly known as the Janzen's wattle, is a shrub native to the tropical regions of Central America. It belongs to the legume family, Fabaceae, and is characterized by its slender, often thorned stems and bipinnate leaves. The plant produces small, yellowish inflorescences that are typical of the Acacia genus. Its seeds are encased in pods, which mature into woody structures. Acacia janzenii is adapted to grow in dry, well-drained soils and is often found in disturbed or secondary forest habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia janzenii is primarily native to the arid and semi-arid regions of central and western Australia. It is commonly found in areas with sandy soils and low rainfall, such as the Simpson Desert and the Great Sandy Desert. This plant is well adapted to harsh environmental conditions, including extreme temperatures and limited water availability. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia janzenii is often seen growing along dry riverbeds and in open woodlands.",
    "distribution_introduced_art_desc": "Acacia janzenii was mainly introduced to the southern regions of California, particularly in areas with Mediterranean climates. It was brought in for its ornamental value due to its unique appearance and drought tolerance. However, it has since become invasive in some parts of its range, outcompeting native vegetation. The plant thrives in well-drained soils and full sun, making it adaptable to various environments. Its rapid growth and ability to spread through seeds have raised concerns among local conservationists."
}
