{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gerrardi var. najdensis",
    "plant_slug": "acacia-gerrardi-var-najdensis",
    "plant_name_scientific": "acacia gerrardi var. najdensis",
    "intro": "Acacia gerrardi var. najdensis, commonly known as the coastal acacia, is a shrub or small tree native to the coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow globular flower heads, which are borne in dense, terminal clusters. It thrives in sandy or gravelly soils and is adapted to coastal conditions, including salt spray and strong winds. This variety is valued for its ornamental appeal and its role in stabilizing coastal dunes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gerrardi var. najdensis is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and South Africa. It is commonly found in sandy soils and rocky outcrops within these areas. This plant thrives in environments with low rainfall and high temperatures. It is often seen in savanna and shrubland ecosystems. Its distribution is limited to specific habitats that provide the necessary conditions for its growth.",
    "distribution_introduced_art_desc": "Acacia gerrardi var. najdensis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coast and in coastal dunes. The plant is valued for its hardy nature and ability to thrive in harsh environmental conditions. It has been used in restoration projects due to its ecological benefits. However, its spread has raised concerns about potential invasiveness in some areas."
}
