{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vernicosa",
    "plant_slug": "acacia-vernicosa",
    "plant_name_scientific": "acacia vernicosa",
    "intro": "Acacia vernicosa, commonly known as the gum acacia or white wattle, is a flowering plant native to Australia. It is a shrub or small tree that can grow up to 5 meters tall, characterized by its slender, often spiny branches. The plant produces yellow flowers in globular clusters, which are followed by long, flat seed pods. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia vernicosa is known for its ability to thrive in arid and semi-arid environments, making it a hardy and adaptable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vernicosa is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Somalia. It is commonly found in dry savannas, woodlands, and along riverbanks. This plant thrives in areas with well-drained soils and is often associated with degraded or disturbed habitats. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia vernicosa is also known for its ability to withstand drought conditions, making it a resilient component of its native ecosystems.",
    "distribution_introduced_art_desc": "Acacia vernicosa was mainly introduced to areas with warm, dry climates and well-drained soils, often in regions where it is used for its hardy nature and ability to thrive in challenging environments. It is commonly found in parts of Africa, the Middle East, and Australia, where it has been planted for erosion control and as a source of timber and honey. The plant's introduction has sometimes led to it becoming invasive in non-native regions, outcompeting local vegetation. Its ability to fix nitrogen in the soil makes it valuable for land rehabilitation projects. However, its spread requires careful management to prevent ecological disruption."
}
