{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cochliocarpa",
    "plant_slug": "acacia-cochliocarpa",
    "plant_name_scientific": "acacia cochliocarpa",
    "intro": "Acacia cochliocarpa, commonly known as the red acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, feathery leaves that are typically green with a reddish tinge. The plant produces yellow globular flowers that bloom in winter, attracting various pollinators. Its seeds are enclosed in pod-like fruits that split open to release the seeds. Acacia cochliocarpa is adapted to arid and semi-arid environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cochliocarpa is primarily native to Australia, specifically the southern regions of Western Australia and South Australia. It is commonly found in arid and semi-arid environments, particularly in shrublands and open woodlands. This plant thrives in well-drained soils and is adapted to the dry climate of its native habitat. It is often seen growing along roadsides and in disturbed areas within its range. Acacia cochliocarpa is an important component of the local flora and plays a role in supporting native wildlife.",
    "distribution_introduced_art_desc": "Acacia cochliocarpa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. This plant thrives in sandy soils and is often seen along roadsides and in disturbed areas. Its introduction has led to concerns about its invasive potential in some ecosystems. It is valued for its hardiness and ability to withstand drought conditions."
}
