{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia georginae",
    "plant_slug": "acacia-georginae",
    "plant_name_scientific": "acacia georginae",
    "intro": "Acacia georginae, commonly known as the Georgina acacia, is a shrub or small tree native to southern Africa. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant has phyllodes, which are flattened leaf stalks that function as leaves, a common adaptation in arid environments. It produces yellow flowers in clusters, which are followed by hard, woody pods containing seeds. Acacia georginae is well adapted to dry conditions and is often found in savanna and rocky habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia georginae"
    },
    "taxonomy_art_desc": "Acacia georginae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that often have compound leaves and flowers with a distinctive arrangement. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their aculeate stems and often protein-rich seeds. Its species is Acacia georginae, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia georginae is primarily native to the Northern Territory, Queensland, and South Australia. This shrub or small tree is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia georginae was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its fast growth and ability to thrive in poor soil conditions. The plant is also valued for its hardy nature, making it suitable for landscaping in drought-prone areas. Its introduction has helped in restoring degraded lands and supporting local biodiversity. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
