{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia orthocarpa",
    "plant_slug": "acacia-orthocarpa",
    "plant_name_scientific": "acacia orthocarpa",
    "intro": "Acacia orthocarpa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, linear leaves and yellow floral spikes that appear in spring. The plant produces pod-like fruits that contain several seeds, which are dispersed by wind. It thrives in sandy or loamy soils and is often found in coastal and inland regions. Acacia orthocarpa is valued for its ornamental appeal and its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia orthocarpa"
    },
    "taxonomy_art_desc": "Acacia orthocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and numerous stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa and Australia, known for their distinctive phyllodes and nitrogen-fixing capabilities. Its species is Acacia orthocarpa, a specific type of acacia found in certain regions of Australia, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia orthocarpa is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy or rocky soils and is well adapted to the harsh climatic conditions of its native range. The plant is often seen in shrublands and open woodlands. Its distribution reflects its ability to thrive in the dry and variable environments of northern Australia.",
    "distribution_introduced_art_desc": "Acacia orthocarpa was mainly introduced to India. It is commonly found in the southern and western regions of the country. This plant thrives in dry and semi-arid climates, making it well-suited for the Indian subcontinent's diverse ecosystems. It is often used for its timber and as a source of fodder for livestock. Its introduction has contributed to the ecological and economic landscape of certain areas in India."
}
