{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ancistroclada",
    "plant_slug": "acacia-ancistroclada",
    "plant_name_scientific": "acacia ancistroclada",
    "intro": "Acacia ancistroclada, commonly known as the \"Bark Acacia,\" is a small, deciduous tree native to the Horn of Africa and the Arabian Peninsula. It is characterized by its slender, often twisted trunk and bipinnate leaves that are reduced to small, scale-like structures in dry conditions. The plant produces yellowish-green globular flowers that appear in clusters, followed by flat, ribbed pods containing seeds. It is adapted to arid environments and has a deep root system for water absorption. The tree is also valued for its hard, durable wood and has cultural significance in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ancistroclada is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of Sudan and northern Kenya. This plant thrives in arid and semi-arid environments, often growing in rocky or sandy soils. It is commonly found in savannas and along riverbanks in these regions. The species is well adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia ancistroclada was mainly introduced to regions where its unique ecological and economic benefits are valued, such as parts of Ethiopia and Eritrea. It is often cultivated for its hardy nature and ability to thrive in arid and semi-arid environments. The plant is also used for its gum, which has commercial applications in food and pharmaceutical industries. Its introduction has helped in soil stabilization and land rehabilitation in degraded areas. However, it requires careful management to prevent over-exploitation and ensure its sustainability."
}
