{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia penninervis var. stenophylla",
    "plant_slug": "acacia-penninervis-var-stenophylla",
    "plant_name_scientific": "acacia penninervis var. stenophylla",
    "intro": "Acacia penninervis var. stenophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping branches and narrow, phyllodes that are typically green and covered in fine hairs. The plant produces yellow globular flower heads, which are clustered in dense, cylindrical spikes. It thrives in well-drained soils and is often found in coastal and sandy regions. This variety is valued for its ornamental appeal and its ability to tolerate coastal conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia penninervis var. stenophylla is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. This variety is commonly found in sandy soils and open woodlands, often growing in association with other acacia species. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of the Australian outback. The plant is well-known for its distinctive, narrow leaves and its ability to withstand drought. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia penninervis var. stenophylla was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally from Australia and was brought to South Africa for ornamental purposes due to its attractive appearance. The plant thrives in a variety of soil types and can tolerate both drought and poor soil conditions, which contributes to its spread. It is often found in disturbed areas such as roadsides and abandoned farms. Due to its rapid growth and ability to form dense stands, it poses a threat to native vegetation and biodiversity."
}
