{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nigripilosa subsp. nigripilosa",
    "plant_slug": "acacia-nigripilosa-subsp-nigripilosa",
    "plant_name_scientific": "acacia nigripilosa subsp. nigripilosa",
    "intro": "Acacia nigripilosa subsp. nigripilosa, commonly known as the black-hair wattle, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often multi-stemmed form and grey-green foliage. The plant produces yellow flowers in globular or cylindrical spikes, which are typical of the Acacia genus. Its leaves are bipinnate, with small, needle-like leaflets, and it is adapted to survive in harsh, dry conditions. The species is also notable for its ability to fix nitrogen, contributing to soil fertility in its native environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nigripilosa"
    },
    "taxonomy_art_desc": "Acacia nigripilosa subsp. nigripilosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for having vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes legumes and other plants that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic phyllodes and often used in various ecological and commercial contexts. Its species is Acacia nigripilosa, a specific type within the Acacia genus, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nigripilosa subsp. nigripilosa is primarily native to Western Australia. It is found in the southern and central regions of the state, particularly in the Geraldton and Esperance regions. This subspecies typically grows in sandy soils and is often found in coastal and inland areas. It is commonly associated with shrublands and open woodlands. The plant is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia nigripilosa subsp. nigripilosa was mainly introduced to areas with sandy or loamy soils and a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. It thrives in full sun and is commonly found in coastal regions and inland valleys. This subspecies is often used in landscaping due to its drought tolerance and ability to fix nitrogen in the soil. It has been introduced to parts of California and other regions with similar climatic conditions. However, it is considered a potential invasive species in some areas where it outcompetes native vegetation."
}
