{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella f. typica",
    "plant_slug": "acacia-pulchella-f-typica",
    "plant_name_scientific": "acacia pulchella f. typica",
    "intro": "Acacia pulchella f. typica, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves and bright yellow flowers that bloom in spring. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. It is often cultivated for its ornamental value and is a symbol of Australia. The species is adapted to a variety of soil types and can thrive in both full sun and partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella f. typica is primarily native to southern Africa, specifically South Africa. It is found in the Western Cape Province, where it thrives in sandy soils and coastal areas. This subspecies is commonly associated with fynbos vegetation, which is characteristic of the region's Mediterranean climate. It is also present in parts of Namibia and southwestern Angola. Due to its unique adaptations, it plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia pulchella f. typica was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was distributed across various regions, including the North Island, where it thrived in a range of soil types. The introduction occurred primarily in the late 19th and early 20th centuries, during a period of increased botanical interest and landscape gardening. It has since become naturalized in some areas, raising concerns about its potential impact on native ecosystems. Despite its ornamental value, its spread has been monitored to prevent ecological disruption."
}
