{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dielsii",
    "plant_slug": "acacia-dielsii",
    "plant_name_scientific": "acacia dielsii",
    "intro": "Acacia dielsii, commonly known as the yellow acacia, is a shrub or small tree native to Africa, particularly found in regions like Kenya and Tanzania. It is characterized by its slender, often thornless stems and bipinnate leaves that are composed of numerous small leaflets. The plant produces yellow to golden-green flowers in dense, spherical clusters, which are highly attractive to pollinators such as bees and birds. Acacia dielsii is adapted to arid and semi-arid environments, exhibiting drought tolerance through its deep root system and reduced leaf surface area. It plays an important ecological role in providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dielsii"
    },
    "taxonomy_art_desc": "Acacia dielsii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have simple flowers and include legumes, which are known for nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and often has nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia dielsii, a specific type of acacia native to certain regions of Africa, known for its ecological importance and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dielsii is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This plant typically grows in dry, sandy soils and is often associated with coastal and inland habitats. It is well adapted to the arid and semi-arid conditions of its native range. Acacia dielsii plays an important ecological role in the local flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia dielsii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the coast, thriving in coastal fynbos and sandy soils. The plant is often associated with disturbed habitats and has spread beyond its original introduction sites. Its rapid growth and ability to colonize open areas have made it a potential invasive species in some regions. However, it is also valued for its ornamental qualities and is sometimes cultivated in gardens."
}
