{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia laevigata",
    "plant_slug": "acacia-laevigata",
    "plant_name_scientific": "acacia laevigata",
    "intro": "Acacia laevigata, commonly known as the white acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its smooth, grey bark and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers in compact globular heads, which are followed by long, flat pods containing seeds. It thrives in arid and semi-arid environments, showing adaptability to poor soils and drought conditions. Acacia laevigata plays an important role in local ecosystems, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia laevigata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Mozambique. It is commonly found in arid and semi-arid regions, particularly in the Karoo and Succulent Karoo biomes. This plant thrives in sandy or gravelly soils and is often seen along roadsides, in open woodlands, and on rocky outcrops. It plays an important ecological role by providing habitat and food for various wildlife species. Due to its hardy nature, it is also sometimes cultivated in gardens in regions with similar climates.",
    "distribution_introduced_art_desc": "Acacia laevigata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. The plant thrives in sandy soils and is often found in open woodlands and shrublands. Its introduction has led to it being considered an invasive species in some areas. It is valued for its hard wood and is also used in traditional medicine."
}
