{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mitchellii",
    "plant_slug": "acacia-mitchellii",
    "plant_name_scientific": "acacia mitchellii",
    "intro": "Acacia mitchellii, commonly known as the Mitchell's wattle, is a small to medium-sized evergreen shrub or tree native to Western Australia. It is characterized by its slender, often multi-branched structure and feathery foliage composed of small, narrow phyllodes. The plant produces yellow globular flowerheads that appear in late winter to early spring, attracting a variety of pollinators. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia mitchellii is also valued for its ornamental appeal and is sometimes used in reforestation projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mitchellii"
    },
    "taxonomy_art_desc": "Acacia mitchellii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Fabales, which comprises plants with legume-like flowers and often nitrogen-fixing capabilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, recognized for their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their phyllodes (modified leaves) and often used in traditional medicine and as sources of timber. Its species is Acacia mitchellii, a specific type of acacia native to Australia, characterized by its slender, wiry stems and small, feathery leaves.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mitchellii is primarily native to New South Wales, South Australia, and Victoria. It is commonly found in dry, sandy soils across these regions. This plant thrives in arid and semi-arid environments, often growing in open woodlands or shrublands. It is well adapted to the climate conditions of its native range. Acacia mitchellii plays an important ecological role in supporting local wildlife and maintaining soil stability.",
    "distribution_introduced_art_desc": "Acacia mitchellii was mainly introduced to control soil erosion and stabilize sand dunes in coastal and arid regions. It is commonly used in restoration projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, its rapid growth and spread can sometimes lead to invasive behavior in non-native environments. It is widely cultivated in Australia and has been introduced to other parts of the world for ecological and agricultural purposes."
}
