{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia merrillii",
    "plant_slug": "acacia-merrillii",
    "plant_name_scientific": "acacia merrillii",
    "intro": "Acacia merrillii, commonly known as the slender acacia, is a flowering plant native to eastern Africa. It is a shrub or small tree that typically grows in arid or semi-arid regions. The plant produces small, yellow flowers arranged in compact clusters, which are often visited by bees and other pollinators. Its leaves are bipinnate, meaning they are divided into small, feather-like leaflets. Acacia merrillii is known for its ability to thrive in poor soils and is often used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia merrillii is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and parts of South Africa. It is commonly found in savanna and woodland habitats, often growing in well-drained soils. This species is adapted to semi-arid and tropical climates, thriving in regions with distinct dry and wet seasons. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia merrillii is also known for its hardy nature, making it a resilient plant in its native range.",
    "distribution_introduced_art_desc": "Acacia merrillii was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It thrives in open landscapes and is commonly planted as an ornamental or for erosion control. The plant is known for its distinctive, flat, feathery leaves and yellow flowers that bloom in spring. It is often used in landscaping due to its hardiness and ability to tolerate drought conditions. However, it may become invasive in certain environments if not managed properly."
}
