{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mellifera subsp. detinens",
    "plant_slug": "acacia-mellifera-subsp-detinens",
    "plant_name_scientific": "acacia mellifera subsp. detinens",
    "intro": "Acacia mellifera subsp. detinens, commonly known as the honey acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branching stems and phyllodes that are typically narrow and linear. The plant produces yellow flowers in globular or cylindrical spikes, which are attractive to pollinators such as bees. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. The species is well-suited to arid and semi-arid environments due to its drought tolerance and deep root system.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mellifera subsp. detinens is primarily native to southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This subspecies is commonly found in arid and semi-arid regions, particularly in grasslands and rocky outcrops. It thrives in well-drained soils and is adapted to the harsh climatic conditions of its native habitat. The plant is often used as a source of firewood and has ecological importance in supporting local wildlife. Its distribution is closely linked to the availability of water and suitable soil conditions in its native range.",
    "distribution_introduced_art_desc": "Acacia mellifera subsp. detinens was mainly introduced to areas with sandy or rocky soils, particularly in regions with a Mediterranean climate. It is commonly found in coastal and inland areas of southern Africa, including parts of South Africa, Namibia, and Botswana. This subspecies is well adapted to dry conditions and can thrive in environments with low rainfall. It is often used for soil stabilization and as a source of timber and firewood. Its introduction has been largely driven by its ecological and economic value in these regions."
}
