{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brownii",
    "plant_slug": "acacia-brownii",
    "plant_name_scientific": "acacia brownii",
    "intro": "Acacia brownii, commonly known as the brown acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, branching structure and its distinctive yellow flowers that bloom in clusters. The plant produces long, flat pods that contain seeds, which are dispersed by the wind. Acacia brownii is adapted to survive in dry conditions, with deep roots that allow it to access water from deeper soil layers. It is also known for its ability to fix nitrogen, improving soil fertility in its environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia brownii"
    },
    "taxonomy_art_desc": "Acacia brownii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants with distinctive flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acacia-like foliage and often used in traditional medicine. Its species is Acacia brownii, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brownii is primarily native to New South Wales, Queensland, and Victoria. This species is commonly found in the arid and semi-arid regions of these Australian states. It thrives in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the dry climate and can survive with minimal rainfall. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia brownii was mainly introduced to areas with sandy soils and arid climates, where it thrives in regions with low rainfall. It is commonly found in coastal dunes and inland sandy plains, often forming dense thickets. This plant has been introduced to several parts of the world, including the Mediterranean, South Africa, and parts of the United States. Its rapid growth and ability to fix nitrogen make it a useful plant for soil stabilization. However, it can also become invasive in some regions, outcompeting native vegetation."
}
