{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia thegonocarpa",
    "plant_slug": "acacia-thegonocarpa",
    "plant_name_scientific": "acacia thegonocarpa",
    "intro": "Acacia thegonocarpa, commonly known as the honey ant tree, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is known for its ability to fix nitrogen in the soil, which enriches the surrounding environment. Its pods contain seeds that are dispersed by wind, contributing to its spread in arid and semi-arid regions. Acacia thegonocarpa is also valued for its role in providing food and shelter for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia thegonocarpa is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This species is adapted to withstand high temperatures and low rainfall, making it a resilient component of the local flora. It plays an important ecological role by providing habitat and food for various wildlife species. Its distribution is largely restricted to these specific environmental conditions across the southern African region.",
    "distribution_introduced_art_desc": "Acacia thegonocarpa was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soil conditions. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. The plant is often used for its hardy nature and ability to stabilize soil, making it valuable in reclamation projects. Its introduction has sometimes led to ecological concerns due to its aggressive growth and potential to outcompete native species. Overall, it plays a significant role in both ecological and agricultural contexts in its introduced range."
}
