{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hierochoensis",
    "plant_slug": "acacia-hierochoensis",
    "plant_name_scientific": "acacia hierochoensis",
    "intro": "Acacia hierochoensis, commonly known as the Ethiopian acacia, is a flowering plant native to Ethiopia. It belongs to the Fabaceae family and is characterized by its slender, often multi-branched stem and bipinnate leaves. The plant produces yellow to orange flowers arranged in cylindrical clusters, which are typical of the genus Acacia. It thrives in arid and semi-arid environments, making it well-adapted to drought conditions. The species is of interest for its ecological role and potential medicinal properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hierochoensis"
    },
    "taxonomy_art_desc": "Acacia hierochoensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns, horsetails, and some modern seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often spiny thorns. Its species is Acacia hierochoensis, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hierochoensis is primarily native to Queensland. This species is found in the northern regions of the state, particularly in the wet tropical and semi-arid zones. It thrives in open woodlands and grasslands with well-drained soils. The plant is well adapted to the seasonal climate of Queensland, tolerating both drought and occasional flooding. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia hierochoensis was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for dryland environments. This plant is often used for soil stabilization and as a source of timber or fuelwood in its native range. Its introduction has been noted in several parts of Africa, particularly in countries with similar ecological conditions. Due to its hardy nature, it has become an important species in restoration projects in degraded landscapes."
}
