{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia harveyi",
    "plant_slug": "acacia-harveyi",
    "plant_name_scientific": "acacia harveyi",
    "intro": "Acacia harveyi, commonly known as the Harvey's wattle, is a shrub native to Australia. It is characterized by its slender, often spiny stems and small, phyllodes that are typically green and linear. The plant produces yellow flowers in globular clusters, which bloom in spring and attract pollinators such as bees and birds. Its leaves are adapted to reduce water loss, making it well-suited for arid environments. Acacia harveyi plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia harveyi"
    },
    "taxonomy_art_desc": "Acacia harveyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their ancient lineage and diverse morphological features. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often found in tropical and subtropical regions. Its order is Fabales, which includes plants with flowers that have five petals and are commonly known for their legume fruits. Its family is Fabaceae, also known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia harveyi, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia harveyi is primarily native to Western Australia. It is commonly found in the coastal regions and adjacent areas of the state. This species thrives in sandy soils and is often seen in heathlands and open woodlands. It plays an important ecological role in its native habitat. Acacia harveyi is well adapted to the dry and sunny conditions typical of its environment.",
    "distribution_introduced_art_desc": "Acacia harveyi was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since spread beyond cultivated areas and is now found in various habitats, including coastal dunes and disturbed soils. The plant is considered invasive in some regions, outcompeting native species for resources. Its rapid growth and ability to form dense thickets contribute to its spread and ecological impact. Management efforts are ongoing to control its spread and mitigate its effects on local ecosystems."
}
