{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pentadenia subsp. syntoma",
    "plant_slug": "acacia-pentadenia-subsp-syntoma",
    "plant_name_scientific": "acacia pentadenia subsp. syntoma",
    "intro": "Acacia pentadenia subsp. syntoma, commonly known as the narrow-leaf wattle, is a shrub native to Western Australia. It is characterized by its slender, often sparsely branched stems and small, yellow flowers that appear in globular or cylindrical clusters. The leaves are narrow and often have a waxy coating, which helps reduce water loss in its arid environment. The plant produces flat, elongated pods that contain seeds with a hard coat. It is well adapted to dry conditions and is often found in sandy or rocky soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pentadenia"
    },
    "taxonomy_art_desc": "Acacia pentadenia subsp. syntoma belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acorn-like pods and often used in traditional medicine. Its species is Acacia pentadenia, a specific type of acacia that is further divided into subspecies, including syntoma, which may have distinct morphological or geographical characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pentadenia subsp. syntoma is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the areas of the Esperance and Great Southern regions. This subspecies thrives in sandy soils and is often associated with coastal and inland shrublands. It is an important component of the local flora and is adapted to the dry, temperate climate of the region. The plant is also known for its distinctive yellow flowers and is sometimes used in horticulture.",
    "distribution_introduced_art_desc": "Acacia pentadenia subsp. syntoma was mainly introduced to Australia. It is commonly found in the northern regions, particularly in Queensland and the Northern Territory. This subspecies is often associated with sandy soils and open habitats such as grasslands and woodland edges. It is valued for its hardiness and ability to thrive in arid conditions. However, it is considered a potential environmental weed in some areas due to its aggressive growth habit."
}
