{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia baileyana var. purpurea",
    "plant_slug": "acacia-baileyana-var-purpurea",
    "plant_name_scientific": "acacia baileyana var. purpurea",
    "intro": "Acacia baileyana var. purpurea, commonly known as the purple wattle, is a flowering plant native to Australia. It is characterized by its feathery, bipinnate leaves and clusters of small, fluffy yellow flowers. The plant is often cultivated for its ornamental value due to its vibrant foliage and showy blooms. It thrives in well-drained soils and full sun, making it suitable for gardens and landscapes. The variety 'purpurea' is distinguished by its striking purple foliage, which adds a unique visual appeal to the plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia baileyana var. purpurea is primarily native to eastern Australia, including regions in New South Wales and Victoria. This variety is commonly found in coastal and sandy soils along the eastern coast of the country. It thrives in well-drained soils and is often seen in open woodlands and heathlands. The plant is known for its striking purple foliage, which distinguishes it from other acacia species. It plays an important role in local ecosystems and is also popular as an ornamental plant.",
    "distribution_introduced_art_desc": "Acacia baileyana var. purpurea was mainly introduced to ornamental horticulture and landscaping due to its attractive purple foliage and hardy nature. It is commonly used in gardens and public spaces for its aesthetic value and ability to thrive in a variety of soil conditions. The plant is native to Australia but has been widely cultivated in other regions with similar climates. Its introduction has led to its presence in several countries, particularly in temperate and subtropical areas. However, it is important to manage its spread to prevent potential ecological impacts in non-native environments."
}
