{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tumida var. pilbarensis",
    "plant_slug": "acacia-tumida-var-pilbarensis",
    "plant_name_scientific": "acacia tumida var. pilbarensis",
    "intro": "Acacia tumida var. pilbarensis, commonly known as the Pilbara acacia, is a shrub or small tree native to the Pilbara region of Western Australia. It is characterized by its slender, erect stems and bipinnate leaves composed of small, oval-shaped leaflets. The plant produces yellow globular flowers that appear in clusters, typically during the cooler months. It is adapted to arid and semi-arid environments, showing drought tolerance and a deep root system. The species is also valued for its role in local ecosystems and as a source of traditional materials by Indigenous communities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tumida"
    },
    "taxonomy_art_desc": "Acacia tumida var. pilbarensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of flowering plants in the legume family, known for their distinctive umbrella-like or flat-topped inflorescences and often used for timber or as ornamental plants. Its species is Acacia tumida, a specific type within the Acacia genus, which is further divided into varieties, with var. pilbarensis being a variant adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tumida var. pilbarensis is primarily native to Western Australia. This variant of the species is found in the Pilbara region, which is located in the northwestern part of the state. It thrives in arid and semi-arid environments, often growing on rocky outcrops and sandy soils. The plant is well adapted to the harsh climatic conditions of the region, including high temperatures and low rainfall. It plays an important ecological role in the local flora and is commonly found in native vegetation communities.",
    "distribution_introduced_art_desc": "Acacia tumida var. pilbarensis was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its hardy nature and ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, making it a popular choice for landscaping in dry environments. Its introduction has helped in restoring degraded lands and supporting local biodiversity. However, it requires careful management to prevent it from becoming invasive in non-native areas."
}
