{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sibilans",
    "plant_slug": "acacia-sibilans",
    "plant_name_scientific": "acacia sibilans",
    "intro": "Acacia sibilans, commonly known as the weeping acacia, is a small to medium-sized evergreen tree native to southern Africa. It is characterized by its delicate, feathery foliage and clusters of yellow flowers that bloom throughout the year. The plant has small, narrow leaves that are often covered in fine hairs, contributing to its distinctive appearance. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The tree is also valued for its ornamental appeal and is often cultivated in gardens for its unique visual characteristics.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sibilans"
    },
    "taxonomy_art_desc": "Acacia sibilans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of plants that includes ferns, horsetails, and other primitive vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, vetches, and other related plants. Its family is Fabaceae, commonly known as the legume family, which is characterized by the distinctive pod-like fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as sources of timber. Its species is Acacia sibilans, a specific type of acacia found in certain regions, known for its unique characteristics and ecological roles.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sibilans is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the south-western part of the state. This species thrives in areas with a Mediterranean climate, characterized by dry summers and wet winters. It is often seen in open woodlands and heathlands. Acacia sibilans plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia sibilans was mainly introduced to the Mediterranean region for its ornamental value and ability to thrive in dry climates. It is commonly found in gardens and landscaped areas due to its attractive foliage and yellow flowers. The plant has been reported in several countries including Spain, Italy, and Greece. However, it is considered invasive in some areas where it outcompetes native vegetation. Its distribution is primarily limited to regions with mild winters and warm, dry summers."
}
