{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. angustata",
    "plant_slug": "acacia-longifolia-var-angustata",
    "plant_name_scientific": "acacia longifolia var. angustata",
    "intro": "Acacia longifolia var. angustata, commonly known as the narrow-leaved wattles, is a shrub or small tree native to the coastal regions of southern Australia. It is characterized by its slender, angular stems and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow globular flower heads that are clustered in dense, cylindrical spikes, which bloom from late winter to early spring. It thrives in sandy or gravelly soils and is adapted to coastal conditions, including salt spray and strong winds. This species is often used in coastal stabilization and as an ornamental plant due to its hardy nature and attractive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. angustata is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Western Cape, Eastern Cape, and parts of the Northern Cape. This variety thrives in coastal and inland sandy soils, often in fynbos vegetation types. It is commonly found in areas with a Mediterranean climate, characterized by wet winters and dry summers. The plant is well adapted to fire-prone environments and plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia longifolia var. angustata was mainly introduced to Australia as an ornamental plant due to its attractive foliage and ability to thrive in a variety of soil conditions. It has since become naturalized in several regions, particularly in coastal and sandy areas of southern Australia. The plant's rapid growth and prolific seed production have led to its spread beyond cultivated areas, sometimes causing ecological concerns. It is often found in disturbed habitats such as roadsides, urban areas, and degraded lands. Despite its invasive tendencies, it remains a popular choice for landscaping in regions with a Mediterranean climate."
}
