{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia revoluta",
    "plant_slug": "acacia-revoluta",
    "plant_name_scientific": "acacia revoluta",
    "intro": "Acacia revoluta, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and compound leaves with small, feather-like leaflets. The plant produces yellow to golden-green flowers that bloom in late winter to early spring, attracting pollinators such as bees and birds. Its bark is smooth and pale, often exfoliating to reveal a lighter inner layer. Acacia revoluta is adapted to arid and semi-arid environments, making it a resilient plant in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia revoluta is primarily native to eastern Australia, including parts of Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry sclerophyll forests and woodlands, often on sandy or rocky soils. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Acacia revoluta is well adapted to fire-prone environments and can regenerate after bushfires. It plays an important ecological role by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia revoluta was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the eastern and western parts of the country, particularly in areas with sandy or loamy soils. The plant is often used in reforestation projects due to its ability to thrive in harsh environmental conditions. It has also been introduced to other parts of the world, including Australia and some islands in the Pacific. However, its spread has raised concerns about potential invasiveness in non-native habitats."
}
