{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fruticosa",
    "plant_slug": "acacia-fruticosa",
    "plant_name_scientific": "acacia fruticosa",
    "intro": "Acacia fruticosa, commonly known as the yellow acacia, is a shrub native to southern Africa. It is characterized by its slender, branching stems and small, yellow flowers that bloom in clusters. The plant produces flat, bean-like pods that contain seeds, which are dispersed by wind. It thrives in arid and semi-arid environments, often growing on rocky soils. Acacia fruticosa is also valued for its ability to fix nitrogen, improving soil fertility in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fruticosa is primarily native to the Mediterranean region, including parts of southern Europe, northern Africa, and western Asia. It thrives in arid and semi-arid environments, often found in rocky soils and coastal areas. This plant is commonly distributed across countries such as Spain, Portugal, Morocco, Algeria, and Turkey. It is well adapted to drought conditions and can tolerate salt spray, making it a common species in coastal and inland deserts. Its distribution is also noted in some parts of the Middle East and the western coast of the Mediterranean Sea.",
    "distribution_introduced_art_desc": "Acacia fruticosa was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, parts of Africa, and the Middle East. This plant is often used for soil stabilization due to its deep root system and ability to withstand drought. Its introduction has sometimes led to ecological concerns in non-native regions. Despite its invasive potential, it is valued for its hardy nature and ornamental qualities."
}
