{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia prorsispinula",
    "plant_slug": "acacia-prorsispinula",
    "plant_name_scientific": "acacia prorsispinula",
    "intro": "Acacia prorsispinula, commonly known as the slender thorned acacia, is a flowering plant native to parts of Africa and the Arabian Peninsula. It is a shrub or small tree that typically grows in arid and semi-arid environments. The plant features bipinnate leaves with small, oblong leaflets and is characterized by its yellow, globular flower heads. Its thorns are slender and often arranged in clusters, providing a defensive mechanism against herbivores. The plant is well adapted to drought conditions, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia prorsispinula is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, often growing in sandy soils. This species is well adapted to harsh environmental conditions, such as high temperatures and low rainfall. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. The plant is also known for its distinctive, spiny foliage and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia prorsispinula was mainly introduced to control soil erosion and as a source of timber and fuelwood in tropical and subtropical regions. It is commonly found in disturbed areas such as roadsides, degraded forests, and agricultural fields. The plant thrives in well-drained soils and is adaptable to a wide range of environmental conditions. Due to its rapid growth and ability to fix nitrogen, it has been widely used in reforestation and land rehabilitation projects. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation."
}
