{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia craspedocarpa",
    "plant_slug": "acacia-craspedocarpa",
    "plant_name_scientific": "acacia craspedocarpa",
    "intro": "Acacia craspedocarpa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and phyllodes that are narrow and slightly curved. The plant produces yellow flowers in late summer to early autumn, which are clustered in spherical heads. Its leaves are modified into phyllodes, a feature common in many Acacia species, reducing water loss in arid environments. Acacia craspedocarpa is adapted to dry conditions and is often found in sandy soils across the arid and semi-arid regions of Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia craspedocarpa"
    },
    "taxonomy_art_desc": "Acacia craspedocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and complex structures like stomata. Its class is Equisetopsida, which consists of ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises plants with distinctive flowers and includes legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their unique leaf structures and often used in traditional medicine. Its species is Acacia craspedocarpa, a specific type of acacia found in certain regions, known for its distinctive morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia craspedocarpa is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in dry, sandy soils and is often associated with coastal and inland habitats. It is a shrub or small tree that plays an important role in local ecosystems. Its distribution is largely restricted to the arid and semi-arid zones of Western Australia.",
    "distribution_introduced_art_desc": "Acacia craspedocarpa was mainly introduced to India as an ornamental plant due to its attractive foliage and ability to thrive in various environmental conditions. It has been cultivated in gardens and landscapes across the country, particularly in regions with warm climates. The plant is also valued for its potential in soil stabilization and as a source of timber. However, its introduction has raised concerns about its invasive potential in certain ecosystems. Despite these concerns, it remains a popular choice for horticultural use in India."
}
