{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia galpinii",
    "plant_slug": "acacia-galpinii",
    "plant_name_scientific": "acacia galpinii",
    "intro": "Acacia galpinii, commonly known as the Galpin's acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, multi-branched structure and phyllodes that are narrow and linear. The plant produces yellow flowers in globular clusters, which are followed by flat, pod-like fruits. It thrives in arid and semi-arid environments, often found in rocky soils. Acacia galpinii is valued for its ecological role and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia galpinii is primarily native to the southern regions of Africa, specifically South Africa. It is found in the Western and Northern Cape provinces, as well as parts of the Free State and Lesotho. This species thrives in arid and semi-arid environments, often growing on rocky outcrops and in open woodlands. It is well adapted to the dry climate and can withstand periods of drought. Acacia galpinii is commonly found in savanna and shrubland habitats across its native range.",
    "distribution_introduced_art_desc": "Acacia galpinii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in rocky outcrops and along coastal areas. This plant is often used for erosion control due to its ability to thrive in poor soils. However, it has also been reported to spread aggressively in some areas, raising concerns about its potential invasiveness. Its introduction has had both ecological and horticultural impacts in the region."
}
