{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aculeaticarpa",
    "plant_slug": "acacia-aculeaticarpa",
    "plant_name_scientific": "acacia aculeaticarpa",
    "intro": "Acacia aculeaticarpa, commonly known as the coastal acacia, is a shrub or small tree native to coastal areas of southern Africa. It is characterized by its slender, often thornless stems and bipinnate leaves that are finely divided. The plant produces yellow globular flowers in late summer, which are followed by flat, ribbed pods containing seeds. It is well adapted to sandy soils and salt spray, making it a common sight in coastal dunes and scrublands. Its ecological importance includes providing habitat and food for various insects and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aculeaticarpa is primarily native to Australia, particularly in the arid and semi-arid regions of the central and western parts of the country. It is commonly found in areas such as the Simpson Desert, the Great Sandy Desert, and the Nullarbor Plain. This species thrives in sandy soils and is well adapted to the harsh, dry conditions of its native habitat. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife. Acacia aculeaticarpa is also known for its distinctive spiny foliage and yellow flowers, which make it a notable feature of the Australian landscape.",
    "distribution_introduced_art_desc": "Acacia aculeaticarpa was mainly introduced to control soil erosion and for its valuable timber and fuelwood. It is commonly found in degraded lands and along roadsides in tropical and subtropical regions. The plant has been widely planted in countries like India, Australia, and parts of Africa for its ecological and economic benefits. However, it can become invasive in some areas, outcompeting native vegetation. Its distribution is now widespread due to human activities and its adaptability to various environmental conditions."
}
