{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia zizyphispina",
    "plant_slug": "acacia-zizyphispina",
    "plant_name_scientific": "acacia zizyphispina",
    "intro": "Acacia zizyphispina, commonly known as the African milk bush, is a shrub or small tree native to southern Africa. It is characterized by its slender, thorned stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellow globular flowers that bloom in winter, followed by flat, pod-like fruits containing edible seeds. It is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for reclamation of degraded lands. The plant has traditional uses in medicine and as a source of fodder for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia zizyphispina is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in well-drained soils. This species is adapted to arid and semi-arid climates, making it a resilient component of the local flora. It plays an important ecological role by providing habitat and food for various wildlife species. The plant is also known for its distinctive spiny thorns and yellow flowers, which are characteristic of the Acacia genus.",
    "distribution_introduced_art_desc": "Acacia zizyphispina was mainly introduced to control soil erosion and for its potential use in agroforestry systems. It is commonly found in degraded lands and has been planted in arid and semi-arid regions to stabilize soil and improve land productivity. The plant is valued for its rapid growth and ability to thrive in poor soil conditions. However, it has also been reported to spread aggressively, sometimes becoming invasive in native ecosystems. Its introduction has had both positive and negative ecological impacts depending on the region."
}
