{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia formidabilis",
    "plant_slug": "acacia-formidabilis",
    "plant_name_scientific": "acacia formidabilis",
    "intro": "Acacia formidabilis, commonly known as the formidable acacia, is a shrub or small tree native to Australia. It is characterized by its compound leaves, which are often covered in fine hairs, and its yellow, globular flower heads that appear in clusters. The plant thrives in arid and semi-arid environments, showcasing its adaptability to harsh conditions. Its woody structure and deep root system enable it to survive in nutrient-poor soils. Acacia formidabilis plays a role in stabilizing soils and providing habitat for various desert species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia formidabilis"
    },
    "taxonomy_art_desc": "Acacia formidabilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that are often characterized by their primitive floral structures. Its order is Fabales, which consists of flowering plants that typically have legumes as their fruit type. Its family is Fabaceae, commonly known as the legume or bean family, known for nitrogen-fixing abilities and diverse morphological features. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia formidabilis, a specific type of acacia known for its robust growth and adaptability to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia formidabilis is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in dry, sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia formidabilis plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia formidabilis was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly planted along roadsides, in degraded lands, and on degraded agricultural fields. The plant is valued for its hardy nature and ability to thrive in poor soil conditions. However, it can become invasive in some areas, outcompeting native vegetation. Its introduction has had both ecological and economic impacts depending on the region."
}
