{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sedifolia",
    "plant_slug": "acacia-sedifolia",
    "plant_name_scientific": "acacia sedifolia",
    "intro": "Acacia sedifolia, commonly known as the silky acacia, is a shrub native to southern Africa. It is characterized by its feathery, grey-green foliage and produces small, yellow flowers that bloom in spring. The plant has small, stipitate leaves that are often covered in fine hairs, giving it a soft, silvery appearance. It thrives in well-drained soils and is drought-tolerant, making it suitable for xeriscaping. The plant is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sedifolia"
    },
    "taxonomy_art_desc": "Acacia sedifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia sedifolia, a specific type of acacia known for its leaf shape and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sedifolia is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This species thrives in arid and semi-arid environments, often growing on rocky soils. It is a hardy shrub that plays an important role in local ecosystems. Its distribution is largely restricted to the coastal and interior areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia sedifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, particularly in the Western and Eastern Cape provinces. The plant thrives in sandy or gravelly soils and is often seen growing in disturbed environments. Its introduction has led to concerns about its potential invasiveness in some ecosystems. Despite its ornamental value, it requires careful management to prevent it from spreading uncontrollably."
}
