{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia micrantha",
    "plant_slug": "acacia-micrantha",
    "plant_name_scientific": "acacia micrantha",
    "intro": "Acacia micrantha, commonly known as the narrow-leaved wattle, is a small to medium-sized shrub or tree native to southern Africa. It is characterized by its slender, often multi-stemmed form and its feathery, bipinnate leaves that are typically narrow and linear. The plant produces small, yellow floral spikes that are typical of the Acacia genus, and these flowers are often followed by flat, pod-like fruits. Acacia micrantha is well adapted to arid and semi-arid environments, making it a resilient component of many local ecosystems. It is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia micrantha is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It is commonly found in savannas, grasslands, and woodland areas where the climate is warm and semi-arid. This species thrives in well-drained soils and is often associated with rocky or sandy habitats. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia micrantha is also known for its ability to fix nitrogen, contributing to soil fertility in its native range.",
    "distribution_introduced_art_desc": "Acacia micrantha was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in fynbos vegetation and has spread into agricultural and urban areas. The plant's rapid growth and ability to thrive in disturbed soils contribute to its spread. It competes with native flora, leading to ecological imbalances in invaded areas. Management efforts focus on controlling its spread through mechanical removal and chemical treatment."
}
