{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dissitiflora",
    "plant_slug": "acacia-dissitiflora",
    "plant_name_scientific": "acacia dissitiflora",
    "intro": "Acacia dissitiflora, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping branches and small, bipinnate leaves. The plant produces yellow flowers in dense, cylindrical spikes, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia dissitiflora is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dissitiflora is primarily native to northern Australia, including parts of Queensland, the Northern Territory, and Western Australia. It thrives in arid and semi-arid regions, often found in sandy soils and open woodlands. This species is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. Acacia dissitiflora is also sometimes referred to as the \"sandy acacia\" due to its preference for sandy environments.",
    "distribution_introduced_art_desc": "Acacia dissitiflora was mainly introduced to areas with well-drained soils and a warm, arid climate, typically found in regions of Australia and parts of Southeast Asia. It is commonly found in disturbed soils, such as along roadsides, in open woodlands, and in degraded habitats. This plant is often used for soil stabilization and as a source of timber due to its hardy nature. Its introduction has led to its establishment in several non-native regions, sometimes outcompeting native vegetation. However, it is generally considered a low-risk invasive species in most environments."
}
