{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nuperrima",
    "plant_slug": "acacia-nuperrima",
    "plant_name_scientific": "acacia nuperrima",
    "intro": "Acacia nuperrima, commonly known as the narrow-leaf wattle, is a small to medium-sized shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features slender, erect stems with small, bipinnate leaves that are often covered in fine hairs. Its yellow flowers are arranged in cylindrical spikes and bloom in spring, attracting various pollinators. Acacia nuperrima is adapted to arid and semi-arid environments, making it a hardy and drought-tolerant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nuperrima"
    },
    "taxonomy_art_desc": "Acacia nuperrima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinct arrangement of petals and are often legumes. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acorn-like seed pods and often used in traditional medicine. Its species is Acacia nuperrima, a specific type of acacia found in certain regions, known for its unique morphological features and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nuperrima is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia nuperrima was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape. The plant thrives in coastal and sandy soils, often growing along the edges of forests and in disturbed areas. Its introduction has led to concerns about its potential invasiveness in local ecosystems. Despite its ornamental value, it requires careful management to prevent it from outcompeting native flora."
}
