{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gracilifolia",
    "plant_slug": "acacia-gracilifolia",
    "plant_name_scientific": "acacia gracilifolia",
    "intro": "Acacia gracilifolia, commonly known as slender-leaf acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often drooping branches and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow, globular inflorescences that bloom in summer, attracting pollinators such as bees and birds. Its seeds are encased in hard, woody pods that open to release the seeds when mature. Acacia gracilifolia is adapted to arid and semi-arid environments, making it a resilient plant in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gracilifolia"
    },
    "taxonomy_art_desc": "Acacia gracilifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex cellular structures and the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which consists of flowering plants that are often legumes, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive acicular leaves and often used in traditional medicine and as sources of timber. Its species is Acacia gracilifolia, a specific type of acacia known for its slender leaves and is typically found in arid or semi-arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gracilifolia is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen along coastal dunes and inland plains. It plays an important role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely confined to the southern parts of the country.",
    "distribution_introduced_art_desc": "Acacia gracilifolia was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and central parts of the country. This plant is often used for soil stabilization due to its deep root system and ability to grow in poor soil conditions. Its introduction has also been associated with ecological changes in native habitats. However, it is considered a potential invasive species in some regions outside its native range."
}
