{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia denticulosa",
    "plant_slug": "acacia-denticulosa",
    "plant_name_scientific": "acacia denticulosa",
    "intro": "Acacia denticulosa, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late summer. The plant thrives in well-drained soils and is drought-tolerant, making it suitable for arid environments. Its seed pods are elongated and contain small, hard seeds. Acacia denticulosa plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia denticulosa"
    },
    "taxonomy_art_desc": "Acacia denticulosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by its complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have leaves with stipules and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of flowering plants commonly known as wattles, found predominantly in Australia and characterized by their phyllodes and often nitrogen-fixing capabilities. Its species is Acacia denticulosa, a specific type of acacia native to Australia, known for its distinctive serrated leaves and its role in local ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia denticulosa is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy or gravelly soils. This species thrives in arid and semi-arid environments, often growing in open woodlands or shrublands. It is well adapted to the climate of Western Australia, with its hardy nature allowing it to survive in dry conditions. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia denticulosa was mainly introduced to control soil erosion and for its ornamental value in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions. This plant is often used in reclamation projects due to its ability to thrive in harsh environments. It has also been introduced as a source of fodder for livestock in some regions. However, its invasive potential in certain ecosystems requires careful management."
}
