{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella tequilana var. tequilana",
    "plant_slug": "acaciella-tequilana-var-tequilana",
    "plant_name_scientific": "acaciella tequilana var. tequilana",
    "intro": "Acaciella tequilana var. tequilana, commonly known as the Mexican honey mesquite, is a shrub or small tree native to Mexico. It is characterized by its compound leaves, which are usually bipinnate and covered in fine hairs. The plant produces small, yellow flowers that are clustered in inflorescences, followed by flat, pod-like fruits. It thrives in arid and semi-arid environments, making it well adapted to hot, dry climates. This species is also valued for its role in traditional medicine and as a source of nectar for bees.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella tequilana"
    },
    "taxonomy_art_desc": "Acaciella tequilana var. tequilana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often associated with broad leaves. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acaciella, a group of flowering plants native to Mexico, typically featuring small, clustered flowers and shrub-like growth. Its species is Acaciella tequilana, a specific variety known for its use in traditional Mexican beverages and its ecological significance in arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella tequilana var. tequilana is primarily native to Mexico Central, Mexico Northeast, Mexico Northwest, and Mexico Southwest. This plant is commonly found in the arid and semi-arid regions of these areas. It thrives in limestone soils and is often associated with desert ecosystems. The species is well adapted to the harsh climate conditions of its native range. It is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acaciella tequilana var. tequilana was mainly introduced to regions with a warm, dry climate, particularly in southern Mexico and parts of Central America. It thrives in well-drained soils and is commonly found in disturbed areas such as roadsides and abandoned fields. This plant is often used for soil stabilization due to its deep root system and ability to tolerate drought conditions. It has also been introduced to other parts of the world for ornamental purposes. However, its spread is limited by its specific climatic requirements and soil preferences."
}
