{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ulicifolia var. brownii",
    "plant_slug": "acacia-ulicifolia-var-brownii",
    "plant_name_scientific": "acacia ulicifolia var. brownii",
    "intro": "Acacia ulicifolia var. brownii, commonly known as the Brown's wattle, is a shrub native to Western Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant thrives in well-drained soils and full sun, often found in coastal and sandy habitats. Its foliage is aromatic and has been used traditionally by Indigenous communities. It is also valued for its ornamental appeal and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ulicifolia var. brownii is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils and rocky outcrops, often in association with other drought-tolerant shrubs and grasses. It is well adapted to the harsh climatic conditions of its native habitat, including high temperatures and low rainfall. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to the specific environmental conditions found in these regions.",
    "distribution_introduced_art_desc": "Acacia ulicifolia var. brownii was mainly introduced to New Zealand. It was brought there during the 19th century as part of the introduction of exotic plant species for ornamental and possibly practical purposes. This variety is known for its distinctive foliage and is often cultivated in gardens and landscapes. However, it has since become naturalized in some areas, raising concerns about its potential impact on native ecosystems. Its distribution is now largely restricted to the northern and central regions of the country."
}
