{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia frutescens",
    "plant_slug": "acacia-frutescens",
    "plant_name_scientific": "acacia frutescens",
    "intro": "Acacia frutescens, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its dense, rounded growth habit and bright yellow flowers that bloom in spring. The plant has phyllodes, which are flattened leaf stalks that function as leaves, and it produces small, woody pods that contain seeds. It thrives in a variety of soil types but prefers well-drained conditions. Acacia frutescens is also valued for its ornamental appeal and its role in ecological systems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia frutescens is primarily native to India. It is commonly found in the arid and semi-arid regions of the country, particularly in the states of Rajasthan, Gujarat, and parts of southern India. This plant thrives in sandy or rocky soils and is often seen along the edges of deserts and in scrublands. It plays an important role in the local ecosystem by providing shelter and food for various wildlife species. Acacia frutescens is also known for its hardy nature and ability to withstand harsh climatic conditions.",
    "distribution_introduced_art_desc": "Acacia frutescens was mainly introduced to areas with dry and semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the inland parts of New South Wales and Queensland. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has sometimes led to the displacement of native vegetation in certain regions. Due to its hardy nature, it has become naturalized in several parts of the world outside its native range."
}
