{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia colei var. colei",
    "plant_slug": "acacia-colei-var-colei",
    "plant_name_scientific": "acacia colei var. colei",
    "intro": "Acacia colei var. colei, commonly known as the coastal acacia, is a shrub native to the coastal regions of southern Africa. It is characterized by its slender, often spiny stems and small, bipinnate leaves that are adapted to reduce water loss in arid environments. The plant produces yellow flowers in globular inflorescences, which attract a variety of pollinators such as bees and birds. It thrives in well-drained soils and is often found in sandy or rocky coastal habitats. Due to its hardy nature, it is sometimes cultivated as a ornamental plant in coastal gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia colei"
    },
    "taxonomy_art_desc": "Acacia colei var. colei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Fabales, which consists of plants with flowers that typically have five petals and include legumes, which are known for nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic acacia-like leaves and often used for timber or as ornamental plants. Its species is Acacia colei, a specific type of acacia that is native to certain regions and is distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia colei var. colei is primarily native to Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia colei var. colei was mainly introduced to India. It is commonly found in the arid and semi-arid regions of the country. This plant is often used for its hardy nature and ability to thrive in poor soil conditions. It has been introduced for purposes such as soil stabilization and as a source of timber. However, its spread has raised concerns about its impact on native flora."
}
