{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heteracantha",
    "plant_slug": "acacia-heteracantha",
    "plant_name_scientific": "acacia heteracantha",
    "intro": "Acacia heteracantha, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It features slender, often thornless stems and bipinnate leaves composed of small, linear leaflets. The plant produces yellow globular flower heads that bloom in spring, attracting pollinators such as bees and birds. Its seeds are encased in a woody pod, which splits open to release the seeds when mature. Acacia heteracantha is adapted to arid environments and is often used in revegetation projects due to its hardiness and ability to fix nitrogen in the soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heteracantha is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and woodland habitats. This plant is well adapted to drought conditions and can survive in areas with low rainfall. It plays an important ecological role by providing food and shelter for various animals. Its distribution is also influenced by its ability to tolerate high temperatures and poor soil nutrients.",
    "distribution_introduced_art_desc": "Acacia heteracantha was mainly introduced to new environments for its ability to thrive in arid and semi-arid conditions, making it useful for land rehabilitation and soil stabilization. It is commonly found in regions with low rainfall and poor soil quality, where it can establish itself quickly and provide shade. This plant is also valued for its hardiness and ability to withstand drought, making it a preferred choice for reforestation projects. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native species. Despite these challenges, Acacia heteracantha remains an important species in ecological restoration efforts in many parts of the world."
}
