{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sericata var. dunnii",
    "plant_slug": "acacia-sericata-var-dunnii",
    "plant_name_scientific": "acacia sericata var. dunnii",
    "intro": "Acacia sericata var. dunnii, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its long, slender, and silky-haired leaves, which give it a distinctive appearance. The plant produces yellow flowers in globular or cylindrical clusters, which are often visited by bees and other pollinators. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The wood of Acacia sericata var. dunnii is hard and durable, historically used for construction and tool-making.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sericata var. dunnii is primarily native to the eastern and southern regions of Australia, including Queensland, New South Wales, Victoria, and South Australia. It thrives in dry, sandy soils and is commonly found in woodlands, grasslands, and coastal areas. This variety is well adapted to the arid and semi-arid climates of its native range. It is often seen growing in open habitats with low shrubs and is a characteristic plant of the Australian flora. The plant is also known for its distinctive foliage and is sometimes used in horticulture due to its ornamental value.",
    "distribution_introduced_art_desc": "Acacia sericata var. dunnii was mainly introduced to South Africa as an ornamental plant due to its attractive appearance and hardy nature. It is commonly found in gardens and along roadsides, where it thrives in well-drained soils and full sun. This variety is also used for soil stabilization and erosion control in arid and semi-arid regions. However, it has raised concerns due to its potential to become invasive in certain ecosystems. Its distribution has expanded beyond its original range, leading to increased monitoring and management efforts."
}
