{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia buxifolia subsp. pubiflora",
    "plant_slug": "acacia-buxifolia-subsp-pubiflora",
    "plant_name_scientific": "acacia buxifolia subsp. pubiflora",
    "intro": "Acacia buxifolia subsp. pubiflora, commonly known as the silky acacia, is a shrub native to southern Africa. It is characterized by its dense, leathery foliage and small, yellow flowers that appear in globular clusters. The plant produces flat, woody pods that contain several seeds. It thrives in well-drained soils and is often found in rocky or sandy habitats. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia buxifolia"
    },
    "taxonomy_art_desc": "Acacia buxifolia subsp. pubiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and produce legume-like fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their unique, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia buxifolia, a specific type of acacia that has the subspecies pubiflora, distinguished by its hairy flower structures and specific geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia buxifolia subsp. pubiflora is primarily native to New South Wales and Queensland. This subspecies is commonly found in the eastern regions of Australia. It thrives in dry to semi-arid environments, often in sandy or rocky soils. The plant is well adapted to the climate conditions of these states. It is a shrub that contributes to the local flora and ecosystem in these areas.",
    "distribution_introduced_art_desc": "Acacia buxifolia subsp. pubiflora was mainly introduced to urban and suburban gardens in South Africa due to its ornamental value. It is commonly found in cultivated landscapes, particularly in areas with mild climates. The plant is valued for its attractive foliage and small, fragrant flowers. However, it has shown invasive tendencies in some regions, leading to concerns about its ecological impact. Proper management is recommended to prevent its spread beyond cultivated areas."
}
