{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stenophylla",
    "plant_slug": "acacia-stenophylla",
    "plant_name_scientific": "acacia stenophylla",
    "intro": "Acacia stenophylla, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and narrow, phyllodes that are typically yellow-green in color. The plant produces yellow flowers in globular or cylindrical clusters, which bloom during the warmer months. Acacia stenophylla is adapted to arid and semi-arid environments, showcasing drought tolerance through its reduced leaf structure. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stenophylla"
    },
    "taxonomy_art_desc": "Acacia stenophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures such as vascular tissues. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their relatives, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, which includes plants that form nitrogen-fixing symbioses with bacteria and are widely distributed across the globe. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive flattened or spiny leaves and pod-like fruits. Its species is Acacia stenophylla, a specific type of acacia characterized by its narrow, needle-like leaves and is native to certain regions in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia stenophylla is primarily native to New South Wales, Northern Territory, Queensland, South Australia, Victoria, and Western Australia. This species is commonly found in arid and semi-arid regions across these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of the Australian interior. Its distribution reflects its ability to survive in low rainfall and high temperature environments.",
    "distribution_introduced_art_desc": "Acacia stenophylla was mainly introduced to India. It is commonly found in the dry and semi-arid regions of the country. This plant is often used for soil stabilization and as a source of timber. It has been introduced for its ability to thrive in harsh environmental conditions. However, its spread requires careful management to prevent ecological imbalances."
}
