{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armillata",
    "plant_slug": "acacia-armillata",
    "plant_name_scientific": "acacia armillata",
    "intro": "Acacia armillata, commonly known as the golden wattle, is a small evergreen shrub native to Australia. It is characterized by its distinctive yellow floral spikes, which bloom in spring and attract a variety of pollinators. The plant has phyllodes, which are flattened leaf stalks that function as leaves, and it produces pods that contain seeds. Acacia armillata is well adapted to arid and semi-arid environments, making it a resilient species in harsh climates. It is also an important plant in Australian ecosystems and holds cultural significance for Indigenous Australians.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia armillata"
    },
    "taxonomy_art_desc": "Acacia armillata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and diverse growth forms. Its order is Fabales, which consists of plants with legume-like fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, recognized by their distinctive pod fruits and often compound leaves. Its genus is Acacia, a large group of shrubs and trees found mainly in Australia and Africa, known for their phyllodes and ability to thrive in arid environments. Its species is Acacia armillata, a specific type of acacia characterized by its unique morphology and ecological adaptations, often found in sandy soils of arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armillata is primarily native to Queensland. It is commonly found in the eastern regions of the state, particularly in areas with sandy soils. This plant thrives in arid and semi-arid environments, often growing in open woodlands and along riverbanks. It is well adapted to the local climate and is an important component of the native flora. Acacia armillata is also known for its distinctive yellow flowers and its role in supporting local wildlife.",
    "distribution_introduced_art_desc": "Acacia armillata was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since become naturalized in various regions, particularly in the North Island, where it thrives in a wide range of soil types. The plant is commonly found in disturbed areas, along roadsides, and in forest margins, often forming dense thickets. Its rapid growth and ability to colonize open spaces have led to concerns about its impact on native ecosystems. Despite its invasive tendencies, it remains popular in horticulture for its yellow flowers and drought tolerance."
}
