{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scorpioides",
    "plant_slug": "acacia-scorpioides",
    "plant_name_scientific": "acacia scorpioides",
    "intro": "Acacia scorpioides, commonly known as the scorpion acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its slender, thorned branches and small, yellow flowers that bloom in clusters. The plant has feathery, bipinnate leaves that help reduce water loss in hot, dry climates. Its seeds are enclosed in woody pods and are often used in traditional medicine. Acacia scorpioides is also valued for its ability to fix nitrogen in the soil, making it useful in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scorpioides is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, Oman, and the United Arab Emirates. It is commonly found in desert and semi-arid regions, often growing along rocky outcrops and in sandy soils. This plant is well adapted to hot, dry climates and can thrive in areas with low rainfall. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Acacia scorpioides is also known for its hardy nature and ability to withstand extreme environmental conditions.",
    "distribution_introduced_art_desc": "Acacia scorpioides was mainly introduced to control soil erosion and as a source of timber and fuelwood in areas with degraded land. It is commonly found in dry savannas and rocky soils, where it establishes quickly and forms dense thickets. The plant's rapid growth and ability to thrive in poor soil conditions make it a valuable species for land rehabilitation. However, its invasive nature can lead to the displacement of native vegetation in some regions. Despite its benefits, careful management is required to prevent ecological imbalances."
}
