{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dimorpha",
    "plant_slug": "acacia-dimorpha",
    "plant_name_scientific": "acacia dimorpha",
    "intro": "Acacia dimorpha, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, bipinnate leaves and yellow flowers that bloom in late summer. The plant is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system. Its flowers are often visited by native bees and birds, contributing to local biodiversity. Acacia dimorpha is also valued for its hardy nature and is used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dimorpha"
    },
    "taxonomy_art_desc": "Acacia dimorpha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic acorn-like seed pods and often used in traditional medicine and as ornamental plants. Its species is Acacia dimorpha, a specific type of acacia found in certain regions, known for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dimorpha is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia dimorpha plays an important ecological role in its habitat by providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia dimorpha was mainly introduced to New Zealand. It was brought there for its ornamental value and potential for soil stabilization. The plant is now considered an invasive species in some regions of New Zealand. It spreads rapidly and can outcompete native vegetation. Management efforts are ongoing to control its spread and protect local ecosystems."
}
