{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chamelensis",
    "plant_slug": "acacia-chamelensis",
    "plant_name_scientific": "acacia chamelensis",
    "intro": "Acacia chamelensis, commonly known as the white acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, multi-branched stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular clusters, which are followed by long, slender pods containing seeds. It is well adapted to drought conditions and can thrive in poor soils. Acacia chamelensis is also valued for its role in soil stabilization and as a source of firewood and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chamelensis is primarily native to the arid and semi-arid regions of North Africa, particularly in countries such as Algeria, Tunisia, and Libya. It thrives in sandy soils and is commonly found in coastal dunes and inland shrublands. This plant is well adapted to hot, dry climates and can tolerate high levels of salinity. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Acacia chamelensis is also sometimes cultivated in regions with similar environmental conditions for its ornamental and medicinal value.",
    "distribution_introduced_art_desc": "Acacia chamelensis was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of Africa and the Middle East. This plant is often used for its hardy nature and ability to prevent soil erosion. Its introduction has been primarily for land stabilization and as a source of fuelwood. However, it can become invasive in some ecosystems if not managed properly."
}
