{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia campylophylla",
    "plant_slug": "acacia-campylophylla",
    "plant_name_scientific": "acacia campylophylla",
    "intro": "Acacia campylophylla, commonly known as the narrow-leaf wattle, is a shrub native to the arid and semi-arid regions of Australia. It is characterized by its slender, often drooping phyllodes that are typically green and covered in fine hairs. The plant produces yellow globular flowers in late summer, which are arranged in compact clusters. Acacia campylophylla is well adapted to drought conditions, with a deep root system that allows it to survive in nutrient-poor soils. It plays an important ecological role by providing food and habitat for various native animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia campylophylla"
    },
    "taxonomy_art_desc": "Acacia campylophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which includes legumes and other plants that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive thorned stems and often fragrant flowers. Its species is Acacia campylophylla, a specific type of acacia native to Australia, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia campylophylla is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Fitzgerald River area. This species thrives in sandy soils and is often associated with dry, open habitats. It is a shrub or small tree that is well adapted to the arid and semi-arid conditions of its native range. The plant plays an important ecological role in its native environment, providing habitat and food for various local fauna.",
    "distribution_introduced_art_desc": "Acacia campylophylla was mainly introduced to control erosion and for soil stabilization in degraded or sandy soils. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its ability to fix nitrogen, improving soil fertility over time. However, it can become invasive in some regions if not managed properly. Its introduction has had both positive ecological and potential negative impacts depending on the environment."
}
