{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mutabilis subsp. stipulifera",
    "plant_slug": "acacia-mutabilis-subsp-stipulifera",
    "plant_name_scientific": "acacia mutabilis subsp. stipulifera",
    "intro": "Acacia mutabilis subsp. stipulifera, commonly known as the variable acacia, is a shrub or small tree native to southeastern Australia. It is characterized by its bipinnate leaves, which are composed of multiple pairs of small, oval leaflets. The plant produces yellow to golden-orange flowers in dense, globular clusters, typically blooming in spring. It thrives in well-drained soils and is often found in coastal and inland regions. This subspecies is valued for its ornamental appeal and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mutabilis"
    },
    "taxonomy_art_desc": "Acacia mutabilis subsp. stipulifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias, characterized by their primitive floral structures. Its order is Fabales, which consists of flowering plants that include legumes and beans, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acicular leaves and often being used in traditional medicine and for timber. Its species is Acacia mutabilis, a specific type of acacia that is further divided into subspecies, with subsp. stipulifera being one of its recognized varieties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mutabilis subsp. stipulifera is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This subspecies thrives in dry, sandy soils and is often associated with coastal and inland areas. It is an important component of the local flora in these regions. The plant is well adapted to the arid and semi-arid climates of its native habitat.",
    "distribution_introduced_art_desc": "Acacia mutabilis subsp. stipulifera was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation and land rehabilitation projects due to its hardy nature and ability to thrive in poor soil conditions. This subspecies is also valued for its nitrogen-fixing properties, which enhance soil fertility. Its introduction has been particularly beneficial in areas affected by desertification. However, it requires careful management to prevent potential ecological imbalances in native ecosystems."
}
