{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hayesii",
    "plant_slug": "acacia-hayesii",
    "plant_name_scientific": "acacia hayesii",
    "intro": "Acacia hayesii, commonly known as the Hayes acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, compound leaves that are adapted to conserve water. The plant produces yellow flowers in compact spikes, which attract pollinators such as bees and birds. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its survival in harsh environments. Acacia hayesii is often used in traditional medicine and has ecological importance in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hayesii is primarily native to the southwestern United States and northern Mexico. It is commonly found in arid and semi-arid regions, particularly in areas with well-drained soils. This species thrives in desert environments and is often associated with rocky or sandy soils. It is especially prevalent in states such as Arizona, New Mexico, and parts of Texas. Acacia hayesii is adapted to withstand extreme temperatures and low precipitation, making it a resilient plant in its native habitat.",
    "distribution_introduced_art_desc": "Acacia hayesii was mainly introduced to areas with well-drained soils and moderate to high sunlight exposure. It thrives in regions with a warm, dry climate and is often found in coastal and inland dunes. This plant is commonly used for erosion control due to its extensive root system and rapid growth rate. It has been introduced to several parts of the United States, including California and Texas, as part of restoration and landscaping efforts. However, its invasive potential in certain ecosystems remains a concern for local biodiversity."
}
