{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia seyal",
    "plant_slug": "acacia-seyal",
    "plant_name_scientific": "acacia seyal",
    "intro": "Acacia seyal, commonly known as the desert thorn or Sahel acacia, is a shrub or small tree native to the dry regions of Africa. It is characterized by its long, straight thorns and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers followed by flat, pod-like fruits containing seeds. It is well adapted to arid environments, with deep roots that allow it to access groundwater. Acacia seyal plays an important role in stabilizing soils and providing habitat for various desert animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Poaceae",
        "genus": "Echinochloa",
        "species": "Echinochloa rotundiflora"
    },
    "taxonomy_art_desc": "Acacia seyal belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Poales, which is a large group of flowering plants that includes grasses and related families. Its family is Poaceae, commonly known as the grass family, which includes plants like wheat, rice, and bamboo. Its genus is Echinochloa, a group of grasses commonly found in tropical and subtropical regions, often as weeds. Its species is Echinochloa rotundiflora, a specific type of grass known for its round, fluffy flower heads and its common occurrence in disturbed soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cameroon",
        "Eritrea",
        "Ethiopia",
        "Nigeria",
        "Sudan-South Sudan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia seyal is primarily native to Cameroon, Eritrea, Ethiopia, Nigeria, Sudan-South Sudan. It is commonly found in arid and semi-arid regions across these countries. This plant thrives in savannas, woodlands, and dry forests where it plays an important ecological role. It is well adapted to the harsh environmental conditions of its native range. Acacia seyal is also known for its ability to fix nitrogen, contributing to soil fertility in its habitat.",
    "distribution_introduced_art_desc": "Acacia seyal was mainly introduced to areas with semi-arid to arid climates, particularly in regions of Africa, the Middle East, and parts of India. It is commonly found in countries such as Sudan, Kenya, Somalia, and Saudi Arabia. This plant thrives in sandy or rocky soils and is often used for its hardy nature and ability to withstand drought conditions. It has been introduced for purposes such as soil stabilization, firewood, and as a source of gum arabic. However, its invasive potential in some regions has raised concerns about its ecological impact."
}
