{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sclerosperma subsp. glaucescens",
    "plant_slug": "acacia-sclerosperma-subsp-glaucescens",
    "plant_name_scientific": "acacia sclerosperma subsp. glaucescens",
    "intro": "Acacia sclerosperma subsp. glaucescens, commonly known as the grey acacia, is a shrub or small tree native to southern Africa. It is characterized by its grey-green foliage and slender, often spiny branches. The plant produces small, yellow flowers arranged in dense, globular heads, which are typical of the Acacia genus. Its seed pods are woody and contain several seeds, which are dispersed by wind. This species is adapted to arid and semi-arid environments, making it a resilient component of local ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sclerosperma"
    },
    "taxonomy_art_desc": "Acacia sclerosperma subsp. glaucescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants with a common ancestor and includes legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are widespread in tropical and subtropical regions. Its species is Acacia sclerosperma, a specific type of acacia that includes the subspecies glaucescens, which is distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sclerosperma subsp. glaucescens is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This subspecies thrives in arid and semi-arid environments, often growing in sandy soils. It is typically found in open woodlands and shrublands. Its distribution is closely associated with the coastal and interior areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia sclerosperma subsp. glaucescens was mainly introduced to South Africa, particularly in the Western Cape region. It has been widely planted for its ornamental value and ability to thrive in arid conditions. The subspecies is known for its distinctive blue-green foliage and showy yellow flowers. It is commonly found in gardens and along roadsides, contributing to local biodiversity. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
