{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptoclada var. polyphylla",
    "plant_slug": "acacia-leptoclada-var-polyphylla",
    "plant_name_scientific": "acacia leptoclada var. polyphylla",
    "intro": "Acacia leptoclada var. polyphylla, commonly known as the slender acacia, is a shrub native to the arid and semi-arid regions of southern Africa. It is characterized by its delicate, feathery foliage composed of small, narrow leaves that are often clustered at the ends of branches. The plant produces yellow flowers in spherical or cylindrical inflorescences, which bloom during the warmer months. It is adapted to survive in dry conditions, with deep roots that help it access groundwater. The species is also valued for its use in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptoclada var. polyphylla is primarily native to eastern Australia, specifically the coastal regions of New South Wales and southern Queensland. This variant is commonly found in sandy soils along the coastline, often in areas with a subtropical to temperate climate. It thrives in open woodlands and heathlands, where it contributes to the local biodiversity. The plant is well adapted to coastal conditions, including salt spray and sandy substrates. Its distribution is largely restricted to the southeastern part of the Australian continent.",
    "distribution_introduced_art_desc": "Acacia leptoclada var. polyphylla was mainly introduced to areas with sandy or loamy soils and a warm, dry climate, typically found in coastal regions. It thrives in full sun and is commonly found in disturbed sites such as roadsides, quarries, and abandoned fields. This plant is often used for soil stabilization due to its extensive root system and ability to tolerate poor soil conditions. It has been reported in several regions of Australia, including New South Wales and Queensland. However, its introduction has raised concerns about its potential to become invasive in native ecosystems."
}
