{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia setigera",
    "plant_slug": "acacia-setigera",
    "plant_name_scientific": "acacia setigera",
    "intro": "Acacia setigera, commonly known as the slender acacia, is a shrub or small tree native to Africa and the Arabian Peninsula. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow, globular flower heads that are clustered in dense inflorescences, typically blooming during the rainy season. Its seeds are enclosed in pod-like fruits that split open to release the seeds. Acacia setigera is well adapted to arid and semi-arid environments, making it a resilient species in dry regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia setigera is primarily native to the eastern and southern regions of Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in savannas, woodlands, and rocky areas, often found in regions with a tropical or subtropical climate. This plant is well adapted to dry and semi-arid environments, making it a common sight in these ecosystems. It plays an important role in local biodiversity and is sometimes used for its timber and medicinal properties. Acacia setigera is also found in parts of the Arabian Peninsula and the Indian subcontinent.",
    "distribution_introduced_art_desc": "Acacia setigera was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its hardy nature and potential for land rehabilitation. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to significant environmental concerns, including habitat loss and biodiversity decline. Efforts are now underway to control its spread and mitigate its impact on native flora."
}
