{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bracteata",
    "plant_slug": "acacia-bracteata",
    "plant_name_scientific": "acacia bracteata",
    "intro": "Acacia bracteata, commonly known as the bracted acacia, is a shrub or small tree native to Australia. It is characterized by its narrow, green, trifoliate leaves and distinctive yellow flowers that bloom in late winter to early spring. The plant produces elongated, flat seed pods that contain hard, angular seeds. It thrives in well-drained soils and is often found in coastal and inland regions. Acacia bracteata is valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bracteata is primarily native to northern Australia, including the Northern Territory, Western Australia, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant thrives in open woodlands and shrublands, often growing in association with other native flora. It is well adapted to the harsh environmental conditions of its native range. Acacia bracteata plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia bracteata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is known for its distinctive leaf structure and is often used in restoration projects due to its hardy nature. However, it can also become invasive in some ecosystems if not managed properly. Its introduction has had both ecological and economic impacts in the regions where it is established."
}
