{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia densa",
    "plant_slug": "acacia-densa",
    "plant_name_scientific": "acacia densa",
    "intro": "Acacia densa, commonly known as the dense acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage and yellow flowers that bloom in winter. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. It is well adapted to arid and semi-arid environments, making it a hardy species. Acacia densa is often used in landscaping due to its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia densa is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry conditions. This plant is well adapted to the harsh climate, with its dense foliage and deep root system allowing it to survive in nutrient-poor soils. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia densa is also sometimes cultivated for its ornamental value and as a source of timber.",
    "distribution_introduced_art_desc": "Acacia densa was mainly introduced to specific regions in Australia for its ornamental value and potential use in erosion control. It is commonly found in coastal areas and sandy soils where it thrives in full sun. The plant has been introduced to several states including New South Wales, Victoria, and South Australia. Due to its rapid growth and ability to spread through seed dispersal, it has become a potential weed in some areas. However, it is also valued for its hardy nature and ability to provide habitat for native wildlife."
}
