{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adnata",
    "plant_slug": "acacia-adnata",
    "plant_name_scientific": "acacia adnata",
    "intro": "Acacia adnata, commonly known as the ghost gum, is a small to medium-sized tree native to Australia. It is characterized by its slender, pale grey bark that peels in thin strips, giving it a distinctive appearance. The plant produces small, yellow, globular flowers that bloom in winter, followed by flat, ribbed pods. Its leaves are bipinnate, consisting of multiple pairs of small, feathery leaflets. Acacia adnata is adapted to arid environments and is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia adnata"
    },
    "taxonomy_art_desc": "Acacia adnata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and root system. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their showy flowers and diverse forms. Its order is Fabales, which consists of flowering plants that often have compound leaves and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive fruit type, the pod, and its role in nitrogen fixation. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive foliage and sometimes thorny structures. Its species is Acacia adnata, a specific type of acacia native to Australia, characterized by its slender, often thornless stems and small, yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adnata is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the southwest and south-western parts of the state. This plant thrives in dry, open habitats such as heathlands and coastal dunes. It is well adapted to the arid and semi-arid climates of its native range. Acacia adnata plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia adnata was mainly introduced to South Australia and Western Australia for its ornamental value and potential for soil stabilization. It is commonly found in coastal areas and sandy soils, thriving in dry and saline conditions. The plant has become naturalized in some regions, spreading through seed dispersal by wind and animals. Its rapid growth and adaptability have led to concerns about its impact on native vegetation. Despite its benefits, management strategies are needed to control its spread in sensitive ecosystems."
}
