{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia buxifolia subsp. buxifolia",
    "plant_slug": "acacia-buxifolia-subsp-buxifolia",
    "plant_name_scientific": "acacia buxifolia subsp. buxifolia",
    "intro": "Acacia buxifolia subsp. buxifolia, commonly known as the boxleaf acacia, is a shrub native to southern Africa. It is characterized by its dense, evergreen foliage with small, rounded leaves that resemble boxwood leaves. The plant produces yellow, globular flower heads that bloom in summer, attracting pollinators such as bees and birds. It thrives in well-drained soils and is drought-tolerant once established. Its compact growth habit makes it suitable for ornamental use in gardens and as a hedge.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia buxifolia"
    },
    "taxonomy_art_desc": "Acacia buxifolia subsp. buxifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and ferns, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia buxifolia, a specific type of acacia known for its compact growth and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia buxifolia subsp. buxifolia is primarily native to New South Wales, Queensland, and Victoria. This subspecies is commonly found in the eastern regions of Australia, particularly in areas with dry to semi-arid conditions. It thrives in sandy or loamy soils and is often seen in open woodlands and grasslands. The plant is well adapted to the local climate and plays a role in the ecological balance of its native habitat. Its distribution is largely confined to these specific states due to environmental and climatic factors.",
    "distribution_introduced_art_desc": "Acacia buxifolia subsp. buxifolia was mainly introduced to India. It is commonly found in the southern regions of the country, particularly in states like Tamil Nadu, Kerala, and parts of Karnataka. This species is often cultivated for its ornamental value due to its dense foliage and ability to thrive in a variety of soil types. It has been reported in urban and suburban areas, where it is used for landscaping and soil stabilization. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
