{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia martiusiana",
    "plant_slug": "acacia-martiusiana",
    "plant_name_scientific": "acacia martiusiana",
    "intro": "Acacia martiusiana, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and distinctive yellow flowers that bloom in spring. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen through symbiotic relationships with rhizobia bacteria. It thrives in well-drained soils and is often found in coastal and inland regions of southern Australia. The golden wattle is also the national floral emblem of Australia, symbolizing the country's natural beauty and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia martiusiana is primarily native to northern Australia, particularly the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions, growing in sandy soils and open woodlands. This species thrives in dry climates with low rainfall and is often associated with coastal areas. It is also found in parts of southern New Guinea. Acacia martiusiana plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia martiusiana was mainly introduced to stabilize soil and prevent erosion in areas with degraded land. It is commonly used in reforestation projects due to its fast growth and ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance, making it suitable for arid and semi-arid regions. Its introduction has helped in restoring ecological balance in several regions where native vegetation has been lost. However, it requires careful management to prevent it from becoming invasive in local ecosystems."
}
