{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decora var. macrophylla",
    "plant_slug": "acacia-decora-var-macrophylla",
    "plant_name_scientific": "acacia decora var. macrophylla",
    "intro": "Acacia decora var. macrophylla, commonly known as the large-leaf wattle, is a striking shrub or small tree native to Australia. It is characterized by its long, slender, feathery leaves that are typically larger than those of the typical acacia species. The plant produces yellow flowers in cylindrical spikes, which bloom in spring and attract a variety of pollinators. It thrives in well-drained soils and full sun, making it suitable for cultivation in warm climates. Due to its ornamental value, it is often used in gardens and landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decora var. macrophylla is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. This variant is commonly found in savanna and woodland habitats, often growing in well-drained soils. It thrives in regions with a tropical or subtropical climate and is adapted to seasonal rainfall patterns. The plant is known for its distinctive foliage and is sometimes used in traditional medicine. Its distribution is closely linked to areas with open vegetation and moderate to high sunlight exposure.",
    "distribution_introduced_art_desc": "Acacia decora var. macrophylla was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique appearance. It is commonly cultivated in regions with warm, temperate climates where it thrives in well-drained soils. This variety is often used in gardens and as a decorative plant in urban settings because of its hardy nature and low maintenance requirements. However, it has raised concerns in some areas due to its potential to become invasive if not properly managed. Its introduction has led to discussions about its ecological impact and suitability for native plant communities."
}
