{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catechu",
    "plant_slug": "acacia-catechu",
    "plant_name_scientific": "acacia catechu",
    "intro": "Acacia catechu, commonly known as Indian acacia or catechu, is a deciduous tree native to tropical regions of Asia. It belongs to the Fabaceae family and is characterized by its thorny stems and bipinnate leaves. The plant is renowned for producing a dark brown gum called catechu, which is harvested from its bark. Acacia catechu thrives in well-drained soils and is often found in dry, open woodlands. Its flowers are yellow and fragrant, attracting various pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catechu is primarily native to tropical and subtropical regions of Asia, including India, Sri Lanka, Myanmar, Thailand, and parts of Southeast Asia. It thrives in dry, semi-arid climates and is commonly found in open woodlands and scrublands. This species is also present in some regions of Africa, such as Kenya and Tanzania, where it adapts to similar environmental conditions. Acacia catechu is known for its hard, heavy wood and has been historically used for tanning and as a source of gum. Its native distribution reflects its ability to flourish in areas with well-drained soils and moderate rainfall.",
    "distribution_introduced_art_desc": "Acacia catechu was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Southeast Asia, including India, Thailand, and Indonesia. The plant is often cultivated for its hard, dense wood and its use in traditional medicine. It has also been introduced to parts of Africa and the Americas for similar reasons. Its distribution is largely influenced by human activity and its adaptability to different environmental conditions."
}
