{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia saliciformis",
    "plant_slug": "acacia-saliciformis",
    "plant_name_scientific": "acacia saliciformis",
    "intro": "Acacia saliciformis, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often pendulous branches and small, fern-like leaves. The plant produces yellow flowers in globular clusters, which are highly attractive to bees and other pollinators. Its bark is smooth and grayish, and it is sometimes used in traditional medicine. Acacia saliciformis is adapted to arid and semi-arid environments, making it a resilient species in dry climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia saliciformis"
    },
    "taxonomy_art_desc": "Acacia saliciformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or bean family, which is recognized for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their thorn-like stems and flower clusters. Its species is Acacia saliciformis, a specific type of acacia native to certain regions of Africa, characterized by its willow-like appearance and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia saliciformis is primarily native to New South Wales. It is commonly found in the coastal and inland regions of the state. This plant thrives in a variety of soil types but prefers well-drained soils. It is often seen in open forests, woodlands, and along riverbanks. Its distribution is largely restricted to the eastern parts of New South Wales.",
    "distribution_introduced_art_desc": "Acacia saliciformis was mainly introduced to control soil erosion and for its ornamental value in landscaping. It is commonly found in disturbed areas such as roadsides, clearings, and degraded soils. The plant thrives in tropical and subtropical climates, making it suitable for regions with high rainfall. Its rapid growth and ability to fix nitrogen make it a useful species for land rehabilitation. However, it can become invasive in some areas if not managed properly."
}
