{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leprosa var. tenuifolia",
    "plant_slug": "acacia-leprosa-var-tenuifolia",
    "plant_name_scientific": "acacia leprosa var. tenuifolia",
    "intro": "Acacia leprosa var. tenuifolia, commonly known as the slender-leaved wattle, is a shrub native to southern Australia. It is characterized by its slender, linear leaves that are often covered in fine, silky hairs. The plant produces yellow, globular flowers that appear in late winter to early spring. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Due to its ornamental value and drought tolerance, it is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leprosa var. tenuifolia is primarily native to the arid and semi-arid regions of southwestern Australia. It is commonly found in the states of Western Australia and South Australia. This variety thrives in sandy soils and is often associated with coastal and inland dunes. It is adapted to withstand drought and high temperatures. The plant plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia leprosa var. tenuifolia was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and hardy nature. It is commonly found in coastal and inland regions, particularly in the Western Cape and Eastern Cape provinces. The plant thrives in well-drained soils and is often used in garden landscapes and for erosion control. Its introduction has led to its naturalization in certain areas, raising concerns about its potential invasiveness. Despite its ornamental value, it is important to monitor its spread to prevent ecological disruption."
}
