{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cuernavacana",
    "plant_slug": "acacia-cuernavacana",
    "plant_name_scientific": "acacia cuernavacana",
    "intro": "Acacia cuernavacana, commonly known as the Cuernavaca acacia, is a species of flowering plant native to central Mexico. It belongs to the Fabaceae family, characterized by its pod fruits and often nitrogen-fixing capabilities. The plant is notable for its slender, often branched stems and bipinnate leaves that are covered in fine hairs. Its yellow flowers are arranged in cylindrical spikes, adding ornamental value to the landscape. Acacia cuernavacana is adapted to dry climates and is often found in rocky or disturbed soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cuernavacana is primarily native to Mexico, specifically the state of Michoacán. It is commonly found in the Sierra Madre de Oaxaca and the Trans-Mexican Volcanic Belt. This species thrives in dry, rocky soils and is often associated with open woodlands and scrub habitats. It is also present in parts of southern Texas, USA. Due to its limited range, it is considered a rare and endemic plant in its native region.",
    "distribution_introduced_art_desc": "Acacia cuernavacana was mainly introduced to areas with warm, dry climates and well-drained soils, typically in regions with seasonal rainfall. It is commonly found in disturbed sites such as roadsides, abandoned fields, and degraded landscapes. This plant thrives in full sun and is often used for soil stabilization due to its deep root system. It has also been introduced as an ornamental plant in some parts of the world. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
