{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gonocarpa",
    "plant_slug": "acacia-gonocarpa",
    "plant_name_scientific": "acacia gonocarpa",
    "intro": "Acacia gonocarpa, commonly known as the African wattle, is a flowering plant native to sub-Saharan Africa. It is a shrub or small tree that can grow up to 5 meters in height, characterized by its compound leaves and yellow flowers. The plant produces woody pods that contain seeds, which are dispersed by wind. It thrives in dry, sandy soils and is adapted to arid and semi-arid environments. Acacia gonocarpa is also known for its ability to fix nitrogen, making it valuable in soil enrichment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gonocarpa"
    },
    "taxonomy_art_desc": "Acacia gonocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissue. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive characteristics and spore reproduction. Its subclass is Magnoliidae, which consists of flowering plants with a wide range of morphological diversity and includes many economically important species. Its order is Fabales, a group of flowering plants that includes legumes and is known for its ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as ornamental plants. Its species is Acacia gonocarpa, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gonocarpa is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant typically grows in sandy or rocky soils and is well adapted to the harsh climate of the region. It is often seen in open woodlands and shrublands. Its distribution is closely linked to the environmental conditions of the northern Australian landscape.",
    "distribution_introduced_art_desc": "Acacia gonocarpa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western Cape and KwaZulu-Natal provinces. The plant thrives in sandy or gravelly soils and is often found in disturbed habitats such as roadsides and abandoned farmland. It is valued for its hardy nature and ability to withstand drought conditions. However, it is also considered an invasive species in some areas, outcompeting native vegetation."
}
