{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens var. mollis",
    "plant_slug": "acacia-decurrens-var-mollis",
    "plant_name_scientific": "acacia decurrens var. mollis",
    "intro": "Acacia decurrens var. mollis, commonly known as soft-leaf wattle, is a shrub native to Australia. It is characterized by its slender, glabrous or softly hairy stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellow globular inflorescences, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, open habitats. This variety is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens var. mollis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variety thrives in sandy soils and is commonly found in savannas and grasslands. It is well adapted to the harsh climate with its ability to withstand drought conditions. The plant is often used as a source of firewood and for its nitrogen-fixing properties that enrich the soil. Its distribution is closely linked to the ecological zones characterized by low rainfall and high temperatures.",
    "distribution_introduced_art_desc": "Acacia decurrens var. mollis was mainly introduced to areas with sandy or loamy soils and a warm, arid climate. It is commonly found in regions such as parts of Australia, South Africa, and the southwestern United States. This plant is often used for erosion control due to its extensive root system and drought tolerance. It has also been introduced as an ornamental plant because of its attractive foliage and ability to thrive in harsh conditions. However, in some regions, it has become invasive, outcompeting native vegetation."
}
