{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia colletioides",
    "plant_slug": "acacia-colletioides",
    "plant_name_scientific": "acacia colletioides",
    "intro": "Acacia colletioides, commonly known as the sweet acacia, is a shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant produces long, flat pods that contain seeds surrounded by a fibrous pulp. It thrives in well-drained soils and is often found in dry, sunny environments. Acacia colletioides is also valued for its role in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia colletioides"
    },
    "taxonomy_art_desc": "Acacia colletioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, many of which are native to Australia. Its species is Acacia colletioides, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia colletioides is primarily native to New South Wales, South Australia, Victoria, and Western Australia. This species is commonly found in a variety of habitats within these regions, including dry forests, woodlands, and sandy soils. It is well adapted to the arid and semi-arid conditions of the Australian landscape. The plant is known for its distinctive yellow flowers and is often used in landscaping due to its ornamental value. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia colletioides was mainly introduced to control soil erosion and for land stabilization in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and rapid growth rate. However, its introduction has led to concerns about its potential to become invasive in certain ecosystems. It is often planted as a windbreak or for afforestation purposes in areas with limited vegetation."
}
