{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia origena",
    "plant_slug": "acacia-origena",
    "plant_name_scientific": "acacia origena",
    "intro": "Acacia origena, commonly known as the African silver acacia, is a species of flowering plant in the legume family. It is native to regions of Africa, including countries like Kenya and Tanzania. The plant is characterized by its slender, often branching stems and small, bipinnate leaves. Its yellow flowers are clustered in cylindrical inflorescences, and it produces small, woody pods that contain seeds. Acacia origena is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia origena is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in dry, semi-arid regions and is commonly found in savannas and woodlands. The plant is well adapted to the local climate and soil conditions, often growing along riverbanks and in rocky areas. It plays an important ecological role by providing food and shelter for various wildlife species. Due to its hardy nature, it is also sometimes cultivated in regions with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acacia origena was mainly introduced to areas with warm, dry climates and well-drained soils, typically found in regions such as parts of Africa, the Middle East, and Australia. It is commonly found in disturbed sites, including roadsides, abandoned fields, and along riverbanks. This plant thrives in full sun and is often used for soil stabilization due to its extensive root system. It is also valued for its ability to fix nitrogen, making it useful in reforestation efforts. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
