{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia phlebocarpa",
    "plant_slug": "acacia-phlebocarpa",
    "plant_name_scientific": "acacia phlebocarpa",
    "intro": "Acacia phlebocarpa, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and its distinctive, flat, feathery leaves. The plant produces yellow flowers in globular clusters, which are typically followed by long, slender pods. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia phlebocarpa is also known for its ability to fix nitrogen, making it valuable in soil rehabilitation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia phlebocarpa"
    },
    "taxonomy_art_desc": "Acacia phlebocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some ferns. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and legume fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive flattened or thorned stems and globular or cylindrical seed pods. Its species is Acacia phlebocarpa, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia phlebocarpa is primarily native to Northern Territory, Queensland, and Western Australia. This species is commonly found in the arid and semi-arid regions of these areas. It thrives in sandy soils and is often seen in shrublands and woodland communities. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia phlebocarpa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy soils. The plant is known for its ability to tolerate drought and poor soil conditions, which contributes to its spread. It is often used for erosion control due to its deep root system. However, its invasive nature has raised concerns in some areas where it competes with native vegetation."
}
