{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia microcalyx",
    "plant_slug": "acacia-microcalyx",
    "plant_name_scientific": "acacia microcalyx",
    "intro": "Acacia microcalyx, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellow flowers arranged in racemes, which attract pollinators such as bees and birds. Its leaves are narrow and often have a slightly hairy texture, adapting to arid environments. Acacia microcalyx is known for its hardy nature and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia microcalyx"
    },
    "taxonomy_art_desc": "Acacia microcalyx belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants that are often legumes and are known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pods as fruits and often having nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their unique foliage and often used in various ecological and economic contexts. Its species is Acacia microcalyx, a specific type of acacia that is distinguished by its small calyx and is typically found in specific habitats within its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia microcalyx is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid zones. This species thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important ecological role in its native habitat. The plant is well adapted to the dry climate and can tolerate periods of drought.",
    "distribution_introduced_art_desc": "Acacia microcalyx was mainly introduced to areas with a warm, dry climate and well-drained soils, typically found in regions of Australia and parts of Southeast Asia. It is commonly found in coastal dunes, sandy soils, and disturbed sites where it can establish quickly. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has sometimes led to ecological concerns due to its aggressive growth habit. It is important to manage its spread to prevent it from becoming invasive in non-native environments."
}
