{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia visco",
    "plant_slug": "acacia-visco",
    "plant_name_scientific": "acacia visco",
    "intro": "Acacia visco, commonly known as the sticky acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, thorny branches and small, yellowish-green flowers that appear in spikes. The plant produces flat, bean-like pods that contain edible seeds, which are often used in traditional cuisines. Its leaves are compound, consisting of multiple small leaflets, and the plant is well adapted to arid and semi-arid environments. Acacia visco is also known for its sticky resin, which has been used historically for various purposes, including as a natural adhesive.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia visco is primarily native to South Africa, specifically the eastern and southern regions. It is commonly found in the coastal areas and mountainous regions of the country. This plant thrives in a variety of habitats, including sandy soils and rocky outcrops. It is well adapted to the Mediterranean climate of the region, with dry summers and wet winters. Acacia visco is an important component of the local flora and plays a role in supporting local wildlife.",
    "distribution_introduced_art_desc": "Acacia visco was mainly introduced to South Africa, where it has become an invasive species. It was originally from Australia and was brought to South Africa for ornamental purposes. The plant thrives in a variety of soil types and is highly adaptable, leading to its rapid spread. It competes with native vegetation and can alter local ecosystems. Due to its invasive nature, it is now considered a significant environmental threat in many areas of South Africa."
}
