{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lathouwersii",
    "plant_slug": "acacia-lathouwersii",
    "plant_name_scientific": "acacia lathouwersii",
    "intro": "Acacia lathouwersii, commonly known as the Lathouwers' acacia, is a flowering plant native to South Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant typically grows in coastal areas and is adapted to sandy soils and saline conditions. Its small, yellow flowers are clustered in spherical inflorescences, and it is often used in coastal stabilization due to its hardy nature. Acacia lathouwersii is also valued for its ornamental appeal and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lathouwersii is primarily native to the coastal areas of southern Africa, particularly in countries such as South Africa, Namibia, and Angola. It thrives in sandy or rocky soils along the shoreline, often in regions with a Mediterranean climate characterized by dry summers and wet winters. This species is commonly found in dune environments and is well adapted to coastal conditions, including salt spray and strong winds. It plays an important ecological role in stabilizing dunes and providing habitat for local wildlife. Due to its restricted range, it is considered a rare and endemic plant in its native habitat.",
    "distribution_introduced_art_desc": "Acacia lathouwersii was mainly introduced to South Africa, particularly in the Western Cape region. It was introduced as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. The distribution of this species has expanded beyond its original introduction area, with sightings in nearby provinces such as the Northern Cape and Western Cape. It is commonly found in gardens and along roadsides where it serves as a hardy, drought-resistant plant. However, its spread has raised concerns about its potential impact on native vegetation in certain areas."
}
