{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amazonica",
    "plant_slug": "acacia-amazonica",
    "plant_name_scientific": "acacia amazonica",
    "intro": "Acacia amazonica, commonly known as the Amazon acacia, is a flowering plant native to the rainforests of South America. It is characterized by its slender, woody stems and bipinnate leaves that are often covered in fine hairs. The plant produces small, yellowish-green flowers that are clustered in globular inflorescences. Acacia amazonica is adapted to thrive in humid, tropical climates with high rainfall. Its ecological role includes providing food and shelter for various wildlife species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amazonica is primarily native to the Amazon Basin, specifically in the tropical rainforests of South America. It is found in countries such as Brazil, Peru, Colombia, and Venezuela. This plant thrives in humid, lowland environments with rich soil and high rainfall. It is commonly found in secondary growth areas and along riverbanks. Acacia amazonica plays an important ecological role in its native habitat by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia amazonica was mainly introduced to the tropical regions of South America, particularly in Brazil, for its ornamental value and potential for soil stabilization. It has been widely planted in urban landscapes and along riverbanks due to its fast growth and ability to thrive in various soil conditions. However, its introduction has raised concerns about its invasive potential, as it can outcompete native species and alter local ecosystems. Despite its benefits, management strategies are being developed to control its spread and mitigate ecological impacts. The plant's distribution highlights the balance between ecological risks and human benefits in introduced species."
}
