{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia buxifolia var. subvelutina",
    "plant_slug": "acacia-buxifolia-var-subvelutina",
    "plant_name_scientific": "acacia buxifolia var. subvelutina",
    "intro": "Acacia buxifolia var. subvelutina, commonly known as the velvet acacia, is a shrub native to southern Africa. It is characterized by its dense, leathery foliage and small, yellow, globular flowers that appear in clusters. The leaves are typically elliptical and have a soft, velvety texture, giving the plant its common name. It thrives in well-drained soils and is often found in rocky or coastal areas. This plant is valued for its ornamental appeal and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia buxifolia var. subvelutina is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often growing in shrubland and savanna ecosystems. This variety is adapted to withstand drought and high temperatures, making it a resilient species in its native habitat. It plays an important ecological role by providing food and shelter for various wildlife species. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acacia buxifolia var. subvelutina was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It was first recorded in the 1960s and has since spread throughout the country, particularly in regions with a temperate climate. Although it is not considered invasive, it has established itself in natural and urban environments, raising concerns about its potential impact on native ecosystems. The plant is often found in coastal areas and on disturbed sites, where it can outcompete native vegetation. Its introduction highlights the importance of monitoring non-native species for ecological impacts."
}
