{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chrysopoda",
    "plant_slug": "acacia-chrysopoda",
    "plant_name_scientific": "acacia chrysopoda",
    "intro": "Acacia chrysopoda, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, yellow-green foliage and produces small, yellow flowers in late summer. The plant is part of the legume family, Fabaceae, and has a deep root system that helps prevent soil erosion. It thrives in well-drained soils and is often found in coastal and sandy areas. The golden wattle is also the national floral emblem of Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chrysopoda"
    },
    "taxonomy_art_desc": "Acacia chrysopoda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive flattened or cylindrical seed pods and often sharp thorns. Its species is Acacia chrysopoda, a specific type of acacia found in certain regions, known for its yellow flowers and ecological importance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chrysopoda is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species thrives in coastal and heathland environments. It is often seen growing in open woodlands and shrublands. Its distribution is largely restricted to the coastal areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia chrysopoda was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides where it establishes quickly. The plant is valued for its hardy nature and ability to thrive in poor soil conditions. However, its introduction has sometimes led to the displacement of native vegetation in certain areas. Due to its invasive potential, it is often managed carefully in ecological restoration projects."
}
