{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acapulcensis",
    "plant_slug": "acacia-acapulcensis",
    "plant_name_scientific": "acacia acapulcensis",
    "intro": "Acacia acapulcensis, commonly known as the Mexican acacia, is a shrub or small tree native to Mexico. It is characterized by its compound leaves, which are typically bipinnate, and its yellow, spherical flower heads. The plant produces long, slender pods that contain seeds covered in a fibrous mesh. It thrives in arid and semi-arid environments, making it well adapted to dry climates. Acacia acapulcensis is often used in traditional medicine and is valued for its ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acapulcensis is primarily native to the highlands of central Mexico, specifically in the states of Hidalgo, Puebla, and Veracruz. It thrives in temperate to subtropical climates and is commonly found in forested areas and along stream banks. This species is adapted to well-drained soils and is often part of the understory vegetation in montane forests. Acacia acapulcensis is also known to grow in rocky or limestone-rich regions. Its distribution is limited to these specific ecological zones within Mexico.",
    "distribution_introduced_art_desc": "Acacia acapulcensis was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions with low rainfall. It thrives in environments where it can receive full sun exposure and has minimal competition from other vegetation. This plant is often found in disturbed soils, such as along roadsides or in degraded habitats. Its introduction has been associated with human activities, including land clearing and agricultural expansion. Due to its adaptability, it has become an invasive species in some regions outside its native range."
}
