{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia neovernicosa",
    "plant_slug": "acacia-neovernicosa",
    "plant_name_scientific": "acacia neovernicosa",
    "intro": "Acacia neovernicosa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, leathery leaves and yellow flowers that bloom in spring. The plant is part of the Fabaceae family, which includes legumes, and it has a symbiotic relationship with nitrogen-fixing bacteria. Acacia neovernicosa is adapted to arid and semi-arid environments, making it resilient to drought. It is often used in ecological restoration projects due to its ability to stabilize soil and provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia neovernicosa is primarily native to northern Australia, including regions of Queensland and the Northern Territory. It thrives in arid and semi-arid environments, often found in rocky soils and open woodlands. This species is well adapted to the harsh climate of the continent, with its ability to withstand drought and high temperatures. It plays an important ecological role in its native habitat by providing shelter and food for various wildlife species. The plant is also known for its distinctive, flat, feathery foliage and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia neovernicosa was mainly introduced to control soil erosion and for its hardy nature in arid environments. It is commonly found in regions with low rainfall and poor soil quality. This plant has been introduced to several parts of Africa, including Kenya and Tanzania. It is valued for its ability to thrive in harsh conditions and provide shade. However, its spread can sometimes lead to competition with native plant species."
}
