{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia willingii",
    "plant_slug": "acacia-willingii",
    "plant_name_scientific": "acacia willingii",
    "intro": "Acacia willingii, commonly known as the black wattle, is a flowering plant native to Australia. It is characterized by its slender, zigzagging stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellow globular flowers that bloom in summer, followed by long, flat pods containing seeds. It is a member of the Fabaceae family, which includes many legumes, and is known for its ability to fix nitrogen in the soil. Acacia willingii is also valued for its hard, heavy wood, which has been historically used in construction and furniture-making.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia willingii"
    },
    "taxonomy_art_desc": "Acacia willingii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Fabales, which consists of flowering plants that are often legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their unique foliage and often used in ecological and commercial contexts. Its species is Acacia willingii, a specific type of acacia native to Australia, recognized for its ecological importance and distinctive morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia willingii is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the south-western part of the state. This species thrives in dry, well-drained environments and is often associated with coastal dunes and heathlands. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. Acacia willingii is a hardy shrub that is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia willingii was mainly introduced to regions with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in coastal areas and sandy soils, often forming dense thickets. This plant is particularly adapted to withstand high temperatures and low rainfall. Its introduction has sometimes led to ecological concerns due to its rapid growth and potential for invasive spread. It is widely used for soil stabilization and as a source of timber and fuel."
}
