{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adenanthera",
    "plant_slug": "acacia-adenanthera",
    "plant_name_scientific": "acacia adenanthera",
    "intro": "Acacia adenanthera, commonly known as the flame acacia, is a leguminous shrub or small tree native to Africa and parts of the Middle East. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves that are deciduous during dry seasons. The plant produces yellow to orange globular flowers, which are clustered in dense, spherical inflorescences. Its seeds are encased in hard, woody pods and are often used in traditional medicine and as a source of tannins. Acacia adenanthera is also valued for its role in soil stabilization and as a source of fodder for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adenanthera is primarily native to Brazil Northeast. It is found in the northeastern region of Brazil, particularly in the states of Bahia, Piauí, and Ceará. This species thrives in dry, tropical, and semi-arid environments. It is commonly found in savannas and dry forests. The plant is well adapted to the local climate and soil conditions of the region.",
    "distribution_introduced_art_desc": "Acacia adenanthera was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate to high rainfall. It is commonly found in parts of Australia, India, and Southeast Asia, where it has been cultivated for its hardy nature and utility. The plant is often used for soil stabilization, as a source of timber, and for its nitrogen-fixing properties that improve soil fertility. Its introduction has sometimes led to ecological concerns due to its aggressive growth and potential to become invasive in certain environments. Despite these challenges, it remains an important species in agroforestry and land rehabilitation projects."
}
