{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tenuior",
    "plant_slug": "acacia-tenuior",
    "plant_name_scientific": "acacia tenuior",
    "intro": "Acacia tenuior, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its slender, wiry branches and phyllodes that are narrow and often curved. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It is well adapted to arid and semi-arid environments, showing drought tolerance. The leaves are usually reduced to phyllodes, which help minimize water loss and are a key botanical feature of the species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tenuior"
    },
    "taxonomy_art_desc": "Acacia tenuior belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and the production of legume-like pods. Its species is Acacia tenuior, a specific type of acacia known for its slender, delicate appearance and typically found in arid or semi-arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tenuior is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy or loamy soils and is often seen in open woodlands and scrublands. It is well adapted to the harsh climate of the region, with its small, waxy leaves helping to reduce water loss. Acacia tenuior plays an important ecological role in supporting local wildlife and stabilizing soil in its native habitat.",
    "distribution_introduced_art_desc": "Acacia tenuior was mainly introduced to areas with a Mediterranean climate, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is often found in coastal regions and open woodlands. This plant is commonly used for erosion control due to its extensive root system and ability to withstand drought. It has also been introduced as an ornamental plant in gardens and parks for its attractive foliage and yellow flowers. However, in some regions, it has become invasive, outcompeting native vegetation."
}
