{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia moirii subsp. moirii",
    "plant_slug": "acacia-moirii-subsp-moirii",
    "plant_name_scientific": "acacia moirii subsp. moirii",
    "intro": "Acacia moirii subsp. moirii, commonly known as the Moir's acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often multi-stemmed form and its distinctive, feathery, bipinnate leaves. The plant produces yellow globular flowers that appear in spring, followed by flat, pod-like fruits containing several seeds. It is adapted to dry environments and is often found in rocky soils. Acacia moirii subsp. moirii is valued for its ornamental appeal and is sometimes cultivated in gardens in suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia moirii"
    },
    "taxonomy_art_desc": "Acacia moirii subsp. moirii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which comprises plants with distinctive flowers and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic phyllodes and often used in traditional medicine and as sources of timber. Its species is Acacia moirii, a specific variety within the Acacia genus, native to Australia and known for its ecological and ornamental significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia moirii subsp. moirii is primarily native to Western Australia. It is found in the southern and western regions of the state, including the Mid-West and Goldfields-Eureka regions. This subspecies typically grows in sandy soils and is commonly found in open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native range. The plant is part of the larger Acacia genus, which is widespread across Australia.",
    "distribution_introduced_art_desc": "Acacia moirii subsp. moirii was mainly introduced to urban and suburban areas in South Australia for its ornamental value and ability to thrive in dry conditions. It is commonly found along roadsides, in gardens, and on degraded land where it can establish quickly. The plant is well adapted to arid environments and can tolerate poor soil conditions, making it a popular choice for landscaping. However, its rapid growth and potential for spreading have raised concerns about its impact on native vegetation. Despite its benefits, its introduction has led to discussions about its ecological implications in the region."
}
