{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scalena",
    "plant_slug": "acacia-scalena",
    "plant_name_scientific": "acacia scalena",
    "intro": "Acacia scalena, commonly known as the slender acacia, is a flowering plant native to southern Africa. It is a small shrub that typically grows in dry, rocky habitats. The plant features small, bipinnate leaves and produces yellow, spherical flower heads. Its woody pods contain seeds that are dispersed by wind. Acacia scalena is valued for its hardy nature and is often used in landscaping in arid regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia scalena"
    },
    "taxonomy_art_desc": "Acacia scalena belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their primitive vascular structures and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with pea-like shapes and include legumes. Its family is Fabaceae, commonly known as the legume family, characterized by the distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive umbrella-like acacia flowers and often used in traditional medicine. Its species is Acacia scalena, a specific type of acacia found in certain regions, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scalena is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid zones. This plant thrives in sandy soils and is often seen in coastal areas and inland plains. It is well adapted to the harsh climate of the region. Acacia scalena plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia scalena was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in various soil conditions. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant is particularly invasive in disturbed sites such as roadsides and forest edges. Its rapid growth and seed dispersal through wind and animals contribute to its spread. Management efforts are ongoing to control its proliferation and prevent further ecological impact."
}
