{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tingoorensis",
    "plant_slug": "acacia-tingoorensis",
    "plant_name_scientific": "acacia tingoorensis",
    "intro": "Acacia tingoorensis, commonly known as the Tingoorensis wattle, is a shrub native to eastern Australia. It belongs to the Fabaceae family and is characterized by its feathery, bipinnate leaves and yellow floral spikes. The plant produces small, pod-like fruits that contain seeds dispersed by wind. It thrives in well-drained soils and is often found in open woodlands and heathlands. Acacia tingoorensis is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tingoorensis"
    },
    "taxonomy_art_desc": "Acacia tingoorensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with complex flower structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acacia-like flowers and often used in traditional medicine. Its species is Acacia tingoorensis, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tingoorensis is primarily native to Queensland. It is found in the tropical and subtropical regions of the state, particularly in areas with sandy or rocky soils. This plant typically grows in open woodlands and coastal areas. It is well adapted to the dry and hot climate of Queensland. Its distribution is limited to specific ecological zones within the region.",
    "distribution_introduced_art_desc": "Acacia tingoorensis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It also serves as a valuable source of food and shelter for local wildlife. However, its introduction has raised concerns about its potential to invade native ecosystems if not managed properly."
}
