{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verticillata var. robusta",
    "plant_slug": "acacia-verticillata-var-robusta",
    "plant_name_scientific": "acacia verticillata var. robusta",
    "intro": "Acacia verticillata var. robusta, commonly known as the robust acacia, is a shrub or small tree native to southern Australia. It is characterized by its dense, spreading crown and feathery, bipinnate leaves that are often covered in a fine, white powder. The plant produces yellow, globular flowers in late winter to early spring, which are followed by flat, pod-like fruits. It is drought-tolerant and thrives in well-drained soils, making it suitable for coastal and sandy environments. This variety is valued for its ornamental appeal and ability to provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verticillata var. robusta is primarily native to northern Australia, including the Northern Territory, Western Australia, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This variety is well adapted to harsh environmental conditions, such as high temperatures and low rainfall. It often grows in open woodlands and shrublands, forming dense thickets. The plant is an important component of the local flora and provides habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia verticillata var. robusta was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and parts of the Western Cape provinces. This plant thrives in sandy or gravelly soils and is often seen in coastal areas and near human settlements. Its introduction has led to its spread along roadsides and in disturbed habitats. Due to its hardiness and adaptability, it has become a common sight in many parts of the country."
}
