{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sphacelata subsp. verticillata",
    "plant_slug": "acacia-sphacelata-subsp-verticillata",
    "plant_name_scientific": "acacia sphacelata subsp. verticillata",
    "intro": "Acacia sphacelata subsp. verticillata, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, often zigzagging stems and small, trifoliate leaves that are arranged in whorls of three. The plant produces yellow, globular flower heads that bloom in spring, attracting nectar-feeding birds and insects. It thrives in well-drained soils and is adapted to dry, sunny environments. This subspecies is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sphacelata"
    },
    "taxonomy_art_desc": "Acacia sphacelata subsp. verticillata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of plants that includes horsetails and ferns, known for their primitive structures and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly known as wattles, characterized by their phyllodes and often used in landscaping and traditional medicine. Its species is Acacia sphacelata, a specific type within the Acacia genus, which includes several subspecies, with subsp. verticillata being one of its notable variants.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sphacelata subsp. verticillata is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area known as the Geraldton-Walpole-Nyungar region. This subspecies typically grows in sandy soils and is commonly found in coastal and inland areas. It is well adapted to the arid and semi-arid climates of its native range. The plant is often seen in open woodlands and heathlands within its distribution area.",
    "distribution_introduced_art_desc": "Acacia sphacelata subsp. verticillata was mainly introduced to areas with well-drained soils and a temperate to subtropical climate, particularly in regions of southern Africa. It thrives in open habitats such as grasslands, rocky outcrops, and disturbed sites. This subspecies is often used in reclamation projects due to its ability to stabilize soil and tolerate poor soil conditions. It is also valued for its ornamental qualities and as a source of fodder for livestock. However, its introduction has raised concerns about potential invasiveness in non-native environments."
}
