{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata var. longipedunculata",
    "plant_slug": "acacia-armata-var-longipedunculata",
    "plant_name_scientific": "acacia armata var. longipedunculata",
    "intro": "Acacia armata var. longipedunculata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, often twisted branches and bipinnate leaves composed of numerous small, needle-like leaflets. The plant produces yellow globular flower heads that are arranged in dense, elongated clusters, giving it its varietal name \"longipedunculata.\" It thrives in well-drained soils and is adapted to dry, sunny environments. The species is valued for its ornamental appeal and its role in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata var. longipedunculata is primarily native to the arid and semi-arid regions of southern Africa, including Namibia, Botswana, and parts of South Africa. This variant of the umbrella thorn acacia is commonly found in savannas and rocky outcrops where it thrives in dry, well-drained soils. It is well adapted to harsh environmental conditions, making it a resilient component of the local flora. The plant plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is largely restricted to the specific climatic and geographical conditions of these regions.",
    "distribution_introduced_art_desc": "Acacia armata var. longipedunculata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the coastal areas, thriving in sandy soils and coastal environments. This variety is known for its distinctive long, pendulous flower clusters and is often used in ornamental gardening. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasive tendencies. Its introduction has led to discussions about its ecological impact in local ecosystems."
}
