{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia velvae",
    "plant_slug": "acacia-velvae",
    "plant_name_scientific": "acacia velvae",
    "intro": "Acacia velvae, commonly known as the velvet acacia, is a shrub native to the arid regions of Australia. It is characterized by its dense, feathery foliage that gives it a soft, velvety appearance. The plant produces small, yellow flowers that bloom in spring, attracting various pollinators. Its leaves are compound, consisting of multiple narrow leaflets, and it has a deep root system adapted to survive in dry conditions. Acacia velvae is often used in landscaping for its ornamental value and ability to thrive in low-water environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia velvae is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savannah and scrubland habitats. This plant is well adapted to drought conditions and can survive in areas with low rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely confined to the dry interior regions of southern Africa.",
    "distribution_introduced_art_desc": "Acacia velvae was mainly introduced to areas with a Mediterranean climate, characterized by dry summers and wet winters. It thrives in well-drained soils and is often found in coastal regions and disturbed sites. This plant is known for its ability to tolerate drought and poor soil conditions, making it a common invasive species in some regions. Its rapid growth and extensive root system contribute to its competitive advantage over native vegetation. Due to its adaptability, it has been reported in several countries outside its native range, raising concerns about its ecological impact."
}
