{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia umbraculiformis",
    "plant_slug": "acacia-umbraculiformis",
    "plant_name_scientific": "acacia umbraculiformis",
    "intro": "Acacia umbraculiformis, commonly known as the umbrella acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, umbrella-like canopy of compound leaves, which provide shade and support for various wildlife. The plant produces yellow, globular flower heads that attract pollinators such as bees and birds. It thrives in well-drained soils and is often found in savanna and woodland habitats. Acacia umbraculiformis is also valued for its role in soil stabilization and as a source of traditional medicinal compounds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia umbraculiformis"
    },
    "taxonomy_art_desc": "Acacia umbraculiformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and often possessing vascular tissues. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have small, clustered flowers and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and the production of legume-like pods. Its species is Acacia umbraculiformis, a specific type of acacia known for its umbrella-shaped crown and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia umbraculiformis is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the Geraldton area. This species thrives in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the dry and arid conditions typical of its native habitat. Acacia umbraculiformis plays an important ecological role in supporting local wildlife and stabilizing soil in its native environment.",
    "distribution_introduced_art_desc": "Acacia umbraculiformis was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its ornamental value and ability to thrive in degraded soils. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to significant ecological concerns, including the reduction of biodiversity in affected areas. Efforts are now being made to control its spread and mitigate its impact on native flora."
}
