{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mountfordiae",
    "plant_slug": "acacia-mountfordiae",
    "plant_name_scientific": "acacia mountfordiae",
    "intro": "Acacia mountfordiae, commonly known as the Mountford's acacia, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, erect stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow globular flower heads, which are clustered in dense spikes at the ends of the branches. It is adapted to survive in harsh, dry environments with low rainfall. Acacia mountfordiae is also valued for its ecological role in providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mountfordiae"
    },
    "taxonomy_art_desc": "Acacia mountfordiae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their ability to fix atmospheric nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their thorned stems and characteristic flower heads, commonly found in arid and tropical regions. Its species is Acacia mountfordiae, a specific type of acacia native to Australia, recognized for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mountfordiae is primarily native to the Northern Territory. This species is found in the arid and semi-arid regions of the territory, particularly in the central and southern parts. It typically grows in sandy soils and is often associated with shrublands and grasslands. The plant is well adapted to the harsh environmental conditions of the region. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia mountfordiae was mainly introduced to the northern regions of Western Australia. It is commonly found in sandy soils and open habitats. This plant is often associated with coastal areas and is adapted to arid conditions. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
