{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heteromalla",
    "plant_slug": "acacia-heteromalla",
    "plant_name_scientific": "acacia heteromalla",
    "intro": "Acacia heteromalla, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and narrow, feather-like leaves. The plant produces small, yellow flowers arranged in compact globular clusters, which bloom in spring. It thrives in well-drained soils and is often found in coastal and sandy areas. Acacia heteromalla is a hardy, drought-tolerant species that plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heteromalla is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It thrives in dry, open habitats such as spinifex plains, sandy soils, and rocky outcrops. This species is commonly found in arid and semi-arid regions, often growing in association with other drought-tolerant shrubs. It plays an important ecological role in stabilizing soil and providing habitat for native fauna. The plant is well adapted to the harsh environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia heteromalla was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has since spread beyond cultivated areas and is now found in native forests and along roadsides. The plant's rapid growth and ability to colonize disturbed sites have led to its classification as a potential environmental weed. Its introduction has raised concerns about its impact on local biodiversity and ecosystem dynamics. Management strategies are being developed to control its spread and mitigate its ecological effects."
}
