{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia siculiformis var. bossiaeoides",
    "plant_slug": "acacia-siculiformis-var-bossiaeoides",
    "plant_name_scientific": "acacia siculiformis var. bossiaeoides",
    "intro": "Acacia siculiformis var. bossiaeoides, commonly known as the Bossie's wattle, is a shrub native to South Africa. It features slender, cylindrical stems that are often twisted and covered in a distinctive greyish bark. The plant produces small, yellow flowers in dense, globular clusters, which bloom in late winter to early spring. Its leaves are bipinnate, with numerous small, feathery leaflets. This species is adapted to arid and semi-arid environments, making it resilient to drought and heat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia siculiformis var. bossiaeoides is primarily native to the coastal regions of southern Africa, specifically South Africa. It is commonly found in the provinces of KwaZulu-Natal and the Eastern Cape. This plant thrives in sandy soils and is often associated with coastal dunes and rocky outcrops. It is well adapted to the warm, humid climate of these areas. Its distribution is limited to specific microhabitats along the southern African coastline.",
    "distribution_introduced_art_desc": "Acacia siculiformis var. bossiaeoides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western Cape and Eastern Cape provinces. This plant is often seen growing in disturbed soils and along roadsides, indicating its adaptability to various environmental conditions. Its introduction has raised concerns due to its potential for invasiveness in native ecosystems. It is important to monitor its spread to prevent ecological disruption."
}
