{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia varia var. affinis",
    "plant_slug": "acacia-varia-var-affinis",
    "plant_name_scientific": "acacia varia var. affinis",
    "intro": "Acacia varia var. affinis, commonly known as the variable acacia, is a shrub or small tree native to parts of Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant typically has slender, often thorned branches and produces yellow to golden flowers in clusters. Its leaves are bipinnate, with small, oval-shaped leaflets, and it is adapted to arid and semi-arid environments. Acacia varia var. affinis is known for its ecological importance, providing food and habitat for various native wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia varia var. affinis is primarily native to southern Africa, including countries such as South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, particularly in the Karoo and Succulent Karoo biomes. This variant thrives in rocky soils and is often seen growing on cliffs or among shrubs. It is adapted to withstand drought and high temperatures, making it a resilient species in its native habitat. The plant plays an important ecological role by providing shelter and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia varia var. affinis was mainly introduced to regions with a tropical and subtropical climate, where it thrives in well-drained soils. It is commonly found in areas with mild winters and warm, dry summers. This plant is often used for ornamental purposes due to its attractive foliage and flowering habits. It has been introduced to several parts of the world, including the United States and Australia. However, its spread is often limited by its specific environmental requirements."
}
