{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bucerophora",
    "plant_slug": "acacia-bucerophora",
    "plant_name_scientific": "acacia bucerophora",
    "intro": "Acacia bucerophora, commonly known as the giant acacia, is a flowering plant native to southern Africa. It is characterized by its tall, straight trunk and feathery, bipinnate leaves. The plant produces yellow flowers in compact globular heads, which appear during the rainy season. It thrives in arid and semi-arid environments, often growing in rocky soils. Acacia bucerophora is also valued for its hard, durable wood and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bucerophora is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and Mozambique. It is commonly found in savannas, woodlands, and rocky outcrops where it thrives in well-drained soils. This species is adapted to dry and semi-arid environments, often growing in areas with seasonal rainfall. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia bucerophora is also valued for its hard wood and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia bucerophora was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with seasonal rainfall. It thrives in open landscapes such as grasslands, savannas, and disturbed sites where it can establish quickly. The plant is often used for soil stabilization and as a source of timber and fodder due to its hardy nature. Its introduction has sometimes led to the displacement of native vegetation in certain regions. However, it plays a valuable role in ecological restoration projects in suitable environments."
}
