{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stenocarpa var. boboensis",
    "plant_slug": "acacia-stenocarpa-var-boboensis",
    "plant_name_scientific": "acacia stenocarpa var. boboensis",
    "intro": "Acacia stenocarpa var. boboensis, commonly known as the Bobo acacia, is a shrub or small tree native to the arid regions of eastern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow, globular inflorescences that attract pollinators such as bees and birds. Its seeds are encased in woody pods and are dispersed by wind, contributing to its ability to colonize disturbed or dry soils. This species is well adapted to harsh environments, displaying drought tolerance and efficient water use.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stenocarpa var. boboensis is primarily native to the western region of Australia, specifically in the states of Western Australia and South Australia. It is commonly found in arid and semi-arid environments, particularly in areas with sandy or gravelly soils. This variety is often associated with shrublands and open woodlands, thriving in regions with low rainfall and high temperatures. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. The plant is well adapted to the harsh conditions of its native range, making it a resilient species in its environment.",
    "distribution_introduced_art_desc": "Acacia stenocarpa var. boboensis was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in arid and semi-arid regions. It is commonly found in regions of southern Africa, particularly in countries like Namibia, Botswana, and South Africa. This variety is often used in reforestation and soil stabilization projects due to its hardy nature and ability to thrive in poor soil conditions. It has also been introduced to other parts of the world for ornamental purposes and as a source of timber. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
