{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hynesiana",
    "plant_slug": "acacia-hynesiana",
    "plant_name_scientific": "acacia hynesiana",
    "intro": "Acacia hynesiana, commonly known as the Hynes' acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are narrow and linear. The plant produces small, yellow flowers arranged in dense, cylindrical inflorescences, which are typical of the Acacia genus. It thrives in arid and semi-arid environments, often found in rocky soils and savanna habitats. The species is valued for its ornamental appeal and is sometimes cultivated for its hardy nature and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hynesiana is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in savannas, rocky outcrops, and along riverbanks in these areas. This plant thrives in well-drained soils and is adapted to withstand high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for various wildlife species. Due to its hardy nature, it is also occasionally cultivated in other arid regions outside its native range.",
    "distribution_introduced_art_desc": "Acacia hynesiana was mainly introduced to areas with well-drained soils and a warm, temperate climate, particularly in regions where it can thrive without excessive rainfall. It is commonly found in disturbed sites such as roadsides, abandoned fields, and along riverbanks. This plant has been introduced to several parts of the United States, including California, Texas, and Arizona, where it has established itself in both natural and human-modified landscapes. Its rapid growth and ability to fix nitrogen make it a valuable plant for soil stabilization and land rehabilitation. However, it can also become invasive in certain ecosystems if not managed properly."
}
