{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eriadenia",
    "plant_slug": "acacia-eriadenia",
    "plant_name_scientific": "acacia eriadenia",
    "intro": "Acacia eriadenia, commonly known as the silky acacia, is a shrub native to the arid regions of Australia. It is characterized by its slender, often multi-branched stems and small, feathery leaves that are covered in fine, silky hairs. The plant produces yellow flowers in clusters, which are followed by woody pods containing several seeds. Acacia eriadenia is well adapted to dry conditions, with deep roots that allow it to survive in nutrient-poor soils. It plays an important role in providing habitat and food for various desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eriadenia is primarily native to eastern Australia, including regions such as Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in open woodlands, heathlands, and along coastal areas. This species thrives in well-drained soils and is often associated with dry or semi-arid environments. It is a shrub or small tree that can grow up to 3 meters in height. Acacia eriadenia is known for its distinctive yellow flowers and is an important plant in the local ecosystem.",
    "distribution_introduced_art_desc": "Acacia eriadenia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is known for its distinctive yellow flowers and is often used in ornamental gardening. However, it has also been reported to spread aggressively in some ecosystems, raising concerns about its invasive potential. Its introduction has led to discussions about its ecological impact and management strategies in local environments."
}
