{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura var. stenocarpa",
    "plant_slug": "acacia-aneura-var-stenocarpa",
    "plant_name_scientific": "acacia aneura var. stenocarpa",
    "intro": "Acacia aneura var. stenocarpa, commonly known as the River Red Gum, is a hardy, drought-tolerant tree native to Australia. It is characterized by its slender, often zigzagging branches and small, yellow flowers that appear in summer. The tree produces flat, leathery pods that contain seeds, which are dispersed by wind. Its bark is typically reddish-brown and peels in thin layers, giving it a distinctive appearance. This species plays an important ecological role in providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aneura var. stenocarpa is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the central and western parts of the country, including areas such as the Simpson Desert, the Great Sandy Desert, and the Nullarbor Plain. This variety is well adapted to harsh, dry environments and thrives in sandy or rocky soils. It is often seen growing along roadsides, in mulga woodlands, and on coastal dunes. Its distribution is closely linked to the availability of water and its ability to tolerate extreme temperatures.",
    "distribution_introduced_art_desc": "Acacia aneura var. stenocarpa was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the southern and western parts of the country. This plant is often used for erosion control due to its deep root system and ability to stabilize sandy soils. It is also valued for its hardy nature and ability to withstand drought conditions. However, its introduction has sometimes led to competition with native species in certain ecosystems."
}
