{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gnidium var. latifolia",
    "plant_slug": "acacia-gnidium-var-latifolia",
    "plant_name_scientific": "acacia gnidium var. latifolia",
    "intro": "Acacia gnidium var. latifolia, commonly known as the broadleaf acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its compound leaves, which are typically narrow and linear, and its yellow flowers that appear in dense, globular clusters. The plant is well adapted to drought conditions, with deep roots that allow it to survive in nutrient-poor soils. It plays an important ecological role by providing food and shelter for various desert wildlife. The wood of this species is hard and durable, making it useful for construction and fuel.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gnidium var. latifolia is primarily native to southern Africa, specifically South Africa. It is commonly found in the Eastern Cape and Western Cape provinces. This plant thrives in coastal areas and sandy soils along the Atlantic and Indian Ocean coasts. It is often associated with fynbos vegetation, which is characteristic of the region's unique biodiversity. Its distribution is limited to these specific habitats due to its particular environmental requirements.",
    "distribution_introduced_art_desc": "Acacia gnidium var. latifolia was mainly introduced to urban and suburban areas in southern Africa, particularly in South Africa, for ornamental purposes due to its attractive foliage and drought tolerance. It is commonly found in gardens, along roadsides, and in agricultural landscapes where it serves as a decorative plant. Despite its aesthetic value, it has the potential to become invasive in certain environments if not managed properly. Its introduction has led to concerns about its impact on native plant communities and ecological balance. Therefore, it is often recommended to use it cautiously in landscaping to prevent unintended spread."
}
