{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustissima var. texensis",
    "plant_slug": "acacia-angustissima-var-texensis",
    "plant_name_scientific": "acacia angustissima var. texensis",
    "intro": "Acacia angustissima var. texensis, commonly known as the Texas acacia, is a shrub native to the southern United States, particularly Texas. It is characterized by its slender, branching stems and bipinnate leaves composed of numerous small, needle-like leaflets. The plant produces yellow, globular flower clusters that bloom in spring, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and full sun, making it well-suited for arid and semi-arid environments. The Texas acacia is often used in landscaping for its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustissima var. texensis is primarily native to the southwestern United States and northern Mexico. It is found in regions such as Texas, New Mexico, and parts of Arizona. This plant thrives in arid and semi-arid environments, often growing in rocky soils and open woodlands. It is commonly associated with limestone and sandy soils in its native range. Its distribution is limited to specific ecological zones where it can tolerate drought and high temperatures.",
    "distribution_introduced_art_desc": "Acacia angustissima var. texensis was mainly introduced to specific regions of Texas, particularly in the Edwards Plateau and the Trans-Pecos area. It was introduced as part of early botanical surveys and ecological studies in the late 19th and early 20th centuries. The plant was often planted for its ornamental value and for stabilizing soils in arid environments. However, it has since become naturalized in certain areas, though its distribution remains limited compared to native species. Its introduction has had minimal impact on local ecosystems, but it is still monitored for potential invasive tendencies."
}
