{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rhigiophylla",
    "plant_slug": "acacia-rhigiophylla",
    "plant_name_scientific": "acacia rhigiophylla",
    "intro": "Acacia rhigiophylla, commonly known as the narrow-leaf wattle, is a shrub native to Western Australia. It is characterized by its slender, wiry stems and small, phyllodes that are typically narrow and linear. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. It thrives in well-drained soils and is drought-tolerant, making it well adapted to arid and semi-arid environments. The species is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rhigiophylla"
    },
    "taxonomy_art_desc": "Acacia rhigiophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants with a distinctive flower structure and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as sources of timber. Its species is Acacia rhigiophylla, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rhigiophylla is primarily native to New South Wales and South Australia. It is commonly found in dry, rocky habitats within these regions. The plant thrives in arid and semi-arid environments, often growing on hillsides and rocky outcrops. It is well adapted to the harsh climatic conditions of its native range. This species is an important part of the local flora in both states.",
    "distribution_introduced_art_desc": "Acacia rhigiophylla was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low rainfall and is often used for soil stabilization. This plant has been introduced to parts of Australia and New Zealand for its hardy nature and ability to thrive in harsh conditions. It is also valued for its ornamental qualities and potential for erosion control. However, its introduction has raised concerns about its impact on native ecosystems."
}
