{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens var. lanigera",
    "plant_slug": "acacia-decurrens-var-lanigera",
    "plant_name_scientific": "acacia decurrens var. lanigera",
    "intro": "Acacia decurrens var. lanigera, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its finely haired, trifoliate leaves that give it a soft, velvety appearance. The plant produces yellow flowers in compact spikes, which are often followed by flat, pod-like fruits. It thrives in well-drained soils and is adapted to semi-arid environments. This variety is valued for its ornamental appeal and is sometimes used in horticulture for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens var. lanigera is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variety is commonly found in sandy soils and open savannas, where it thrives in harsh, dry conditions. It is often seen growing along roadsides, riverbanks, and in disturbed areas due to its adaptability. The plant plays an important ecological role by providing shelter and food for local wildlife. Its distribution is closely linked to the availability of water and well-drained soils in its native range.",
    "distribution_introduced_art_desc": "Acacia decurrens var. lanigera was mainly introduced to areas with well-drained soils and a temperate to warm climate, often found in regions with low to moderate rainfall. It thrives in open habitats such as grasslands, rocky outcrops, and disturbed sites. This variety is commonly used for soil stabilization and as a source of timber and fuelwood. Its introduction has sometimes led to competition with native plant species in invaded areas. Due to its adaptability, it has become a common ornamental and reclamation plant in various parts of the world."
}
