{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sandra",
    "plant_slug": "acacia-sandra",
    "plant_name_scientific": "acacia sandra",
    "intro": "Acacia sandra, commonly known as the sand acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in globular or cylindrical inflorescences, which are followed by woody pods containing seeds. Acacia sandra is adapted to survive in harsh, dry environments with minimal water availability. It plays an important ecological role in stabilizing soils and providing habitat for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sandra is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and is often associated with shrublands and grasslands. This species thrives in environments with low rainfall and high temperatures. It plays an important ecological role by providing shelter and food for various animals. Due to its hardy nature, it is well adapted to the harsh conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia sandra was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, it has been reported to spread aggressively, sometimes becoming invasive in certain ecosystems. Its introduction has had both positive ecological benefits and some unintended environmental impacts."
}
