{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia debilis",
    "plant_slug": "acacia-debilis",
    "plant_name_scientific": "acacia debilis",
    "intro": "Acacia debilis, commonly known as the slender acacia, is a small, thorny shrub native to arid and semi-arid regions of Africa. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves and yellow or pale yellow flowers. The plant produces small, woody pods that contain edible seeds, which are used as food by both humans and animals. Acacia debilis is adapted to survive in harsh environments, with deep roots that help it access groundwater and reduce water loss through its small, thick leaves.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia debilis"
    },
    "taxonomy_art_desc": "Acacia debilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some modern plants with a complex vascular system. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and ability to thrive in arid environments. Its species is Acacia debilis, a specific type of acacia native to Australia, characterized by its small size, feathery foliage, and ability to survive in dry conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia debilis is primarily native to New South Wales and Queensland in Australia. It is commonly found in arid and semi-arid regions within these states. The plant thrives in sandy or rocky soils and is often associated with shrublands and open woodlands. It plays an important ecological role by providing habitat and food for various native animals. Its distribution is largely restricted to the eastern parts of Australia, where it has adapted to the local climate conditions.",
    "distribution_introduced_art_desc": "Acacia debilis was mainly introduced to areas with arid or semi-arid climates, where it thrives in poor soils and requires minimal water. It is commonly found in regions of Africa, particularly in countries like Somalia, Kenya, and Ethiopia. The plant is often used for its hardy characteristics, making it suitable for reclamation of degraded lands. Its introduction has sometimes led to ecological impacts, including competition with native species. Despite its potential for environmental restoration, careful management is needed to prevent its spread into unintended habitats."
}
