{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica subsp. vediana",
    "plant_slug": "acacia-nilotica-subsp-vediana",
    "plant_name_scientific": "acacia nilotica subsp. vediana",
    "intro": "Acacia nilotica subsp. vediana, commonly known as the Sudanese acacia, is a shrub or small tree native to parts of Africa and the Middle East. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellow, globular inflorescences that attract pollinators such as bees and birds. Its bark and wood are valued for their durability and have been used in traditional construction and crafts. The species is also known for its ability to thrive in arid and semi-arid environments, making it an important component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica subsp. vediana is primarily native to eastern and southern Africa, including countries such as Sudan, South Sudan, Ethiopia, Kenya, Tanzania, Uganda, and parts of the Democratic Republic of the Congo. It is commonly found in savannas, grasslands, and rocky areas, often growing along riverbanks and in dry, semi-arid regions. This subspecies is well adapted to hot and arid climates, with a deep root system that allows it to survive in poor soil conditions. It plays an important ecological role by providing habitat and food for various wildlife species. Additionally, it has been used traditionally for its timber, gum, and medicinal properties.",
    "distribution_introduced_art_desc": "Acacia nilotica subsp. vediana was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate to high rainfall. It is commonly found in parts of Africa, the Middle East, and South Asia where it thrives in open woodlands and savannas. This subspecies is often used for its hardy nature, providing shade and serving as a source of timber and fodder. Its introduction has sometimes led to ecological impacts, including competition with native species in invaded habitats. Due to its adaptability, it has been planted in reforestation and afforestation projects in various countries."
}
