{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura var. macrocarpa",
    "plant_slug": "acacia-aneura-var-macrocarpa",
    "plant_name_scientific": "acacia aneura var. macrocarpa",
    "intro": "Acacia aneura var. macrocarpa, commonly known as the river red gum, is a species of flowering plant in the legume family. It is native to Australia and is characterized by its distinctive red-barked trunk and long, narrow leaves. The plant produces yellow flowers in spikes, which are often followed by woody pods containing seeds. It thrives in a variety of soil types but prefers well-drained soils and is commonly found near water sources. The river red gum plays an important ecological role in Australian woodlands and is also valued for its timber and ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aneura var. macrocarpa is primarily native to the arid and semi-arid regions of central Australia, including parts of the Northern Territory, South Australia, and Queensland. It is commonly found in areas with sandy or rocky soils, often forming dense shrubs or small trees. This variety is well adapted to the harsh conditions of the Australian outback, including high temperatures and low rainfall. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife. The plant is also known for its distinctive yellow flowers and is sometimes used in traditional land management practices.",
    "distribution_introduced_art_desc": "Acacia aneura var. macrocarpa was mainly introduced to South Australia and Western Australia for its hardy nature and ornamental value. It is commonly found in arid and semi-arid regions, thriving in well-drained soils. This variety is often used in landscaping and as a windbreak due to its drought tolerance. It has also been introduced to parts of New South Wales and the Northern Territory. However, its spread is limited by its specific environmental requirements and the challenges of its native habitat."
}
