{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia botrydion",
    "plant_slug": "acacia-botrydion",
    "plant_name_scientific": "acacia botrydion",
    "intro": "Acacia botrydion, commonly known as the sweet acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-stemmed form and its distinctive, flat, feathery leaves. The plant produces yellow flowers in dense, globular clusters, which are followed by flat, pod-like fruits. It thrives in arid and semi-arid environments, showing remarkable drought tolerance. The bark and leaves have been used traditionally for their medicinal properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia botrydion"
    },
    "taxonomy_art_desc": "Acacia botrydion belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true root system and complex structures such as vascular tissue. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes plants with characteristic flowers that have a papilionaceous or legume-like structure, and many are nitrogen-fixing. Its family is Fabaceae, commonly known as the legume or bean family, which is recognized for its distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their phyllodes and often used in various ecological and economic contexts. Its species is Acacia botrydion, a specific type of acacia characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia botrydion is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species thrives in coastal and inland habitats, often growing in shrublands and woodlands. It is well adapted to the dry and temperate climate of the region. The plant is an important component of the local flora and supports various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia botrydion was mainly introduced to areas with a warm, dry climate and well-drained soils, often in regions where it is used for soil stabilization and erosion control. It is commonly found in disturbed sites such as roadsides, abandoned fields, and degraded landscapes. The plant thrives in full sun and is known for its ability to tolerate drought conditions. Due to its rapid growth and spreading habit, it can become invasive in certain ecosystems. Its introduction has led to concerns about its impact on native plant communities in some regions."
}
