{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia parvifolia",
    "plant_slug": "acacia-parvifolia",
    "plant_name_scientific": "acacia parvifolia",
    "intro": "Acacia parvifolia, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It is characterized by its small, feathery leaves and yellow flowers that bloom in late winter to early spring. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. It thrives in well-drained soils and is often found in open woodlands and grasslands. Its seeds are encased in pods and are dispersed by wind, contributing to its spread across arid and semi-arid regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia parvifolia is primarily native to northern Australia, including regions of Western Australia, Northern Territory, and Queensland. It thrives in arid and semi-arid environments, often found in sandy soils and open woodlands. This species is well adapted to the harsh conditions of the Australian outback, with its small, feathery leaves reducing water loss. It plays an important role in local ecosystems by providing shelter and food for various wildlife. Acacia parvifolia is also commonly found in coastal areas and on sand dunes, where it contributes to stabilizing the soil.",
    "distribution_introduced_art_desc": "Acacia parvifolia was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the southern and western parts of the country. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced to other parts of the world, including some regions of the United States and South Africa. However, its introduction has sometimes led to concerns about its potential to become invasive in non-native environments."
}
