{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stipuligera var. glabrifolia",
    "plant_slug": "acacia-stipuligera-var-glabrifolia",
    "plant_name_scientific": "acacia stipuligera var. glabrifolia",
    "intro": "Acacia stipuligera var. glabrifolia, commonly known as the smooth-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are smooth and glabrous, giving it its varietal name. The plant produces yellow flowers in cylindrical spikes, which are typical of the Acacia genus. It is often found in dry, sandy soils and is adapted to arid and semi-arid environments. This species is valued for its ornamental appeal and is sometimes used in landscaping due to its hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stipuligera var. glabrifolia is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, often growing in sandy or rocky soils. This variety is adapted to harsh environmental conditions and is typically found in shrublands and open woodlands. It plays an important ecological role in these ecosystems by providing habitat and food for various native animals. Its distribution is largely restricted to the specific climatic and soil conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia stipuligera var. glabrifolia was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It is commonly cultivated in gardens and landscapes for its ornamental value due to its unique foliage and flowering characteristics. This plant thrives in full sun and is relatively drought-tolerant once established. It has been introduced to parts of Australia and the United States, where it is used for erosion control and as a shade plant. However, it may become invasive in certain environments if not managed properly."
}
