{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pycnostachya",
    "plant_slug": "acacia-pycnostachya",
    "plant_name_scientific": "acacia pycnostachya",
    "intro": "Acacia pycnostachya, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its dense, cylindrical yellow flowers that appear in late summer to early autumn. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It thrives in well-drained soils and is often found in open forests and woodlands. Acacia pycnostachya is also valued for its ornamental qualities and is used in horticulture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pycnostachya"
    },
    "taxonomy_art_desc": "Acacia pycnostachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of plants that typically have compound leaves and are often legumes, capable of nitrogen fixation. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their distinctive phyllodes and ability to thrive in harsh environments. Its species is Acacia pycnostachya, a specific type of acacia native to Africa, recognized for its dense foliage and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pycnostachya is primarily native to New South Wales. It is commonly found in the coastal regions and sandy soils of the state. This plant thrives in dry, open habitats such as heathlands and coastal dunes. It is well adapted to the local climate and soil conditions of New South Wales. Acacia pycnostachya plays an important role in the local ecosystem and is often used in landscaping due to its hardy nature.",
    "distribution_introduced_art_desc": "Acacia pycnostachya was mainly introduced to areas with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It is commonly found in regions of Australia, where it has been used for soil stabilization and as a source of timber. The plant's rapid growth and nitrogen-fixing capabilities make it valuable for land rehabilitation projects. However, its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. Despite these challenges, it remains an important species in ecological restoration efforts in its native range."
}
