{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bivenosa var. borealis",
    "plant_slug": "acacia-bivenosa-var-borealis",
    "plant_name_scientific": "acacia bivenosa var. borealis",
    "intro": "Acacia bivenosa var. borealis, commonly known as the northern acacia, is a shrub native to the Arctic and subarctic regions of North America. It is characterized by its small, compound leaves and yellow flowers that bloom in late summer. The plant thrives in cold, dry environments and is adapted to permafrost conditions. Its root system helps stabilize soil in harsh, nutrient-poor habitats. It plays a vital role in providing food and shelter for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bivenosa var. borealis is primarily native to the Arctic and subarctic regions of North America, including parts of Alaska and northern Canada. It thrives in cold, dry environments and is commonly found in tundra and rocky slopes. This variant is adapted to harsh climatic conditions and is often associated with low-growing vegetation. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Due to its limited range, it is considered a rare and specialized plant in its native habitat.",
    "distribution_introduced_art_desc": "Acacia bivenosa var. borealis was mainly introduced to regions with temperate to subarctic climates, where it thrives in well-drained soils and full sun. It is commonly found in areas with low precipitation and cold winters, such as parts of northern North America and northern Europe. This plant is often used in reclamation projects due to its hardy nature and ability to stabilize soil. Its introduction has been primarily for ecological restoration and erosion control purposes. However, it is important to monitor its spread to prevent potential invasiveness in non-native environments."
}
