{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sorophylla",
    "plant_slug": "acacia-sorophylla",
    "plant_name_scientific": "acacia sorophylla",
    "intro": "Acacia sorophylla, commonly known as the yellow wattle, is a small to medium-sized shrub or tree native to eastern Australia. It is characterized by its feathery, yellow flowers that bloom in late summer and early autumn. The plant has phyllodes, which are flattened, leaf-like structures that reduce water loss in arid conditions. Acacia sorophylla is well adapted to a variety of soil types and can thrive in both full sun and partial shade. It is also an important species for local wildlife, providing nectar for birds and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sorophylla"
    },
    "taxonomy_art_desc": "Acacia sorophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes, with a distinctive type of flower and a symbiotic relationship with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in various ecological and commercial contexts. Its species is Acacia sorophylla, a specific type of acacia found in certain regions of Australia, known for its unique leaf structure and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sorophylla is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Avon-Heathcote Estuaries. This plant thrives in sandy soils and is often found in coastal and near-coastal environments. It is an important component of the local flora and plays a role in stabilizing dunes and preventing erosion. Acacia sorophylla is well adapted to the dry and sometimes saline conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia sorophylla was mainly introduced to areas with well-drained soils and a temperate to subtropical climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is often found in open woodlands and along riverbanks. Its introduction has been primarily for soil stabilization and as an ornamental species. However, it can sometimes become invasive in certain ecosystems if not managed properly."
}
