{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nebneb",
    "plant_slug": "acacia-nebneb",
    "plant_name_scientific": "acacia nebneb",
    "intro": "Acacia nebneb, commonly known as the red acacia, is a flowering plant native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are covered in fine hairs. The plant produces yellow flowers in clusters, which are followed by long, flat pods containing edible seeds. Acacia nebneb thrives in arid and semi-arid environments, making it an important component of local ecosystems. Its wood and seeds have been used by indigenous communities for various traditional purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nebneb is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, shrublands, and rocky outcrops where it thrives in dry, well-drained soils. This plant is well adapted to the harsh climate of its native habitat, with its deep root system allowing it to access water from deeper underground. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia nebneb is also known for its distinctive appearance, featuring long, thin leaves and yellow flowers that bloom during the rainy season.",
    "distribution_introduced_art_desc": "Acacia nebneb was mainly introduced to South Africa, where it has become an invasive species. It was originally from Australia and was brought over for ornamental purposes. The plant thrives in a variety of soil types and is highly adaptable, which contributes to its spread. It outcompetes native vegetation, leading to ecological imbalances in invaded areas. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
