{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lugardiae",
    "plant_slug": "acacia-lugardiae",
    "plant_name_scientific": "acacia lugardiae",
    "intro": "Acacia lugardiae, commonly known as the Lugard's acacia, is a shrub or small tree native to southern Africa. It is characterized by its bipinnate leaves, which are divided into small, feather-like segments. The plant produces yellow flowers arranged in spherical or cylindrical heads, which are followed by flat, pod-like fruits. It thrives in arid and semi-arid environments, often found in savannas and rocky soils. Acacia lugardiae is notable for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lugardiae is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and Angola. It thrives in sandy soils and is commonly found in coastal and inland dunes. This species is well adapted to dry conditions and can tolerate high temperatures and limited rainfall. It plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife. Acacia lugardiae is also sometimes cultivated in other parts of the world for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia lugardiae was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for drought-tolerant landscapes. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It has also been introduced as an ornamental plant in some parts of the world because of its unique foliage and resilience. However, its introduction has raised concerns about its potential to become invasive in non-native ecosystems."
}
