{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia foetida",
    "plant_slug": "acacia-foetida",
    "plant_name_scientific": "acacia foetida",
    "intro": "Acacia foetida, commonly known as the stinking acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its pale yellow to greenish-gray bark and its distinctive, fragrant or sometimes unpleasant-smelling flowers. The plant produces small, flat seed pods that contain hard, angular seeds, which are often dispersed by wind. Acacia foetida is adapted to survive in harsh, dry environments, with deep roots that allow it to access groundwater. It plays an important ecological role in stabilizing soil and providing habitat for various desert organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia foetida is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is also found in parts of the Horn of Africa, including Somalia and Eritrea. This plant thrives in arid and semi-arid environments, often growing in rocky soils and coastal areas. It is commonly found in coastal dunes and along the edges of deserts. Acacia foetida is well adapted to withstand high temperatures and low rainfall.",
    "distribution_introduced_art_desc": "Acacia foetida was mainly introduced to areas with arid or semi-arid climates, where it thrives in poor soils and high temperatures. It is commonly found in regions of Africa, the Middle East, and parts of Australia. This plant has been introduced to several countries as an ornamental or for its timber and fuelwood properties. However, its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. It is important to monitor its spread to prevent negative impacts on native flora and fauna."
}
