{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia diphylla",
    "plant_slug": "acacia-diphylla",
    "plant_name_scientific": "acacia diphylla",
    "intro": "Acacia diphylla, commonly known as the two-leaved acacia, is a shrub native to arid and semi-arid regions of Africa. It is characterized by its bipinnate leaves, which consist of two pairs of leaflets, giving it its common name. The plant produces yellow flowers in compact globular inflorescences, which attract various pollinators. Its small, woody pods contain seeds that are dispersed by wind. Acacia diphylla is adapted to survive in harsh environments, showcasing resilience through its deep root system and water-storing tissues.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia diphylla is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in dry, open habitats like savannas, woodlands, and rocky areas. This species is commonly found in areas with well-drained soils and moderate to high sunlight exposure. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia diphylla is also known for its distinctive bipinnate leaves and yellow flowers, which make it a notable plant in its native range.",
    "distribution_introduced_art_desc": "Acacia diphylla was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions of southern Africa. It is commonly found in open woodlands and rocky outcrops where it thrives in full sun. The plant is valued for its hardy nature and ability to withstand drought conditions. It has been introduced to several parts of the world, including Australia and the United States, for ornamental and erosion control purposes. Due to its invasive potential, it is often monitored in non-native regions to prevent ecological disruption."
}
