{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia singula",
    "plant_slug": "acacia-singula",
    "plant_name_scientific": "acacia singula",
    "intro": "Acacia singula, commonly known as the slender acacia, is a shrub native to southern Africa. It is characterized by its slender, branching stems and small, bipinnate leaves. The plant produces yellow flowers arranged in spherical heads, which are followed by flat, pod-like fruits. Acacia singula thrives in well-drained soils and is adapted to arid and semi-arid environments. It is often used in ornamental gardening due to its attractive appearance and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia singula"
    },
    "taxonomy_art_desc": "Acacia singula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and vetches. Its family is Fabaceae, commonly known as the legume family, characterized by the distinctive pod-like fruit and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped acorn-like pods and often used in traditional medicine. Its species is Acacia singula, a specific type of acacia found in certain regions, known for its unique botanical features and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia singula is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the Geraldton area. This plant thrives in sandy soils and is often seen in coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia singula plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia singula was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, particularly in the Western Cape and Eastern Cape provinces. The plant is known for its ability to thrive in sandy soils and withstand drought conditions. Its introduction has led to concerns about its potential to invade native ecosystems. However, it is not considered a major invasive species in the region."
}
