{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia arcuatilis",
    "plant_slug": "acacia-arcuatilis",
    "plant_name_scientific": "acacia arcuatilis",
    "intro": "Acacia arcuatilis, commonly known as the warty acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive, curved and warty pod-like fruits, which are a key feature of the species. The plant has phyllodes rather than true leaves, which are narrow and strap-like, adapted to reduce water loss in arid conditions. It produces yellow flowers in clusters, which are attractive to pollinators such as bees and birds. Acacia arcuatilis is often used in traditional medicine and is also valued for its ornamental qualities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia arcuatilis"
    },
    "taxonomy_art_desc": "Acacia arcuatilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that often have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and ability to thrive in arid environments. Its species is Acacia arcuatilis, a specific type of acacia known for its curved, leaf-like structures and adaptation to dry habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia arcuatilis is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is well adapted to the harsh climatic conditions of the region. Acacia arcuatilis is an important component of the local vegetation in these areas.",
    "distribution_introduced_art_desc": "Acacia arcuatilis was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential use in reforestation. It is commonly found in regions with a Mediterranean climate, such as the Western Cape, due to its adaptability to dry conditions. The plant is often used in landscaping because of its distinctive, feathery foliage and yellow flowers. However, it has raised concerns as a potential invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to ongoing monitoring to assess its ecological impact."
}
