{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cycnorum var. sedifolia",
    "plant_slug": "acacia-cycnorum-var-sedifolia",
    "plant_name_scientific": "acacia cycnorum var. sedifolia",
    "intro": "Acacia cycnorum var. sedifolia, commonly known as the white acacia, is a flowering plant native to parts of Africa and the Middle East. It is characterized by its slender, often spiny stems and bipinnate leaves composed of small, ovate leaflets. The plant produces yellow to golden-green flowers arranged in cylindrical inflorescences, which bloom during the dry season. It thrives in arid and semi-arid environments, often growing in sandy or gravelly soils. The plant has traditional uses in medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cycnorum var. sedifolia is primarily native to the Indian subcontinent, including countries such as India, Nepal, Bhutan, and Sri Lanka. It is commonly found in dry, arid, and semi-arid regions, often growing in open woodlands and along roadsides. This variant is adapted to thrive in sandy and rocky soils, making it a resilient plant in harsh environments. It is also present in parts of Pakistan and Bangladesh. The plant is well-known for its distinctive yellow flowers and is often used in traditional medicine and as a source of fodder.",
    "distribution_introduced_art_desc": "Acacia cycnorum var. sedifolia was mainly introduced to control soil erosion and as a forage plant in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has been widespread in parts of Africa, Asia, and the Middle East. However, it has occasionally become invasive in some regions, raising concerns about its ecological impact."
}
