{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stolonifera",
    "plant_slug": "acacia-stolonifera",
    "plant_name_scientific": "acacia stolonifera",
    "intro": "Acacia stolonifera, commonly known as the stoloniferous acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its dense, woody growth habit and the ability to form extensive mats through stolons, which are horizontal stems that root at the nodes. The plant produces small, yellow flowers clustered in cylindrical inflorescences, followed by flat, pod-like fruits containing seeds. Its leaves are typically small, feathery, and arranged in spirals along the stems. Acacia stolonifera is well adapted to harsh environments, exhibiting drought tolerance and efficient water use strategies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stolonifera is primarily native to southern Africa, including countries such as South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant thrives in open habitats like grasslands, shrublands, and rocky outcrops. It is well adapted to dry conditions and can tolerate high temperatures. Acacia stolonifera is often used in traditional medicine and as a source of browse for livestock.",
    "distribution_introduced_art_desc": "Acacia stolonifera was mainly introduced to control soil erosion and for its ability to thrive in arid environments. It is commonly found in disturbed soils and along roadsides in regions with a Mediterranean climate. This plant forms dense mats through its stolons, which help stabilize loose soil and prevent further degradation. Its rapid growth and drought tolerance make it a popular choice for land rehabilitation projects. However, its invasive nature can lead to the displacement of native vegetation if not managed properly."
}
