{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lasiocarpa var. villosa",
    "plant_slug": "acacia-lasiocarpa-var-villosa",
    "plant_name_scientific": "acacia lasiocarpa var. villosa",
    "intro": "Acacia lasiocarpa var. villosa, commonly known as the silky acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often twisted branches and its distinctive foliage of small, dense, grey-green leaves that are covered in fine, silky hairs. The plant produces yellow, globular flower heads that bloom in spring, attracting nectar-feeding birds and insects. Its woody, fibrous stems are often used in traditional Aboriginal practices for basket-making and other crafts. The species is well adapted to drought and poor soils, making it a hardy component of dryland ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lasiocarpa var. villosa is primarily native to the arid and semi-arid regions of southwestern Australia. It is commonly found in the states of Western Australia and South Australia. This variety thrives in sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the dry climate and can withstand periods of drought. Its distribution is limited to specific ecological zones where it plays a role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia lasiocarpa var. villosa was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions with low rainfall and high sunlight exposure. This plant is often used for erosion control due to its extensive root system and ability to stabilize soil. It is also valued for its nitrogen-fixing properties, making it beneficial for soil enrichment. However, its introduction has sometimes led to ecological concerns due to its aggressive growth in certain environments."
}
