{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura var. fuliginea",
    "plant_slug": "acacia-aneura-var-fuliginea",
    "plant_name_scientific": "acacia aneura var. fuliginea",
    "intro": "Acacia aneura var. fuliginea, commonly known as the black wattle, is a shrub or small tree native to southern Australia. It is characterized by its dark, almost black, woody stems and small, compound leaves. The plant produces yellow globular flowers that bloom in late winter to early spring. It thrives in well-drained soils and is often found in dry, coastal regions. The species is notable for its hard, dense wood, which has been historically used for fuel and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aneura var. fuliginea is primarily native to the arid and semi-arid regions of Australia, particularly in the central and western parts of the country. This variety is commonly found in areas such as the Simpson Desert, the Great Sandy Desert, and the Northern Territory. It thrives in sandy soils and is well adapted to the harsh, dry conditions of its native habitat. The plant is often seen as a dominant species in shrublands and woodland communities. Its distribution is closely linked to the availability of water and its ability to withstand extreme temperatures.",
    "distribution_introduced_art_desc": "Acacia aneura var. fuliginea was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in land rehabilitation projects due to its hardy nature and ability to thrive in harsh conditions. This variant is particularly valued for its dense foliage and rapid growth, making it suitable for windbreaks and shelterbelts. It has been introduced to various parts of Australia, including Queensland and New South Wales, where it plays a role in ecological restoration. However, its spread has raised concerns about potential invasiveness in native ecosystems."
}
