{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia saltiana",
    "plant_slug": "acacia-saltiana",
    "plant_name_scientific": "acacia saltiana",
    "intro": "Acacia saltiana, commonly known as the saltbush acacia, is a shrub native to arid and semi-arid regions of Africa. It is characterized by its small, feathery leaves and yellow flowers that bloom in clusters. The plant is well adapted to saline and drought conditions, making it a hardy species for challenging environments. Its root system helps stabilize soil, and it is often used in rehabilitation of degraded lands. Acacia saltiana is also valued for its potential in traditional medicine and as a source of animal forage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia saltiana is primarily native to the coastal regions of southern Africa, particularly in countries such as South Africa, Namibia, and Angola. It thrives in sandy or gravelly soils and is commonly found in dune environments and along the edges of coastal forests. This plant is well adapted to arid and semi-arid climates, with its deep root system allowing it to access groundwater. It plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife. Acacia saltiana is also known for its distinctive yellow flowers, which bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia saltiana was mainly introduced to regions with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for dryland environments. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has been noted in parts of Africa, the Middle East, and Australia. However, it can sometimes become invasive in non-native habitats if not managed properly."
}
