{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cunninghamii var. longispicata",
    "plant_slug": "acacia-cunninghamii-var-longispicata",
    "plant_name_scientific": "acacia cunninghamii var. longispicata",
    "intro": "Acacia cunninghamii var. longispicata, commonly known as the long-spined wattle, is a shrub or small tree native to Australia. It is characterized by its compound leaves and yellow flowers that bloom in spring. The plant produces cylindrical pods that contain seeds, and it is adapted to dry, sandy soils. It is often found in coastal areas and is valued for its ornamental appeal and ecological benefits. The variety is distinguished by its longer, more prominent spines compared to other acacia species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cunninghamii var. longispicata is primarily native to the tropical and subtropical regions of northern Australia, including the Northern Territory, Western Australia, and Queensland. This variety is commonly found in coastal areas, sandplain woodlands, and dry rainforests. It thrives in well-drained soils and is often associated with sandy or lateritic soils. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia cunninghamii var. longispicata was mainly introduced to South Australia and Western Australia. It is commonly found in sandy soils along coastal areas and in dune environments. This variety is known for its distinctive long, slender spines and its ability to thrive in arid conditions. It is often used in rehabilitation projects due to its hardy nature and windbreak capabilities. However, it can become invasive in certain areas if not managed properly."
}
