{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia inaequilatera",
    "plant_slug": "acacia-inaequilatera",
    "plant_name_scientific": "acacia inaequilatera",
    "intro": "Acacia inaequilatera, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow globular flower heads that appear in late winter to early spring, attracting a variety of pollinators. It thrives in sandy or loamy soils and is often found in coastal areas and heathlands. Acacia inaequilatera is well adapted to dry conditions and can tolerate salt spray, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia inaequilatera"
    },
    "taxonomy_art_desc": "Acacia inaequilatera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and their allies, often with a distinct life cycle involving both spore and seed reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of plants that are typically legumes, often with compound leaves and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa, Australia, and Asia, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia inaequilatera, a specific type of acacia found in certain regions of Africa, distinguished by its unique leaf structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia inaequilatera is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This species thrives in sandy soils and is often seen in shrublands and open woodlands. It plays an important ecological role in providing habitat and food for local wildlife. Its distribution is closely linked to the environmental conditions of the region.",
    "distribution_introduced_art_desc": "Acacia inaequilatera was mainly introduced to areas with warm, dry climates and well-drained soils, often in regions where it is used for land stabilization and erosion control. It is commonly found in tropical and subtropical environments, including parts of Australia, Africa, and the Middle East. This plant is valued for its hardy nature and ability to thrive in poor soil conditions. It has been introduced to various parts of the world for its ecological and ornamental benefits. However, in some regions, it has become invasive, posing a threat to native flora."
}
