{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia litakunensis",
    "plant_slug": "acacia-litakunensis",
    "plant_name_scientific": "acacia litakunensis",
    "intro": "Acacia litakunensis, commonly known as the KwaZulu-Natal acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and bipinnate leaves that are yellowish-green in color. The plant produces yellow flowers in globular or cylindrical inflorescences, which are followed by flat, fibrous pods. It thrives in coastal and sandy soils, often found in coastal forests and shrublands. Acacia litakunensis plays a role in local ecosystems by providing habitat and food for various insects and animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia litakunensis is primarily native to northern Australia, specifically the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions, particularly in the Pilbara and Kimberley areas. This plant thrives in sandy soils and is often associated with spinifex plains and sand dunes. It is well adapted to the harsh climatic conditions of its native habitat. Acacia litakunensis plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia litakunensis was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of northern Australia, particularly in the Northern Territory and Western Australia. This plant is often used for its hardy nature and ability to stabilize soils in degraded landscapes. It has been introduced for purposes such as land rehabilitation and as a source of timber or forage. Due to its adaptability, it has spread beyond its original introduction sites in some parts of its range."
}
