{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riograndensis",
    "plant_slug": "acacia-riograndensis",
    "plant_name_scientific": "acacia riograndensis",
    "intro": "Acacia riograndensis, commonly known as the Rio Grande acacia, is a shrub or small tree native to South America, particularly Brazil. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is known for its distinctive yellow flowers that bloom in clusters, attracting pollinators such as bees and birds. Its bark is often used in traditional medicine, and it plays a role in local ecosystems by providing habitat and food for various wildlife species. Acacia riograndensis is also valued for its hard, durable wood.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riograndensis is primarily native to South America, specifically Brazil, Paraguay, and Argentina. It is commonly found in the regions of the Brazilian Cerrado, the Pampa biome, and the southern parts of Paraguay. This plant thrives in dry to semi-arid environments and is often associated with grasslands and shrublands. It is well adapted to the climate conditions of its native range, including high temperatures and seasonal droughts. Acacia riograndensis plays an important ecological role in its habitat by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia riograndensis was mainly introduced to South America, particularly in Brazil, Paraguay, and Argentina. It was brought there for its potential use in windbreaks and as a source of timber. The plant thrives in dry, sandy soils and is adapted to arid and semi-arid environments. Its introduction has led to its establishment in several regions, sometimes becoming invasive. Due to its rapid growth and ability to colonize disturbed areas, it is now considered a potential ecological concern in some parts of its range."
}
