{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia basedowii",
    "plant_slug": "acacia-basedowii",
    "plant_name_scientific": "acacia basedowii",
    "intro": "Acacia basedowii, commonly known as the West African acacia, is a flowering plant native to tropical regions of Africa. It is a small to medium-sized shrub or tree that typically grows in dry, savannah-like environments. The plant is characterized by its bipinnate leaves, which are often reduced to small, scale-like structures in mature plants. Its yellow flowers are arranged in dense, globular inflorescences, making it visually distinctive. Acacia basedowii is also known for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia basedowii"
    },
    "taxonomy_art_desc": "Acacia basedowii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with bilateral symmetry and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid and tropical regions, known for their phyllodes and often used for timber and medicinal purposes. Its species is Acacia basedowii, a specific type of acacia native to southern Africa, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia basedowii is primarily native to the Northern Territory, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy or rocky soils and is adapted to the harsh environmental conditions of the Australian outback. The plant is part of the legume family and plays a role in stabilizing soil and providing habitat for local wildlife. Its distribution reflects its ability to thrive in dry, nutrient-poor environments across these regions.",
    "distribution_introduced_art_desc": "Acacia basedowii was mainly introduced to areas with well-drained soils and moderate to high rainfall, typically in regions with a warm climate. It thrives in open habitats such as grasslands, woodlands, and disturbed sites. This plant is often found in coastal and inland areas where it can establish itself quickly due to its drought tolerance. Its introduction has been noted in parts of Australia and other regions with similar environmental conditions. However, its spread is limited by soil type and competition with native vegetation."
}
