{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gelasina",
    "plant_slug": "acacia-gelasina",
    "plant_name_scientific": "acacia gelasina",
    "intro": "Acacia gelasina, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in winter. The plant is part of the legume family, Fabaceae, and has a deep root system that helps prevent soil erosion. It thrives in well-drained soils and is often found in coastal and sandy areas. Acacia gelasina is also notable for its ability to fix nitrogen, enriching the soil and supporting other plant life.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gelasina"
    },
    "taxonomy_art_desc": "Acacia gelasina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are typically characterized by having compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive umbrella-like acorn-shaped pods. Its species is Acacia gelasina, a specific type of acacia native to certain regions of Africa, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gelasina is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the southern and western parts of the state. This species thrives in arid and semi-arid environments, often growing in heathlands and woodlands. Its distribution is largely restricted to the southwest and south coast regions of Western Australia. Acacia gelasina is well adapted to the dry climate and nutrient-poor soils typical of its native habitat.",
    "distribution_introduced_art_desc": "Acacia gelasina was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate to high rainfall. It is commonly found in countries such as Australia, Southeast Asia, and parts of Africa. This plant is often used for its hardy nature and ability to thrive in disturbed environments. Its introduction has sometimes led to ecological impacts due to its invasive tendencies in non-native regions. It is valued for its ornamental qualities and potential for soil stabilization."
}
