{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura var. pilbarana",
    "plant_slug": "acacia-aneura-var-pilbarana",
    "plant_name_scientific": "acacia aneura var. pilbarana",
    "intro": "Acacia aneura var. pilbarana, commonly known as the Pilbara acacia, is a shrub or small tree native to the arid regions of Western Australia. It is characterized by its slender, often multi-branched stems and small, grey-green leaves that are usually reduced to spines. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits containing seeds. It is well adapted to harsh, dry environments and is often found in sandy soils. This variety is notable for its ecological importance in providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aneura var. pilbarana is primarily native to the Pilbara region of Western Australia. This variant of the acacia species is found in the arid and semi-arid zones of the northwestern part of the state. It thrives in rocky outcrops and sandy soils, often forming dense shrubs or small trees. The plant is well adapted to the harsh environmental conditions of its native habitat. It plays an important ecological role in the local ecosystem, providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia aneura var. pilbarana was mainly introduced to the Pilbara region of Western Australia. It is commonly found in sandy soils and is often used for stabilizing dunes and preventing soil erosion. This plant is well adapted to arid and semi-arid environments. It has been introduced for its ecological and practical benefits in land rehabilitation projects. Its presence has also contributed to the biodiversity of the region."
}
