{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. linearis",
    "plant_slug": "acacia-longifolia-var-linearis",
    "plant_name_scientific": "acacia longifolia var. linearis",
    "intro": "Acacia longifolia var. linearis, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, linear leaves that are typically 2–5 cm long and 2–4 mm wide. The plant produces yellow flowers in globular clusters, which appear in spring and attract nectar-feeding birds and insects. It thrives in well-drained soils and is often found in coastal areas and sandy soils. This variety is valued for its ornamental appeal and is sometimes used in landscaping and reforestation projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. linearis is primarily native to southern Australia, including the states of South Australia, Western Australia, and Victoria. It is commonly found in coastal regions and sandy soils along the southern coast. This variant is adapted to dry, Mediterranean-type climates and is often associated with heathlands and open woodlands. It is also present in parts of Tasmania and extends into the southern regions of New Zealand. Its distribution is closely linked to areas with well-drained soils and moderate rainfall.",
    "distribution_introduced_art_desc": "Acacia longifolia var. linearis was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was initially brought there for ornamental purposes due to its attractive foliage and hardy nature. However, its rapid growth and ability to outcompete native vegetation have led to ecological concerns. The plant thrives in coastal areas and has spread along the Western and Eastern Cape provinces. Despite its aesthetic appeal, its invasive behavior has prompted management efforts to control its spread."
}
