{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia coriaria",
    "plant_slug": "acacia-coriaria",
    "plant_name_scientific": "acacia coriaria",
    "intro": "Acacia coriaria, commonly known as the Armenian acacia, is a shrub or small tree native to the Caucasus region. It is characterized by its compound leaves, which are often covered in a fine, white pubescence. The plant produces small, yellow flowers that are clustered in spherical inflorescences. It is adapted to arid and semi-arid environments, making it a resilient species in dry climates. The wood of Acacia coriaria is hard and durable, historically used for various practical purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia coriaria is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is also found in parts of the Horn of Africa, including Somalia and Eritrea. This plant typically grows in arid and semi-arid environments, often in coastal areas and along rocky slopes. It is well adapted to hot, dry climates and can tolerate poor soil conditions. Acacia coriaria is commonly found in coastal dunes and is an important component of the local vegetation in these regions.",
    "distribution_introduced_art_desc": "Acacia coriaria was mainly introduced to New Zealand. It was brought there during the 19th century as part of the introduction of exotic plant species for ornamental and agricultural purposes. This plant has since become naturalized and is now commonly found in various habitats across the country. It is particularly prevalent in coastal areas and disturbed soils. However, it is considered a potential weed in some regions due to its rapid growth and ability to spread easily."
}
