{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia umbraculata",
    "plant_slug": "acacia-umbraculata",
    "plant_name_scientific": "acacia umbraculata",
    "intro": "Acacia umbraculata, commonly known as the umbrella acacia, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that provide dense shade, giving it its common name. The plant produces yellow flowers in spikes, which bloom in spring and attract a variety of pollinators. Its wood is hard and durable, making it useful for construction and furniture. Acacia umbraculata is also valued for its ability to thrive in arid conditions, making it an important species in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia umbraculata is primarily native to northern Australia, including regions of Queensland, Western Australia, and the Northern Territory. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This plant thrives in open woodlands and shrublands, often growing along watercourses or in coastal areas. It is well adapted to the hot and dry climate of its native range. Acacia umbraculata plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia umbraculata was mainly introduced to regions with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It has been widely planted in parts of Australia, particularly in Queensland and New South Wales, for soil stabilization and as a source of timber. The plant is also used in reforestation projects because of its rapid growth and ability to fix nitrogen. However, it has become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its introduction has led to both ecological benefits and challenges in certain environments."
}
