{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia daphnifolia",
    "plant_slug": "acacia-daphnifolia",
    "plant_name_scientific": "acacia daphnifolia",
    "intro": "Acacia daphnifolia, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, lace-like appearance. The plant produces yellow globular flowerheads that are highly attractive to pollinators such as bees and birds. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia daphnifolia is also valued for its ornamental qualities and is used in horticulture for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia daphnifolia"
    },
    "taxonomy_art_desc": "Acacia daphnifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acacia-like leaves and often used in traditional medicine. Its species is Acacia daphnifolia, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia daphnifolia is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the Geraldton area. This plant typically grows in sandy or gravelly soils along coastal areas and in open woodlands. It is well adapted to the arid and semi-arid conditions of its native habitat. Acacia daphnifolia is often found in association with other endemic flora in the region.",
    "distribution_introduced_art_desc": "Acacia daphnifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in a variety of soil conditions. It has since spread beyond cultivated areas and is now considered an environmental weed in several regions. The plant's rapid growth and seed dispersal through wind and animals have contributed to its invasive potential. It is particularly problematic in coastal and riparian habitats where it can outcompete native vegetation. Management efforts focus on early detection and control to prevent further spread."
}
