{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica subsp. cupressiformis",
    "plant_slug": "acacia-nilotica-subsp-cupressiformis",
    "plant_name_scientific": "acacia nilotica subsp. cupressiformis",
    "intro": "Acacia nilotica subsp. cupressiformis, commonly known as the Egyptian acacia or the black acacia, is a shrub or small tree native to the Nile Valley and parts of the Sahel. It is characterized by its dense, dark green foliage and thorny branches, which provide habitat for various animals. The plant produces small, yellow flowers followed by long, flat pods containing seeds. It has a deep root system that allows it to thrive in arid and semi-arid environments. The wood is hard and durable, historically used for construction and tool-making.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica subsp. cupressiformis is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of Sudan and the Arabian Peninsula. This subspecies thrives in arid and semi-arid environments, often growing in dry woodlands and savannas. It is well adapted to hot, dry climates with poor soil conditions. Its native range extends into some regions of southern Arabia and northern tropical Africa.",
    "distribution_introduced_art_desc": "Acacia nilotica subsp. cupressiformis was mainly introduced to regions with a tropical and subtropical climate, particularly in parts of Africa, the Middle East, and South Asia. It is commonly found in dry, semi-arid, and coastal areas where it thrives in well-drained soils. This subspecies is often used for its hardy nature, providing shade and soil stabilization in degraded landscapes. Its introduction has been largely for ecological restoration and agroforestry purposes. However, it can become invasive in some areas, outcompeting native vegetation."
}
