{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia velutina var. monadena",
    "plant_slug": "acacia-velutina-var-monadena",
    "plant_name_scientific": "acacia velutina var. monadena",
    "intro": "Acacia velutina var. monadena, commonly known as the silky acacia, is a shrub or small tree native to parts of Africa. It is characterized by its slender, often branching stems covered in a dense layer of silky, white hair. The leaves are compound, with small, oval-shaped leaflets that are also densely hairy. The plant produces yellow flowers in globular inflorescences, which are typically visited by various pollinators. It thrives in arid or semi-arid environments and is often used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia velutina var. monadena is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. This variant is commonly found in rocky outcrops, sandy soils, and open woodlands. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of the Australian outback. The plant is often associated with coastal and inland desert areas, where it plays a role in stabilizing soil and providing habitat for local wildlife. Its distribution is limited to specific ecological zones that match its environmental requirements.",
    "distribution_introduced_art_desc": "Acacia velutina var. monadena was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. This plant is often associated with disturbed habitats such as roadsides, gravel plains, and agricultural areas. Its introduction has led to concerns about its potential invasiveness in local ecosystems. However, it is not currently classified as a major invasive species in the region."
}
