{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latronum subsp. benadirensis",
    "plant_slug": "acacia-latronum-subsp-benadirensis",
    "plant_name_scientific": "acacia latronum subsp. benadirensis",
    "intro": "Acacia latronum subsp. benadirensis, commonly known as the Benadire acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spindly branches and small, trifoliate leaves. The plant produces yellow flowers in globular heads, which are typically visited by a variety of pollinators. It thrives in sandy or rocky soils and is adapted to arid and semi-arid environments. The wood of this species is generally hard and durable, making it useful for local crafts and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latronum subsp. benadirensis is primarily native to the eastern regions of South Africa, specifically occurring in the provinces of KwaZulu-Natal andMpumalanga. This subspecies is commonly found in rocky outcrops, sandstone formations, and dry bushveld habitats. It thrives in areas with well-drained soils and is adapted to semi-arid to arid conditions. The plant is often seen growing on cliffs and in open woodland communities. Its distribution is relatively localized, reflecting its specific ecological requirements.",
    "distribution_introduced_art_desc": "Acacia latronum subsp. benadirensis was mainly introduced to South Africa, particularly in the eastern regions. It is commonly found in areas with sandy soils and is often associated with coastal and inland savanna habitats. This subspecies is known for its ability to thrive in arid and semi-arid environments. It has been used for erosion control and as a source of timber and fodder. However, its introduction has raised concerns about its potential impact on native plant communities."
}
