{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia suaveolens subsp. prostrata",
    "plant_slug": "acacia-suaveolens-subsp-prostrata",
    "plant_name_scientific": "acacia suaveolens subsp. prostrata",
    "intro": "Acacia suaveolens subsp. prostrata, commonly known as the prostrate sweet acacia, is a low-growing shrub native to southern Africa. It features slender, prostrate stems that often root at the nodes, forming dense mats. The plant produces small, yellow, globular flowers arranged in clusters, which are typical of the Acacia genus. Its leaves are bipinnate, with numerous small, linear leaflets. This subspecies is adapted to arid and semi-arid environments, making it resilient to drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia suaveolens subsp. prostrata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This subspecies is commonly found in sandy soils and along riverbanks in these areas. It thrives in environments with low rainfall and high temperatures. The plant is well adapted to harsh conditions, making it a resilient component of local ecosystems. It plays an important role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia suaveolens subsp. prostrata was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly used in rehabilitation projects due to its ability to thrive in arid and semi-arid environments. This subspecies is valued for its rapid growth and tolerance to poor soil conditions. It has been introduced in several regions of Australia and parts of Southeast Asia. However, its spread can sometimes lead to ecological concerns if not managed properly."
}
