{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciopsis sonorensis",
    "plant_slug": "acaciopsis-sonorensis",
    "plant_name_scientific": "acaciopsis sonorensis",
    "intro": "Acaciopsis sonorensis, commonly known as the Sonoran acaciopsis, is a small, shrub-like plant native to the Sonoran Desert in the southwestern United States and northern Mexico. It belongs to the Fabaceae family, which includes legumes, and is characterized by its compound leaves and small, yellow flowers. The plant is adapted to arid environments, with a deep root system that allows it to access water from deeper soil layers. It plays a role in stabilizing sandy soils and providing habitat for small desert organisms. Acaciopsis sonorensis is also known for its ability to fix nitrogen, contributing to soil fertility in nutrient-poor desert regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciopsis sonorensis is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Texas. This species thrives in arid and semi-arid environments, often growing in rocky soils. It is commonly associated with desert scrub and grassland habitats. The plant is well adapted to the harsh climate conditions of its native range.",
    "distribution_introduced_art_desc": "Acaciopsis sonorensis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of the southwestern United States and northern Mexico. This plant is often used for erosion control due to its deep root system and drought tolerance. Its introduction has helped stabilize soils in degraded landscapes. However, it is important to monitor its spread to prevent potential ecological impacts."
}
