{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia karroo var. transvaalensis",
    "plant_slug": "acacia-karroo-var-transvaalensis",
    "plant_name_scientific": "acacia karroo var. transvaalensis",
    "intro": "Acacia karroo var. transvaalensis, commonly known as the Transvaal acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of small, delicate leaflets. The plant produces yellow flowers in globular or cylindrical inflorescences, which are followed by elongated, woody pods. It thrives in arid and semi-arid environments, often found in savannas and rocky areas. The species is valued for its ornamental appeal and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia karroo var. transvaalensis is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in the arid and semi-arid regions of these countries. This variety thrives in sandy soils and is often seen in savannas and shrublands. It is well adapted to the dry climate and can withstand periods of drought. The plant is an important component of the local vegetation and provides habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia karroo var. transvaalensis was mainly introduced to South Africa, where it has been cultivated for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides, particularly in the western and northern parts of the country. This variety is known for its distinctive yellow flowers and its capacity to fix nitrogen, making it beneficial for soil enrichment. However, it has also been reported to naturalize in certain areas, raising concerns about its potential invasiveness. Its introduction has contributed to the biodiversity of local ecosystems, though with some ecological implications."
}
