{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kelleri",
    "plant_slug": "acacia-kelleri",
    "plant_name_scientific": "acacia kelleri",
    "intro": "Acacia kelleri, commonly known as the desert wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, wiry stems and small, fern-like leaves that help reduce water loss in hot, dry environments. The plant produces yellow flowers in clustered spikes, which attract pollinators such as bees and birds. Its seed pods are woody and contain numerous small, hard seeds. Acacia kelleri is adapted to survive in nutrient-poor soils and can go for long periods without rainfall.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia kelleri"
    },
    "taxonomy_art_desc": "Acacia kelleri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes plants with flowers that have a distinctive structure and often contain legumes as fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and acacia-like leaves. Its species is Acacia kelleri, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kelleri is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy or rocky soils and is well adapted to the harsh climatic conditions of its native range. It is often seen in shrublands and along riverbanks in its natural habitat. Acacia kelleri plays an important ecological role in supporting local wildlife and stabilizing soil in its environment.",
    "distribution_introduced_art_desc": "Acacia kelleri was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in harsh environmental conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has helped restore degraded lands in several parts of Africa and the Middle East. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
