{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farnesiana",
    "plant_slug": "acacia-farnesiana",
    "plant_name_scientific": "acacia farnesiana",
    "intro": "Acacia farnesiana, commonly known as the mimosa tree, is a deciduous shrub or small tree native to the Americas. It is characterized by its feathery, bipinnate leaves that close when touched, a response triggered by touch-sensitive tendrils. The plant produces yellow to orange globular flower heads, which are followed by flat, pod-like fruits containing seeds. It thrives in well-drained soils and is often found in arid or semi-arid regions. The plant is also known for its ability to fix nitrogen, making it beneficial in soil enrichment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Santalales",
        "family": "Loranthaceae",
        "genus": "Tapinanthus",
        "species": "Tapinanthus bangwensis"
    },
    "taxonomy_art_desc": "Acacia farnesiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Santalales, which consists of plants that often have parasitic or hemiparasitic relationships with other plants. Its family is Loranthaceae, commonly known as the mistletoe family, which includes parasitic plants that attach to host trees. Its genus is Tapinanthus, a group of flowering plants that are typically hemiparasitic and have small, clustered leaves. Its species is Tapinanthus bangwensis, a specific type of mistletoe native to certain regions of Africa, known for its parasitic lifestyle and unique ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Benin",
        "Burkina",
        "Cameroon",
        "Central African Republic",
        "Chad",
        "DR Congo",
        "Gabon",
        "Gambia",
        "Guinea",
        "Guinea-Bissau",
        "Gulf of Guinea Is.",
        "Ivory Coast",
        "Liberia",
        "Mauritania",
        "Senegal",
        "Togo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farnesiana is primarily native to Benin, Burkina, Cameroon, Central African Republic, Chad, DR Congo, Gabon, Gambia, Guinea, Guinea-Bissau, Gulf of Guinea Is., Ivory Coast, Liberia, Mauritania, Senegal, and Togo. It is commonly found in tropical and subtropical regions across these countries. The plant thrives in open habitats such as savannas, woodlands, and along riverbanks. It is well adapted to dry and semi-arid environments. Its distribution spans much of sub-Saharan Africa, where it plays an important ecological role.",
    "distribution_introduced_art_desc": "Acacia farnesiana was mainly introduced to the southern United States, particularly in Texas and California, as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since spread beyond its original introduction range, becoming naturalized in various parts of the southwestern United States. The plant is also found in other regions where it has been introduced, such as parts of Australia and the Mediterranean. Its rapid growth and ability to colonize disturbed areas have led to concerns about its invasive potential in some ecosystems. Despite its ornamental value, Acacia farnesiana can outcompete native vegetation and alter local habitats."
}
