{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paraguariensis",
    "plant_slug": "acacia-paraguariensis",
    "plant_name_scientific": "acacia paraguariensis",
    "intro": "Acacia paraguariensis, commonly known as yerba mate, is a shrub or small tree native to South America, particularly Brazil, Paraguay, and Argentina. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is well-known for its caffeine-containing leaves, which are used to make a traditional infusion. Its ability to fix nitrogen through root nodules makes it an important plant in soil enrichment. Acacia paraguariensis thrives in tropical and subtropical climates, often found in humid forests and along riverbanks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paraguariensis is primarily native to South America, particularly in the regions of Paraguay, Brazil, and Argentina. It is commonly found in the subtropical and tropical areas of these countries. This plant thrives in open woodlands, savannas, and along riverbanks. It is well adapted to the dry and semi-arid climates of its native habitat. Acacia paraguariensis is also known as \"mate\" and is widely used for its leaves in traditional tea preparation.",
    "distribution_introduced_art_desc": "Acacia paraguariensis was mainly introduced to South America, particularly in Brazil, Argentina, and Paraguay, where it has become naturalized in certain regions. It is commonly found in disturbed areas, along roadsides, and in degraded forests due to its adaptability to various soil types. The plant is often used for its edible seeds and has cultural significance in some local communities. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems. It is also valued for its nitrogen-fixing ability, which can improve soil fertility."
}
