{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hirtella var. inermis",
    "plant_slug": "acacia-hirtella-var-inermis",
    "plant_name_scientific": "acacia hirtella var. inermis",
    "intro": "Acacia hirtella var. inermis, commonly known as the silky acacia, is a shrub native to the arid and semi-arid regions of southern Africa. It is characterized by its slender, often branched stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces small, yellow to golden flowers arranged in compact, cylindrical inflorescences. It thrives in well-drained soils and is adapted to withstand drought conditions. The silky acacia is often used in traditional medicine and as a source of fuelwood in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hirtella var. inermis is primarily native to the arid and semi-arid regions of Australia, particularly in the northern and central parts of the country. This variety is commonly found in the Northern Territory, Western Australia, and Queensland. It thrives in sandy soils and is often associated with rocky outcrops and dry shrublands. The plant is well adapted to hot, dry climates and can tolerate periods of drought. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia hirtella var. inermis was mainly introduced to areas with well-drained soils and a temperate climate, typically found in regions of southern Australia. It thrives in full sun and is commonly found in coastal and inland areas where it can establish itself in disturbed or open habitats. This plant is often used in landscaping due to its hardy nature and attractive foliage. However, it can become invasive in certain environments if not managed properly. Its distribution is largely limited by climate conditions and human activity."
}
