{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acachmena krynkensis",
    "plant_slug": "acachmena-krynkensis",
    "plant_name_scientific": "acachmena krynkensis",
    "intro": "Acachmena krynkensis, commonly known as the Krynkens' acachmena, is a rare flowering plant native to the tropical rainforests of Southeast Asia. It belongs to the family Sapotaceae and is characterized by its glossy, elliptical leaves and small, fragrant white flowers. The plant produces a unique, spherical fruit that contains a single seed enclosed in a fleshy, yellow pulp. It thrives in humid, shaded environments and requires well-drained, nutrient-rich soil. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acachmena krynkensis is primarily native to the eastern regions of the Democratic Republic of the Congo. It is found in the dense tropical rainforests of this area, where it thrives in the humid and warm climate. The plant is commonly associated with the understory vegetation in these forests, growing along the forest floor and in shaded areas. It is known for its unique leaf structure and is often found in association with other endemic flora of the region. Due to habitat loss, its distribution is becoming increasingly restricted.",
    "distribution_introduced_art_desc": "Acachmena krynkensis was mainly introduced to areas with tropical and subtropical climates, particularly in regions with high humidity and well-drained soils. It is commonly found in coastal and lowland areas where it thrives in warm, moist environments. The plant has been introduced to several islands in the Pacific and parts of Southeast Asia. It is often cultivated for its ornamental value due to its attractive foliage and flowers. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
