{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia somnians",
    "plant_slug": "acacia-somnians",
    "plant_name_scientific": "acacia somnians",
    "intro": "Acacia somnians, commonly known as the weeping acacia, is a deciduous shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its long, pendulous branches that droop gracefully, giving it a distinctive appearance. The plant produces small, yellow flowers that bloom in clusters, attracting various pollinators such as bees and birds. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia somnians is also known for its ability to thrive in harsh environments, making it an important species in ecological restoration efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia somnians is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is also found in parts of the Horn of Africa, including Somalia and Eritrea. This plant typically grows in arid and semi-arid regions, often in rocky or coastal areas. It is well adapted to the hot and dry climate of its native habitat. Acacia somnians is commonly found in coastal dunes and along the edges of deserts.",
    "distribution_introduced_art_desc": "Acacia somnians was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, parts of Africa, and the Middle East. The plant is often used for its nitrogen-fixing properties, which improve soil fertility. It also serves as a source of food for wildlife and has traditional medicinal uses. However, its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments."
}
