{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia claussenii",
    "plant_slug": "acacia-claussenii",
    "plant_name_scientific": "acacia claussenii",
    "intro": "Acacia claussenii, commonly known as the Cape York acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow flowers in globular or cylindrical clusters, which are followed by flat, leathery pods. It thrives in arid and semi-arid environments, showing drought tolerance and adapted growth forms. Acacia claussenii is often found in coastal and inland regions, contributing to local biodiversity and ecological stability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia claussenii is primarily native to South Africa, specifically the Eastern Cape province. It is commonly found in rocky outcrops and coastal areas along the southeastern coast. This species thrives in dry, sandy soils and is often associated with fynbos vegetation. It is also known to occur in parts of KwaZulu-Natal and the Western Cape. Acacia claussenii is well adapted to the Mediterranean climate of the region, with periods of drought and mild, wet winters.",
    "distribution_introduced_art_desc": "Acacia claussenii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coast and in coastal dunes. The plant is adapted to arid and semi-arid environments, making it resilient to drought conditions. It is often used in landscaping due to its hardy nature and attractive foliage. However, its spread can sometimes lead to competition with native vegetation in invaded areas."
}
