{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pycnophylla var. angustifolia",
    "plant_slug": "acacia-pycnophylla-var-angustifolia",
    "plant_name_scientific": "acacia pycnophylla var. angustifolia",
    "intro": "Acacia pycnophylla var. angustifolia, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It belongs to the Fabaceae family and is characterized by its narrow, feathery leaves. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It is adapted to arid and semi-arid environments, making it drought-tolerant. The wood of this species is hard and durable, often used in traditional crafts and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pycnophylla var. angustifolia is primarily native to eastern Australia, including parts of Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry forest, woodland, and heathland environments. This variety thrives in well-drained soils and is often associated with sclerophyllous vegetation. It is well adapted to the seasonal rainfall patterns of its native region. The plant is an important component of the local ecosystems, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia pycnophylla var. angustifolia was mainly introduced to South Africa, where it has been established in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in coastal and mountainous areas. This variety is known for its narrow leaves and is often used in ornamental horticulture due to its aesthetic appeal. However, it has also been reported to spread into natural vegetation, raising concerns about its potential invasiveness. Its introduction is primarily attributed to human activities such as gardening and land clearing."
}
