{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia everistii",
    "plant_slug": "acacia-everistii",
    "plant_name_scientific": "acacia everistii",
    "intro": "Acacia everistii, commonly known as the everistii acacia, is a flowering plant native to East Africa. It is a shrub or small tree that can grow up to 5 meters in height, characterized by its slender, branching structure. The plant produces yellow flowers in dense, spherical clusters, which are typically visited by bees and other pollinators. Its leaves are bipinnate, consisting of numerous small, feather-like leaflets, and it has a woody, fibrous trunk. Acacia everistii is adapted to arid and semi-arid environments, making it a resilient species in regions with low rainfall.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia everistii"
    },
    "taxonomy_art_desc": "Acacia everistii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing ability through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their characteristic phyllodes and ability to thrive in harsh environments. Its species is Acacia everistii, a specific type of acacia found in certain regions of Africa, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia everistii is primarily native to Queensland. It is found in the northern regions of the state, particularly in the Cape York Peninsula and surrounding areas. This species thrives in tropical and subtropical environments, often in sandy or rocky soils. It is commonly associated with coastal and inland dry forests. Acacia everistii plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia everistii was mainly introduced to areas with dry and semi-arid climates, particularly in regions where it can thrive in poor soils. It is commonly found in parts of East Africa, including Kenya, Tanzania, and Uganda. This plant is often used for its hardy nature and ability to provide shade and forage for livestock. Its introduction has been both intentional and accidental, often through human activities such as land clearing and agriculture. However, its spread can sometimes lead to ecological imbalances in native ecosystems."
}
