{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bella",
    "plant_slug": "acacia-bella",
    "plant_name_scientific": "acacia bella",
    "intro": "Acacia bella, commonly known as the silver wattle, is a small shrub native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, fern-like appearance. The plant produces yellow flowers in winter, which are clustered in spherical inflorescences. It thrives in well-drained soils and is often found in coastal regions and sandy soils. Acacia bella is valued for its ornamental beauty and is sometimes cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bella is primarily native to the eastern and southeastern regions of Australia. It is commonly found in coastal areas, heathlands, and sandy soils. This species thrives in temperate to subtropical climates and is often associated with coastal dunes and open woodlands. It is also present in parts of New Zealand, where it has been introduced. The plant is well adapted to dry conditions and can tolerate salt spray, making it a resilient species in its native habitat.",
    "distribution_introduced_art_desc": "Acacia bella was mainly introduced to areas with well-drained soils and full sun exposure, often in disturbed or degraded landscapes. It thrives in arid and semi-arid regions, making it a common invader in native grasslands and shrublands. Its rapid growth and ability to fix nitrogen give it a competitive advantage over native plants. The plant is often spread through seed dispersal by wind, animals, or human activity. Due to its invasive nature, it can significantly alter local ecosystems and reduce biodiversity."
}
