{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia orthotricha",
    "plant_slug": "acacia-orthotricha",
    "plant_name_scientific": "acacia orthotricha",
    "intro": "Acacia orthotricha, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in globular clusters. The plant is adapted to arid and semi-arid environments, with a deep root system that helps it survive in dry conditions. Its flowers attract a variety of pollinators, including bees and birds. The wood of Acacia orthotricha is hard and durable, making it useful for timber and fuel.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia orthotricha"
    },
    "taxonomy_art_desc": "Acacia orthotricha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex life cycles involving alternation of generations. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their vascular systems and often ancient evolutionary origins. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinct structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are widespread in Australia and characterized by their phyllodes and often yellow flowers. Its species is Acacia orthotricha, a specific type of acacia found in certain regions, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia orthotricha is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This species typically grows in sandy or rocky soils, often in open woodlands or shrublands. It is well adapted to the harsh climatic conditions of its native range. The plant plays an important ecological role in its habitat by providing food and shelter for local wildlife.",
    "distribution_introduced_art_desc": "Acacia orthotricha was mainly introduced to areas with well-drained soils and a temperate climate, typically in regions with mild winters and warm, dry summers. It thrives in open woodlands and rocky slopes, where it can receive ample sunlight. This plant is often found in areas with low to moderate rainfall, making it adaptable to a range of environmental conditions. Its introduction has been associated with both ornamental horticulture and ecological restoration efforts. However, it is important to monitor its spread to prevent potential invasiveness in non-native habitats."
}
