{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica var. tomentosa",
    "plant_slug": "acacia-nilotica-var-tomentosa",
    "plant_name_scientific": "acacia nilotica var. tomentosa",
    "intro": "Acacia nilotica var. tomentosa, commonly known as the white acacia, is a shrub or small tree native to Africa and the Arabian Peninsula. It is characterized by its slender, grayish-green branches and small, yellow, globular flowers that appear in clusters. The leaves are bipinnate, consisting of numerous tiny leaflets, and the plant produces long, slender pods that contain seeds. It thrives in arid and semi-arid environments, often growing on rocky soils. The plant is known for its ability to fix nitrogen, making it valuable for soil enrichment in degraded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica var. tomentosa is primarily native to parts of Africa, the Arabian Peninsula, and the Indian subcontinent. It is commonly found in arid and semi-arid regions, including countries such as Sudan, Eritrea, Somalia, and parts of India. This variant thrives in dry climates with well-drained soils, often growing in savannas and along riverbanks. It is well adapted to harsh environmental conditions, making it a resilient species in its native range. The plant is also occasionally found in southern Arabia and northern parts of the Middle East.",
    "distribution_introduced_art_desc": "Acacia nilotica var. tomentosa was mainly introduced to areas with semi-arid to arid climates, particularly in regions of Africa, the Middle East, and parts of South Asia. It is commonly found in countries such as Sudan, Ethiopia, and India, where it thrives in well-drained soils. This plant is often used for its hardy nature, providing shade and fodder for livestock. Its introduction has sometimes led to ecological impacts, including competition with native species. Despite its benefits, it is considered an invasive species in some regions due to its rapid spread and adaptability."
}
