{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia filicicoma var. tenuior",
    "plant_slug": "acacia-filicicoma-var-tenuior",
    "plant_name_scientific": "acacia filicicoma var. tenuior",
    "intro": "Acacia filicicoma var. tenuior, commonly known as the slender-leaved acacia, is a shrub native to southern Africa. It is characterized by its narrow, feathery leaves that give it a delicate appearance. The plant produces yellow flowers in spikes, which are often visited by bees and other pollinators. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Its unique foliage and ornamental value make it a popular choice for drought-tolerant landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia filicicoma var. tenuior is primarily native to eastern Australia, specifically Queensland and New South Wales. It is commonly found in dry rainforest and coastal heathland ecosystems. This variety is adapted to well-drained soils and can thrive in areas with moderate to high rainfall. It is often found in association with other sclerophyllous plants. The species is also occasionally reported in the northern parts of Victoria.",
    "distribution_introduced_art_desc": "Acacia filicicoma var. tenuior was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with mild winters and hot, dry summers. It is commonly cultivated in gardens and landscapes for its ornamental value, particularly its feathery foliage and yellow flowers. This plant is well-suited for coastal and urban environments due to its tolerance of salty air and compact growth habit. It has been introduced to several parts of the United States, including California and Florida, where it thrives in sunny, open spaces. However, its invasive potential in some regions has led to its limited use in certain ecological restoration projects."
}
