{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia michelii",
    "plant_slug": "acacia-michelii",
    "plant_name_scientific": "acacia michelii",
    "intro": "Acacia michelii, commonly known as the Michel's acacia, is a small to medium-sized evergreen shrub or tree native to South Africa. It is characterized by its narrow, lance-shaped leaves that are often glandular and have a distinctive, aromatic scent. The plant produces yellow, globular flowers that bloom in winter, attracting a variety of pollinators. Acacia michelii is adapted to dry, sandy soils and is often found in coastal and inland fynbos vegetation. Its ecological importance includes providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia michelii is primarily native to Madagascar. It is found in the dry and humid regions of the island, particularly in the southern and western parts. This species thrives in a variety of habitats, including dry forests, coastal areas, and degraded landscapes. It is well adapted to the tropical climate of Madagascar, often growing in sandy or rocky soils. Due to its ecological importance, it plays a significant role in the local biodiversity and traditional practices of the region.",
    "distribution_introduced_art_desc": "Acacia michelii was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally native to Australia but was brought to South Africa for ornamental purposes due to its attractive foliage and ability to thrive in arid conditions. However, its rapid growth and competitive nature have led to its spread beyond cultivated areas, impacting native vegetation. The plant is now considered a weed in some parts of South Africa, particularly in the Western Cape and Eastern Cape provinces. Efforts are being made to control its spread through mechanical and chemical means."
}
