{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catechu var. wallichiana",
    "plant_slug": "acacia-catechu-var-wallichiana",
    "plant_name_scientific": "acacia catechu var. wallichiana",
    "intro": "Acacia catechu var. wallichiana, commonly known as the Indian blackwood, is a deciduous tree native to the Himalayas and parts of Southeast Asia. It is characterized by its slender, straight trunk and bipinnate leaves that are dark green and glossy. The plant produces small, yellowish flowers followed by flat, pod-like fruits containing dark brown seeds. It is valued for its hard, dense wood, which is used in traditional crafts and as a source of tannins. The species is also known for its ecological importance in providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catechu var. wallichiana is primarily native to the Indian subcontinent, including regions of India, Nepal, and Bhutan. It is commonly found in tropical and subtropical areas, particularly in moist evergreen forests and along riverbanks. This variety thrives in humid climates with well-drained soils, often growing at elevations ranging from 300 to 1,500 meters. It is an important species in traditional medicine and is also valued for its hard, heavy wood. The plant plays a significant ecological role in supporting local biodiversity and soil stability.",
    "distribution_introduced_art_desc": "Acacia catechu var. wallichiana was mainly introduced to regions with tropical and subtropical climates where it can thrive in well-drained soils. It is commonly found in areas of Southeast Asia, including parts of India, Myanmar, and Thailand. This plant is often cultivated for its hard, durable wood and its use in traditional medicine. Its introduction has also contributed to local ecosystems by providing habitat and food for various wildlife species. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
