{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia improcera",
    "plant_slug": "acacia-improcera",
    "plant_name_scientific": "acacia improcera",
    "intro": "Acacia improcera, commonly known as the giant acacia or umbrella thorn acacia, is a large, deciduous tree native to eastern and southern Africa. It is characterized by its thick, flaky bark and long, straight branches that form a wide, umbrella-like canopy. The tree produces yellow flowers in clusters, which are followed by flat, bean-like pods containing edible seeds. Its leaves are bipinnate, consisting of numerous small, oval leaflets, and it is often found in savanna and woodland habitats. Acacia improcera is adapted to arid environments and plays an important role in providing shade and habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia improcera"
    },
    "taxonomy_art_desc": "Acacia improcera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is known for its primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities, such as beans and peas. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic pod fruits and often nitrogen-fixing symbiotic relationships. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive umbrella-shaped acacia flowers and often used in traditional medicine. Its species is Acacia improcera, a specific type of acacia found in Africa, known for its long, straight thorns and its use in local communities for various purposes.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia improcera is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the southern and central parts. This plant thrives in sandy soils and is often seen along roadsides and in open woodlands. It is well adapted to the harsh climate of Western Australia, with its deep root system allowing it to access water from deeper underground. Acacia improcera plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia improcera was mainly introduced to regions with arid or semi-arid climates due to its adaptability to harsh environmental conditions. It is commonly found in savannas and open woodlands where it can thrive with minimal water and nutrient requirements. The plant is often used for soil stabilization and as a source of timber and firewood in its native range. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native vegetation. Despite these challenges, it remains an important species in both ecological and economic contexts."
}
