{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica",
    "plant_slug": "acacia-nilotica",
    "plant_name_scientific": "acacia nilotica",
    "intro": "Acacia nilotica, commonly known as the Sudanese acacia or the devil's tree, is a deciduous shrub or small tree native to Africa and the Arabian Peninsula. It is characterized by its long, flat, greenish-gray phyllodes that are often mistaken for leaves. The plant produces yellow flower spikes during the dry season, which are followed by woody pods containing flat, oval seeds. Acacia nilotica is well adapted to arid environments and is often found in savannas and along riverbanks. Its bark and wood have been traditionally used for various purposes, including tanning leather and making tools.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Vachellia",
        "species": "Vachellia nilotica"
    },
    "taxonomy_art_desc": "Acacia nilotica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Vachellia, a group of flowering plants native to Africa and the Arabian Peninsula, often referred to as acacia due to their similar appearance. Its species is Vachellia nilotica, a shrub or small tree native to Africa and the Middle East, known for its thorny stems and yellow flowers, often used in traditional medicine and as a source of gum arabic.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Algeria",
        "Angola",
        "Assam",
        "Bangladesh",
        "Benin",
        "Botswana",
        "Burkina",
        "Cameroon",
        "Cape Verde",
        "Caprivi Strip",
        "Central African Republic",
        "Chad",
        "Djibouti",
        "East Himalaya",
        "Egypt",
        "Eritrea",
        "Eswatini",
        "Ethiopia",
        "Gambia",
        "Ghana",
        "Guinea",
        "Guinea-Bissau",
        "Gulf States",
        "India",
        "Iran",
        "Kenya",
        "KwaZulu-Natal",
        "Libya",
        "Malawi",
        "Mali",
        "Mauritania",
        "Mozambique",
        "Myanmar",
        "Namibia",
        "Nepal",
        "Niger",
        "Nigeria",
        "Northern Provinces",
        "Oman",
        "Pakistan",
        "Saudi Arabia",
        "Senegal",
        "Somalia",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Tanzania",
        "Togo",
        "Uganda",
        "West Himalaya",
        "Yemen",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Andaman Is.",
        "Argentina Northeast",
        "Bahamas",
        "Bolivia",
        "California",
        "Cuba",
        "Ecuador",
        "Galápagos",
        "Gulf of Guinea Is.",
        "Iraq",
        "Jamaica",
        "Leeward Is.",
        "Madagascar",
        "Mauritius",
        "Mexico Central",
        "Mexico Southwest",
        "New Caledonia",
        "New Guinea",
        "Northern Territory",
        "Peru",
        "Puerto Rico",
        "Queensland",
        "Rodrigues",
        "South Australia",
        "Trinidad-Tobago",
        "Western Australia",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Acacia nilotica is primarily native to Algeria, Angola, Assam, Bangladesh, Benin, Botswana, Burkina, Cameroon, Cape Verde, Caprivi Strip, Central African Republic, Chad, Djibouti, East Himalaya, Egypt, Eritrea, Eswatini, Ethiopia, Gambia, Ghana, Guinea, Guinea-Bissau, Gulf States, India, Iran, Kenya, KwaZulu-Natal, Libya, Malawi, Mali, Mauritania, Mozambique, Myanmar, Namibia, Nepal, Niger, Nigeria, Northern Provinces, Oman, Pakistan, Saudi Arabia, Senegal, Somalia, Sri Lanka, Sudan-South Sudan, Tanzania, Togo, Uganda, West Himalaya, Yemen, Zambia, and Zimbabwe. It thrives in arid and semi-arid regions, often found in savannas, woodlands, and along riverbanks. This species is well adapted to hot and dry climates, making it a common sight in many parts of Africa and South Asia. It is also known for its hardy nature and ability to withstand poor soil conditions. Acacia nilotica plays an important ecological and economic role in the regions where it is native.",
    "distribution_introduced_art_desc": "Acacia nilotica was mainly introduced to the listed regions for its ecological, economic, and ornamental value. It has been established in diverse environments such as the Andaman Islands, Argentina Northeast, and the Bahamas. The plant thrives in tropical and subtropical climates, making it suitable for areas like California, Cuba, and New Guinea. Its introduction has led to its naturalization in regions such as the Galápagos, Queensland, and Western Australia. However, in some areas, it has become an invasive species, posing challenges to native ecosystems."
}
