{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heterochroa subsp. heterochroa",
    "plant_slug": "acacia-heterochroa-subsp-heterochroa",
    "plant_name_scientific": "acacia heterochroa subsp. heterochroa",
    "intro": "Acacia heterochroa subsp. heterochroa, commonly known as the yellow acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in dense, globular heads, which are typically arranged in clusters along the stems. Its wood is light, durable, and has been traditionally used for various purposes. The species is adapted to arid and semi-arid environments, making it a resilient component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia heterochroa"
    },
    "taxonomy_art_desc": "Acacia heterochroa subsp. heterochroa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of plants with distinctive flowers and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found primarily in arid regions, known for their thorn-like stems and compound leaves. Its species is Acacia heterochroa, a specific type of acacia that is distinguished by its unique leaf and flower structures, typically found in specific geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heterochroa subsp. heterochroa is primarily native to Western Australia. It is found in the southern and southwestern regions of the state. This subspecies thrives in dry, sandy soils and is commonly associated with coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia heterochroa subsp. heterochroa was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for stabilizing soils and preventing erosion due to its deep root system. It is also valued for its ability to provide shade and forage for livestock. However, its introduction has sometimes led to the displacement of native flora in certain ecosystems."
}
