{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia deanei subsp. paucijuga",
    "plant_slug": "acacia-deanei-subsp-paucijuga",
    "plant_name_scientific": "acacia deanei subsp. paucijuga",
    "intro": "Acacia deanei subsp. paucijuga, commonly known as the slender acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched structure and phyllodes that are linear to narrowly elliptic. The plant produces yellow flowers in globular or cylindrical inflorescences, typically during the warmer months. Its leaves are reduced to phyllodes, a common adaptation in acacia species to reduce water loss. The plant is often found in rocky or sandy soils and is adapted to arid or semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia deanei"
    },
    "taxonomy_art_desc": "Acacia deanei subsp. paucijuga belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are found primarily in Africa, Australia, and Asia. Its species is Acacia deanei, a specific type of acacia that includes the subspecies paucijuga, which is distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia deanei subsp. paucijuga is primarily native to New South Wales and Victoria. This subspecies is found in the eastern regions of Australia, particularly in areas with dry to semi-arid conditions. It typically grows in open woodlands and grasslands, often on sandy or loamy soils. The plant is well adapted to the climate of these regions, thriving in areas with low rainfall. Its distribution is limited to specific habitats within these two states.",
    "distribution_introduced_art_desc": "Acacia deanei subsp. paucijuga was mainly introduced to Australia as a potential ornamental and forage plant due to its hardy nature and ability to thrive in arid conditions. It was also considered for reforestation and land stabilization projects because of its deep root system and nitrogen-fixing capabilities. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its benefits, its spread has been limited by environmental factors and management practices. Overall, it remains a plant of interest for both ecological and agricultural research."
}
