{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pelloiae",
    "plant_slug": "acacia-pelloiae",
    "plant_name_scientific": "acacia pelloiae",
    "intro": "Acacia pelloiae, commonly known as the slender wattle, is a shrub native to the coastal regions of southern Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features slender, often spiny stems and small, bipinnate leaves that are typically gray-green in color. Its flowers are yellow and arranged in racemes, attracting nectar-feeding birds and insects. Acacia pelloiae is adapted to sandy soils and can tolerate salt spray, making it a hardy coastal species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pelloiae is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often in association with other drought-tolerant flora. This species is adapted to hot, dry climates and can thrive in areas with low annual rainfall. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Acacia pelloiae is also known for its distinctive yellow flowers, which bloom during the rainy season.",
    "distribution_introduced_art_desc": "Acacia pelloiae was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It was first recorded in the early 20th century and has since spread across various regions of the country. Despite its aesthetic value, it has become invasive in some areas, outcompeting native vegetation. The plant thrives in a variety of soil types and can tolerate both dry and wet conditions. Its rapid growth and ability to form dense thickets have raised concerns among conservationists."
}
