{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ceratonia",
    "plant_slug": "acacia-ceratonia",
    "plant_name_scientific": "acacia ceratonia",
    "intro": "Acacia ceratonia, commonly known as the sickle acacia, is a shrub or small tree native to the Arabian Peninsula and parts of the Middle East. It is characterized by its compound leaves, which are typically pinnate with 6 to 12 pairs of oval-shaped leaflets. The plant produces yellow flowers that are clustered in dense inflorescences, followed by flat, bean-like pods containing seeds. It is adapted to arid environments and has a deep root system that allows it to thrive in dry conditions. The plant is also valued for its ecological role in providing habitat and food for various desert species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ceratonia is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky, and coastal areas, often found in scrublands and maquis vegetation. This plant is well adapted to arid and semi-arid climates, with its deep root system allowing it to access water from deeper soil layers. It is commonly found in countries such as Spain, France, Italy, Morocco, and Turkey. The species is also known as the \"Babul tree\" and has been historically used for its timber and medicinal properties.",
    "distribution_introduced_art_desc": "Acacia ceratonia was mainly introduced to regions with semi-arid to arid climates, where it thrives in well-drained soils. It has been widely planted for its hardy nature and ability to withstand drought conditions. This plant is often used for land stabilization and as a source of timber and fodder. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain areas. It is commonly found in parts of Australia, the Middle East, and North Africa."
}
