{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia granulosa",
    "plant_slug": "acacia-granulosa",
    "plant_name_scientific": "acacia granulosa",
    "intro": "Acacia granulosa, commonly known as the rough wattle, is a shrub or small tree native to Australia. It is characterized by its yellow flowers and compound leaves with small, rounded leaflets. The plant produces pods that contain seeds, which are often used in traditional Aboriginal practices. It thrives in arid and semi-arid environments, demonstrating adaptability to harsh conditions. Its ecological role includes providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia granulosa is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils and open woodlands. This species thrives in environments with low rainfall and high temperatures. It is often associated with coastal areas and is sometimes found in sand dunes. Acacia granulosa is well adapted to the harsh conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia granulosa was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions of Australia and parts of Southeast Asia. It is commonly found in sandy or gravelly soils, often along coastal areas or in open woodlands. This plant is well adapted to arid environments and can thrive with minimal water requirements. Its introduction has been primarily for ornamental purposes due to its attractive foliage and ability to provide shade. However, it has also been noted to spread aggressively in certain regions, raising concerns about its potential as an invasive species."
}
