{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pygmaea",
    "plant_slug": "acacia-pygmaea",
    "plant_name_scientific": "acacia pygmaea",
    "intro": "Acacia pygmaea, commonly known as the dwarf acacia, is a small shrub native to Australia. It belongs to the Fabaceae family and is characterized by its small, leathery leaves and yellow flowers. The plant produces pods that contain edible seeds, which are often used in traditional Aboriginal diets. Acacia pygmaea is adapted to arid environments and is often found in sandy soils. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pygmaea"
    },
    "taxonomy_art_desc": "Acacia pygmaea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and ability to thrive in arid environments. Its species is Acacia pygmaea, a small shrub native to Australia, recognized for its compact size and unique ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pygmaea is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils and coastal environments. This species thrives in Mediterranean climate zones characterized by hot, dry summers and mild, wet winters. It is often seen in heathlands and coastal dunes, where it plays a vital role in local ecosystems. Due to its adaptability, it is also sometimes cultivated in gardens and for erosion control.",
    "distribution_introduced_art_desc": "Acacia pygmaea was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of timber and fuel. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native species. Despite these challenges, it remains an important component of certain ecosystems in its introduced range."
}
