{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flexifolia",
    "plant_slug": "acacia-flexifolia",
    "plant_name_scientific": "acacia flexifolia",
    "intro": "Acacia flexifolia, commonly known as the weeping acacia, is a shrub or small tree native to southern Africa. It is characterized by its drooping branches and yellow flowers that bloom in late winter to early spring. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. Acacia flexifolia thrives in well-drained soils and is often found in coastal and sandy regions. It is valued for its ornamental appeal and ability to provide habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia flexifolia"
    },
    "taxonomy_art_desc": "Acacia flexifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often found in tropical and temperate regions. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their acicular leaves and often used for timber or ornamental purposes. Its species is Acacia flexifolia, a specific type of acacia known for its flexible branches and is often found in arid and semi-arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flexifolia is primarily native to New South Wales, Queensland, and Victoria. This species is commonly found in the arid and semi-arid regions of these states. It thrives in sandy soils and is often seen along roadsides and in open woodlands. The plant is well adapted to the harsh climatic conditions of the region. Its distribution reflects its ability to survive in low-nutrient environments.",
    "distribution_introduced_art_desc": "Acacia flexifolia was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its rapid growth and hardy nature make it suitable for landscaping and afforestation efforts. However, it can become invasive in certain environments if not managed properly."
}
