{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia seyal var. lescrauwaetii",
    "plant_slug": "acacia-seyal-var-lescrauwaetii",
    "plant_name_scientific": "acacia seyal var. lescrauwaetii",
    "intro": "Acacia seyal var. lescrauwaetii, commonly known as the yellow acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are usually reduced to small, scale-like structures. The plant produces yellow to orange spherical flower heads, which are clustered in dense, rounded inflorescences. It is well adapted to drought conditions, with deep root systems that allow it to access water from deeper soil layers. The bark and wood of this acacia are often used in traditional medicine and for making charcoal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia seyal var. lescrauwaetii is primarily native to the Horn of Africa, specifically Somalia and Ethiopia. This variant is commonly found in arid and semi-arid regions, thriving in sandy soils and rocky landscapes. It is often associated with coastal areas and dry savannas, where it plays a significant ecological role. The plant is well adapted to high temperatures and low rainfall, making it a resilient component of the local flora. Its distribution is closely linked to the specific environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia seyal var. lescrauwaetii was mainly introduced to areas with arid and semi-arid climates, particularly in regions of Africa and the Middle East. It is commonly found in countries such as Sudan, Eritrea, and parts of Saudi Arabia. This plant thrives in sandy or rocky soils and is often used for soil stabilization and as a source of timber. Its introduction has had both ecological and economic impacts, including competition with native vegetation. Due to its adaptability, it has become an important species in reforestation and land rehabilitation projects."
}
