{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elongata var. dilatata",
    "plant_slug": "acacia-elongata-var-dilatata",
    "plant_name_scientific": "acacia elongata var. dilatata",
    "intro": "Acacia elongata var. dilatata, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It features slender, often twisted stems and narrow, bipinnate leaves that give it a distinctive appearance. The plant produces yellow globular flowers in late winter to early spring, which are followed by elongated, woody pods. It is adapted to arid and semi-arid environments, showing drought tolerance and resilience. The species is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elongata var. dilatata is primarily native to the arid and semi-arid regions of South Africa, particularly in the western and southwestern parts of the country. It is commonly found in the Karoo and Succulent Karoo biomes, where it thrives in well-drained soils and dry conditions. This variant is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. It often grows along rocky outcrops and in open grasslands, contributing to the local ecosystem. Due to its hardy nature, it is also occasionally cultivated in other arid regions with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acacia elongata var. dilatata was mainly introduced to South Africa, particularly in the Western Cape region. It has been widely planted for its ornamental value and ability to thrive in arid conditions. The plant is commonly found in gardens and along roadsides due to its hardy nature. However, it has also become invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
