{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia engleri",
    "plant_slug": "acacia-engleri",
    "plant_name_scientific": "acacia engleri",
    "intro": "Acacia engleri, commonly known as the Kauri acacia, is a flowering plant native to New Zealand. It is a small tree or shrub that typically grows in coastal and lowland areas. The plant is characterized by its slender, often twisted branches and small, feathery leaves. It produces yellow flowers in winter, which are followed by distinctive, flat, pod-like fruits. Acacia engleri is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia engleri is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests, secondary growth areas, and along riverbanks. This species thrives in humid climates with well-drained soils and is often associated with disturbed or degraded habitats. Acacia engleri is also occasionally found in parts of northern Australia and New Guinea. Its distribution is largely limited to areas with a warm, moist climate and adequate sunlight.",
    "distribution_introduced_art_desc": "Acacia engleri was mainly introduced to areas with warm, dry climates and well-drained soils, often found in regions with Mediterranean or subtropical conditions. It is commonly used as an ornamental plant due to its attractive foliage and ability to thrive in harsh environments. This species is also valued for its role in soil stabilization and as a source of browse for livestock. Its introduction has sometimes led to ecological concerns due to its potential invasiveness in non-native habitats. Proper management is essential to prevent its spread into sensitive ecosystems."
}
