{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hilliana",
    "plant_slug": "acacia-hilliana",
    "plant_name_scientific": "acacia hilliana",
    "intro": "Acacia hilliana, commonly known as the white acacia, is a small shrub native to southern Africa. It is characterized by its slender, zigzagging stems and bipinnate leaves that are finely divided. The plant produces small, yellow flowers arranged in globular clusters, which bloom during the warm season. It thrives in well-drained soils and is often found in rocky or sandy habitats. Acacia hilliana is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hilliana"
    },
    "taxonomy_art_desc": "Acacia hilliana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and includes legumes and other related families. Its family is Fabaceae, commonly known as the legume family, which is recognized for its characteristic pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acicular leaves and often produces flowers in spherical or cylindrical clusters. Its species is Acacia hilliana, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hilliana is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant typically grows in sandy or rocky soils and is well adapted to the harsh conditions of the outback. It is often seen in shrublands and open woodlands. Acacia hilliana plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia hilliana was mainly introduced to New Zealand. It was brought there for its ornamental value and ability to thrive in various soil conditions. The plant has since spread into native ecosystems, becoming a weed in some areas. It is now considered invasive in parts of the country due to its rapid growth and competitive nature. Management efforts are ongoing to control its spread and protect native flora."
}
