{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia derwentii",
    "plant_slug": "acacia-derwentii",
    "plant_name_scientific": "acacia derwentii",
    "intro": "Acacia derwentii, commonly known as the Derwent acacia, is a shrub or small tree native to southern Australia. It is characterized by its slender, often multi-branched stem and small, bipinnate leaves that are typically reduced to spines in mature plants. The plant produces yellow, globular flower heads that appear in late winter to early spring, attracting a variety of pollinators. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. The wood of Acacia derwentii is hard and durable, historically used by indigenous communities for tool-making and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia derwentii is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and South Africa. It is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. This species is well adapted to dry climates and can thrive in harsh environmental conditions. It is often seen growing along riverbanks and in coastal dunes. Its distribution is limited to specific ecological zones within these countries.",
    "distribution_introduced_art_desc": "Acacia derwentii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in coastal and semi-arid environments. This plant is often used for its hardy nature and ability to withstand harsh conditions. It has been introduced as a potential ornamental and for erosion control purposes. However, its spread has raised concerns about its impact on local ecosystems."
}
