{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tetraptera",
    "plant_slug": "acacia-tetraptera",
    "plant_name_scientific": "acacia tetraptera",
    "intro": "Acacia tetraptera, commonly known as the white acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow or pale yellow flowers arranged in dense, globular clusters, which are an important food source for various pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by animals and through mechanical means. Acacia tetraptera is also valued for its use in traditional medicine and as a source of timber and fuel.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tetraptera"
    },
    "taxonomy_art_desc": "Acacia tetraptera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures such as stomata. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants with compound leaves and often legume-like fruits, including many nitrogen-fixing species. Its family is Fabaceae, commonly known as the legume family, characterized by pods as fruits and often having symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of flowering plants commonly found in arid and tropical regions, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia tetraptera, a specific type of acacia native to certain parts of Africa, recognized by its unique leaf structure and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tetraptera is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy soils and is often seen in shrublands and open woodlands. It is well adapted to the harsh climatic conditions of the region. Its distribution is largely confined to the southern and western parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia tetraptera was mainly introduced to areas with dry, sandy soils and a warm climate, typically in regions of southern Africa. It is commonly found in countries such as Namibia, Botswana, and South Africa. This plant thrives in arid and semi-arid environments, often growing along riverbanks or in open grasslands. Its ability to tolerate drought makes it a valuable species for soil stabilization and erosion control. However, it can become invasive in certain ecosystems if not managed properly."
}
