{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia veronica",
    "plant_slug": "acacia-veronica",
    "plant_name_scientific": "acacia veronica",
    "intro": "Acacia veronica, commonly known as the silky acacia, is a flowering plant native to South Africa. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant features slender, branching stems and produces small, yellow flowers arranged in clusters. Its leaves are bipinnate, meaning they are divided into multiple pairs of tiny leaflets. Acacia veronica is often cultivated for its ornamental value and is adapted to dry, sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia veronica"
    },
    "taxonomy_art_desc": "Acacia veronica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a variety of floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia veronica, a specific type of acacia found in certain regions, known for its unique morphological characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia veronica is primarily native to Western Australia. It is found in the southern and western regions of the state, including the wheatbelt and jarrah forest areas. This plant typically grows in sandy or gravelly soils and is commonly found in open woodlands and heathlands. It is well adapted to the dry and often harsh conditions of its native habitat. Acacia veronica plays an important ecological role in supporting local wildlife and maintaining biodiversity in its region.",
    "distribution_introduced_art_desc": "Acacia veronica was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality due to its drought-resistant characteristics. The plant has been widely used in reclamation projects to stabilize degraded lands and improve soil structure. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation. Despite its benefits, careful management is required to prevent it from becoming a problematic weed."
}
