{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia prosopoma",
    "plant_slug": "acacia-prosopoma",
    "plant_name_scientific": "acacia prosopoma",
    "intro": "Acacia prosopoma, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant produces yellow flowers that bloom in spring, attracting pollinators such as bees and birds. Its leaves are narrow and often have a silvery underside, which helps reflect sunlight and reduce water loss. Acacia prosopoma is adapted to arid and semi-arid environments, making it a resilient plant in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia prosopoma is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This plant thrives in well-drained soils and is often associated with dry shrublands and woodland ecosystems. It is well adapted to the harsh climatic conditions of its native habitat. Acacia prosopoma plays an important role in local ecosystems by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia prosopoma was mainly introduced to areas with disturbed soils and degraded landscapes, particularly in semi-arid and arid regions. It is commonly found in agricultural fields, along roadsides, and in degraded native vegetation. This plant thrives in low-nutrient soils and can tolerate drought conditions. Its introduction has led to its spread in several countries across Africa and the Middle East. However, it is considered a potential weed in some regions due to its rapid growth and ability to outcompete native species."
}
