{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. obtusifolia",
    "plant_slug": "acacia-longifolia-var-obtusifolia",
    "plant_name_scientific": "acacia longifolia var. obtusifolia",
    "intro": "Acacia longifolia var. obtusifolia, commonly known as the coastal wattle, is a shrub native to southern Australia. It is characterized by its slender, yellow flowers that appear in late winter to early spring. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It thrives in sandy or coastal soils and is often found in coastal dunes and heathlands. Acacia longifolia var. obtusifolia is adapted to salt spray and is an important component of coastal vegetation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. obtusifolia is primarily native to southern Australia, including the states of Western Australia, South Australia, and Victoria. It is commonly found in coastal regions and sandy soils, particularly in heathlands and open woodlands. This variant is adapted to dry, temperate climates and is often seen in areas with low rainfall. It thrives in well-drained soils and is a common component of the native flora in these regions. The plant is also occasionally found in New Zealand, where it has been introduced.",
    "distribution_introduced_art_desc": "Acacia longifolia var. obtusifolia was mainly introduced to stabilize soils and for ornamental purposes in regions with Mediterranean climates. It is commonly found in coastal areas and disturbed sites due to its rapid growth and hardy nature. This plant has been widely used in landscaping and reclamation projects across southern Europe and parts of Australia. However, its invasive potential has led to concerns about its impact on native ecosystems. Its distribution is now expanding beyond its original range due to human activity and climate conditions."
}
