{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia perrottii",
    "plant_slug": "acacia-perrottii",
    "plant_name_scientific": "acacia perrottii",
    "intro": "Acacia perrottii, commonly known as the coastal acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and feathery, bipinnate leaves. The plant produces yellow flowers in clusters, which are followed by long, flat pods containing seeds. It thrives in coastal areas and is adapted to sandy soils and salt spray. Acacia perrottii is often used in coastal stabilization due to its hardy nature and ability to withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia perrottii is primarily native to northern Australia, including regions of Queensland, Northern Territory, and Western Australia. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This species thrives in coastal and inland areas, often forming dense shrubs or small trees. It is well adapted to the harsh conditions of the Australian outback, including high temperatures and low rainfall. Acacia perrottii is an important component of the local flora and provides habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia perrottii was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with mild winters and hot, dry summers. It thrives in full sun and is commonly found in coastal and inland areas where the soil is sandy or gravelly. This plant is often used in landscaping due to its hardy nature and attractive, feathery foliage. It has been introduced to several regions outside its native range, including parts of the United States and Australia. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
