{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia deficiens",
    "plant_slug": "acacia-deficiens",
    "plant_name_scientific": "acacia deficiens",
    "intro": "Acacia deficiens, commonly known as the narrow-leaf acacia, is a shrub native to arid regions of Australia. It is characterized by its slender, often zigzagging stems and small, bipinnate leaves that reduce water loss. The plant produces yellow flowers in globular or cylindrical clusters, which are followed by pod-like fruits containing seeds. It is well adapted to dry conditions, with deep roots and a capacity for dormancy during droughts. Acacia deficiens plays a role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia deficiens"
    },
    "taxonomy_art_desc": "Acacia deficiens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid regions, characterized by their phyllodes and often used for timber or in traditional medicine. Its species is Acacia deficiens, a specific type of acacia native to certain parts of Africa, known for its ecological role and specific adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia deficiens is primarily native to Western Australia. It is found in the southern regions of the state, particularly in the areas around the Fitzgerald River National Park and the Shark Bay region. This plant thrives in arid and semi-arid environments, often growing in sandy soils. It is commonly found in coastal and inland areas with low rainfall. Acacia deficiens is an important component of the local flora and plays a role in stabilizing the soil in its native habitat.",
    "distribution_introduced_art_desc": "Acacia deficiens was mainly introduced to areas with sandy or rocky soils and a dry climate, typically in arid or semi-arid regions. It is commonly found in regions such as parts of Australia, South Africa, and the Arabian Peninsula. This plant has adapted well to low rainfall and high temperatures, making it resilient in harsh environments. Its introduction has sometimes led to ecological impacts, including competition with native species. It is often used for erosion control and as a source of timber or fuel."
}
