{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia conjunctifolia",
    "plant_slug": "acacia-conjunctifolia",
    "plant_name_scientific": "acacia conjunctifolia",
    "intro": "Acacia conjunctifolia, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and small, phyllodes that are typically green and narrow. The plant produces yellow flowers in spikes, which bloom in spring and attract various pollinators. Acacia conjunctifolia is adapted to arid and semi-arid environments, making it resilient to drought conditions. It is also valued for its ornamental appeal and is sometimes used in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia conjunctifolia"
    },
    "taxonomy_art_desc": "Acacia conjunctifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral anatomy. Its order is Fabales, which consists of flowering plants that typically have specialized flowers and are often associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, commonly known as the legume family, which includes plants with pod fruits and nitrogen-fixing capabilities through root nodules. Its genus is Acacia, a large group of flowering plants commonly known as wattles, characterized by their typical bipinnate leaves and often spiny thorns. Its species is Acacia conjunctifolia, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia conjunctifolia is primarily native to the Northern Territory and Queensland of Australia. It is commonly found in arid and semi-arid regions within these areas. This plant typically grows in sandy or rocky soils and is adapted to the harsh climatic conditions of its native habitat. It is often seen in open woodlands and along riverbanks. Its distribution is closely linked to the specific environmental conditions of northern Australia.",
    "distribution_introduced_art_desc": "Acacia conjunctifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and disturbed soils, often spreading along roadsides and in urban environments. The plant is known for its rapid growth and ability to thrive in harsh conditions, making it a potential invasive species in some areas. Its introduction has raised concerns due to its competitive nature and impact on native vegetation. Despite its ecological challenges, it is also valued for its ornamental qualities and use in traditional medicine."
}
