{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latisepala",
    "plant_slug": "acacia-latisepala",
    "plant_name_scientific": "acacia latisepala",
    "intro": "Acacia latisepala, commonly known as the broad-sepal acacia, is a flowering plant native to eastern Africa. It is a shrub or small tree that typically grows in savanna and woodland habitats. The plant is characterized by its compound leaves and yellowish to pale green flowers that appear in clusters. Its seeds are enclosed in elongated pods, which are often used in traditional medicine. The species is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia latisepala"
    },
    "taxonomy_art_desc": "Acacia latisepala belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that often have compound leaves and include legumes, which are known for nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing capabilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive, often thorned appearance and nitrogen-fixing abilities. Its species is Acacia latisepala, a specific type of acacia characterized by its broad sepals and is typically found in regions with specific climatic conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latisepala is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, open habitats such as woodlands, grasslands, and rocky areas. This species thrives in regions with a temperate to subtropical climate. It is well adapted to the seasonal rainfall patterns of these areas. Its distribution reflects its preference for well-drained soils and full sun exposure.",
    "distribution_introduced_art_desc": "Acacia latisepala was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and ability to thrive in a variety of soil conditions. However, it has since become invasive, outcompeting native species in certain regions. The plant is now considered a weed in some areas of the country. Its spread has raised concerns among conservationists due to its ecological impact."
}
