{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sphacelata var. sessilis",
    "plant_slug": "acacia-sphacelata-var-sessilis",
    "plant_name_scientific": "acacia sphacelata var. sessilis",
    "intro": "Acacia sphacelata var. sessilis, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, sessile leaves that are often clustered at the base of the stems. The plant produces yellow flowers in globular clusters, which bloom in spring and attract pollinators such as bees and birds. It thrives in well-drained soils and is often found in coastal areas and sandy soils. The species is valued for its ornamental appeal and is used in landscaping and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sphacelata var. sessilis is primarily native to eastern Australia, including parts of New South Wales and Queensland. This variant is commonly found in dry, open habitats such as woodlands, grasslands, and rocky outcrops. It thrives in regions with a Mediterranean climate, characterized by dry summers and wet winters. The plant is well adapted to low-nutrient soils and can tolerate drought conditions. It plays an important ecological role in supporting local fauna and maintaining biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acacia sphacelata var. sessilis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, often thriving in disturbed soils. This variety is known for its ability to tolerate saline and alkaline conditions, making it adaptable to a variety of environments. It has been used in reclamation projects due to its fast growth and nitrogen-fixing capabilities. However, its spread has raised concerns about its potential impact on native vegetation."
}
