{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia merrickiae",
    "plant_slug": "acacia-merrickiae",
    "plant_name_scientific": "acacia merrickiae",
    "intro": "Acacia merrickiae, commonly known as the Ghanan acacia, is a shrub or small tree native to western Africa. It is characterized by its slender, often branched stems and bipinnate leaves that are feather-like in appearance. The plant produces yellow flowers in globular clusters, which are typically followed by flat, woody pods containing seeds. Acacia merrickiae is adapted to arid and semi-arid environments, making it a resilient species in such climates. It is also valued for its ecological role in providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia merrickiae"
    },
    "taxonomy_art_desc": "Acacia merrickiae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes flowering plants such as legumes, known for their symbiotic relationship with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in Africa, Australia, and the Americas, known for their distinctive, flat or curved leaflets. Its species is Acacia merrickiae, a specific type of acacia that is native to certain regions and is distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia merrickiae is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. This species thrives in sandy soils and is commonly found in coastal and inland heathlands. It is well adapted to the arid and semi-arid climates of its native habitat. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity in its region.",
    "distribution_introduced_art_desc": "Acacia merrickiae was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland regions where it can establish itself easily. It has been introduced to several parts of Australia and South Africa. However, its spread is often limited by its specific environmental requirements."
}
