{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia falciformis var. propinqua",
    "plant_slug": "acacia-falciformis-var-propinqua",
    "plant_name_scientific": "acacia falciformis var. propinqua",
    "intro": "Acacia falciformis var. propinqua, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping phyllodes that are typically 5–15 cm long and 1–2 cm wide. The plant produces yellow flowers in globular or cylindrical spikes, which appear during the warmer months. It thrives in well-drained soils and is often found in dry, open habitats such as woodlands and coastal areas. The species is valued for its ornamental appeal and is sometimes cultivated for erosion control.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia falciformis var. propinqua is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This variety thrives in sandy soils and is commonly found in savanna and shrubland ecosystems. It is well adapted to dry climates and can tolerate high temperatures and low rainfall. The plant is often seen along roadsides and in open grasslands, where it plays a role in stabilizing soil and providing habitat for local wildlife. Its distribution is closely linked to areas with specific climatic conditions that support its growth and survival.",
    "distribution_introduced_art_desc": "Acacia falciformis var. propinqua was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for its hardy nature and ability to stabilize soil in degraded landscapes. Its introduction has been largely for ecological restoration and erosion control purposes. However, it has also been noted to spread aggressively in some environments, raising concerns about its impact on native flora."
}
