{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia strigosa var. intermedia",
    "plant_slug": "acacia-strigosa-var-intermedia",
    "plant_name_scientific": "acacia strigosa var. intermedia",
    "intro": "Acacia strigosa var. intermedia, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, yellow flowers arranged in dense, cylindrical clusters. The leaves are linear and often have a hairy texture, which helps reduce water loss in arid environments. It thrives in well-drained soils and is often found in coastal areas and sandy soils. This plant plays an important role in local ecosystems by providing food and habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia strigosa var. intermedia is primarily native to eastern Australia, including parts of Queensland, New South Wales, and the Australian Capital Territory. It thrives in dry, open habitats such as woodlands, heathlands, and sandy soils. This variety is commonly found in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is well adapted to fire-prone environments and often regenerates after bushfires. Its distribution is limited to specific ecological zones where it can receive adequate sunlight and moisture.",
    "distribution_introduced_art_desc": "Acacia strigosa var. intermedia was mainly introduced to South Africa, where it has been widely cultivated for its ornamental value and potential for erosion control. It is commonly found in gardens and along roadsides due to its hardy nature and ability to thrive in various soil types. The plant is also used in traditional medicine and has been introduced to other regions for similar purposes. However, its invasive potential has raised concerns in some areas where it may outcompete native vegetation. Despite its benefits, careful management is recommended to prevent ecological imbalances."
}
