{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pityoides",
    "plant_slug": "acacia-pityoides",
    "plant_name_scientific": "acacia pityoides",
    "intro": "Acacia pityoides, commonly known as the silver wattle, is a shrub or small tree native to southern Australia. It is characterized by its feathery, bipinnate leaves and yellow globular flowers that appear in spring. The plant is well adapted to arid and semi-arid environments, showcasing drought tolerance and a deep root system. It plays an important role in local ecosystems by providing habitat and nectar for native pollinators. The wood of Acacia pityoides is lightweight and has been used traditionally by Indigenous Australians for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pityoides is primarily native to tropical and subtropical regions of Africa, including countries such as Kenya, Tanzania, Uganda, and parts of the Democratic Republic of the Congo. It is commonly found in savannas, woodlands, and along riverbanks in these areas. This plant thrives in well-drained soils and is often associated with dry to semi-arid environments. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia pityoides is also known for its ability to fix nitrogen, contributing to soil fertility in its native range.",
    "distribution_introduced_art_desc": "Acacia pityoides was mainly introduced to control soil erosion and as a source of timber and fuelwood in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its rapid growth and adaptability. The plant has become naturalized in several countries, including parts of Africa and the Middle East. Its introduction has led to both ecological benefits and challenges, such as competition with native vegetation. Despite its utility, its spread requires careful management to prevent overdominance in local ecosystems."
}
