{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia homomalla",
    "plant_slug": "acacia-homomalla",
    "plant_name_scientific": "acacia homomalla",
    "intro": "Acacia homomalla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, often zigzagging branches. The plant produces yellow flowers in compact spherical clusters, which are followed by flat, linear pods. Its leaves are simple, alternate, and typically narrow, giving it a distinctive appearance. Acacia homomalla is well adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia homomalla is primarily native to eastern Australia, including regions such as New South Wales, Victoria, and parts of South Australia. It is commonly found in dry sclerophyll forests and woodlands, particularly in areas with well-drained soils. This species thrives in temperate to warm climates and is often associated with sandy or rocky soils. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. Acacia homomalla is also known for its hardy nature, making it a resilient plant in its native range.",
    "distribution_introduced_art_desc": "Acacia homomalla was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its ornamental value and potential for soil stabilization. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to significant ecological concerns, particularly in semi-arid regions. Management efforts are ongoing to control its spread and mitigate its impact on native biodiversity."
}
