{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassiuscula var. angustifolia",
    "plant_slug": "acacia-crassiuscula-var-angustifolia",
    "plant_name_scientific": "acacia crassiuscula var. angustifolia",
    "intro": "Acacia crassiuscula var. angustifolia, commonly known as the narrow-leaf wattles, is a shrub or small tree native to Australia. It features narrow, feather-like phyllodes that are typically light green to grey-green in color. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense spherical heads. It is adapted to arid and semi-arid environments, with a deep root system to access groundwater. This species is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassiuscula var. angustifolia is primarily native to the eastern coast of Australia, including Queensland, New South Wales, and the ACT. It is commonly found in coastal heathlands, sand dunes, and rocky outcrops. This variety is adapted to sandy soils and is often found in areas with a Mediterranean climate. It is a shrub or small tree that thrives in well-drained conditions. The plant is known for its distinctive narrow leaves and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia crassiuscula var. angustifolia was mainly introduced to control soil erosion and for its ornamental value in landscaping. It is commonly found in disturbed soils and along roadsides in regions with a Mediterranean climate. This plant has adapted well to various environmental conditions, making it a persistent weed in agricultural and natural areas. Its rapid growth and ability to thrive in poor soils contribute to its spread. However, it can outcompete native vegetation, raising concerns about its ecological impact."
}
