{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tanumbirinensis",
    "plant_slug": "acacia-tanumbirinensis",
    "plant_name_scientific": "acacia tanumbirinensis",
    "intro": "Acacia tanumbirinensis, commonly known as the Tanumbirinensis acacia, is a flowering plant species native to specific regions of Australia. It belongs to the legume family, Fabaceae, and is characterized by its distinctive, narrow, bipinnate leaves. The plant produces yellow to golden-orange flowers arranged in dense, cylindrical spikes, which are typical of many acacia species. It thrives in arid and semi-arid environments, often growing on rocky soils. Due to its unique appearance and ecological role, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tanumbirinensis is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. This species is commonly found in sandy soils and is adapted to the harsh, dry conditions of these environments. It is often associated with spinifex plains and other dry shrublands. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its limited range, it is considered a rare and endemic species within its native habitat.",
    "distribution_introduced_art_desc": "Acacia tanumbirinensis was mainly introduced to South Africa as part of ornamental plantings and for soil stabilization in degraded areas. It is commonly found in the Eastern Cape and Western Cape provinces, where it thrives in sandy and well-drained soils. The plant is valued for its hardy nature and ability to withstand drought conditions. However, it has also been reported to spread aggressively in some regions, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact and management in native ecosystems."
}
