{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis subsp. spirocarpa",
    "plant_slug": "acacia-tortilis-subsp-spirocarpa",
    "plant_name_scientific": "acacia tortilis subsp. spirocarpa",
    "intro": "Acacia tortilis subsp. spirocarpa, commonly known as the spiral acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive spiral arrangement of branches, which gives it its common name. The plant produces yellow flowers followed by flat, pod-like fruits containing seeds. Its leaves are bipinnate, consisting of numerous small leaflets, and it has a deep root system adapted to drought conditions. It is often used for its timber and has cultural significance in some African communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis subsp. spirocarpa is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of the Arabian Peninsula, particularly in Saudi Arabia and Yemen. This subspecies thrives in arid and semi-arid environments, often growing in rocky soils and along dry riverbeds. It is commonly found in savannas and woodlands, where it plays an important ecological role. Its distribution is closely linked to regions with low rainfall and high temperatures.",
    "distribution_introduced_art_desc": "Acacia tortilis subsp. spirocarpa was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or rocky soils. It is commonly found in regions of Africa, particularly in countries like Sudan, Ethiopia, and Somalia. This subspecies is known for its ability to tolerate drought and poor soil conditions, making it a valuable plant for erosion control and land rehabilitation. It also provides habitat and food for various wildlife species. Due to its hardy nature, it has been introduced to other parts of the world for ecological and agricultural purposes."
}
