{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leucophylla",
    "plant_slug": "acacia-leucophylla",
    "plant_name_scientific": "acacia leucophylla",
    "intro": "Acacia leucophylla, commonly known as the white-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, pale green leaves that are often covered in fine hairs, giving it a silvery appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. It thrives in well-drained soils and is often found in coastal and sandy areas. Acacia leucophylla is valued for its ornamental appeal and is sometimes used in landscaping due to its hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leucophylla is primarily native to the coastal regions of southern Australia, including the states of South Australia, Victoria, and Western Australia. It is commonly found in sandy soils along the coastlines and in dunes. This species thrives in temperate to warm climates and is often associated with coastal heath and shrubland communities. It is well adapted to salty and windy conditions typical of coastal environments. Acacia leucophylla is also occasionally found in inland areas with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acacia leucophylla was mainly introduced to South Australia and parts of Western Australia. It is commonly found in sandy soils along coastal and inland regions. The plant is often used for soil stabilization and as a windbreak due to its hardy nature. It has also been introduced to some areas in New South Wales and Queensland. However, it is considered a weed in certain regions due to its aggressive growth habit."
}
