{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lysiphloia",
    "plant_slug": "acacia-lysiphloia",
    "plant_name_scientific": "acacia lysiphloia",
    "intro": "Acacia lysiphloia, commonly known as the narrow-leaf wattle, is a shrub native to the arid and semi-arid regions of Australia. It is characterized by its slender, cylindrical stems and bipinnate leaves that are composed of numerous small, narrow leaflets. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It is well adapted to harsh environments, with a deep root system that allows it to access water from deeper soil layers. Acacia lysiphloia is also notable for its ability to fix nitrogen, contributing to soil fertility in nutrient-poor areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lysiphloia"
    },
    "taxonomy_art_desc": "Acacia lysiphloia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises plants with characteristic flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, recognized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and their ability to thrive in arid environments. Its species is Acacia lysiphloia, a specific type of acacia found in Australia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lysiphloia is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions across these areas. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia lysiphloia was mainly introduced to control soil erosion and stabilize degraded land in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions. The plant has been introduced to several countries in Africa and the Middle East as part of afforestation and reclamation efforts. Its rapid growth and deep root system make it an effective pioneer species in ecological restoration. However, its introduction has also raised concerns about potential invasiveness in some environments."
}
