{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obbiadensis",
    "plant_slug": "acacia-obbiadensis",
    "plant_name_scientific": "acacia obbiadensis",
    "intro": "Acacia obbiadensis, commonly known as the White Acacia, is a shrub or small tree native to parts of Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in dense, globular heads, which are typically followed by long, straight pods. It thrives in arid and semi-arid environments, making it well adapted to dry climates. The species is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obbiadensis is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. It is commonly found in sandy soils and rocky outcrops within these areas. This species thrives in environments with low rainfall and high temperatures. It is often seen in woodland and shrubland communities. Its distribution is closely tied to the ecological conditions of the Australian outback.",
    "distribution_introduced_art_desc": "Acacia obbiadensis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in semi-arid and coastal areas, particularly in the Western and Eastern Cape provinces. This plant is often used for its hardy nature and ability to thrive in poor soil conditions. However, it has also been reported to spread into natural vegetation, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact and management in local ecosystems."
}
