{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cultriformis",
    "plant_slug": "acacia-cultriformis",
    "plant_name_scientific": "acacia cultriformis",
    "intro": "Acacia cultriformis, commonly known as the narrowleaf wattle, is a shrub native to Australia. It is characterized by its slender, leaf-like phyllodes that are typically 5–15 cm long and have a narrow, blade-like shape. The plant produces small, yellow globular flowers that bloom in spring, attracting nectar-feeding birds and insects. Acacia cultriformis is often found in dry, sandy soils and is adapted to arid and semi-arid environments. Its growth habit and appearance make it a distinctive component of coastal and inland vegetation in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cultriformis"
    },
    "taxonomy_art_desc": "Acacia cultriformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns, horsetails, and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which comprises flowering plants that are often legumes and include plants like peas and vetches. Its family is Fabaceae, commonly known as the legume family, which is characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly known as wattles, which are native to Australia and other regions. Its species is Acacia cultriformis, a specific type of acacia known for its distinctive leaf shape and is found in certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [
        "Argentina Northeast",
        "Assam",
        "Brazil Northeast",
        "California",
        "Cape Provinces",
        "Ethiopia",
        "India",
        "Jawa",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acacia cultriformis is primarily native to New South Wales and Queensland in Australia. This species is commonly found in dry, sandy soils within these regions. It thrives in arid and semi-arid environments, often growing along riverbanks and in open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia cultriformis was mainly introduced to Argentina Northeast, Assam, Brazil Northeast, California, Cape Provinces, Ethiopia, India, Jawa, and Zimbabwe. It has been established in these regions, often as an ornamental or for soil stabilization purposes. The plant thrives in tropical and subtropical climates, making it suitable for the diverse environments listed. Its introduction has sometimes led to ecological impacts, including competition with native species. Despite its spread, it remains a significant species in certain parts of the world due to its hardiness and adaptability."
}
