{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennata var. dregeana",
    "plant_slug": "acacia-pennata-var-dregeana",
    "plant_name_scientific": "acacia pennata var. dregeana",
    "intro": "Acacia pennata var. dregeana, commonly known as the dwarf silver wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in globular clusters, which are typically followed by flat, bean-like pods. It thrives in well-drained soils and is adapted to arid and semi-arid environments. This variety is valued for its ornamental appeal and is often cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennata var. dregeana is primarily native to the southern regions of Africa, specifically South Africa. It is commonly found in the Eastern Cape and Western Cape provinces. This plant thrives in coastal and inland areas with sandy or gravelly soils. It is often associated with fynbos vegetation, which is characteristic of the region's Mediterranean climate. Its distribution is limited to specific habitats that provide the right balance of sunlight, temperature, and moisture.",
    "distribution_introduced_art_desc": "Acacia pennata var. dregeana was mainly introduced to South Africa, particularly in the coastal regions of the Eastern and Western Cape provinces. It was brought there for its ornamental value due to its unique foliage and ability to thrive in coastal conditions. The plant is often cultivated in gardens and along roadsides for its aesthetic appeal. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasive behavior. Its introduction has led to discussions about its ecological impact in local ecosystems."
}
