{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia myrmecophila",
    "plant_slug": "acacia-myrmecophila",
    "plant_name_scientific": "acacia myrmecophila",
    "intro": "Acacia myrmecophila, commonly known as the African silver acacia, is a shrub or small tree native to sub-Saharan Africa. It is characterized by its slender, zigzagging branches and small, greenish-yellow flowers that bloom in clusters. The plant has phyllodes, which are flattened leaf stalks that function as leaves, and it produces pods containing seeds. It is also known for its mutualistic relationship with ants, which inhabit the hollow thorns on its stems. This relationship provides the plant with protection from herbivores.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia myrmecophila is primarily native to the eastern and southern regions of Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It is commonly found in savannas, woodlands, and along riverbanks in these areas. This plant thrives in well-drained soils and is often associated with dry to semi-arid climates. It plays an important ecological role by providing habitat and food for various insect species, including ants. Its distribution is closely linked to the presence of ant colonies, which form a mutualistic relationship with the plant.",
    "distribution_introduced_art_desc": "Acacia myrmecophila was mainly introduced to areas with disturbed soils and arid conditions, often as part of land rehabilitation or agricultural expansion. It thrives in regions with low rainfall and poor soil quality, making it a common invasive species in degraded landscapes. The plant forms a symbiotic relationship with ants, which helps protect it from herbivores and promotes its growth in harsh environments. Its rapid growth and ability to colonize open spaces contribute to its spread in new regions. However, it can outcompete native vegetation, leading to ecological concerns in some areas."
}
