{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trinervata",
    "plant_slug": "acacia-trinervata",
    "plant_name_scientific": "acacia trinervata",
    "intro": "Acacia trinervata, commonly known as the narrow-veined acacia, is a shrub or small tree native to the arid regions of Africa and the Middle East. It is characterized by its slender, often thornless stems and bipinnate leaves with three nerves per leaflet. The plant produces yellow flowers in globular or cylindrical spikes, which are followed by flat, bean-like pods containing seeds. Acacia trinervata is adapted to dry environments, with deep roots that allow it to survive in nutrient-poor soils. It plays a role in local ecosystems and has been used traditionally for various purposes, including medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia trinervata"
    },
    "taxonomy_art_desc": "Acacia trinervata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are found predominantly in Africa and Australia. Its species is Acacia trinervata, a specific type of acacia native to parts of Africa, known for its distinctive three-veined leaves and its ecological and potential medicinal importance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [
        "Assam",
        "India"
    ],
    "distribution_native_art_desc": "Acacia trinervata is primarily native to New South Wales. It is commonly found in the coastal and tableland regions of the state. This species thrives in a variety of soil types but prefers well-drained soils. It is often seen in open forests, woodlands, and along riverbanks. Acacia trinervata plays an important role in the local ecosystem and is a characteristic component of the native vegetation in New South Wales.",
    "distribution_introduced_art_desc": "Acacia trinervata was mainly introduced to Assam, India. It was brought there for its potential use in agroforestry and soil stabilization. The plant is valued for its ability to thrive in poor soil conditions. It has been widely planted to prevent soil erosion and improve land productivity. However, its introduction has also raised concerns about its potential to become invasive in local ecosystems."
}
