{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia microsperma",
    "plant_slug": "acacia-microsperma",
    "plant_name_scientific": "acacia microsperma",
    "intro": "Acacia microsperma, commonly known as the small-seeded acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular or cylindrical clusters, which are typically pollinated by insects. Its small, woody pods contain numerous minute, oblong seeds. Acacia microsperma is adapted to arid and semi-arid environments, making it a resilient species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia microsperma"
    },
    "taxonomy_art_desc": "Acacia microsperma belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by the presence of true vascular tissue. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often compound leaves. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are predominantly found in Australia and are known for their unique umbrella-shaped flower clusters. Its species is Acacia microsperma, a specific type of acacia known for its small seeds and is typically found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia microsperma is primarily native to Queensland. It is commonly found in the eastern regions of the state, particularly in areas with sandy or loamy soils. This species thrives in open woodlands and dry shrublands, often in regions with a subtropical or tropical climate. It is well adapted to the seasonal rainfall patterns of Queensland. Acacia microsperma plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia microsperma was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with moderate rainfall. It thrives in open habitats such as grasslands, woodlands, and disturbed sites where it can establish quickly. This plant is often found in areas with full sun exposure and is adapted to low-nutrient soils. Its introduction has led to its establishment in several regions outside its native range, including parts of the United States and Australia. Due to its rapid growth and ability to colonize new areas, it is considered an invasive species in some regions."
}
