{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ouyrarema",
    "plant_slug": "acacia-ouyrarema",
    "plant_name_scientific": "acacia ouyrarema",
    "intro": "Acacia ouyrarema, commonly known as the yellow acacia, is a shrub or small tree native to Australia. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant is notable for its bright yellow flowers, which appear in clusters and attract a variety of pollinators. Its leaves are bipinnate, consisting of numerous small, feather-like leaflets. Acacia ouyrarema is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ouyrarema is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. It thrives in sandy soils and is commonly found in shrublands and woodlands. This species is well adapted to the harsh climate with its deep root system and waxy leaves. It plays an important ecological role in providing habitat and food for local wildlife. Acacia ouyrarema is also known for its yellow flowers, which bloom during the dry season.",
    "distribution_introduced_art_desc": "Acacia ouyrarema was mainly introduced to areas with well-drained soils and a warm, dry climate. It is commonly found in regions of Australia, particularly in the arid and semi-arid zones. The plant is known for its ability to thrive in low-nutrient soils and withstand drought conditions. It has been introduced for its ornamental value and as a potential windbreak in agricultural landscapes. However, its spread has raised concerns due to its potential to become invasive in certain ecosystems."
}
