{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. sophorae",
    "plant_slug": "acacia-longifolia-var-sophorae",
    "plant_name_scientific": "acacia longifolia var. sophorae",
    "intro": "Acacia longifolia var. sophorae, commonly known as the coastal wattles, is a shrub or small tree native to southern Australia. It is characterized by its slender, often pendulous branches and yellow globular flowers that appear in spring. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic structures. It thrives in coastal environments and is adapted to sandy soils and salt spray. This species is also valued for its ornamental appeal and its role in stabilizing dunes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. sophorae is primarily native to the coastal regions of southern Australia, including the states of New South Wales, Victoria, and South Australia. This variant is commonly found in sandy soils along the coastline, particularly in areas with a Mediterranean climate. It thrives in dune environments and is often part of the vegetation in coastal heathlands. The plant is well adapted to salt spray and can tolerate periodic drought conditions. It plays an important ecological role in stabilizing coastal dunes and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia longifolia var. sophorae was mainly introduced to stabilize sand dunes and prevent erosion in coastal areas. It is commonly found in regions with sandy soils and moderate to high salinity. This plant has been widely used in ecological restoration projects along the coastlines of southern Australia. Its rapid growth and ability to thrive in harsh conditions make it a valuable species for land rehabilitation. However, its invasive nature has led to concerns about its impact on native flora and ecosystems."
}
