{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pataczekii",
    "plant_slug": "acacia-pataczekii",
    "plant_name_scientific": "acacia pataczekii",
    "intro": "Acacia pataczekii, commonly known as the Pataczek's wattle, is a flowering plant native to Western Australia. It belongs to the Fabaceae family, which includes legumes, and is characterized by its compound leaves and yellow floral spikes. The plant is known for its ability to thrive in arid and semi-arid environments, making it well-adapted to harsh conditions. Its seeds are often dispersed by ants, a process known as myrmecochory, which aids in its propagation. Acacia pataczekii is also valued for its ecological role in stabilizing soils and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pataczekii"
    },
    "taxonomy_art_desc": "Acacia pataczekii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and ability to thrive in arid environments. Its species is Acacia pataczekii, a specific type of acacia found in certain regions of Africa, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tasmania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pataczekii is primarily native to Tasmania. It is found in various regions across the island, particularly in areas with sandy soils and open habitats. This species is commonly associated with coastal and inland heathlands. It plays an important role in the local ecosystem by providing habitat and food for native wildlife. Due to its limited range, it is considered a rare and vulnerable plant species in Tasmania.",
    "distribution_introduced_art_desc": "Acacia pataczekii was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and ability to thrive in a variety of environmental conditions. It has since spread beyond cultivated areas and is now considered an invasive species in several regions of the country. The plant's rapid growth and ability to form dense thickets have led to concerns about its impact on native ecosystems. It is particularly problematic in coastal and riverine habitats where it outcompetes native vegetation. Management efforts are ongoing to control its spread and mitigate its ecological effects."
}
