{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella var. grandis",
    "plant_slug": "acacia-pulchella-var-grandis",
    "plant_name_scientific": "acacia pulchella var. grandis",
    "intro": "Acacia pulchella var. grandis, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. It thrives in well-drained soils and is often found in open forests and woodlands. The species is widely cultivated for its ornamental value and is the floral emblem of Australia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella var. grandis is primarily native to the arid and semi-arid regions of Australia, particularly in the states of Western Australia, South Australia, and Queensland. This variety is commonly found in sandy soils and coastal dunes, thriving in environments with low rainfall and high solar exposure. It is often associated with coastal vegetation and is well adapted to salt-laden winds and sandy substrates. The plant plays an important ecological role in stabilizing dunes and providing habitat for local wildlife. Its distribution is limited to specific geographic areas within these regions, reflecting its adaptation to harsh environmental conditions.",
    "distribution_introduced_art_desc": "Acacia pulchella var. grandis was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly used in reclamation projects due to its rapid growth and deep root system. This variety is also valued for its ability to thrive in arid and semi-arid environments. Its introduction has helped restore vegetation in areas affected by mining and agricultural activities. However, it requires careful management to prevent it from becoming invasive in non-target habitats."
}
