{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pinguiculosa subsp. pinguiculosa",
    "plant_slug": "acacia-pinguiculosa-subsp-pinguiculosa",
    "plant_name_scientific": "acacia pinguiculosa subsp. pinguiculosa",
    "intro": "Acacia pinguiculosa subsp. pinguiculosa, commonly known as the sticky acacia, is a shrub native to the arid regions of Australia. It is characterized by its dense, glandular foliage that secretes a sticky resin, which helps reduce water loss and deter herbivores. The plant produces yellow flowers in globular clusters, typically during the warmer months. Its leaves are narrow and linear, adapted to minimize transpiration in hot, dry environments. This subspecies is well-suited to xerophytic conditions and is often found in sandy or rocky soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pinguiculosa"
    },
    "taxonomy_art_desc": "Acacia pinguiculosa subsp. pinguiculosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and clubmosses, and is distinguished by their vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is known for its primitive floral structures. Its order is Fabales, which includes legumes and related plants, characterized by the presence of symbiotic nitrogen-fixing bacteria in their root nodules. Its family is Fabaceae, commonly known as the legume or pea family, which is notable for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found primarily in arid and tropical regions, known for their phyllodes and often used in traditional medicine. Its species is Acacia pinguiculosa, a specific variety within the Acacia genus that is native to certain regions of Australia and is recognized for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pinguiculosa subsp. pinguiculosa is primarily native to Western Australia. It is found in the southern and southwestern regions of the state. This subspecies typically grows in sandy or gravelly soils. It is commonly associated with open woodlands and shrublands. Its distribution is limited to specific areas within Western Australia due to its particular habitat requirements.",
    "distribution_introduced_art_desc": "Acacia pinguiculosa subsp. pinguiculosa was mainly introduced to regions with arid and semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas of Australia, particularly in the Northern Territory and Western Australia. This subspecies is known for its ability to tolerate high temperatures and low rainfall, making it suitable for reclamation projects in degraded lands. Its introduction has also been noted in parts of Southeast Asia and the Arabian Peninsula. However, its spread is often limited by its specific ecological requirements and the presence of suitable habitats."
}
