{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia columnaris",
    "plant_slug": "acacia-columnaris",
    "plant_name_scientific": "acacia columnaris",
    "intro": "Acacia columnaris, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It features slender, upright branches with small, feathery leaves that are typically green and glossy. The plant produces yellow flowers in spikes, which bloom in spring and attract pollinators like bees and birds. Its seeds are enclosed in woody pods and are adapted for dispersal by wind. Acacia columnaris is often used in landscaping due to its hardy nature and attractive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia columnaris is primarily native to the coastal regions of southern Africa, including countries such as South Africa, Namibia, and Angola. It thrives in sandy soils and is commonly found in dune environments and along the coastline. This species is well adapted to arid and semi-arid climates, making it a characteristic plant of the Namib Desert and other similar ecosystems. It plays an important role in stabilizing dunes and providing habitat for local wildlife. Acacia columnaris is also known for its distinctive yellow flowers, which bloom during the rainy season.",
    "distribution_introduced_art_desc": "Acacia columnaris was mainly introduced to New Zealand, where it was initially planted for ornamental purposes due to its unique appearance and hardy nature. It has since become an invasive species, outcompeting native plants and altering local ecosystems. The plant thrives in a variety of soil types and can tolerate both drought and frost, contributing to its rapid spread. Its introduction has led to increased management efforts to control its population and prevent further ecological damage. Despite its aesthetic appeal, Acacia columnaris is now considered a significant environmental threat in many regions."
}
