{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia undulata var. elegans",
    "plant_slug": "acacia-undulata-var-elegans",
    "plant_name_scientific": "acacia undulata var. elegans",
    "intro": "Acacia undulata var. elegans, commonly known as the elegant wattle, is a shrub native to southern Africa. It features slender, zigzagging branches and produces small, yellow, fluffy flowers that bloom in spring. The plant has bipinnate leaves composed of numerous small leaflets. It is adapted to arid environments and thrives in well-drained soils. The elegant wattle is often used in ornamental gardening due to its attractive appearance and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia undulata var. elegans is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This plant thrives in sandy or gravelly soils and is commonly found in savanna and shrubland habitats. It is well adapted to withstand drought conditions and high temperatures, making it a resilient species in its native environment. The plant is often seen growing along roadsides, riverbanks, and in open woodlands. Its distribution is closely linked to the availability of sunlight and well-drained soil, which are key factors in its ecological niche.",
    "distribution_introduced_art_desc": "Acacia undulata var. elegans was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy soils. The plant is valued for its ornamental qualities, with its delicate foliage and yellow flowers making it a popular choice for gardens. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasive behavior. Its introduction has led to discussions about its ecological impact in local ecosystems."
}
