{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mucronata var. dependens",
    "plant_slug": "acacia-mucronata-var-dependens",
    "plant_name_scientific": "acacia mucronata var. dependens",
    "intro": "Acacia mucronata var. dependens, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often drooping branches and small, bipinnate leaves. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in dry, sandy soils and is often found in coastal and inland regions. The variety 'dependens' is distinguished by its more upright growth habit compared to other acacia species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mucronata var. dependens is primarily native to the northern regions of Western Australia. It is commonly found in the Pilbara and Kimberley regions, where it thrives in arid and semi-arid environments. This variety is typically associated with rocky outcrops and sandy soils, often growing in association with other shrubs and grasses. It is well adapted to the harsh climate of its native habitat, with deep root systems that allow it to access groundwater. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia mucronata var. dependens was mainly introduced to control soil erosion and for its potential use in revegetation projects. It is commonly found in disturbed areas such as roadsides, quarries, and degraded lands. This plant has been used in ecological restoration due to its fast growth rate and ability to thrive in poor soil conditions. However, it is considered an invasive species in some regions, outcompeting native vegetation. Its introduction has raised concerns about its impact on local biodiversity and ecosystem balance."
}
