{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retivenea subsp. retivenea",
    "plant_slug": "acacia-retivenea-subsp-retivenea",
    "plant_name_scientific": "acacia retivenea subsp. retivenea",
    "intro": "Acacia retivenea subsp. retivenea, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It typically grows in arid and semi-arid regions, characterized by its slender, often twisted branches and bipinnate leaves. The plant produces yellow flowers in globular or cylindrical clusters, which appear in spring. Its seeds are encased in elongated pods and are adapted for dispersal by wind. The species is notable for its ecological role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia retivenea"
    },
    "taxonomy_art_desc": "Acacia retivenea subsp. retivenea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by its diverse floral structures. Its order is Fabales, which includes legumes and related plants, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees, typically found in arid regions, known for their distinctive phyllodes and often used for timber or as sources of gum. Its species is Acacia retivenea, a specific variety within the Acacia genus, which is native to certain regions of Australia and is recognized for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia retivenea subsp. retivenea is primarily native to Northern Territory, Queensland, and Western Australia. This subspecies is commonly found in arid and semi-arid regions across these states. It typically grows in open woodlands, shrublands, and rocky outcrops. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for native fauna.",
    "distribution_introduced_art_desc": "Acacia retivenea subsp. retivenea was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often growing in open woodlands and shrublands. This subspecies is known for its ability to thrive in arid and semi-arid conditions, making it adaptable to a range of environmental conditions. It has been introduced for its ornamental value and is sometimes used in landscaping. However, it can also pose a threat to native ecosystems if it spreads beyond controlled areas."
}
