{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia podalyriifolia var. caleyi",
    "plant_slug": "acacia-podalyriifolia-var-caleyi",
    "plant_name_scientific": "acacia podalyriifolia var. caleyi",
    "intro": "Acacia podalyriifolia var. caleyi, commonly known as the Caleyan wattle, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, often spiny stems and small, narrow leaves that are arranged in a compact, rounded form. The plant produces yellow flowers in late winter to early spring, which are clustered in dense, globular inflorescences. Its leaves are typically covered in fine, white hairs, which help reduce water loss in its harsh environment. The species is valued for its ornamental appeal and is often cultivated in gardens with well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia podalyriifolia var. caleyi is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in rocky outcrops, sandy soils, and dry shrublands where it thrives in low rainfall conditions. It is well adapted to the harsh climate of its native habitat, showing resilience to drought and high temperatures. The plant is often part of the local vegetation in these regions, contributing to the biodiversity of the area. Its distribution is largely confined to specific ecological zones within southern Africa.",
    "distribution_introduced_art_desc": "Acacia podalyriifolia var. caleyi was mainly introduced to Australia as an ornamental plant due to its attractive foliage and drought tolerance. It has since become naturalized in parts of Queensland and New South Wales, where it thrives in dry, sandy soils. The plant's rapid growth and ability to spread through seeds have led to its establishment in native ecosystems. It is considered a potential weed in some regions due to its competitive nature. Management strategies are being developed to control its spread and minimize its impact on local flora."
}
