{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gonoacantha",
    "plant_slug": "acacia-gonoacantha",
    "plant_name_scientific": "acacia gonoacantha",
    "intro": "Acacia gonoacantha, commonly known as the green thorn acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, thorned stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers in globular or cylindrical clusters, which are followed by flat, fibrous pods containing seeds. It is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. Acacia gonoacantha is also valued for its use in traditional medicine and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gonoacantha is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This plant thrives in well-drained soils and is often seen growing along roadsides and in open woodlands. It is well adapted to the hot and dry climate of its native habitat. Acacia gonoacantha plays an important ecological role by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia gonoacantha was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern and Western Cape provinces, as well as parts of KwaZulu-Natal. The plant thrives in sandy or rocky soils and is often seen along roadsides and in disturbed areas. It is valued for its hardiness and ability to withstand drought conditions. However, it is also considered a potential invasive species in some areas due to its rapid spread."
}
