{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia petiolaris",
    "plant_slug": "acacia-petiolaris",
    "plant_name_scientific": "acacia petiolaris",
    "intro": "Acacia petiolaris, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, often twisted branches and bipinnate leaves. The plant produces yellow flowers in compact spikes, which are followed by flat, pod-like fruits. Acacia petiolaris is adapted to arid and semi-arid environments, showcasing drought tolerance through its deep root system and reduced leaf surface area. It plays an important ecological role by providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia petiolaris is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in savanna woodlands and rocky outcrops where it thrives in well-drained soils. This species is adapted to withstand high temperatures and low rainfall, making it a resilient component of the local flora. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia petiolaris is also known for its distinctive, flat, leaf-like structures that help reduce water loss.",
    "distribution_introduced_art_desc": "Acacia petiolaris was mainly introduced to urban and industrial areas for its ability to thrive in polluted environments. It is commonly found along roadsides and in disturbed soils where it can quickly establish itself. This plant is valued for its hardy nature and ability to stabilize soil, making it useful in erosion control efforts. However, its invasive potential has raised concerns in some regions where it outcompetes native species. Its distribution is largely limited to areas with moderate to high levels of environmental stress."
}
