{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia congesta subsp. wonganensis",
    "plant_slug": "acacia-congesta-subsp-wonganensis",
    "plant_name_scientific": "acacia congesta subsp. wonganensis",
    "intro": "Acacia congesta subsp. wonganensis, commonly known as Wongan acacia, is a shrub or small tree native to Western Australia. It is characterized by its slender, often multi-stemmed form and its distinctive, narrow, bipinnate leaves. The plant produces yellow flowers in dense, globular clusters, which are typically followed by elongated, woody pods. It is adapted to arid and semi-arid environments, showing drought tolerance and a preference for well-drained soils. This subspecies is of interest in ecological studies due to its role in local ecosystems and its potential for use in rehabilitation projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia congesta"
    },
    "taxonomy_art_desc": "Acacia congesta subsp. wonganensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and ferns, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species, often with showy flowers and a wide range of growth forms. Its order is Fabales, which includes plants known for their legume fruits and the ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their phyllodes and often used in traditional medicine. Its species is Acacia congesta, a specific type of acacia that is further divided into subspecies, with Acacia congesta subsp. wonganensis being a distinct variant found in particular geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia congesta subsp. wonganensis is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area known as the Fitzgerald River National Park. This subspecies thrives in sandy soils and is commonly associated with open woodlands and shrublands. It is well adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters. The plant plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia congesta subsp. wonganensis was mainly introduced to areas with well-drained soils and full sun exposure, typically in semi-arid or arid environments. It is commonly found in rocky outcrops and sandy soils across parts of Western Australia. This subspecies is adapted to withstand drought and high temperatures, making it suitable for rehabilitation of degraded lands. It plays a role in stabilizing soil and providing habitat for native fauna. However, its introduction has raised concerns about its potential to become invasive in non-native regions."
}
