{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acradenia",
    "plant_slug": "acacia-acradenia",
    "plant_name_scientific": "acacia acradenia",
    "intro": "Acacia acradenia, commonly known as the African bristlenut, is a flowering plant native to East Africa. It is a small to medium-sized tree or shrub that typically grows in dry, rocky habitats. The plant produces yellow flowers that are clustered in spherical heads, which are often visited by bees and other pollinators. Its leaves are bipinnate, meaning they are divided into small, feathery leaflets. The wood of Acacia acradenia is hard and durable, making it valuable for construction and fuel.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia acradenia"
    },
    "taxonomy_art_desc": "Acacia acradenia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often characterized by their distinctive flowers and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume family, which includes plants with pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their acicular leaves and often used in traditional medicine and land restoration. Its species is Acacia acradenia, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acradenia is primarily native to the Northern Territory, Queensland, South Australia, and Western Australia. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. Acacia acradenia is well adapted to the harsh climatic conditions of its native range. Its distribution reflects its ability to survive in dry, nutrient-poor environments.",
    "distribution_introduced_art_desc": "Acacia acradenia was mainly introduced to areas with a tropical or subtropical climate, where it thrives in well-drained soils. It is commonly found in regions with seasonal rainfall, particularly in parts of Africa, the Middle East, and Southeast Asia. This plant is often used for its hardy nature and ability to withstand dry conditions. It has been introduced for ornamental purposes and as a source of timber. However, it can become invasive in some ecosystems if not managed properly."
}
