{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia metrosideriflora",
    "plant_slug": "acacia-metrosideriflora",
    "plant_name_scientific": "acacia metrosideriflora",
    "intro": "Acacia metrosideriflora, commonly known as the silky acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often branching stems and bipinnate leaves that are finely divided. The plant produces yellow or pale yellow flowers in globular or cylindrical heads, which are typically visited by various pollinators. Its seed pods are elongated and woody, containing numerous flat, winged seeds. Acacia metrosideriflora is adapted to arid and semi-arid environments, making it a resilient species in dry regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia metrosideriflora is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in dry, open habitats like savannas and woodland areas. This species is commonly found in regions with well-drained soils and a distinct dry season. It plays an important ecological role by providing food and shelter for various wildlife. Due to its hardy nature, it is also sometimes cultivated in arid landscapes for its ornamental and practical value.",
    "distribution_introduced_art_desc": "Acacia metrosideriflora was mainly introduced to control soil erosion and for land rehabilitation in degraded areas. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its rapid growth and capacity to fix nitrogen, improving soil fertility. However, it has been reported to spread aggressively, sometimes becoming invasive in certain ecosystems. Its introduction has had both positive ecological and potential negative impacts depending on the local environment."
}
