{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia redacta",
    "plant_slug": "acacia-redacta",
    "plant_name_scientific": "acacia redacta",
    "intro": "Acacia redacta, commonly known as the red acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers arranged in cylindrical spikes, which are highly attractive to pollinators such as bees and birds. Its seeds are encased in pod-like structures that split open when mature, dispersing the seeds by wind. Acacia redacta is adapted to arid and semi-arid environments, making it a resilient species in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia redacta is primarily native to eastern Australia, specifically the coastal regions of New South Wales and southern Queensland. It thrives in sandy soils and is commonly found in open woodlands and heathlands. This species is well adapted to the temperate climate of these areas, often growing in areas with moderate rainfall. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Acacia redacta is also known for its distinctive yellow flowers that bloom during the spring season.",
    "distribution_introduced_art_desc": "Acacia redacta was mainly introduced to areas with a warm, dry climate and well-drained soils, often found in regions with seasonal rainfall. It is commonly established in disturbed sites such as roadsides, agricultural fields, and degraded landscapes. This plant has shown a high capacity for spreading through seed dispersal and vegetative propagation. Its introduction has led to its establishment in several regions outside its native range. However, it is considered a potential invasive species in some areas due to its rapid growth and competitive ability."
}
