{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trinervia",
    "plant_slug": "acacia-trinervia",
    "plant_name_scientific": "acacia trinervia",
    "intro": "Acacia trinervia, commonly known as the narrow-leaf acacia, is a small to medium-sized evergreen shrub or tree native to southern Africa. It is characterized by its slender, trifoliate leaves that are often covered in a fine layer of white, powdery wax. The plant produces small, yellow flowers arranged in cylindrical spikes, which bloom throughout the year in some regions. Its bark is smooth and grayish, and it is often used in traditional medicine for its purported healing properties. Acacia trinervia is also valued for its ability to thrive in arid and semi-arid environments, making it an important species in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trinervia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, rocky outcrops, and along riverbanks in these areas. This plant thrives in well-drained soils and is adapted to withstand periods of drought. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is closely linked to the specific environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia trinervia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, particularly in the Eastern and Western Cape provinces. The plant thrives in sandy or gravelly soils and is often used for soil stabilization due to its extensive root system. It is also valued for its ornamental qualities, with its feathery foliage and yellow flowers. However, its spread has raised concerns about potential invasiveness in some ecosystems."
}
