{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia montana var. psilocarpa",
    "plant_slug": "acacia-montana-var-psilocarpa",
    "plant_name_scientific": "acacia montana var. psilocarpa",
    "intro": "Acacia montana var. psilocarpa, commonly known as the sacred acacia, is a flowering plant native to the mountainous regions of Central America. It belongs to the Fabaceae family and is characterized by its slender, often branched stems and bipinnate leaves. The plant produces yellow to orange flowers that are clustered in spherical inflorescences. Its seeds are encased in a hard, woody pod, and the species is notable for its association with traditional spiritual practices. Due to its ecological significance and cultural importance, it is often protected in its natural habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia montana var. psilocarpa is primarily native to the western United States, specifically California and Nevada. This variety is commonly found in the Mojave Desert and surrounding areas, where it thrives in arid and semi-arid environments. It is often associated with rocky soils and is adapted to withstand extreme temperature fluctuations. The plant is also present in parts of Utah and Arizona, though its distribution is more limited compared to other acacia species. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia montana var. psilocarpa was mainly introduced to areas with suitable climate conditions, including regions with warm temperatures and well-drained soils. It has been established in parts of Australia, particularly in New South Wales and Queensland, where it thrives in open habitats such as woodlands and grasslands. The plant is often found in disturbed soils and can spread rapidly due to its ability to colonize new areas. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. However, it is not considered a major threat in all regions where it has been introduced."
}
