{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sulcata var. sulcata",
    "plant_slug": "acacia-sulcata-var-sulcata",
    "plant_name_scientific": "acacia sulcata var. sulcata",
    "intro": "Acacia sulcata var. sulcata, commonly known as the African screw tree, is a species of flowering plant in the legume family. It is native to parts of Africa and is characterized by its distinctive, spirally twisted branches. The plant produces small, yellow flowers that are clustered in dense, globular inflorescences. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia sulcata var. sulcata is adapted to arid and semi-arid environments, making it a hardy and resilient plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sulcata"
    },
    "taxonomy_art_desc": "Acacia sulcata var. sulcata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with distinct floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their phyllodes and often used in traditional medicine. Its species is Acacia sulcata, a specific type of acacia known for its distinctive leaf structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sulcata var. sulcata is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species typically grows in sandy soils and is adapted to arid and semi-arid environments. It is often seen in open woodlands and shrublands. The plant is well-suited to the climate and ecological conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia sulcata var. sulcata was mainly introduced to areas with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soil conditions. It has been widely planted in regions of Africa, the Middle East, and parts of Australia for land stabilization and as a source of timber and fodder. Its rapid growth and nitrogen-fixing ability make it a valuable species for reforestation and soil improvement projects. However, it can become invasive in some ecosystems, outcompeting native vegetation and altering local biodiversity. Despite its benefits, its introduction has raised concerns about ecological impacts in non-native regions."
}
