{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia laricina var. laricina",
    "plant_slug": "acacia-laricina-var-laricina",
    "plant_name_scientific": "acacia laricina var. laricina",
    "intro": "Acacia laricina var. laricina, commonly known as the slender wattle, is a deciduous shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow globular flowerheads that appear in late winter to early spring. It thrives in well-drained soils and is often found in open woodlands and heathlands. The acacia is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia laricina"
    },
    "taxonomy_art_desc": "Acacia laricina var. laricina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their thorny stems and acacia-like leaves. Its species is Acacia laricina, a specific variety within the Acacia genus, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia laricina var. laricina is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in dry, sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native habitat. The species is an important component of the local flora and plays a role in supporting native wildlife.",
    "distribution_introduced_art_desc": "Acacia laricina var. laricina was mainly introduced to areas with well-drained soils and moderate to warm climates, typically found in regions of the southwestern United States and northern Mexico. It is commonly found in disturbed sites such as roadsides, open woodlands, and rocky slopes. This plant is often used for erosion control due to its rapid growth and ability to thrive in poor soil conditions. It has also been introduced as an ornamental plant in some regions for its attractive foliage and floral display. However, its invasive potential in certain areas has raised concerns among land managers."
}
