{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mearnsii",
    "plant_slug": "acacia-mearnsii",
    "plant_name_scientific": "acacia mearnsii",
    "intro": "Acacia mearnsii, commonly known as black wattle, is a shrub or small tree native to South Africa. It is characterized by its slender, often thorned stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow flowers in cylindrical spikes, which are followed by long, flat pods containing seeds. It is well adapted to dry conditions and can thrive in a variety of soil types. Due to its rapid growth and nitrogen-fixing ability, it is sometimes used in reforestation and soil improvement projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mearnsii"
    },
    "taxonomy_art_desc": "Acacia mearnsii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and ferns, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological characteristics. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in various ecological and commercial contexts. Its species is Acacia mearnsii, a specific type of acacia native to South Africa, known for its rapid growth and use in afforestation and as a source of timber and charcoal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [
        "Algeria",
        "Assam",
        "Brazil South",
        "California",
        "Cape Provinces",
        "Cape Verde",
        "China South-Central",
        "China Southeast",
        "Corse",
        "DR Congo",
        "Ecuador",
        "Eritrea",
        "Eswatini",
        "Ethiopia",
        "Free State",
        "Hawaii",
        "India",
        "Italy",
        "Jamaica",
        "Kenya",
        "KwaZulu-Natal",
        "Lesotho",
        "Madagascar",
        "Madeira",
        "Morocco",
        "Mozambique",
        "Nansei-shoto",
        "Nepal",
        "New Guinea",
        "New Zealand North",
        "New Zealand South",
        "Northern Provinces",
        "Pakistan",
        "Portugal",
        "Rwanda",
        "Réunion",
        "Spain",
        "Sri Lanka",
        "St.Helena",
        "Sudan-South Sudan",
        "Taiwan",
        "Tanzania",
        "Tunisia",
        "Uganda",
        "West Himalaya",
        "Western Australia",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acacia mearnsii is primarily native to New South Wales, South Australia, Tasmania, and Victoria. This species is commonly found in a variety of habitats, including dry sclerophyll forests and open woodlands. It thrives in well-drained soils and is often associated with coastal and inland regions. The plant is known for its hardy nature and ability to tolerate drought conditions. It plays an important ecological role in its native range.",
    "distribution_introduced_art_desc": "Acacia mearnsii was mainly introduced to Algeria, Assam, Brazil South, California, Cape Provinces, Cape Verde, China South-Central, China Southeast, Corse, DR Congo, Ecuador, Eritrea, Eswatini, Ethiopia, Free State, Hawaii, India, Italy, Jamaica, Kenya, KwaZulu-Natal, Lesotho, Madagascar, Madeira, Morocco, Mozambique, Nansei-shoto, Nepal, New Guinea, New Zealand North, New Zealand South, Northern Provinces, Pakistan, Portugal, Rwanda, Réunion, Spain, Sri Lanka, St. Helena, Sudan-South Sudan, Taiwan, Tanzania, Tunisia, Uganda, West Himalaya, Western Australia, Zambia, and Zimbabwe. It was introduced primarily for its fast-growing properties, making it useful for afforestation, erosion control, and as a source of timber and charcoal. However, it has become invasive in many regions, outcompeting native species and altering local ecosystems. Its introduction has had both ecological and economic impacts, depending on the region. Despite its benefits, its spread requires careful management to prevent environmental harm."
}
