{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cummingiana",
    "plant_slug": "acacia-cummingiana",
    "plant_name_scientific": "acacia cummingiana",
    "intro": "Acacia cummingiana, commonly known as the white wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are covered in fine hairs. The plant produces yellow flowers in globular heads, which are typically borne in clusters at the ends of the branches. Its seeds are enclosed in woody pods, and the plant is adapted to arid and semi-arid environments. Acacia cummingiana is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cummingiana"
    },
    "taxonomy_art_desc": "Acacia cummingiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their complex flower structures and diverse leaf forms. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, characterized by their phyllodes and pod fruits. Its species is Acacia cummingiana, a specific type of acacia native to certain regions of Australia, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cummingiana is primarily native to Western Australia. It is found in the coastal regions and surrounding areas of the state. This species typically grows in sandy soils and is often associated with coastal dunes and heathlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia cummingiana plays an important ecological role in the local flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia cummingiana was mainly introduced to areas with warm, dry climates and well-drained soils, often found in regions with low annual rainfall. It is commonly established in disturbed sites such as roadsides, abandoned fields, and along riverbanks. This plant is particularly adapted to thrive in areas with high sunlight exposure and minimal competition from other vegetation. Its introduction has led to its spread in parts of Australia and the Mediterranean. However, it is considered a potential invasive species in some regions due to its rapid growth and ability to outcompete native plants."
}
