{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oldfieldii",
    "plant_slug": "acacia-oldfieldii",
    "plant_name_scientific": "acacia oldfieldii",
    "intro": "Acacia oldfieldii, commonly known as the oldfield acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, branching structure and its distinctive yellow flowers that bloom in winter. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves, adapting to the dry climate. Its root system is deep and extensive, allowing it to access water from deeper soil layers. Acacia oldfieldii plays an important role in stabilizing soils and providing habitat for various desert organisms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia oldfieldii"
    },
    "taxonomy_art_desc": "Acacia oldfieldii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorny foliage and clustered flowers. Its species is Acacia oldfieldii, a specific type of acacia found in certain regions, noted for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oldfieldii is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy or gravelly soils. This species thrives in dry, open habitats such as heathlands and coastal dunes. It is well adapted to the arid and semi-arid climates of its native range. Acacia oldfieldii plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia oldfieldii was mainly introduced to the United States as an ornamental plant due to its attractive yellow flowers and drought tolerance. It has since been found growing in several states, particularly in the southwestern regions. The plant is considered invasive in some areas where it outcompetes native vegetation. Its rapid growth and ability to thrive in disturbed soils contribute to its spread. Management efforts are ongoing to control its distribution and minimize ecological impact."
}
