{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia boboensis",
    "plant_slug": "acacia-boboensis",
    "plant_name_scientific": "acacia boboensis",
    "intro": "Acacia boboensis, commonly known as the Bobo acacia, is a shrub or small tree native to the semi-arid regions of Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is adapted to arid environments, with small, waxy leaves that reduce water loss. It produces yellow flowers and is often used for its timber and as a source of gum arabic. Acacia boboensis plays a role in stabilizing soils and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia boboensis is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in dry savanna and woodland habitats, where it plays an important ecological role. This species is often found in areas with well-drained soils and moderate to high rainfall. It is well adapted to the local climate and can tolerate periods of drought. Acacia boboensis is also known for its ability to fix nitrogen, contributing to soil fertility in its native range.",
    "distribution_introduced_art_desc": "Acacia boboensis was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Kenya, Tanzania, and Uganda. This plant is often used for its hardy nature and ability to withstand drought conditions. Its introduction has been associated with reforestation and land stabilization projects. However, it can also become invasive in certain environments if not managed properly."
}
