{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia blakei",
    "plant_slug": "acacia-blakei",
    "plant_name_scientific": "acacia blakei",
    "intro": "Acacia blakei, commonly known as the Blake's wattle, is a flowering plant native to Western Australia. It is a small shrub that typically grows in sandy or gravelly soils, often in arid or semi-arid regions. The plant produces yellow floral spikes during the warmer months, which are characteristic of the Acacia genus. Its leaves are bipinnate, consisting of multiple small leaflets, and it is well adapted to drought conditions. Acacia blakei plays a role in stabilizing soil and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia blakei"
    },
    "taxonomy_art_desc": "Acacia blakei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some ferns, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for their nitrogen-fixing ability. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing properties. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive umbrella-like flower heads and often used in traditional medicine and for timber. Its species is Acacia blakei, a specific type of acacia that is native to certain regions and is recognized by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia blakei is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, open habitats such as woodlands, grasslands, and rocky outcrops. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Acacia blakei is often associated with sandy or gravelly soils and is well adapted to arid environments. Its distribution is limited to specific areas within these two states, reflecting its ecological preferences and environmental constraints.",
    "distribution_introduced_art_desc": "Acacia blakei was mainly introduced to South Africa, where it has become established in various regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in coastal and sandy soils. This plant is often used for erosion control due to its deep root system and ability to withstand harsh environmental conditions. However, it has also been reported to invade native vegetation, posing a threat to local biodiversity. Its introduction has led to increased management efforts to control its spread in sensitive ecosystems."
}
