{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella var. hispidula",
    "plant_slug": "acacia-pulchella-var-hispidula",
    "plant_name_scientific": "acacia pulchella var. hispidula",
    "intro": "Acacia pulchella var. hispidula, commonly known as the hispid acacia, is a shrub native to the arid regions of Australia. It is characterized by its dense, spiny foliage and small, yellow flowers that bloom in late spring. The plant has compound leaves with phyllodes, which are flattened leaf stalks that perform the function of photosynthesis. It thrives in well-drained soils and is adapted to withstand drought and high temperatures. Its distinctive appearance makes it a popular choice for ornamental gardening in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella var. hispidula is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savanna and shrubland habitats. This variant is adapted to withstand drought and high temperatures, making it a resilient species in its native range. It is often seen growing along roadsides and in open grasslands. Its distribution is closely linked to the ecological conditions of the Kalahari and Namib Desert regions.",
    "distribution_introduced_art_desc": "Acacia pulchella var. hispidula was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, making it a popular choice for landscaping in dry climates. Its introduction has helped in restoring degraded lands and supporting local biodiversity. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
