{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elongata",
    "plant_slug": "acacia-elongata",
    "plant_name_scientific": "acacia elongata",
    "intro": "Acacia elongata, commonly known as the slender wattle, is a shrub native to Australia. It features slender, zigzagging stems and small, phyllodes that are typically linear to narrowly elliptic in shape. The plant produces yellow globular flowers that bloom in spring, attracting nectar-feeding birds and insects. Its leaves are modified into phyllodes, a characteristic feature of many Acacia species. Acacia elongata is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia elongata"
    },
    "taxonomy_art_desc": "Acacia elongata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with pea-like structures and include many legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive fruit and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic phyllodes and often used in various ecological and economic contexts. Its species is Acacia elongata, a specific type of acacia known for its elongated phyllodes and adapted to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [
        "Dominican Republic"
    ],
    "distribution_native_art_desc": "Acacia elongata is primarily native to New South Wales. It is commonly found in the dry, open habitats such as woodlands and grasslands across the state. This species is adapted to the semi-arid and arid regions of the region. It plays an important role in the local ecosystem by providing food and shelter for various wildlife. Its distribution is largely restricted to the specific climatic conditions of New South Wales.",
    "distribution_introduced_art_desc": "Acacia elongata was mainly introduced to the Dominican Republic as an ornamental plant due to its unique appearance and ability to thrive in tropical climates. It has been observed growing in both urban and rural areas, often along roadsides and in disturbed soils. The plant's rapid growth and adaptability have led to its spread beyond cultivated areas, raising concerns about its potential impact on native vegetation. Despite its benefits for erosion control, its introduction has sparked discussions about ecological management. Currently, it is considered a non-native species with limited but increasing presence in the region."
}
