{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chartacea",
    "plant_slug": "acacia-chartacea",
    "plant_name_scientific": "acacia chartacea",
    "intro": "Acacia chartacea, commonly known as the paper acacia, is a shrub native to southern Africa. It is characterized by its delicate, feathery foliage and small, yellow flowers that bloom in clusters. The leaves are narrow and papery, giving the plant its common name, while the bark is smooth and often pale in color. It thrives in well-drained soils and is often found in coastal or sandy environments. This plant is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chartacea"
    },
    "taxonomy_art_desc": "Acacia chartacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and ferns, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are important for nitrogen fixation. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their unique leaf structures and often used in traditional medicine and as sources of timber. Its species is Acacia chartacea, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chartacea is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal and inland regions of the state. This species thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the harsh climatic conditions of the region, including high temperatures and low rainfall. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia chartacea was mainly introduced to control soil erosion and as a source of firewood in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides where it establishes quickly. The plant has become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to thrive in poor soils contribute to its spread. However, it is also valued for its nitrogen-fixing properties and ability to rehabilitate degraded land."
}
