{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cincinnata",
    "plant_slug": "acacia-cincinnata",
    "plant_name_scientific": "acacia cincinnata",
    "intro": "Acacia cincinnata, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its feathery, yellow flowers that bloom in winter and spring. The plant has small, narrow leaves that are often covered in a fine layer of white hairs. It thrives in well-drained soils and is often found in coastal and sandy regions. Acacia cincinnata is also valued for its hardy nature and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cincinnata"
    },
    "taxonomy_art_desc": "Acacia cincinnata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have legumes as their fruit and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, often with phyllodes instead of leaves. Its species is Acacia cincinnata, a specific type of acacia native to Australia, known for its small leaves and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cincinnata is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This plant typically grows in open woodlands and grasslands. It is well adapted to the local climate and soil conditions. Acacia cincinnata plays an important role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acacia cincinnata was mainly introduced to control soil erosion and for its ornamental value in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its rapid growth and ability to thrive in poor soil conditions. This plant is also used for forage and as a windbreak in agricultural landscapes. Its introduction has led to its establishment in several regions outside its native range. However, it is important to monitor its spread to prevent potential ecological impacts."
}
