{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guacamayo",
    "plant_slug": "acacia-guacamayo",
    "plant_name_scientific": "acacia guacamayo",
    "intro": "Acacia guacamayo, commonly known as the yellow acacia, is a flowering plant native to parts of Central and South America. It is characterized by its slender, branching stems and compound leaves that are often covered in fine hairs. The plant produces small, yellowish-green flowers arranged in dense, cylindrical clusters. It thrives in tropical and subtropical climates, often growing in dry, open areas. Acacia guacamayo is also valued for its ability to fix nitrogen in the soil, making it beneficial in ecological restoration efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guacamayo is primarily native to Central America, including countries such as Belize, Guatemala, Honduras, and parts of Mexico. It is commonly found in dry to semi-arid regions, often growing in disturbed or open habitats. This species is also present in some areas of northern South America, particularly in Venezuela and Colombia. It thrives in tropical and subtropical climates with well-drained soils. Acacia guacamayo is known for its ability to withstand drought conditions, making it a resilient plant in its native range.",
    "distribution_introduced_art_desc": "Acacia guacamayo was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. The plant has been widely used in reforestation projects due to its rapid growth and ability to thrive in harsh conditions. However, its introduction has sometimes led to competition with native plant species. Despite its benefits, it requires careful management to prevent overgrowth and ecological imbalance."
}
