{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macracantha var. glabrescens",
    "plant_slug": "acacia-macracantha-var-glabrescens",
    "plant_name_scientific": "acacia macracantha var. glabrescens",
    "intro": "Acacia macracantha var. glabrescens, commonly known as the silky wattle, is a flowering plant native to Australia. It is characterized by its slender, zigzagging stems and small, yellow flowers that appear in globular clusters. The leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. This variety is distinguished by its smooth, glabrous stems and leaves, which give it a silky appearance. It thrives in well-drained soils and is often found in open woodlands and along coastal areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macracantha var. glabrescens is primarily native to northern Australia, including parts of Queensland, the Northern Territory, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This variety is often associated with shrublands and woodland habitats. It thrives in areas with low rainfall and is well adapted to the harsh conditions of the Australian outback. The plant is known for its distinctive yellow flowers and is an important component of the local flora.",
    "distribution_introduced_art_desc": "Acacia macracantha var. glabrescens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western and Eastern Cape provinces. This plant thrives in sandy or loamy soils and is often seen growing along roadsides and in disturbed habitats. Its introduction has led to its spread into native ecosystems, sometimes competing with indigenous flora. Due to its rapid growth and adaptability, it is considered a potential invasive species in some parts of its range."
}
