{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mackenziei",
    "plant_slug": "acacia-mackenziei",
    "plant_name_scientific": "acacia mackenziei",
    "intro": "Acacia mackenziei, commonly known as the Mackenzie acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in globular or cylindrical inflorescences, which are followed by flat, leathery pods. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia mackenziei is often used in ornamental horticulture due to its attractive form and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mackenziei"
    },
    "taxonomy_art_desc": "Acacia mackenziei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and are often legumes, with a significant role in nitrogen fixation. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their compound leaves and unique floral structures, often found in arid and tropical regions. Its species is Acacia mackenziei, a specific type of acacia native to Australia, recognized for its ecological importance and distinctive appearance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mackenziei is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the southern and central areas. This plant thrives in sandy or gravelly soils and is often seen in shrublands and woodland habitats. It is well adapted to the harsh climatic conditions of the region, including high temperatures and low rainfall. Acacia mackenziei plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acacia mackenziei was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It thrives in open landscapes such as grasslands and rocky outcrops, where it can receive ample sunlight. This plant is commonly used for soil stabilization and as a source of timber due to its hardy nature. Its introduction has sometimes led to ecological concerns due to its potential for invasiveness in certain environments. Overall, Acacia mackenziei is valued for its adaptability and utility in both agricultural and ornamental settings."
}
