{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paucijuga",
    "plant_slug": "acacia-paucijuga",
    "plant_name_scientific": "acacia paucijuga",
    "intro": "Acacia paucijuga, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in compact spherical clusters, which are followed by flat, pod-like fruits. It is adapted to arid and semi-arid environments, often growing in sandy or rocky soils. Acacia paucijuga is valued for its hardy nature and is sometimes used in landscaping due to its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paucijuga is primarily native to northern Australia, particularly in the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions, growing in sandy soils and rocky outcrops. This species is well adapted to dry climates and can thrive in areas with low rainfall. It is often seen in coastal and inland desert environments. Acacia paucijuga plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia paucijuga was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with moderate rainfall. It is commonly established in disturbed soils, such as along roadsides, in pastures, and near human settlements. This plant has shown adaptability to various soil types but prefers sandy or loamy soils with good drainage. Its introduction has led to its spread in several parts of the world, including Australia and parts of the United States. However, it is considered a potential invasive species in some regions due to its rapid growth and competitive nature."
}
