{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aulacocarpa var. macrocarpa",
    "plant_slug": "acacia-aulacocarpa-var-macrocarpa",
    "plant_name_scientific": "acacia aulacocarpa var. macrocarpa",
    "intro": "Acacia aulacocarpa var. macrocarpa, commonly known as the large-fruited wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging stems and compound leaves composed of numerous small, needle-like phyllodes. The plant produces yellow globular flowers in spring, which are followed by woody, pod-like fruits containing several seeds. It thrives in well-drained soils and is often found in coastal and sandy regions. The species is valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aulacocarpa var. macrocarpa is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in savanna woodlands and rocky outcrops where it thrives in well-drained soils. It is adapted to withstand drought and high temperatures, making it a resilient species in these environments. The plant plays an important role in local ecosystems by providing habitat and food for various wildlife species. Its distribution is largely limited to the southern African continent, with limited occurrences in neighboring regions.",
    "distribution_introduced_art_desc": "Acacia aulacocarpa var. macrocarpa was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential for soil stabilization. It is commonly found in gardens and along roadsides, particularly in the Western Cape region. This plant thrives in well-drained soils and full sun, making it adaptable to various environmental conditions. However, it is considered invasive in some areas due to its rapid growth and ability to outcompete native vegetation. Its introduction has raised concerns about its impact on local ecosystems and biodiversity."
}
