{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leiophylla var. microcephala",
    "plant_slug": "acacia-leiophylla-var-microcephala",
    "plant_name_scientific": "acacia leiophylla var. microcephala",
    "intro": "Acacia leiophylla var. microcephala, commonly known as the small-headed wattle, is a shrub native to Australia. It features small, yellow flowers arranged in compact globular heads, which are typical of the Acacia genus. The plant has slender, often thornless stems and bipinnate leaves composed of numerous small, rounded leaflets. It thrives in well-drained soils and is adapted to dry, sunny environments. This variety is valued for its ornamental appeal and is often used in horticultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leiophylla var. microcephala is primarily native to the eastern and southern regions of Australia, including Queensland, New South Wales, and parts of South Australia. This variety thrives in dry, sandy soils and is commonly found in coastal and inland areas. It is often associated with open woodlands and heathlands, where it forms part of the native flora. The plant is well adapted to the arid and semi-arid climates of its native range. Due to its ecological significance, it plays an important role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia leiophylla var. microcephala was mainly introduced to specific regions in Australia, particularly in the southern parts of New South Wales and Victoria. It has been cultivated in these areas for its ornamental value and its ability to thrive in dry, sandy soils. This plant is often used in landscaping due to its hardy nature and attractive foliage. However, it is important to note that it has not become naturalized in the wild and remains primarily a cultivated species. Its introduction has been limited to controlled environments and managed landscapes."
}
