{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella f. aculeata",
    "plant_slug": "acacia-pulchella-f-aculeata",
    "plant_name_scientific": "acacia pulchella f. aculeata",
    "intro": "Acacia pulchella f. aculeata, commonly known as the spiny acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its dense, thorny growth and compound leaves that are often covered in fine hairs. The plant produces yellow flowers in clusters, which are followed by cylindrical pods containing seeds. It is well adapted to dry conditions, with deep roots and a low water requirement. The spines provide protection against herbivores, making it a resilient and hardy species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella f. aculeata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. This form is commonly found in arid and semi-arid regions, particularly in rocky soils and along riverbanks. It thrives in areas with low rainfall and is often part of the vegetation in savanna and woodland ecosystems. The plant is well adapted to harsh environmental conditions, making it a resilient species in its native range. Its distribution is largely restricted to the southern African region, where it plays a role in local biodiversity.",
    "distribution_introduced_art_desc": "Acacia pulchella f. aculeata was mainly introduced to ornamental horticulture and landscaping due to its attractive appearance and hardy nature. It is commonly cultivated in regions with warm climates where it can thrive in well-drained soils. This form is often used in gardens and as a decorative plant because of its unique foliage and ability to withstand drought conditions. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact in non-native environments."
}
