{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nematophylla",
    "plant_slug": "acacia-nematophylla",
    "plant_name_scientific": "acacia nematophylla",
    "intro": "Acacia nematophylla, commonly known as the ghost gum, is a small, hardy shrub native to the arid regions of Australia. It is characterized by its slender, grey-green foliage and distinctive, narrow, bottle-shaped leaves. The plant produces small, yellowish flowers that bloom in spring, followed by flat, pod-like fruits. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. Acacia nematophylla is often used in landscaping due to its drought tolerance and unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nematophylla"
    },
    "taxonomy_art_desc": "Acacia nematophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often associated with angiosperm diversity. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia nematophylla, a specific type of acacia found in particular habitats, notable for its unique morphological features and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nematophylla is primarily native to South Australia. It is found in the arid and semi-arid regions of the state, particularly in the northern and central parts. This species typically grows in sandy soils and is adapted to the harsh environmental conditions of the region. It is a shrub that plays an important role in the local ecosystem. Due to its limited distribution, it is considered a rare and threatened plant species in South Australia.",
    "distribution_introduced_art_desc": "Acacia nematophylla was mainly introduced to areas with specific environmental conditions, such as well-drained sandy soils and regions with low rainfall. It is commonly found in coastal dunes and other arid or semi-arid environments. This plant has been introduced to several parts of Australia, particularly in the southern and western regions. Its introduction has been associated with habitat modification and soil stabilization efforts. However, it is also considered a potential invasive species in some areas due to its rapid growth and competitive nature."
}
