{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia desertorum var. nudipes",
    "plant_slug": "acacia-desertorum-var-nudipes",
    "plant_name_scientific": "acacia desertorum var. nudipes",
    "intro": "Acacia desertorum var. nudipes, commonly known as the barefoot acacia, is a shrub native to the arid regions of the Arabian Peninsula. It is characterized by its slender, branched stems and small, spine-tipped leaves that reduce water loss in its harsh environment. The plant produces yellow flowers in clusters, which attract pollinators such as bees and birds. Its wood is hard and durable, making it useful for traditional crafts and construction. Due to its limited distribution and sensitivity to environmental changes, it is considered a vulnerable species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia desertorum"
    },
    "taxonomy_art_desc": "Acacia desertorum var. nudipes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and a specific arrangement of stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and for their hard, durable wood. Its species is Acacia desertorum, a specific variety of acacia adapted to arid environments, with unique morphological features that help it survive in dry conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia desertorum var. nudipes is primarily native to Western Australia. This variant is typically found in the arid and semi-arid regions of the state. It is commonly distributed across the central and western parts of the region, including areas such as the Great Sandy Desert and the Simpson Desert. The plant thrives in sandy soils and is well adapted to the harsh, dry conditions of its native environment. It plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia desertorum var. nudipes was mainly introduced to stabilize sand dunes and prevent soil erosion in arid regions. It is commonly found in areas with low rainfall and extreme temperature fluctuations. This plant is well adapted to harsh environments due to its deep root system and drought-resistant characteristics. Its introduction has helped in reclaiming degraded lands and supporting local biodiversity. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
