{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macalusoi",
    "plant_slug": "acacia-macalusoi",
    "plant_name_scientific": "acacia macalusoi",
    "intro": "Acacia macalusoi, commonly known as the Macaluso acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, paired leaflets that are often covered in a fine layer of white hairs. The plant produces yellow, globular flower heads that attract various pollinators, including bees and birds. It is adapted to survive in harsh, dry conditions with minimal water requirements. Its woody structure and ability to thrive in poor soils make it a resilient component of its ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macalusoi is primarily native to the island of Socotra, which is located in the Arabian Sea off the coast of Yemen. This unique plant is found in the arid and rugged landscapes of Socotra, where it thrives in dry, rocky environments. It is one of the many endemic species that contribute to the island's distinct ecological and botanical significance. The plant is adapted to the extreme conditions of its native habitat, including high temperatures and limited rainfall. Due to its restricted distribution, it is considered a rare and vulnerable species.",
    "distribution_introduced_art_desc": "Acacia macalusoi was mainly introduced to coastal and semi-arid regions of southern Africa, particularly in countries like South Africa, Namibia, and Botswana. It was brought in for its potential in soil stabilization and as a source of timber and fuelwood. The plant thrives in well-drained soils and can tolerate drought conditions, making it suitable for reclamation projects. However, its spread has raised concerns due to its invasive potential in native ecosystems. Despite its benefits, careful management is required to prevent it from outcompeting local flora."
}
