{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nervosa",
    "plant_slug": "acacia-nervosa",
    "plant_name_scientific": "acacia nervosa",
    "intro": "Acacia nervosa, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. Its root system helps prevent soil erosion, and it plays a role in stabilizing sandy soils. Acacia nervosa is also valued for its ornamental appeal and is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nervosa"
    },
    "taxonomy_art_desc": "Acacia nervosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique structural features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid and tropical regions, known for their characteristic phyllodes and often used in traditional medicine. Its species is Acacia nervosa, a specific type of acacia known for its finely veined leaves and is typically found in regions with a Mediterranean climate.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nervosa is primarily native to Western Australia. It is commonly found in the regions of the Wheatbelt and the Geraldton areas. This plant thrives in sandy soils and is often seen in open woodlands and grasslands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is closely linked to the environmental conditions of the southwestern part of the country.",
    "distribution_introduced_art_desc": "Acacia nervosa was mainly introduced to regions with a Mediterranean climate, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and full sun exposure, making it suitable for coastal and inland areas. This plant is often used in landscaping due to its drought tolerance and attractive foliage. However, it can become invasive in some areas if not managed properly. Its introduction has raised concerns about its potential impact on native ecosystems."
}
