{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia praecox f. armata",
    "plant_slug": "acacia-praecox-f-armata",
    "plant_name_scientific": "acacia praecox f. armata",
    "intro": "Acacia praecox f. armata, commonly known as the hairy wattle, is a shrub native to southern Africa. It is characterized by its feathery, bipinnate leaves that are covered in fine, silky hairs, giving it a distinctive appearance. The plant produces yellow flowers in dense, cylindrical spikes, which bloom in early spring. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its ornamental value and hardy nature, it is cultivated in gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia praecox f. armata is primarily native to southern Africa, specifically South Africa. It is found in the eastern and northeastern regions of the country. This plant typically grows in rocky outcrops and dry, sandy soils. It is commonly observed in the Karoo and surrounding areas. Its distribution is limited to specific habitats within these regions.",
    "distribution_introduced_art_desc": "Acacia praecox f. armata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, particularly in the Western and Eastern Cape provinces. This plant is often used for soil stabilization due to its extensive root system and ability to thrive in harsh conditions. It has also been introduced to other parts of the world, including Australia and the United States, for ornamental and ecological purposes. However, its spread has raised concerns about potential invasiveness in non-native environments."
}
