{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia curvifructa",
    "plant_slug": "acacia-curvifructa",
    "plant_name_scientific": "acacia curvifructa",
    "intro": "Acacia curvifructa, commonly known as the warty acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, feathery leaves. The plant produces yellow flowers in globular clusters, which are followed by distinctive, warty pods. It thrives in dry, sandy soils and is adapted to arid and semi-arid environments. Acacia curvifructa is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia curvifructa is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry, open woodlands and shrublands, often on sandy or rocky soils. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is well adapted to fire-prone environments and can resprout from underground stems after bushfires. Acacia curvifructa plays an important ecological role by providing habitat and food for various native animals and insects.",
    "distribution_introduced_art_desc": "Acacia curvifructa was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential for soil stabilization. It is commonly found in gardens and along roadsides, particularly in the coastal regions of the country. The plant thrives in well-drained soils and full sun, making it adaptable to various urban and rural environments. Due to its rapid growth and ability to fix nitrogen, it has been used in reforestation projects. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
