{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lapidosa",
    "plant_slug": "acacia-lapidosa",
    "plant_name_scientific": "acacia lapidosa",
    "intro": "Acacia lapidosa, commonly known as the rock acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, thorny foliage and yellow flowers that bloom in winter. The plant has small, oval-shaped leaves that are often covered in fine hairs. It thrives in arid and semi-arid environments, making it well adapted to drought conditions. Its wood is hard and durable, historically used by indigenous communities for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lapidosa"
    },
    "taxonomy_art_desc": "Acacia lapidosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by the presence of true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by the structure of their flowers and reproductive systems. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, and is recognized by its distinctive pod-like fruits and often compound leaves. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Indian subcontinent, known for their characteristic thorn-like branches and small, often fragrant flowers. Its species is Acacia lapidosa, a specific type of acacia commonly found in arid regions, known for its hard, woody structure and ability to thrive in harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lapidosa is primarily native to Western Australia. It is commonly found in the coastal regions and inland areas of the state. This plant thrives in sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the arid and semi-arid climates of the region. Acacia lapidosa plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia lapidosa was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh conditions. The plant is also valued for its hardy nature and ability to fix nitrogen in the soil. It has been introduced to several regions outside its native range, including parts of the United States and Australia. Its introduction has had both ecological and economic benefits in these areas."
}
