{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ataxiphylla subsp. ataxiphylla",
    "plant_slug": "acacia-ataxiphylla-subsp-ataxiphylla",
    "plant_name_scientific": "acacia ataxiphylla subsp. ataxiphylla",
    "intro": "Acacia ataxiphylla subsp. ataxiphylla, commonly known as the narrow-leaf wattle, is a shrub native to western Australia. It is characterized by its slender, wiry stems and small, narrow, phyllodes that are typically green with a slight reddish tinge. The plant produces yellow globular flowerheads that appear in late summer to early autumn. It is adapted to arid and semi-arid conditions, with a deep root system to access water. The species is often found in sandy soils and is part of the broader Acacia genus known for its ecological and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ataxiphylla"
    },
    "taxonomy_art_desc": "Acacia ataxiphylla subsp. ataxiphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique structural features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes legumes and related plants, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and their ability to thrive in arid environments. Its species is Acacia ataxiphylla, a specific variety within the Acacia genus that is adapted to particular ecological conditions and exhibits unique morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ataxiphylla subsp. ataxiphylla is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This subspecies thrives in arid and semi-arid environments, often growing in sandy or gravelly soils. It is typically found in open woodlands and shrublands. Its distribution is largely restricted to the coastal and inland areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia ataxiphylla subsp. ataxiphylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coast and in open woodlands. This subspecies is known for its distinctive yellow flowers and its ability to thrive in arid conditions. It is often used in ornamental horticulture due to its aesthetic appeal. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
