{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pseudosocotrana",
    "plant_slug": "acacia-pseudosocotrana",
    "plant_name_scientific": "acacia pseudosocotrana",
    "intro": "Acacia pseudosocotrana, commonly known as the Socotra acacia, is a unique plant native to the island of Socotra. It is characterized by its distinctive, thorned stems and bipinnate leaves that are adapted to the arid climate of its native habitat. The plant produces yellow flowers followed by flat, pod-like fruits containing seeds. It is well-suited to rocky and sandy soils, making it a resilient species in harsh environments. Acacia pseudosocotrana is also notable for its role in the local ecosystem and its historical significance in traditional uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pseudosocotrana is primarily native to the Socotra Archipelago, which is located in the Indian Ocean off the coast of the Horn of Africa. This unique plant is found in the dry, arid environments of the islands, particularly on the main island of Socotra. It thrives in rocky and limestone soils, adapting to the harsh climatic conditions of the region. The species is part of the diverse flora that characterizes the endemic biodiversity of Socotra. Due to its limited distribution, it is considered a rare and ecologically significant plant in its native habitat.",
    "distribution_introduced_art_desc": "Acacia pseudosocotrana was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It has been reported in regions of the Arabian Peninsula, including parts of Oman and the United Arab Emirates. This plant is often found in coastal dunes and rocky outcrops, adapting well to harsh environmental conditions. Its introduction has been associated with both natural dispersal and human activities such as land clearing and landscaping. Due to its resilience, it has become an invasive species in some areas, posing challenges to native ecosystems."
}
