{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trigona",
    "plant_slug": "acacia-trigona",
    "plant_name_scientific": "acacia trigona",
    "intro": "Acacia trigona, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, often twisted stems and small, bipinnate leaves. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia trigona is well adapted to arid and semi-arid environments, with a deep root system that allows it to thrive in poor soils. It is also notable for its ability to fix atmospheric nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trigona is primarily native to northern Australia, including regions of Western Australia, South Australia, and the Northern Territory. It thrives in arid and semi-arid environments, often found in sandy soils and open woodlands. This species is commonly associated with coastal and inland dunes, as well as rocky outcrops. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife. Acacia trigona is well adapted to withstand drought and high temperatures, making it a resilient component of the local flora.",
    "distribution_introduced_art_desc": "Acacia trigona was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly used in reforestation projects due to its fast growth and ability to thrive in poor soils. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, its introduction has led to some ecological concerns in certain regions. It is now widely planted in arid and semi-arid areas across Africa and parts of Asia."
}
