{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassiuscula var. pubescens",
    "plant_slug": "acacia-crassiuscula-var-pubescens",
    "plant_name_scientific": "acacia crassiuscula var. pubescens",
    "intro": "Acacia crassiuscula var. pubescens, commonly known as the rough acacia or white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted stems and small, pale green phyllodes that are covered in fine, soft hairs. The plant produces yellow globular flower heads during the winter months, which are arranged in dense clusters. It thrives in well-drained soils and is adapted to dry, sunny conditions. The species is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassiuscula var. pubescens is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in coastal and inland regions, often growing in sandy or loamy soils. This variety is typically associated with open woodlands, heathlands, and rocky outcrops. It thrives in areas with moderate to high rainfall and is well adapted to the local climate. Its distribution is also influenced by its ability to tolerate both full sun and partial shade.",
    "distribution_introduced_art_desc": "Acacia crassiuscula var. pubescens was mainly introduced to Australia as a ornamental plant due to its unique appearance and hardy nature. It has since become naturalized in several regions, particularly in the coastal areas of New South Wales and southern Queensland. The plant thrives in well-drained soils and is often found in disturbed habitats such as roadsides and urban environments. Its introduction has led to concerns about its potential invasiveness in certain ecosystems. Despite its ornamental value, management strategies are being developed to control its spread in sensitive areas."
}
