{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stefaninii",
    "plant_slug": "acacia-stefaninii",
    "plant_name_scientific": "acacia stefaninii",
    "intro": "Acacia stefaninii, commonly known as the Stefanini acacia, is a shrub native to the arid regions of southern Africa. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing ability. The plant features small, yellow, pod-like fruits that contain seeds, and its leaves are compound, consisting of several leaflets. Acacia stefaninii is adapted to survive in dry conditions, with a deep root system that helps it access water from deeper soil layers. It is often used in local landscaping due to its hardy nature and ornamental appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stefaninii is primarily native to the dry, rocky areas of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in arid and semi-arid environments, often found on rocky outcrops and sandy soils. This species is well adapted to withstand drought conditions and high temperatures. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its specific habitat requirements, it is not commonly found outside of its native range.",
    "distribution_introduced_art_desc": "Acacia stefaninii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in coastal and sandy soils. The plant is often used for erosion control due to its ability to stabilize soil with its extensive root system. It is also cultivated for its ornamental value and as a source of fodder for livestock. However, its introduction has raised concerns about its potential to become invasive in local ecosystems."
}
