{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bussei",
    "plant_slug": "acacia-bussei",
    "plant_name_scientific": "acacia bussei",
    "intro": "Acacia bussei, commonly known as the narrow-leaf acacia, is a flowering plant native to the arid regions of southern Africa. It is characterized by its slender, upright growth habit and bipinnate leaves that are composed of numerous small, linear leaflets. The plant produces yellow to golden-orange flowers arranged in dense, cylindrical clusters, which bloom during the rainy season. Acacia bussei is well adapted to drought conditions, with deep root systems that allow it to access water from deeper soil layers. It is often found in sandy or rocky soils and is an important component of the local flora in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bussei is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savanna woodlands and rocky outcrops where it thrives in well-drained soils. This species is adapted to hot, dry climates and can tolerate periods of drought. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia bussei is also sometimes cultivated in regions with similar environmental conditions for its ornamental and practical uses.",
    "distribution_introduced_art_desc": "Acacia bussei was mainly introduced to control erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions. The plant is valued for its rapid growth and ability to thrive in harsh environments. However, it can become invasive and outcompete native vegetation if not managed properly. Its introduction has had both positive and negative ecological impacts depending on the region."
}
