{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dulcis",
    "plant_slug": "acacia-dulcis",
    "plant_name_scientific": "acacia dulcis",
    "intro": "Acacia dulcis, commonly known as the sweet acacia, is a species of flowering plant in the legume family Fabaceae. It is native to parts of Africa and is characterized by its slender, often spiny stems and small, fragrant yellow flowers. The plant produces flat, compound leaves that are typically covered in a fine, white powder, which helps reduce water loss in arid environments. Acacia dulcis is well adapted to dry climates and can thrive in sandy or rocky soils. Its seeds are encased in a hard pod and are often used in traditional medicine and as a source of gum arabic.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dulcis is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the inland areas of Western Australia, South Australia, and parts of Queensland. This plant thrives in sandy or rocky soils and is well adapted to drought conditions. It is often seen in open woodlands and shrublands. Its distribution is closely associated with the natural vegetation of the Australian outback.",
    "distribution_introduced_art_desc": "Acacia dulcis was mainly introduced to areas with arid or semi-arid climates where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. The plant is valued for its hardy nature and ability to withstand drought conditions. It has been introduced to other parts of the world, including parts of Africa and the Middle East, for ornamental and ecological purposes. However, it can become invasive in some environments if not managed properly."
}
