{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acinacea",
    "plant_slug": "acacia-acinacea",
    "plant_name_scientific": "acacia acinacea",
    "intro": "Acacia acinacea, commonly known as the hooded acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its compound leaves, which are often reduced to small, spiny structures, and its distinctive yellow flowers that bloom in globular or cylindrical heads. The plant produces flat, pod-like fruits that contain several seeds, which are dispersed by wind. Acacia acinacea is well adapted to harsh environments, with deep roots that allow it to access water from deeper soil layers. It plays an important ecological role in stabilizing soils and providing habitat for various desert animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia acinacea"
    },
    "taxonomy_art_desc": "Acacia acinacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants with flowers that typically have five petals and include legumes and related families. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their unique, often thorn-like structures and nitrogen-fixing capabilities. Its species is Acacia acinacea, a specific type of acacia found in arid regions, known for its small, clustered flowers and its role in desert ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [
        "India",
        "Tasmania"
    ],
    "distribution_native_art_desc": "Acacia acinacea is primarily native to New South Wales, South Australia, and Victoria. It is commonly found in arid and semi-arid regions across these areas. The plant thrives in sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the dry climate and can withstand periods of drought. This species plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia acinacea was mainly introduced to India and Tasmania. It is a shrub or small tree native to Australia. The plant was likely introduced for its ornamental value or for soil stabilization purposes. It has adapted well to the climates of these regions. However, it is important to monitor its spread to prevent potential ecological impacts."
}
