{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tumida",
    "plant_slug": "acacia-tumida",
    "plant_name_scientific": "acacia tumida",
    "intro": "Acacia tumida, commonly known as the woolly acacia, is a shrub native to southern Africa. It is characterized by its dense, pale green foliage and distinctive, cylindrical flower spikes that bloom in spring. The plant produces small, pod-like fruits that contain edible seeds, which are often used in traditional cuisine. Its thick, waxy leaves help it conserve water, making it well adapted to arid environments. Acacia tumida is also valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tumida"
    },
    "taxonomy_art_desc": "Acacia tumida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique reproductive structures. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and showy petals, and includes important legume families. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia tumida, a specific type of acacia known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia tumida is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important ecological role by providing habitat and food for native wildlife. Its distribution is closely linked to the environmental conditions of the Australian outback.",
    "distribution_introduced_art_desc": "Acacia tumida was mainly introduced to India. It is commonly found in the arid and semi-arid regions of the country. The plant is often used for its hardy nature and ability to thrive in poor soil conditions. It has been introduced for purposes such as afforestation and soil stabilization. However, it is important to monitor its spread to prevent potential ecological imbalances."
}
