{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia yemenensis subsp. obtusifoliolata",
    "plant_slug": "acacia-yemenensis-subsp-obtusifoliolata",
    "plant_name_scientific": "acacia yemenensis subsp. obtusifoliolata",
    "intro": "Acacia yemenensis subsp. obtusifoliolata, commonly known as the Yemen acacia, is a shrub or small tree native to Yemen and parts of the Arabian Peninsula. It is characterized by its bipinnate leaves, which are composed of small, rounded leaflets that give it a distinctive appearance. The plant produces yellow globular flowers, which are clustered in dense inflorescences. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. Acacia yemenensis subsp. obtusifoliolata is well adapted to drought conditions and is an important component of the local flora in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia yemenensis subsp. obtusifoliolata is primarily native to Yemen and parts of Saudi Arabia. It is commonly found in the southern regions of Yemen, particularly in the highlands and mountainous areas. This subspecies thrives in arid and semi-arid environments, often growing in rocky soils. It is adapted to the hot and dry climate typical of the Arabian Peninsula. The plant is well-suited to regions with low rainfall and high temperatures.",
    "distribution_introduced_art_desc": "Acacia yemenensis subsp. obtusifoliolata was mainly introduced to areas with arid to semi-arid climates, characterized by low rainfall and well-drained soils. It thrives in regions with temperatures ranging from 15°C to 35°C, making it suitable for dryland environments. This subspecies is commonly found in rocky or sandy soils, often in association with other drought-tolerant flora. Its introduction has been primarily for soil stabilization and as a source of fodder for livestock. Due to its hardy nature, it is also used in reforestation efforts in degraded landscapes."
}
