{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lanuginosa",
    "plant_slug": "acacia-lanuginosa",
    "plant_name_scientific": "acacia lanuginosa",
    "intro": "Acacia lanuginosa, commonly known as the silky acacia, is a shrub native to southern Africa. It is characterized by its slender, branching stems covered in soft, white, woolly hairs. The plant produces small, yellow flowers that bloom in clusters, typically during the warmer months. Its leaves are bipinnate, consisting of numerous small, oval-shaped leaflets. Acacia lanuginosa is often found in rocky or sandy soils and is adapted to arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lanuginosa is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, particularly in coastal areas and sandy soils. This plant thrives in coastal dunes and is often associated with maritime climates. It is well adapted to high salinity and wind exposure, making it a characteristic species of the Arabian coastal environment. Acacia lanuginosa plays an important ecological role in stabilizing dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia lanuginosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the coastal areas and along the edges of the Great Karoo. This plant thrives in sandy or gravelly soils and is often seen in disturbed habitats. Its introduction has led to its spread beyond its original range, contributing to local ecological changes. It is valued for its hardy nature and ability to withstand drought conditions."
}
