{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia alata var. glabrata",
    "plant_slug": "acacia-alata-var-glabrata",
    "plant_name_scientific": "acacia alata var. glabrata",
    "intro": "Acacia alata var. glabrata, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its slender, branching stems and small, feathery leaves. The plant produces yellow flowers in summer, which are clustered in dense, cylindrical spikes. It thrives in well-drained soils and is often found in coastal and sandy environments. This variety is distinguished by its smooth, glabrous stems, which set it apart from other acacia species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia alata var. glabrata is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, often growing in sandy soils. This variety is adapted to withstand high temperatures and low rainfall conditions. It is typically found in open woodlands and along riverbanks. Its distribution is also recorded in some parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia alata var. glabrata was mainly introduced to ornamental horticulture and reforestation projects due to its attractive appearance and hardy nature. It is commonly cultivated in regions with warm climates where it can thrive in well-drained soils. The plant's ability to tolerate drought and poor soil conditions makes it a popular choice for landscaping and ecological restoration. However, its introduction has raised concerns about potential invasiveness in certain areas. Despite its benefits, careful management is recommended to prevent unintended ecological impacts."
}
