{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia loretensis",
    "plant_slug": "acacia-loretensis",
    "plant_name_scientific": "acacia loretensis",
    "intro": "Acacia loretensis, commonly known as the Loretto acacia, is a species of flowering plant in the legume family, Fabaceae. It is native to the tropical regions of Central America, particularly in countries like Mexico and Guatemala. The plant is characterized by its slender, often multi-branched stem and bipinnate leaves that are compound and feathery in appearance. Its yellow flowers are arranged in dense, globular inflorescences, making it visually striking. Acacia loretensis is valued for its ornamental qualities and is sometimes cultivated in botanical gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia loretensis is primarily native to the tropical regions of Central America, specifically found in countries such as Mexico, Guatemala, and Honduras. It thrives in dry to semi-arid environments, often growing in limestone soils. This species is commonly found in scrublands and open woodlands, where it contributes to the local vegetation structure. It plays an important role in the ecosystem by providing habitat and food for various wildlife species. Due to its limited distribution, it is considered a regionally important plant in its native range.",
    "distribution_introduced_art_desc": "Acacia loretensis was mainly introduced to areas with a tropical or subtropical climate, characterized by warm temperatures and seasonal rainfall. It thrives in well-drained soils and is commonly found in savannas and open woodlands. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced to several regions outside its native range for ecological restoration and ornamental purposes. However, its introduction has raised concerns about potential invasiveness in some ecosystems."
}
