{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ericifolia",
    "plant_slug": "acacia-ericifolia",
    "plant_name_scientific": "acacia ericifolia",
    "intro": "Acacia ericifolia, commonly known as the coastal acacia, is a shrub native to southern Africa. It is characterized by its small, feathery leaves and yellow flowers that bloom in winter. The plant thrives in coastal areas and sandy soils, often growing in maritime climates. Its root system helps stabilize dunes and prevent erosion. Acacia ericifolia is well adapted to salt spray and can tolerate moderate drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ericifolia"
    },
    "taxonomy_art_desc": "Acacia ericifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used in landscaping and for their medicinal properties. Its species is Acacia ericifolia, a specific type of acacia characterized by its dense foliage and adaptability to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ericifolia is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the areas of the South West and the Mid West. This plant typically grows in sandy or gravelly soils and is often associated with coastal and inland heathlands. It is well adapted to the Mediterranean climate of Western Australia, with periods of drought and seasonal rainfall. Acacia ericifolia plays an important role in local ecosystems, providing habitat and food for various native fauna.",
    "distribution_introduced_art_desc": "Acacia ericifolia was mainly introduced to control soil erosion and provide windbreaks in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions. The plant is valued for its rapid growth and ability to thrive in harsh environments. However, it can become invasive in some regions, outcompeting native vegetation. Its introduction has had both beneficial and problematic ecological impacts depending on the local environment."
}
