{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elongata var. hebecephala",
    "plant_slug": "acacia-elongata-var-hebecephala",
    "plant_name_scientific": "acacia elongata var. hebecephala",
    "intro": "Acacia elongata var. hebecephala, commonly known as the narrow-leaf wattle, is a shrub native to Western Australia. It is characterized by its slender, upright growth habit and narrow, linear leaves that are often a deep green color. The plant produces yellow flowers in late winter to early spring, which are arranged in compact, cylindrical spikes. It is well adapted to arid and semi-arid environments, with a deep root system that allows it to survive in poor soils. This variety is often used in landscaping due to its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elongata var. hebecephala is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This plant is commonly found in sandy soils and along rocky outcrops in these areas. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native habitat. The species is often seen in shrublands and woodlands, contributing to the local biodiversity. Its distribution is closely tied to the specific ecological niches it occupies in southern Africa.",
    "distribution_introduced_art_desc": "Acacia elongata var. hebecephala was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often in disturbed habitats. This plant is considered an invasive species in some parts of its range due to its rapid growth and ability to outcompete native vegetation. It is also used in horticulture for its ornamental value, particularly its distinctive foliage. However, its spread requires careful management to prevent ecological harm."
}
