{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia undulata var. longispina",
    "plant_slug": "acacia-undulata-var-longispina",
    "plant_name_scientific": "acacia undulata var. longispina",
    "intro": "Acacia undulata var. longispina, commonly known as the long-spined wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow globular flowers in late winter to early spring, which are followed by long, straight pods. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its distinctive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia undulata var. longispina is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in well-drained soils. This variety is adapted to semi-arid and arid climates, making it a resilient plant in these regions. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is also influenced by the availability of water and the specific microclimatic conditions of its habitat.",
    "distribution_introduced_art_desc": "Acacia undulata var. longispina was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and parts of the Western Cape provinces. This plant thrives in dry, sandy soils and is often seen along roadsides and in open grasslands. Its introduction has led to some ecological concerns due to its potential invasive nature. It is valued for its hardy growth and ability to withstand harsh environmental conditions."
}
