{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia turgida",
    "plant_slug": "acacia-turgida",
    "plant_name_scientific": "acacia turgida",
    "intro": "Acacia turgida, commonly known as the stiff acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its dense, thorny branches and small, pale green or yellowish leaves. The plant produces yellow flowers in globular clusters, which are followed by flat, pod-like fruits containing seeds. Acacia turgida is well adapted to drought conditions, with deep roots and a slow growth rate. It plays an important ecological role in stabilizing soil and providing habitat for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia turgida is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in dry, rocky habitats and sandy soils, often in arid or semi-arid regions. This plant thrives in areas with low rainfall and is adapted to withstand periods of drought. It is often seen growing along roadsides, in shrublands, and on rocky outcrops. Acacia turgida plays an important role in local ecosystems by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia turgida was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It is commonly established in disturbed sites such as roadsides, pastures, and degraded lands. This plant thrives in full sun and is relatively drought-tolerant, making it adaptable to various environmental conditions. Its introduction has led to its spread in several regions outside its native range. However, it is considered a potential invasive species in some areas due to its rapid growth and ability to outcompete native vegetation."
}
