{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia salinarum",
    "plant_slug": "acacia-salinarum",
    "plant_name_scientific": "acacia salinarum",
    "intro": "Acacia salinarum, commonly known as the saltbush acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its small, yellow flowers and feathery, salt-tolerant foliage. The plant thrives in saline soils and is adapted to withstand extreme drought conditions. Its root system helps stabilize sandy or degraded soils, making it useful for land rehabilitation. Acacia salinarum plays a vital role in supporting local wildlife, including insects and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia salinarum is primarily native to the coastal regions of southern Africa, particularly Namibia and South Africa. It thrives in arid and semi-arid environments, often found along the Atlantic coastline. This species is commonly associated with sandy soils and is well adapted to salty and windy conditions. It plays an important role in stabilizing dunes and providing habitat for local wildlife. Acacia salinarum is also known for its ability to tolerate extreme drought and high salinity levels.",
    "distribution_introduced_art_desc": "Acacia salinarum was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in saline and poor soil conditions. This plant has been introduced to various parts of Australia, particularly in areas with high salinity. Its introduction has helped in restoring degraded lands and supporting biodiversity in these environments. However, it is important to monitor its spread to prevent potential ecological impacts."
}
