{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sclerophylla var. lissophylla",
    "plant_slug": "acacia-sclerophylla-var-lissophylla",
    "plant_name_scientific": "acacia sclerophylla var. lissophylla",
    "intro": "Acacia sclerophylla var. lissophylla, commonly known as the silky acacia, is a shrub or small tree native to the arid and semi-arid regions of southern Africa. It is characterized by its narrow, leathery leaves that are covered in a fine, silky white pubescence, giving it a distinctive appearance. The plant produces yellow flowers in dense, globular clusters, which attract a variety of pollinators such as bees and birds. It is well adapted to drought conditions, with a deep root system that allows it to thrive in poor soils. This species is often used in landscaping for its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sclerophylla var. lissophylla is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the Pilbara and Goldfields regions, where it thrives in sandy soils. This plant is adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to the inland areas of the state.",
    "distribution_introduced_art_desc": "Acacia sclerophylla var. lissophylla was mainly introduced to areas with well-drained soils and a Mediterranean climate, particularly in southern Australia. It thrives in full sun and is commonly found in coastal regions and sandy soils. This plant is often used in landscaping due to its hardy nature and ability to withstand drought conditions. It has also been introduced to parts of California and South Africa for ornamental purposes. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
