{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subcaerulea var. subsessilis",
    "plant_slug": "acacia-subcaerulea-var-subsessilis",
    "plant_name_scientific": "acacia subcaerulea var. subsessilis",
    "intro": "Acacia subcaerulea var. subsessilis, commonly known as the blue acacia or blue wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spindly growth habit and its distinctive blue-green foliage. The leaves are compound, consisting of several pairs of small, elliptical leaflets. It produces yellow flowers in globular heads, which are often visited by birds and insects. This species is adapted to arid and semi-arid environments, making it a hardy plant suitable for dryland conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subcaerulea var. subsessilis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in rocky outcrops, sand dunes, and dry shrublands where it thrives in well-drained soils. This variant is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. Its distribution is often associated with areas that have a distinct dry season and limited vegetation cover. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia subcaerulea var. subsessilis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. This plant is often used for erosion control due to its hardy nature and ability to withstand harsh environmental conditions. However, it is considered a potential invasive species in some areas, outcompeting native flora. Its introduction has raised concerns among conservationists due to its rapid spread and ecological impact."
}
