{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptostachya",
    "plant_slug": "acacia-leptostachya",
    "plant_name_scientific": "acacia leptostachya",
    "intro": "Acacia leptostachya, commonly known as the slender-stemmed acacia, is a shrub native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow or pale green inflorescences composed of numerous small flowers. It thrives in arid and semi-arid environments, often found in rocky soils and along coastal regions. Acacia leptostachya is also notable for its role in providing habitat and forage for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leptostachya"
    },
    "taxonomy_art_desc": "Acacia leptostachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their diverse floral structures and evolutionary relationships. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their phyllodes and often used in various ecological and economic contexts. Its species is Acacia leptostachya, a specific type of acacia known for its slender staminal filaments and typically found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptostachya is primarily native to Queensland. It is found in the northern and central regions of the state. This plant typically grows in dry, open habitats such as grasslands and woodlands. It is well adapted to the semi-arid and tropical climates of Queensland. Its distribution is largely confined to specific ecological zones within the region.",
    "distribution_introduced_art_desc": "Acacia leptostachya was mainly introduced to areas with a dry climate and well-drained soils, typically found in arid and semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it suitable for regions such as parts of Africa, the Middle East, and Australia. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It is also valued for its hardy nature and ability to grow in poor soil conditions. However, its introduction has sometimes led to ecological concerns in non-native regions."
}
