{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dissona var. dissona",
    "plant_slug": "acacia-dissona-var-dissona",
    "plant_name_scientific": "acacia dissona var. dissona",
    "intro": "Acacia dissona var. dissona, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its slender, often multi-branched stems and small, feathery leaves. The plant produces yellow flowers in globular or cylindrical clusters, which are typically visited by various pollinators. It is well adapted to dry and arid conditions, making it a resilient species in its native habitat. The wood of Acacia dissona var. dissona is strong and durable, historically used by Indigenous Australians for tool-making.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dissona"
    },
    "taxonomy_art_desc": "Acacia dissona var. dissona belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique anatomical features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which comprises plants that typically have flowers with five petals and include legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acicular leaves and often used in traditional medicine and for their hard wood. Its species is Acacia dissona, a specific type within the Acacia genus, which is native to certain regions of Australia and is recognized for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dissona var. dissona is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in arid and semi-arid environments. It is often seen in open woodlands and shrublands. Its distribution is closely associated with sandy soils and coastal areas.",
    "distribution_introduced_art_desc": "Acacia dissona var. dissona was mainly introduced to areas with a warm, dry climate and well-drained soils, often in regions with low rainfall. It is commonly found in coastal and inland areas where it can tolerate high salinity and sandy soils. This plant is often used for erosion control and as a windbreak due to its hardy nature. It has also been introduced as an ornamental plant because of its distinctive foliage and ability to thrive in challenging environments. Its distribution is largely limited to regions where it can establish itself without significant competition from native vegetation."
}
