{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farnesiana var. cavenia",
    "plant_slug": "acacia-farnesiana-var-cavenia",
    "plant_name_scientific": "acacia farnesiana var. cavenia",
    "intro": "Acacia farnesiana var. cavenia, commonly known as the sweet acacia, is a shrub or small tree native to the Mediterranean region. It is characterized by its feathery, bipinnate leaves and yellow, spherical flower heads that bloom in spring. The plant is often cultivated for its ornamental value and is also used in traditional medicine. It thrives in well-drained soils and requires full sun to partial shade. Its ability to fix nitrogen makes it beneficial for soil enrichment in ecological settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farnesiana var. cavenia is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky, or coastal environments, often found in areas with mild winters and warm, dry summers. This variety is particularly common in countries such as Spain, Italy, Greece, and the Levant. It is well adapted to arid and semi-arid climates, making it a resilient plant in such regions. Its native range includes both coastal and inland areas, where it often forms part of the local vegetation.",
    "distribution_introduced_art_desc": "Acacia farnesiana var. cavenia was mainly introduced to the Mediterranean region for ornamental purposes due to its attractive foliage and ability to thrive in arid conditions. It has also been introduced to parts of North Africa and the Middle East as a decorative and drought-resistant plant. The species is commonly found in urban landscapes and along roadsides where it provides shade and erosion control. However, its invasive potential has raised concerns in some areas where it outcompetes native vegetation. Despite its benefits, careful management is recommended to prevent unintended ecological impacts."
}
