{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia salvadorensis",
    "plant_slug": "acacia-salvadorensis",
    "plant_name_scientific": "acacia salvadorensis",
    "intro": "Acacia salvadorensis, commonly known as the Salvadoran acacia, is a shrub or small tree native to Central America. It is characterized by its bipinnate leaves and yellow-orange flowers that bloom in clusters. The plant produces long, slender pods that contain seeds enclosed in a fibrous covering. It thrives in dry, tropical climates and is often found in savannas and along riverbanks. Acacia salvadorensis is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia salvadorensis is primarily native to El Salvador, specifically in the central and northern regions of the country. It is commonly found in dry tropical forests and scrublands, often growing in areas with well-drained soils. This species is adapted to the warm, arid climate typical of its native habitat. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to habitat loss, it is also considered a rare and threatened species in its native range.",
    "distribution_introduced_art_desc": "Acacia salvadorensis was mainly introduced to the region of El Salvador as a potential source of timber and for its ability to stabilize soil in degraded areas. It was introduced during the 20th century as part of reforestation efforts aimed at restoring ecosystems affected by deforestation. However, its rapid growth and invasive tendencies have led to concerns about its impact on native flora and fauna. Despite its ecological risks, it is still cultivated in some areas for its hardy nature and economic value. The distribution of Acacia salvadorensis is now primarily limited to specific regions in El Salvador where it has been planted."
}
