{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia congesta subsp. cliftoniana",
    "plant_slug": "acacia-congesta-subsp-cliftoniana",
    "plant_name_scientific": "acacia congesta subsp. cliftoniana",
    "intro": "Acacia congesta subsp. cliftoniana, commonly known as the Clifton's acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, thorny foliage and yellow flowers that appear in clusters. The plant has small, oblong phyllodes that are often covered in fine hairs. It thrives in arid and semi-arid environments, showing adaptability to poor soils. The species is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia congesta"
    },
    "taxonomy_art_desc": "Acacia congesta subsp. cliftoniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures and reproductive systems. Its order is Fabales, which comprises plants with characteristic legume-like flowers and includes economically significant crops such as beans and peas. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees primarily found in tropical and subtropical regions, known for their acicular leaves and often used in traditional medicine. Its species is Acacia congesta, a specific type within the Acacia genus, which is further divided into subspecies, with Acacia congesta subsp. cliftoniana being one such subspecies adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia congesta subsp. cliftoniana is primarily native to Western Australia. This subspecies is found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. It typically grows in sandy soils and is commonly associated with coastal and near-coastal environments. The plant is well adapted to the dry and often windy conditions of its native habitat. It is an important component of the local flora and plays a role in the ecological balance of the region.",
    "distribution_introduced_art_desc": "Acacia congesta subsp. cliftoniana was mainly introduced to South Africa, where it has been established in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. This subspecies is adapted to semi-arid and coastal environments. It is often used in landscaping due to its ornamental value and hardiness. However, it is considered a potential invasive species in some areas."
}
