{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia discolor var. angustifolia",
    "plant_slug": "acacia-discolor-var-angustifolia",
    "plant_name_scientific": "acacia discolor var. angustifolia",
    "intro": "Acacia discolor var. angustifolia, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, angular leaves that are typically 2–6 cm long and have a distinctive yellowish-green color. The plant produces yellow globular flowers in late summer to early autumn, which are clustered in dense, spherical inflorescences. It thrives in well-drained soils and is often found in coastal or sandy habitats. This variety is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive foliage and flowering display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia discolor var. angustifolia is primarily native to eastern Australia, including parts of New South Wales and Queensland. It is commonly found in dry, open habitats such as grasslands, woodlands, and heathlands. This variety is adapted to arid and semi-arid environments, often growing on sandy or rocky soils. It is part of the broader Acacia genus, which is well-known for its ecological and economic importance in Australia. The plant plays a significant role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia discolor var. angustifolia was mainly introduced to Australia as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread beyond cultivated areas and is now found in several regions across the country. The plant is considered invasive in some parts of its range, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to thrive in disturbed environments contribute to its spread. Management efforts are ongoing to control its proliferation and mitigate its ecological impact."
}
