{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia berlandieri",
    "plant_slug": "acacia-berlandieri",
    "plant_name_scientific": "acacia berlandieri",
    "intro": "Acacia berlandieri, commonly known as the honey mesquite, is a shrub or small tree native to the southwestern United States and northern Mexico. It is characterized by its slender, often spiny branches and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellowish-green flowers that are clustered in spherical heads, followed by flat, pod-like fruits containing edible seeds. It is adapted to arid and semi-arid environments, with deep roots that allow it to thrive in poor soils. Acacia berlandieri is also valued for its role in providing forage for wildlife and livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia berlandieri is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in desert and semi-desert regions, including parts of Arizona, New Mexico, Texas, and California. This plant thrives in arid and rocky environments, often growing on limestone soils. It is known for its ability to withstand extreme temperatures and limited water availability. Acacia berlandieri plays an important role in stabilizing soil and providing habitat for various desert wildlife.",
    "distribution_introduced_art_desc": "Acacia berlandieri was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in arid and semi-arid regions, particularly in areas with well-drained soils. This plant is often used for erosion control due to its deep root system and ability to thrive in harsh conditions. It has also been introduced as an ornamental plant in some regions because of its distinctive appearance. However, it can become invasive in certain areas if not managed properly."
}
