{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia × cedilloi",
    "plant_slug": "acacia-×-cedilloi",
    "plant_name_scientific": "acacia × cedilloi",
    "intro": "Acacia × cedilloi, commonly known as the hybrid acacia, is a naturally occurring hybrid between Acacia angulata and Acacia longifolia. It is a shrub or small tree native to coastal regions of southern Australia. The plant features bipinnate leaves that are often reduced to spines, and it produces yellow flowers in globular or cylindrical clusters. It is well adapted to sandy soils and coastal environments, showing tolerance to salt spray and wind. The hybrid is notable for its ecological role in stabilizing dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia × cedilloi is primarily native to the tropical and subtropical regions of northern Australia, particularly in the Northern Territory and Queensland. This hybrid species is commonly found in sandy soils along coastal areas and in the mulga woodlands. It thrives in environments with low rainfall and high temperatures, often growing in open habitats. The plant is well adapted to the harsh conditions of the arid and semi-arid zones of its native range. Its distribution is closely associated with areas where its parent species, Acacia aneura and Acacia retinodes, naturally occur.",
    "distribution_introduced_art_desc": "Acacia × cedilloi was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This hybrid plant is often used in ornamental landscaping due to its attractive foliage and ability to withstand drought conditions. However, its invasive potential has raised concerns in some areas where it competes with native vegetation. Despite its benefits, careful management is necessary to prevent its spread into sensitive ecosystems."
}
