{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia martinicensis",
    "plant_slug": "acacia-martinicensis",
    "plant_name_scientific": "acacia martinicensis",
    "intro": "Acacia martinicensis, commonly known as the Martinique acacia, is a flowering plant native to the Caribbean islands. It is a member of the legume family, Fabaceae, and is characterized by its slender, branching structure and bipinnate leaves. The plant produces small, yellowish-green flowers that are clustered in spherical inflorescences. It thrives in tropical and subtropical climates, often found in coastal areas and disturbed soils. Acacia martinicensis is also valued for its ability to fix nitrogen, contributing to soil fertility in its natural habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia martinicensis is primarily native to the Caribbean islands, particularly the French West Indies, including Martinique, Guadeloupe, and Saint Lucia. It is also found in parts of the Greater Antilles, such as Cuba and Hispaniola. This species thrives in coastal areas and dry forests, often growing on limestone soils. It is an important component of the local flora and has adapted to the tropical climate with seasonal droughts. Due to habitat loss and invasive species, its distribution has become increasingly restricted.",
    "distribution_introduced_art_desc": "Acacia martinicensis was mainly introduced to stabilize soil and prevent erosion in areas with poor soil quality. It is commonly used in reforestation projects due to its fast growth rate and ability to thrive in harsh conditions. This plant has been introduced to several regions outside its native habitat, including parts of Africa and the Middle East. Its introduction has helped in restoring degraded lands and improving biodiversity in those areas. However, it has also raised concerns about its potential to become invasive in some ecosystems."
}
