{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia × grayana",
    "plant_slug": "acacia-×-grayana",
    "plant_name_scientific": "acacia × grayana",
    "intro": "Acacia × grayana, commonly known as the silver wattle, is a hybrid plant resulting from the cross between Acacia dealbata and Acacia longifolia. It is native to southern Australia and is characterized by its silvery-blue foliage and yellow globular flowerheads. The plant is a shrub or small tree, typically growing up to 5 meters in height. It thrives in well-drained soils and is drought-tolerant, making it suitable for coastal and semi-arid environments. The botanical features of Acacia × grayana make it an ornamental plant valued for its aesthetic appeal and adaptability.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia × grayana"
    },
    "taxonomy_art_desc": "Acacia × grayana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and ability to thrive in arid environments. Its species is Acacia × grayana, a hybrid plant resulting from the cross between two Acacia species, exhibiting characteristics from both parent plants.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia × grayana is primarily native to Victoria. This hybrid plant is found in the state of Victoria, Australia. It typically grows in areas with a Mediterranean climate, characterized by dry summers and wet winters. The plant is commonly seen in coastal regions and open woodlands. Its distribution is limited to specific habitats within Victoria due to its particular environmental requirements.",
    "distribution_introduced_art_desc": "Acacia × grayana was mainly introduced to areas with warm, dry climates and well-drained soils, often as an ornamental or for its hardy nature. It is commonly found in regions such as southern Africa, parts of Australia, and the Mediterranean. This hybrid plant is valued for its fast growth and ability to thrive in poor soil conditions. However, it can become invasive in some environments if not managed properly. Its introduction has raised concerns about ecological impact in certain regions."
}
