{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia desertorum var. desertorum",
    "plant_slug": "acacia-desertorum-var-desertorum",
    "plant_name_scientific": "acacia desertorum var. desertorum",
    "intro": "Acacia desertorum var. desertorum, commonly known as the desert acacia, is a shrub native to arid and semi-arid regions of the southwestern United States and northern Mexico. It is characterized by its slender, branching stems and small, compound leaves that reduce water loss in hot, dry environments. The plant produces yellow flowers in late spring, which are clustered in spherical inflorescences. Its root system is deep and extensive, allowing it to access groundwater in nutrient-poor soils. This species is well adapted to harsh desert conditions and plays a role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia desertorum"
    },
    "taxonomy_art_desc": "Acacia desertorum var. desertorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pods as fruits and often forming symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often spiny foliage and pod-like fruits. Its species is Acacia desertorum, a specific type of acacia adapted to arid environments, typically found in desert regions with specific ecological and morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia desertorum var. desertorum is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the Nullarbor Plain and surrounding areas. This plant thrives in sandy soils and is well adapted to the harsh, dry conditions of the region. It is often seen growing along roadsides and in open habitats. Its distribution is limited to the southern and central parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia desertorum var. desertorum was mainly introduced to stabilize sand dunes and prevent soil erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh, dry environments. The plant has shallow roots that help bind the soil, making it effective for land restoration. It is also valued for its drought tolerance and minimal water requirements. However, its introduction has raised concerns about potential ecological impacts on native plant communities."
}
