{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacallis caerulea",
    "plant_slug": "acacallis-caerulea",
    "plant_name_scientific": "acacallis caerulea",
    "intro": "Acacallis caerulea, commonly known as the blue acacia, is a flowering plant native to South Africa. It belongs to the Amaryllidaceae family and is characterized by its striking blue-violet flowers that bloom in summer. The plant has strap-shaped leaves and produces seed pods that split open to release its seeds. It thrives in well-drained soils and full sun, making it a popular choice for rock gardens and coastal landscapes. Due to its ornamental value, it is often cultivated in gardens for its vibrant color and unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacallis caerulea is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Western Cape, Eastern Cape, and parts of the Northern Cape. This plant thrives in sandy or rocky soils and is commonly found in coastal and mountainous areas. It is well adapted to the Mediterranean climate of the region, with dry summers and wet winters. Acacallis caerulea is often seen growing in open vegetation types like fynbos and renostervlei.",
    "distribution_introduced_art_desc": "Acacallis caerulea was mainly introduced to New Zealand as an ornamental plant due to its attractive blue flowers and hardy nature. It was first brought there in the 19th century by European settlers who admired its aesthetic value. Despite its beauty, it has since become invasive in some areas, outcompeting native species for resources. The plant thrives in well-drained soils and full sun, making it adaptable to a variety of environments. Its rapid spread has led to increased management efforts to control its impact on local ecosystems."
}
