{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia forsythii",
    "plant_slug": "acacia-forsythii",
    "plant_name_scientific": "acacia forsythii",
    "intro": "Acacia forsythii, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is part of the legume family, Fabaceae, and has the ability to fix nitrogen through symbiotic relationships with rhizobia bacteria. It is often used in landscaping for its ornamental value and is also valued for its role in soil stabilization. Acacia forsythii is adapted to a variety of soil types and can thrive in both full sun and partial shade.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia forsythii"
    },
    "taxonomy_art_desc": "Acacia forsythii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and ferns, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinct structure and include legumes and other related families. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their acacia-like features, including phyllodes and often being used for timber or as ornamental plants. Its species is Acacia forsythii, a specific type of acacia native to certain regions, recognized by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia forsythii is primarily native to New South Wales. It is commonly found in the central and western regions of the state. This plant typically grows in dry, open habitats such as grasslands and rocky outcrops. It is well adapted to the arid and semi-arid climates of its native range. Acacia forsythii plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia forsythii was mainly introduced to areas with dry, semi-arid climates where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the arid and semi-arid zones of Western Australia and South Australia. This plant is well adapted to withstand drought conditions and high temperatures, making it a resilient species in harsh environments. It is often used for soil stabilization and as a ornamental plant in landscaping. Its introduction has helped in ecological restoration projects in degraded lands."
}
