{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegal",
    "plant_slug": "acacia-senegal",
    "plant_name_scientific": "acacia senegal",
    "intro": "Acacia senegal, commonly known as the gum arabic tree, is a flowering plant native to the Sahel region of Africa. It is a deciduous shrub or small tree that can grow up to 6 meters tall, with a thick, flaky bark and small, bipinnate leaves. The plant is notable for producing a valuable gum, known as acacia gum or gum arabic, which is exuded from its bark. Its flowers are small, yellowish-green, and clustered in dense, spherical inflorescences. Acacia senegal thrives in arid and semi-arid environments, often growing in sandy soils and along riverbanks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegal is primarily native to the Sahel region of Africa, including countries such as Sudan, Chad, Niger, and Mali. It thrives in semi-arid and arid environments, often found in sandy soils and along riverbanks. This plant is also present in parts of the Arabian Peninsula and the Horn of Africa. It plays an important ecological role in preventing soil erosion and providing habitat for various species. Acacia senegal is well adapted to hot, dry climates and is commonly used for its gum arabic production.",
    "distribution_introduced_art_desc": "Acacia senegal was mainly introduced to regions where its gum arabic is highly valued for industrial and commercial uses. It is commonly found in arid and semi-arid areas of Africa, particularly in countries like Sudan, Ethiopia, and Somalia. The plant thrives in sandy soils and requires minimal water, making it well-suited for harsh environments. Its introduction has also supported local economies through the production of gum arabic, which is used in food, pharmaceuticals, and cosmetics. However, its spread has sometimes led to competition with native vegetation, raising ecological concerns."
}
