{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia morrisonii",
    "plant_slug": "acacia-morrisonii",
    "plant_name_scientific": "acacia morrisonii",
    "intro": "Acacia morrisonii, commonly known as the Morrison's acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures in mature plants. The plant produces yellow globular flower heads, which are clustered in dense, spherical inflorescences. It is well adapted to drought conditions, with a deep root system that allows it to survive in nutrient-poor soils. Acacia morrisonii is also noted for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia morrisonii is primarily native to the arid regions of western Australia, specifically the Pilbara and Geraldton areas. It thrives in sandy soils and is commonly found in coastal and inland dunes. This species is well adapted to the harsh, dry climate with low rainfall. It plays an important role in stabilizing sand dunes and providing habitat for local wildlife. Acacia morrisonii is also known for its distinctive yellow flowers that bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia morrisonii was mainly introduced to South Africa, where it has been cultivated for its ornamental value and hardy nature. It is commonly found in gardens and along roadsides due to its ability to thrive in arid and semi-arid conditions. The plant is also used in reforestation projects because of its fast growth and nitrogen-fixing properties. However, it has been identified as an invasive species in some regions, outcompeting native vegetation. Its introduction has led to ecological concerns, prompting management strategies to control its spread."
}
