{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia etbaica var. hirta",
    "plant_slug": "acacia-etbaica-var-hirta",
    "plant_name_scientific": "acacia etbaica var. hirta",
    "intro": "Acacia etbaica var. hirta, commonly known as the Ethiopian acacia, is a shrub or small tree native to Ethiopia. It is characterized by its slender, branching structure and phyllodes that are typically hairy, giving it the species name *hirta*. The plant produces yellow flowers in globular or cylindrical inflorescences, which bloom during the dry season. Its leaves are reduced to flattened, leaf-like structures called phyllodes, which help reduce water loss in arid environments. The plant is adapted to grow in rocky soils and is often found in dry, mountainous regions of Ethiopia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia etbaica var. hirta is primarily native to Eritrea and northern Ethiopia. It is commonly found in the highland regions of these countries, particularly in areas with rocky soils and elevations ranging from 1,500 to 3,000 meters above sea level. This plant thrives in arid and semi-arid environments, often growing along riverbanks and in open woodlands. It is an important component of the local vegetation and plays a role in stabilizing soil in these regions. Its distribution is closely linked to the specific climatic and geological conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia etbaica var. hirta was mainly introduced to South Africa, where it has been cultivated for its ornamental value and drought tolerance. It is commonly found in regions with semi-arid to arid climates, particularly in the western and northern parts of the country. This plant is often used in landscaping due to its attractive foliage and ability to thrive in poor soils. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its introduction has been linked to both horticultural practices and natural dispersal mechanisms."
}
