{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macocentra",
    "plant_slug": "acacia-macocentra",
    "plant_name_scientific": "acacia macocentra",
    "intro": "Acacia macocentra, commonly known as the red acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stem and bipinnate leaves that are feathery in appearance. The plant produces yellow flowers in globular or cylindrical inflorescences, which are followed by flat, linear pods. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The species is also valued for its ecological role in providing habitat and food for various insects and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macocentra is primarily native to southern Africa, specifically South Africa. It is commonly found in the Eastern Cape, Western Cape, and parts of KwaZulu-Natal. This plant thrives in coastal and sandy soils, often in open woodlands and grasslands. It is well adapted to the Mediterranean climate of the region, with a winter rainfall pattern. Acacia macocentra is an important component of the local flora and is often used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia macocentra was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern and Western Cape provinces, as well as in KwaZulu-Natal. The plant thrives in sandy soils and is often found in coastal and inland areas with a Mediterranean climate. Due to its rapid growth and ability to spread vegetatively, it has become an invasive species in some parts of its range. It is now considered a weed in agricultural and natural ecosystems."
}
