{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia moggii",
    "plant_slug": "acacia-moggii",
    "plant_name_scientific": "acacia moggii",
    "intro": "Acacia moggii, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves and yellow floral spikes that bloom in spring. The plant is part of the legume family, Fabaceae, and has the ability to fix nitrogen in the soil through its root nodules. Its flowers are not only ornamental but also attract a variety of pollinators such as bees and birds. The golden wattle is the national floral emblem of Australia and holds cultural significance in Indigenous Australian traditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia moggii is primarily native to northern Australia, including the Northern Territory, Western Australia, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant is well adapted to harsh environmental conditions and thrives in areas with low rainfall. It is often seen growing along roadsides, in open woodlands, and on rocky outcrops. Acacia moggii is also known as the \"whistling wood\" due to the sound it makes when the wind passes through its foliage.",
    "distribution_introduced_art_desc": "Acacia moggii was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. It has been introduced to several countries in Africa, Asia, and the Middle East as part of ecological restoration efforts. However, in some areas, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
