{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hebeclada subsp. tristis",
    "plant_slug": "acacia-hebeclada-subsp-tristis",
    "plant_name_scientific": "acacia hebeclada subsp. tristis",
    "intro": "Acacia hebeclada subsp. tristis, commonly known as the slender acacia, is a shrub native to parts of southern Africa. It typically grows in coastal and sandy soils, thriving in well-drained environments. The plant features small, bipinnate leaves and produces yellow flowers in globular heads. It is often used in ornamental gardening due to its hardy nature and attractive foliage. The subspecies is distinguished by its slender growth habit and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hebeclada subsp. tristis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. This subspecies is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. It thrives in environments with high temperatures and limited water availability. The plant is well adapted to the harsh conditions of its native habitat, displaying drought-resistant characteristics. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia hebeclada subsp. tristis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and resilience. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in a variety of soil types and is particularly common in coastal and lowland regions. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
