{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mathuataensis",
    "plant_slug": "acacia-mathuataensis",
    "plant_name_scientific": "acacia mathuataensis",
    "intro": "Acacia mathuataensis, commonly known as the Socotra acacia, is a unique species native to the island of Socotra. It is characterized by its distinctive, flat, fan-shaped leaves and long, thin, yellowish-green thorns. The plant produces small, yellow flowers that bloom in clusters, followed by pods containing seeds. It thrives in arid and semi-arid environments, showcasing adaptations to the harsh climate of its native habitat. Due to its ecological importance and unique appearance, it is considered a valuable component of Socotra's biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mathuataensis"
    },
    "taxonomy_art_desc": "Acacia mathuataensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants known for their acicular leaves and often used in traditional medicine and as sources of timber. Its species is Acacia mathuataensis, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mathuataensis is primarily native to Fiji. It is found in the tropical regions of the country, particularly in the lowland areas. This species thrives in moist, well-drained soils and is commonly seen in forested habitats. It plays an important role in the local ecosystem and is part of the native flora of Fiji. The plant is adapted to the warm and humid climate typical of the region.",
    "distribution_introduced_art_desc": "Acacia mathuataensis was mainly introduced to areas with arid or semi-arid climates, particularly in regions of Australia and parts of Southeast Asia. It thrives in well-drained soils and is often found in disturbed or degraded landscapes. This plant is commonly used for soil stabilization and as a source of timber and fodder. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. It is also valued for its ability to fix nitrogen, improving soil fertility in degraded areas."
}
