{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia grandistipula",
    "plant_slug": "acacia-grandistipula",
    "plant_name_scientific": "acacia grandistipula",
    "intro": "Acacia grandistipula, commonly known as the large-leaf acacia, is a deciduous shrub or small tree native to South America. It is characterized by its slender, branching stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellowish-green flowers in globular or cylindrical inflorescences, which are often visited by insects and birds. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia grandistipula is often found in dry, open habitats such as savannas and rocky slopes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia grandistipula is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is also found in parts of India, particularly in the eastern and southern regions. This species thrives in tropical and subtropical climates, often growing in lowland areas with well-drained soils. It is commonly found in open forests, grasslands, and along roadsides. Acacia grandistipula is an important plant in local ecosystems, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia grandistipula was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and degraded forests. It thrives in tropical and subtropical climates, particularly in regions with well-drained soils and moderate to high rainfall. This plant is often found in coastal areas and can tolerate salt spray, making it common in coastal dunes and mangrove ecosystems. Its rapid growth and ability to fix nitrogen contribute to its success in colonizing new environments. However, it can become invasive in some regions, outcompeting native vegetation and altering local ecosystems."
}
