{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia merrallii",
    "plant_slug": "acacia-merrallii",
    "plant_name_scientific": "acacia merrallii",
    "intro": "Acacia merrallii, commonly known as the Merrall's wattle, is a shrub native to eastern Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late summer. The plant is adapted to dry, sandy soils and is often found in coastal and inland regions. It produces flat, pod-like fruits that contain seeds dispersed by wind. Acacia merrallii is valued for its ornamental appeal and its role in stabilizing soil in arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia merrallii"
    },
    "taxonomy_art_desc": "Acacia merrallii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chloroplasts and a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their vascular systems and reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures and diverse habitats. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their ability to fix atmospheric nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or bean family, which is recognized for its distinctive fruit type, the legume, and its ecological importance in nitrogen fixation. Its genus is Acacia, a large group of shrubs and trees primarily found in arid and tropical regions, known for their distinctive, often thorn-bearing foliage and nitrogen-fixing capabilities. Its species is Acacia merrallii, a specific type of acacia native to certain regions of Australia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia merrallii is primarily native to South Australia and Western Australia. This species is commonly found in the arid and semi-arid regions of these two Australian states. It thrives in sandy soils and is often associated with shrublands and open woodlands. The plant is well adapted to the dry climate and can tolerate periods of drought. Its distribution is largely restricted to the specific ecological conditions found in these regions.",
    "distribution_introduced_art_desc": "Acacia merrallii was mainly introduced to areas with well-drained soils and a temperate climate, particularly in regions where it can thrive in full sun. It has been successfully established in parts of the southeastern United States, including states like Georgia, Florida, and Texas. This plant is often used for erosion control due to its deep root system and ability to withstand drought conditions. Its introduction has been primarily for ornamental purposes and land stabilization. However, it is important to monitor its spread to prevent potential ecological impacts."
}
