{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassicarpa",
    "plant_slug": "acacia-crassicarpa",
    "plant_name_scientific": "acacia crassicarpa",
    "intro": "Acacia crassicarpa, commonly known as the thick-leaf acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, dark green foliage and produces yellow flowers in clusters. The plant has compound leaves with small, oval-shaped leaflets and is often used in traditional medicine. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid environments. The acacia also plays a role in supporting local wildlife, including birds and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia crassicarpa"
    },
    "taxonomy_art_desc": "Acacia crassicarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns, horsetails, and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises plants known for their legume-like fruits and often nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and commercial contexts. Its species is Acacia crassicarpa, a specific type of acacia native to Australia, known for its dense foliage and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassicarpa is primarily native to New Guinea and Queensland. It is commonly found in tropical and subtropical regions of these areas. This plant thrives in open woodlands, savannas, and along riverbanks. It is well adapted to the warm and humid climate of its native range. Acacia crassicarpa is an important component of the local flora and plays a significant role in the ecosystems of New Guinea and Queensland.",
    "distribution_introduced_art_desc": "Acacia crassicarpa was mainly introduced to regions with a warm, temperate climate and well-drained soils, particularly in parts of Australia and the Mediterranean. It is commonly found in coastal areas and disturbed soils due to its adaptability and rapid growth. This species is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has sometimes led to the displacement of native vegetation in certain areas. However, it plays an important ecological role in providing habitat for various wildlife species."
}
