{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia praecox",
    "plant_slug": "acacia-praecox",
    "plant_name_scientific": "acacia praecox",
    "intro": "Acacia praecox, commonly known as the early acacia, is a shrub native to southern Africa. It is characterized by its slender, multi-branched stems and feathery, bipinnate leaves. The plant produces yellow, spherical flower heads that bloom in late summer, attracting various pollinators. Its seeds are enclosed in long, slender pods that split open when mature. Acacia praecox is well adapted to arid and semi-arid environments, making it a resilient component of its ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia praecox is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Zimbabwe. It thrives in arid and semi-arid regions, often found in savannas and rocky outcrops. This plant is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role by providing food and shelter for various wildlife species. Its distribution is closely linked to the availability of well-drained soils and sufficient sunlight.",
    "distribution_introduced_art_desc": "Acacia praecox was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, particularly in the Western Cape. The plant is known for its ability to thrive in arid and semi-arid conditions, making it a pioneer species in disturbed habitats. It is often used for erosion control due to its rapid growth and extensive root system. However, its spread can sometimes lead to the displacement of native vegetation, raising concerns about its ecological impact."
}
