{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia citrinoviridis",
    "plant_slug": "acacia-citrinoviridis",
    "plant_name_scientific": "acacia citrinoviridis",
    "intro": "Acacia citrinoviridis, commonly known as the golden-green acacia, is a flowering plant native to the island of Madagascar. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in dense, globular clusters. The plant belongs to the Fabaceae family, which includes legumes, and it has a symbiotic relationship with nitrogen-fixing bacteria. Its unique coloration and structure make it a striking ornamental plant, though it is not widely cultivated outside its native habitat. The species is also noted for its ability to thrive in arid conditions, showcasing its adaptability to harsh environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia citrinoviridis"
    },
    "taxonomy_art_desc": "Acacia citrinoviridis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as ornamental plants. Its species is Acacia citrinoviridis, a specific type of acacia known for its yellow-green foliage and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia citrinoviridis is primarily native to Western Australia. This species is found in the southern and western regions of the state, particularly in the areas of the Geraldton and Shark Bay regions. It typically grows in sandy soils and is commonly found in coastal and inland areas. The plant is well adapted to the arid and semi-arid conditions of its native habitat. It plays an important role in the local ecosystem and is a characteristic feature of the region's flora.",
    "distribution_introduced_art_desc": "Acacia citrinoviridis was mainly introduced to New Zealand as an ornamental plant due to its unique yellow foliage and drought tolerance. It has since become naturalized in several regions, particularly in the North Island, where it thrives in coastal and sandy soils. Despite its aesthetic appeal, it has raised concerns due to its potential to invade native ecosystems and compete with indigenous flora. The plant's rapid growth and ability to spread through seed dispersal have led to its classification as a potential environmental weed. Management efforts are ongoing to control its spread and mitigate its impact on local biodiversity."
}
