{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lanceolata",
    "plant_slug": "acacia-lanceolata",
    "plant_name_scientific": "acacia lanceolata",
    "intro": "Acacia lanceolata, commonly known as the narrowleaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, lance-shaped phyllodes that are typically green and covered in fine hairs. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical inflorescences. Acacia lanceolata thrives in well-drained soils and is often found in coastal and inland regions. It is valued for its ornamental appeal and is used in ecological restoration projects due to its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lanceolata"
    },
    "taxonomy_art_desc": "Acacia lanceolata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that are often legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acicular leaves and often for their ability to thrive in arid environments. Its species is Acacia lanceolata, a specific type of acacia known for its lance-shaped leaves and is commonly found in various regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lanceolata is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal and inland regions of the state. This plant thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the hot, dry climate typical of much of Western Australia. Acacia lanceolata plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia lanceolata was mainly introduced to South Africa, where it has become naturalized in various regions. It is commonly found in coastal areas and along roadsides, thriving in sandy and well-drained soils. This plant is often used for soil stabilization and as a source of timber and fodder. Its rapid growth and adaptability have led to its spread beyond its original introduction sites. However, it is considered a potential invasive species in some areas due to its competitive nature."
}
