{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia semispinosa",
    "plant_slug": "acacia-semispinosa",
    "plant_name_scientific": "acacia semispinosa",
    "intro": "Acacia semispinosa, commonly known as the spinifex acacia, is a shrub or small tree native to Australia. It is characterized by its woody stems and compound leaves that are often covered in fine hairs. The plant produces yellow flowers in globular or cylindrical clusters, which are followed by hard, woody pods containing seeds. It is well adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions. Acacia semispinosa plays an important role in stabilizing soils and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia semispinosa is primarily native to southern Australia, including parts of New South Wales, Victoria, and South Australia. It is commonly found in dry, sandy soils and is adapted to arid and semi-arid environments. This species thrives in open woodlands and shrublands, often along riverbanks and in coastal areas. Its distribution extends into Western Australia, where it is found in similar ecological settings. Acacia semispinosa is an important component of the native flora in these regions, contributing to local biodiversity.",
    "distribution_introduced_art_desc": "Acacia semispinosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and parts of the Western Cape, growing in open woodlands and along roadsides. The plant thrives in well-drained soils and is adapted to semi-arid climates. It is often used for its hardy nature and ability to fix nitrogen, making it beneficial for soil improvement. However, its introduction has raised concerns about potential invasiveness in some ecosystems."
}
