{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia haematites",
    "plant_slug": "acacia-haematites",
    "plant_name_scientific": "acacia haematites",
    "intro": "Acacia haematites, commonly known as the red acacia, is a small shrub native to southern Africa. It is characterized by its dense, thorny stems and small, bright yellow flowers that bloom in spring. The plant has bipinnate leaves composed of numerous tiny leaflets, and its flowers are clustered in spherical inflorescences. Acacia haematites is well adapted to arid and semi-arid environments, making it a resilient species in harsh conditions. It is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia haematites"
    },
    "taxonomy_art_desc": "Acacia haematites belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissue and true roots. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns, horsetails, and some seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod-like fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and the production of nitrogen-fixing root nodules. Its species is Acacia haematites, a specific type of acacia native to Australia, characterized by its bright red flowers and use in traditional medicine and landscaping.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia haematites is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This species thrives in dry, sandy soils and is often seen in shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia haematites plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia haematites was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly used in rehabilitation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation. Proper management is essential to balance its ecological benefits and potential risks."
}
