{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chrysocephala",
    "plant_slug": "acacia-chrysocephala",
    "plant_name_scientific": "acacia chrysocephala",
    "intro": "Acacia chrysocephala, commonly known as the yellow acacia, is a deciduous shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its feathery, bipinnate leaves and clusters of yellow, globular flowers that bloom in winter. The plant produces flat, pod-like fruits that contain seeds covered in a sticky, resinous substance. It is well adapted to drought conditions, with deep roots that allow it to survive in nutrient-poor soils. Acacia chrysocephala is also valued for its role in traditional medicine and as a source of timber and charcoal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chrysocephala"
    },
    "taxonomy_art_desc": "Acacia chrysocephala belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes and other related families. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive leaf structures and often used in traditional medicine and as sources of timber. Its species is Acacia chrysocephala, a specific type of acacia found in certain regions of Africa, known for its yellow flowers and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chrysocephala is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the state. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the hot and dry climate typical of much of Western Australia. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia chrysocephala was mainly introduced to areas with suitable climatic conditions, including regions with warm temperatures and low to moderate rainfall. It thrives in well-drained soils and is commonly found in savannas and dry forests. This plant has been introduced to several countries in Africa, particularly in regions where it can provide both ecological and economic benefits. Its introduction has sometimes led to competition with native plant species, raising concerns about its impact on local biodiversity. Despite this, it is valued for its hardiness and ability to stabilize soil in degraded landscapes."
}
