{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trichodella",
    "plant_slug": "acacia-trichodella",
    "plant_name_scientific": "acacia trichodella",
    "intro": "Acacia trichodella, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and small, fern-like leaves. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in dry, sandy soils and is well adapted to arid and semi-arid environments. Acacia trichodella is also known for its ability to fix nitrogen, making it an important plant in ecological restoration efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trichodella is primarily native to parts of East Africa, including countries such as Kenya, Tanzania, and Somalia. It is commonly found in dry savannas and woodlands where it thrives in arid and semi-arid conditions. This species is also present in some regions of the Horn of Africa, such as Eritrea and Ethiopia. It prefers well-drained soils and is often found in association with other drought-tolerant plants. Acacia trichodella plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia trichodella was mainly introduced to areas with dry, sandy soils and a warm climate, often in regions where it is used for erosion control or as a source of timber. It is commonly found in parts of Australia, where it has been introduced for its hardy nature and ability to thrive in harsh conditions. The plant's introduction has sometimes led to concerns about its potential to become invasive in certain ecosystems. Due to its adaptability, it has been planted in various parts of the world, including some regions of the United States and Southeast Asia. However, its distribution remains largely limited to specific environmental conditions that support its growth."
}
