{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subtilifolia",
    "plant_slug": "acacia-subtilifolia",
    "plant_name_scientific": "acacia subtilifolia",
    "intro": "Acacia subtilifolia, commonly known as the slender-leaved acacia, is a shrub native to southern Africa. It is characterized by its narrow, linear leaves that are finely divided, giving it a delicate appearance. The plant produces small, yellowish flowers arranged in cylindrical spikes, which are typical of the Acacia genus. It thrives in arid and semi-arid environments, often found in sandy soils. Its botanical features make it an important species in ecological studies and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subtilifolia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savanna and shrubland ecosystems. This species is well adapted to drought conditions and can tolerate high temperatures. It often grows in open areas with minimal vegetation cover. Acacia subtilifolia plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia subtilifolia was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in arid and semi-arid regions where it establishes quickly and forms dense thickets. The plant is valued for its ability to thrive in poor soils and its drought tolerance. However, it can become invasive in some areas, outcompeting native vegetation. Its distribution has expanded due to its ecological and agricultural benefits, though management is required to prevent overgrowth."
}
