{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia calamistrata",
    "plant_slug": "acacia-calamistrata",
    "plant_name_scientific": "acacia calamistrata",
    "intro": "Acacia calamistrata, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and its distinctive, feathery foliage composed of small, silky-haired leaflets. The plant produces yellow, globular flower heads that are highly attractive to bees and other pollinators. Its seeds are encased in elongated, woody pods that split open to release the seeds. Acacia calamistrata is adapted to arid and semi-arid environments, making it a resilient plant in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia calamistrata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, rocky outcrops, and sandy soils where it thrives in dry conditions. This species is well adapted to the harsh climate of its native habitat, exhibiting drought tolerance and a deep root system. It plays an important ecological role by providing shelter and food for local wildlife. The plant is also known for its distinctive, thorny appearance and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia calamistrata was mainly introduced to Australia as an ornamental plant due to its unique appearance and hardy nature. It has since become naturalized in several regions, particularly in the eastern and southern parts of the country. The plant thrives in a variety of soil types but prefers well-drained soils and full sun exposure. Its rapid growth and ability to colonize disturbed areas have led to concerns about its potential invasiveness. Despite its ornamental value, management strategies are being developed to control its spread in sensitive ecosystems."
}
