{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macracantha var. glabra",
    "plant_slug": "acacia-macracantha-var-glabra",
    "plant_name_scientific": "acacia macracantha var. glabra",
    "intro": "Acacia macracantha var. glabra, commonly known as the smooth wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and phyllodes that are smooth and glabrous, giving it its varietal name. The plant produces yellow globular flower heads in late summer to early autumn, which are highly attractive to birds and insects. It thrives in well-drained soils and is often found in open woodlands and along coastal areas. The smooth wattle is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardy nature and visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macracantha var. glabra is primarily native to eastern Australia, including the states of New South Wales, Queensland, and Victoria. It is commonly found in dry, open habitats such as woodlands, grasslands, and coastal areas. This variety is adapted to a range of soil types but prefers well-drained soils. It is often seen in regions with a temperate to subtropical climate. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia macracantha var. glabra was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, thriving in coastal and sandy soils. This plant is often used in ornamental horticulture due to its attractive yellow flowers and drought tolerance. However, it has also been reported to spread beyond cultivation, posing a potential risk to native vegetation. Its introduction has led to discussions regarding its ecological impact and management in invaded areas."
}
