{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drummondii subsp. elegans",
    "plant_slug": "acacia-drummondii-subsp-elegans",
    "plant_name_scientific": "acacia drummondii subsp. elegans",
    "intro": "Acacia drummondii subsp. elegans, commonly known as the elegant acacia, is a shrub native to the arid regions of Australia. It features slender, upright stems and small, feathery leaves that are adapted to reduce water loss in dry environments. The plant produces yellow flowers in dense, globular clusters, which attract various pollinators such as bees and birds. It is often found in sandy soils and can thrive in full sun. Its ornamental value makes it a popular choice for drought-tolerant landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia drummondii"
    },
    "taxonomy_art_desc": "Acacia drummondii subsp. elegans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, and is notable for the presence of nitrogen-fixing symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and semi-arid regions, known for their distinctive acacia-like flowers and often used for timber and medicinal purposes. Its species is Acacia drummondii, a specific type of acacia that is further divided into subspecies, with subsp. elegans being one of its recognized variants.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drummondii subsp. elegans is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Avon-Ord River region. This subspecies thrives in sandy soils and is commonly found in coastal and inland dune systems. It is often associated with open woodlands and shrublands, where it forms part of the local vegetation. The plant is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia drummondii subsp. elegans was mainly introduced to New South Wales, Australia, as part of ornamental horticulture and revegetation programs. It is commonly found in coastal and inland regions where it thrives in well-drained soils. The plant is known for its attractive foliage and ability to tolerate drought and salty conditions. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its distribution highlights the ecological impact of introduced plant species in native ecosystems."
}
