{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia reclinata var. binervis",
    "plant_slug": "acacia-reclinata-var-binervis",
    "plant_name_scientific": "acacia reclinata var. binervis",
    "intro": "Acacia reclinata var. binervis, commonly known as the slender acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, drooping branches and bipinnate leaves, which are divided into small, linear leaflets. The plant produces yellow flowers in dense, cylindrical inflorescences, which are highly attractive to pollinators such as bees and birds. It thrives in well-drained soils and is often found in savanna and woodland habitats. The species is valued for its ornamental appeal and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia reclinata var. binervis is primarily native to eastern and southern Africa, including countries such as Tanzania, Kenya, Uganda, Rwanda, Burundi, and the Democratic Republic of the Congo. It thrives in savanna and woodland habitats, often found in areas with well-drained soils. This variant is commonly associated with dry to semi-arid regions, where it forms part of the local vegetation. It is well adapted to seasonal droughts and can tolerate a range of soil types. The plant plays an important ecological role in its native range, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia reclinata var. binervis was mainly introduced to the northern regions of South Africa, particularly in the Mpumalanga and Limpopo provinces. It thrives in semi-arid to arid environments, often found in rocky outcrops and along riverbanks. This variant is known for its distinctive bipinnate leaves and yellow flowers, which make it a popular ornamental plant. Its introduction has led to its cultivation in gardens and as a pioneer species in degraded landscapes. However, it is considered invasive in some areas, posing a threat to native flora."
}
