{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia coolgardiensis subsp. effusa",
    "plant_slug": "acacia-coolgardiensis-subsp-effusa",
    "plant_name_scientific": "acacia coolgardiensis subsp. effusa",
    "intro": "Acacia coolgardiensis subsp. effusa, commonly known as the slender acacia, is a shrub native to the arid regions of Southwestern Australia. It is characterized by its narrow, often twisted stems and small, feathery leaves that are adapted to reduce water loss in its harsh environment. The plant produces yellow flowers in globular heads, which attract a variety of pollinators such as bees and birds. It is typically found in sandy or gravelly soils and is well-suited to low-nutrient, drought-prone areas. Due to its resilience and unique appearance, it is sometimes cultivated in dry gardens as an ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia coolgardiensis subsp. effusa is primarily native to the arid and semi-arid regions of Western Australia. It is found in the southern parts of the state, particularly in the areas of the Fitzgerald River National Park and the Shark Bay region. This subspecies thrives in sandy soils and is commonly associated with coastal and inland dune systems. It is well adapted to the harsh climatic conditions of its native habitat, including high temperatures and low rainfall. The plant plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia coolgardiensis subsp. effusa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, often growing along the edges of forests and in open habitats. This subspecies is known for its ability to thrive in arid and semi-arid conditions, making it adaptable to various environments. It is sometimes cultivated for its ornamental value due to its distinctive foliage and flowering patterns. However, its introduction has raised concerns about potential ecological impacts on native plant communities."
}
