{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sambesiaca",
    "plant_slug": "acacia-sambesiaca",
    "plant_name_scientific": "acacia sambesiaca",
    "intro": "Acacia sambesiaca, commonly known as the Brazilian wattle, is a deciduous shrub or small tree native to Brazil. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow floral spikes. The plant is well adapted to tropical and subtropical climates, often growing in sandy or rocky soils. It plays a role in soil stabilization and is sometimes used in traditional medicine. Its flowers attract pollinators such as bees and butterflies, contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sambesiaca is primarily native to Brazil, specifically the states of Pará, Amazonas, and Maranhão. It is commonly found in the Amazon rainforest and surrounding areas. This plant thrives in tropical and subtropical climates with high humidity and well-drained soil. It is often associated with secondary forests and disturbed areas. Its distribution is also extended to parts of northern South America.",
    "distribution_introduced_art_desc": "Acacia sambesiaca was mainly introduced to the Americas, particularly in Brazil, as part of ornamental and agroforestry initiatives. It has been widely planted in urban and rural areas due to its fast growth and ability to thrive in poor soil conditions. However, its introduction has raised concerns about its potential to become an invasive species in certain ecosystems. Despite its ecological benefits, its spread requires careful management to prevent negative impacts on native flora. The plant's distribution highlights the balance between ecological utility and environmental risk."
}
