{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia xylocarpa",
    "plant_slug": "acacia-xylocarpa",
    "plant_name_scientific": "acacia xylocarpa",
    "intro": "Acacia xylocarpa, commonly known as the ironwood acacia, is a shrub or small tree native to the arid regions of Australia. It is characterized by its dense, hard wood, which is highly valued for its strength and durability. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves, and it produces yellow flowers in spring. It is adapted to survive in dry conditions with a deep root system and waxy leaf surfaces to reduce water loss. Acacia xylocarpa plays an important ecological role by providing habitat and food for various desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia xylocarpa is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry, open habitats such as woodlands, grasslands, and heathlands. This species thrives in regions with a subtropical to temperate climate, often in areas with well-drained soils. It is well adapted to withstand drought and fire, making it a resilient component of the local flora. Acacia xylocarpa plays an important ecological role by providing habitat and food for various native animals and insects.",
    "distribution_introduced_art_desc": "Acacia xylocarpa was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for degraded or disturbed lands. This plant is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has been noted in parts of Australia, Africa, and the Middle East. However, it can become invasive in some environments if not managed properly."
}
