{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scorpioides var. adstringens",
    "plant_slug": "acacia-scorpioides-var-adstringens",
    "plant_name_scientific": "acacia scorpioides var. adstringens",
    "intro": "Acacia scorpioides var. adstringens, commonly known as the African silver acacia, is a shrub or small tree native to southern Africa. It features narrow, leathery leaves that are often clustered at the ends of branches. The plant produces yellow globular flowers that bloom in winter, adding ornamental value. Its bark and leaves contain tannins, which have been traditionally used for their astringent properties. It is well adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scorpioides var. adstringens is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variety thrives in sandy or rocky soils and is commonly found in savanna and grassland ecosystems. It is well adapted to drought conditions and can tolerate high temperatures. The plant is often seen growing along roadsides and in disturbed areas. Its distribution is largely confined to the southern half of the African continent.",
    "distribution_introduced_art_desc": "Acacia scorpioides var. adstringens was mainly introduced to control soil erosion and for its use in traditional medicine. It is commonly found in disturbed areas such as roadsides, degraded lands, and along riverbanks. The plant is valued for its ability to thrive in poor soil conditions and its rapid growth rate. It has been used in reclamation projects due to its hardy nature and ability to stabilize soil. However, its invasive potential requires careful management to prevent ecological disruption."
}
