{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mirandae",
    "plant_slug": "acacia-mirandae",
    "plant_name_scientific": "acacia mirandae",
    "intro": "Acacia mirandae, commonly known as the Mirandae acacia, is a flowering plant native to the arid regions of northern South America. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant typically grows as a shrub or small tree, featuring narrow, bipinnate leaves and yellow or golden flowers. Its seeds are enclosed in elongated pods and are adapted for dispersal by wind or animals. Acacia mirandae is valued for its ecological role in stabilizing soil and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mirandae is primarily native to the coastal regions of southern Africa, specifically along the eastern and southern coasts of South Africa. It is found in areas with sandy soils and is commonly associated with fynbos vegetation. This species thrives in Mediterranean climates characterized by wet winters and dry summers. It is often found in open woodlands and on rocky outcrops near the coast. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acacia mirandae was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions with low rainfall and high temperatures, making it suitable for rehabilitation of degraded lands. This plant is often used in reforestation projects due to its ability to fix nitrogen and improve soil quality. Its introduction has also been associated with ornamental purposes in some regions. However, its spread has raised concerns about potential invasiveness in non-native ecosystems."
}
