{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pilispina",
    "plant_slug": "acacia-pilispina",
    "plant_name_scientific": "acacia pilispina",
    "intro": "Acacia pilispina, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping branches and small, feathery leaves that are typically green and covered in fine hairs. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical or cylindrical heads. Acacia pilispina is adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pilispina is primarily native to northern Australia, including regions of Queensland, Northern Territory, and Western Australia. It thrives in arid and semi-arid environments, often found in coastal dunes and sandy soils. This species is well adapted to hot, dry climates and can tolerate salt spray, making it common in coastal areas. It plays an important ecological role in stabilizing sandy soils and providing habitat for native wildlife. Acacia pilispina is also sometimes cultivated for its ornamental value due to its attractive foliage and flowering habits.",
    "distribution_introduced_art_desc": "Acacia pilispina was mainly introduced to control soil erosion and provide shade in degraded lands. It is commonly found in semi-arid and arid regions where it thrives in poor soils. The plant is valued for its hardy nature and ability to establish quickly in challenging environments. Its introduction has helped in land rehabilitation and livestock forage production. However, it can become invasive if not managed properly."
}
