{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia parkerae",
    "plant_slug": "acacia-parkerae",
    "plant_name_scientific": "acacia parkerae",
    "intro": "Acacia parkerae, commonly known as the Parker's wattle, is a small shrub native to the arid regions of Western Australia. It is characterized by its slender, often twisted branches and bright yellow flowers that appear in clusters. The plant has phyllodes, which are flattened leaf-like structures that reduce water loss in its harsh environment. Acacia parkerae is well adapted to drought and can thrive in sandy or gravelly soils. It plays an important role in stabilizing soils and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia parkerae"
    },
    "taxonomy_art_desc": "Acacia parkerae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as sources of timber. Its species is Acacia parkerae, a specific type of acacia native to Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia parkerae is primarily native to Western Australia. It is found in the coastal regions of the state, particularly in the south-western area. This species thrives in sandy soils and is commonly associated with coastal heathlands and dunes. It is well adapted to the dry and saline conditions of its native habitat. Acacia parkerae plays an important ecological role in stabilizing coastal dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia parkerae was mainly introduced to South Africa, where it has been established in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape provinces. The plant is often associated with disturbed habitats such as roadsides and agricultural areas. Due to its rapid growth and adaptability, it has become a potential invasive species in some areas. Its introduction has raised concerns about its impact on native vegetation and ecosystem balance."
}
