{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guinetii",
    "plant_slug": "acacia-guinetii",
    "plant_name_scientific": "acacia guinetii",
    "intro": "Acacia guinetii, commonly known as the Guinet's wattle, is a small shrub native to Australia. It is characterized by its slender, often spiny stems and small, bipinnate leaves. The plant produces yellow floral clusters, typical of the Acacia genus, which attract pollinators such as bees and birds. It is adapted to arid and semi-arid environments, showcasing drought-resistant features. Acacia guinetii is often used in ecological restoration projects due to its hardy nature and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia guinetii"
    },
    "taxonomy_art_desc": "Acacia guinetii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive floral structures and often used in various applications. Its species is Acacia guinetii, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guinetii is primarily native to Western Australia. It is commonly found in the coastal and inland regions of the state, particularly in areas with sandy or gravelly soils. This species thrives in arid and semi-arid environments, often growing in shrublands and woodlands. It is well adapted to the hot, dry climate of Western Australia. Acacia guinetii plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia guinetii was mainly introduced to areas with a tropical and subtropical climate, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in Queensland and New South Wales. The plant is often used for erosion control due to its rapid growth and deep root system. However, it can become invasive in certain environments if not managed properly. Its introduction has raised concerns about its impact on native plant species and ecosystems."
}
