{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mayana",
    "plant_slug": "acacia-mayana",
    "plant_name_scientific": "acacia mayana",
    "intro": "Acacia mayana, commonly known as the yellow acacia, is a flowering plant native to tropical regions of Central and South America. It is a small to medium-sized tree or shrub that typically grows up to 10 meters in height. The plant is characterized by its feathery, bipinnate leaves and clusters of yellow or golden-green flowers that bloom throughout the year. Acacia mayana is often found in dry, sandy soils and is adapted to withstand drought conditions. Its wood is lightweight and has been used traditionally for various purposes, including construction and crafts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mayana is primarily native to Central America, including countries such as Belize, Guatemala, Honduras, Nicaragua, and El Salvador. It is also found in parts of Mexico, particularly in the southern regions. This plant thrives in tropical and subtropical climates, often growing in dry to moist forests and scrublands. It is commonly associated with limestone soils and is often found in secondary growth areas. Acacia mayana plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia mayana was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Central and South America, as well as parts of Africa and Asia. The plant is often cultivated for its ornamental value due to its distinctive foliage and ability to withstand drought conditions. It has also been introduced as a potential agroforestry species for its nitrogen-fixing capabilities. However, its introduction has raised concerns about its potential invasiveness in non-native ecosystems."
}
