{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia translucens var. humilis",
    "plant_slug": "acacia-translucens-var-humilis",
    "plant_name_scientific": "acacia translucens var. humilis",
    "intro": "Acacia translucens var. humilis, commonly known as the dwarf silver wattle, is a low-growing shrub native to parts of Australia. It is characterized by its delicate, feathery foliage and yellow flowers that bloom in spring. The plant has small, flat leaves that are often covered in a fine, silky hair, giving it a distinctive appearance. It thrives in well-drained soils and is often found in coastal or sandy environments. Due to its ornamental value and drought tolerance, it is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia translucens var. humilis is primarily native to the arid and semi-arid regions of western Australia, particularly in the states of Western Australia and South Australia. It thrives in sandy soils and is commonly found in coastal dunes and inland shrublands. This variety is well adapted to dry climates and can tolerate high levels of salt in the soil. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. Due to its limited range, it is considered a rare and vulnerable species within its native habitat.",
    "distribution_introduced_art_desc": "Acacia translucens var. humilis was mainly introduced to stabilize soil and provide shade in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions. This plant is often used in reclamation projects due to its hardy nature and ability to thrive in harsh environments. Its introduction has helped prevent soil erosion and improve land productivity in degraded areas. However, it requires careful management to avoid becoming invasive in non-native habitats."
}
