{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia intsia var. caesia",
    "plant_slug": "acacia-intsia-var-caesia",
    "plant_name_scientific": "acacia intsia var. caesia",
    "intro": "Acacia intsia var. caesia, commonly known as the golden wattle, is a flowering plant native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is a member of the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. It thrives in a variety of soil types but prefers well-drained conditions. The golden wattle is an important species in Australian flora and is often used in reforestation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia intsia var. caesia is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist to dry climates. This variant of Acacia intsia thrives in coastal and inland forests, often growing in sandy or loamy soils. Its natural range extends to parts of Oceania, including Papua New Guinea and some islands in the Pacific. The plant is well adapted to warm, humid environments and is often associated with mangrove and secondary forest ecosystems.",
    "distribution_introduced_art_desc": "Acacia intsia var. caesia was mainly introduced to areas with tropical and subtropical climates, particularly in Southeast Asia and parts of Australia. It thrives in well-drained soils and is often found in coastal regions and disturbed sites. This species is commonly planted for its hardy nature and ability to stabilize soil. Its introduction has been associated with reforestation and land rehabilitation efforts. However, it can become invasive in certain environments if not managed properly."
}
