{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassa subsp. longicoma",
    "plant_slug": "acacia-crassa-subsp-longicoma",
    "plant_name_scientific": "acacia crassa subsp. longicoma",
    "intro": "Acacia crassa subsp. longicoma, commonly known as the longpod acacia, is a shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are usually bipinnate and have a feathery appearance. The plant produces yellow flowers in dense, globular inflorescences, which are followed by long, slender pods. It thrives in arid and semi-arid environments, often found in sandy or rocky soils. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia crassa"
    },
    "taxonomy_art_desc": "Acacia crassa subsp. longicoma belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which comprises plants with distinctive flowers and includes legumes, which are known for their nitrogen-fixing ability. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species adapted to arid environments. Its species is Acacia crassa, a specific type within the Acacia genus, which is further divided into subspecies like longicoma, each with unique characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassa subsp. longicoma is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This subspecies thrives in sandy soils and is often associated with coastal and inland dune environments. It plays an important role in stabilizing sand dunes and providing habitat for local wildlife. The plant is well adapted to the arid and semi-arid climates of Queensland.",
    "distribution_introduced_art_desc": "Acacia crassa subsp. longicoma was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with seasonal rainfall. It thrives in open habitats such as grasslands, woodlands, and disturbed sites where it can establish quickly. This subspecies is often found in coastal areas and sandy soils, where it plays a role in stabilizing dunes and preventing erosion. Its introduction has been associated with human activities, including land clearing and agricultural expansion. Due to its adaptability, it has become a common invasive species in some regions outside its native range."
}
