{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pappii",
    "plant_slug": "acacia-pappii",
    "plant_name_scientific": "acacia pappii",
    "intro": "Acacia pappii, commonly known as the silver acacia, is a shrub native to southern Africa. It is characterized by its grey-green foliage and distinctive, feathery stipules that give it a unique appearance. The plant produces small, yellow flowers that bloom in clusters, attracting various pollinators. Its bark is smooth and often peels in thin layers, and it is adapted to arid environments. Acacia pappii is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pappii is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in shrublands and grasslands. This plant is well adapted to drought conditions and can survive in areas with low rainfall. It plays an important ecological role by providing habitat and food for various wildlife species. Its distribution is largely limited to the southwestern and central parts of the African continent.",
    "distribution_introduced_art_desc": "Acacia pappii was mainly introduced to areas with Mediterranean climates, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal regions and inland valleys. This plant is often used in landscaping due to its drought tolerance and ornamental value. It has been introduced to several regions outside its native range, including parts of California and Australia. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
