{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciopsis vernicosa",
    "plant_slug": "acaciopsis-vernicosa",
    "plant_name_scientific": "acaciopsis vernicosa",
    "intro": "Acaciopsis vernicosa, commonly known as the glossy acacia, is a shrub native to the tropical regions of Africa. It is characterized by its smooth, waxy leaves that give it a glossy appearance. The plant produces small, yellow flowers that are clustered in spikes, which are often visited by bees and other pollinators. Its bark is thin and can be easily stripped, revealing a fibrous inner layer. Acaciopsis vernicosa is often used in traditional medicine and for its ornamental value in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciopsis vernicosa is primarily native to the island of Madagascar. It is found in the dry deciduous forests and spiny forest habitats of the country. This plant is adapted to the arid and semi-arid conditions of the region. It is commonly found in the southern and southwestern parts of Madagascar. Its distribution is limited to specific ecological zones within the island's unique biodiversity.",
    "distribution_introduced_art_desc": "Acaciopsis vernicosa was mainly introduced to the island of Rodrigues as part of a reforestation initiative aimed at restoring degraded land. It was chosen for its fast growth rate and ability to thrive in poor soil conditions. The plant has since spread beyond its original planting sites, becoming established in secondary forests and disturbed habitats. Its introduction has raised concerns due to its potential to outcompete native species and alter local ecosystems. Despite its ecological impact, it remains an important component of the island's vegetation dynamics."
}
