{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gardneri",
    "plant_slug": "acacia-gardneri",
    "plant_name_scientific": "acacia gardneri",
    "intro": "Acacia gardneri, commonly known as the Gardner's acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, zigzagging branches and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow to orange flower clusters, which are arranged in spherical or cylindrical inflorescences. It thrives in arid and semi-arid environments, often growing on rocky soils. Acacia gardneri is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gardneri"
    },
    "taxonomy_art_desc": "Acacia gardneri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their simple structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-like clusters of flowers and often used for timber and traditional medicine. Its species is Acacia gardneri, a specific type of acacia native to certain regions of Africa, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gardneri is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often associated with coastal and inland dune environments. It is well adapted to the arid and semi-arid climates of its native range. Acacia gardneri plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia gardneri was mainly introduced to the western United States, particularly in California and Oregon. It was brought in for its ornamental value due to its distinctive yellow flowers and ability to thrive in dry conditions. The plant has since spread into native habitats, often outcompeting local vegetation. It is considered an invasive species in some areas, posing a threat to native ecosystems. Proper management is necessary to control its spread and mitigate its impact on biodiversity."
}
