{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dudgeonii",
    "plant_slug": "acacia-dudgeonii",
    "plant_name_scientific": "acacia dudgeonii",
    "intro": "Acacia dudgeonii, commonly known as the narrow-leaf wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, cylindrical stems and bipinnate leaves that are narrow and feathery. The plant produces yellow globular flowers that bloom in spring, attracting a variety of pollinators. It is well adapted to dry conditions, with deep roots that allow it to survive in poor soil and low rainfall. Acacia dudgeonii is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dudgeonii is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often growing in shrublands and grassland ecosystems. This species is well adapted to the harsh conditions of its native habitat, including high temperatures and low rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia dudgeonii is also occasionally found in parts of western Australia, though it is more widespread in its southern African range.",
    "distribution_introduced_art_desc": "Acacia dudgeonii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for erosion control due to its deep root system and ability to stabilize sandy soils. Its introduction has also been noted in some parts of Southeast Asia as part of reforestation efforts. However, it is considered a potential weed in certain environments due to its rapid growth and adaptability."
}
