{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eliasiana",
    "plant_slug": "acacia-eliasiana",
    "plant_name_scientific": "acacia eliasiana",
    "intro": "Acacia eliasiana, commonly known as the Elias's acacia, is a shrub native to parts of southern Africa. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and distinctive yellow flowers. The plant is well adapted to arid and semi-arid environments, showcasing drought tolerance through its deep root system. Its bark and leaves have been traditionally used in local medicine for their purported healing properties. Acacia eliasiana plays a role in supporting local wildlife, particularly insects and birds, due to its nectar-rich flowers.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eliasiana is primarily native to eastern Australia, specifically the coastal regions of New South Wales and Queensland. It is commonly found in sandy soils along the eastern coast, often in open forests and heathlands. This species thrives in temperate to subtropical climates and is well adapted to the local environmental conditions. It plays an important role in the ecosystem by providing habitat and food for various native animals. Acacia eliasiana is also valued for its ornamental qualities and is sometimes cultivated in gardens.",
    "distribution_introduced_art_desc": "Acacia eliasiana was mainly introduced to regions with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It has been widely used for its hardy nature, making it a popular choice for reforestation and land stabilization projects. The plant's rapid growth and nitrogen-fixing capabilities have contributed to its successful establishment in various ecosystems. However, its invasive potential in some areas has raised concerns about ecological impact. Despite these challenges, Acacia eliasiana remains an important species in both agricultural and environmental contexts."
}
