{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sphaerostachya",
    "plant_slug": "acacia-sphaerostachya",
    "plant_name_scientific": "acacia sphaerostachya",
    "intro": "Acacia sphaerostachya, commonly known as the globe acacia, is a shrub or small tree native to southern Africa. It is characterized by its spherical, yellowish flower heads that bloom in late winter to early spring. The plant has compound leaves with small, paired leaflets and produces woody pods that contain edible seeds. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia sphaerostachya is also valued for its ornamental appeal and use in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sphaerostachya"
    },
    "taxonomy_art_desc": "Acacia sphaerostachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and numerous stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia sphaerostachya, a specific type of acacia found in certain regions, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sphaerostachya is primarily native to Western Australia. It is commonly found in the dry, arid regions of the state, particularly in the inland areas. This plant thrives in sandy or rocky soils and is often seen in shrublands and woodland habitats. It is well adapted to the harsh climate of the region, with its small, waxy leaves helping to conserve water. The species plays an important ecological role in the local environment.",
    "distribution_introduced_art_desc": "Acacia sphaerostachya was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts. The plant is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has sometimes led to ecological impacts, including competition with native species. Due to its hardy nature, it has been spread to other parts of the world with similar environmental conditions."
}
