{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia disparrima subsp. disparrima",
    "plant_slug": "acacia-disparrima-subsp-disparrima",
    "plant_name_scientific": "acacia disparrima subsp. disparrima",
    "intro": "Acacia disparrima subsp. disparrima, commonly known as the narrow-leaf wattle, is a shrub native to the arid and semi-arid regions of southern Africa. It is characterized by its slender, often twisted stems and small, bipinnate leaves that are typically narrow and linear. The plant produces yellow globular flower heads, which are clustered in dense, cylindrical inflorescences. It is well adapted to drought conditions, with a deep root system that allows it to survive in nutrient-poor soils. This species is often used in reclamation projects due to its hardiness and ability to stabilize soil in degraded areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia disparrima"
    },
    "taxonomy_art_desc": "Acacia disparrima subsp. disparrima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and complex vascular systems. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and flowering plants. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often a symbiotic relationship with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia disparrima, a specific plant within the Acacia genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia disparrima subsp. disparrima is primarily native to New South Wales and Queensland. This subspecies is found in the eastern part of Australia, particularly in regions with dry to semi-arid conditions. It typically grows in sandy or rocky soils and is commonly found in open woodlands and shrublands. The plant is well adapted to the climate of these regions, thriving in areas with low rainfall. Its distribution is limited to specific ecological zones within New South Wales and Queensland.",
    "distribution_introduced_art_desc": "Acacia disparrima subsp. disparrima was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, particularly in the Western Cape and along the eastern coast. This subspecies is often used in landscaping due to its drought tolerance and attractive foliage. However, it has also been reported to spread into natural habitats, raising concerns about its invasive potential. Its introduction is largely attributed to human activities such as horticultural planting and accidental seed dispersal."
}
