{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rivularis",
    "plant_slug": "acacia-rivularis",
    "plant_name_scientific": "acacia rivularis",
    "intro": "Acacia rivularis, commonly known as the river acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often drooping branches and bipinnate leaves that are compound and feathery in appearance. The plant produces yellow flowers in compact spikes, which are typically arranged in dense clusters along the stems. Acacia rivularis thrives in moist, sandy soils near rivers and streams, making it a common sight in riparian habitats. Its ecological importance includes providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rivularis is primarily native to eastern Australia, including regions such as Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in riparian zones, along riverbanks, and in moist, well-drained soils. This species thrives in temperate to subtropical climates and is often associated with streamside vegetation. Acacia rivularis is well adapted to periodic flooding and can tolerate seasonal waterlogging. It plays an important ecological role in stabilizing riverbanks and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia rivularis was mainly introduced to riverbanks and disturbed soils in arid and semi-arid regions. It is commonly found in areas with low rainfall and well-drained soils. The plant is known for its ability to thrive in harsh environmental conditions. It has been reported in several countries in Africa and parts of Australia. Its introduction has sometimes led to ecological changes in native plant communities."
}
