{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia campbellii",
    "plant_slug": "acacia-campbellii",
    "plant_name_scientific": "acacia campbellii",
    "intro": "Acacia campbellii, commonly known as the Campbell's acacia, is a flowering plant native to South Africa. It is a small, shrub-like species that typically grows in rocky or sandy soils. The plant produces yellow flowers in clusters, which bloom during the winter months. Its leaves are bipinnate, consisting of numerous small, thread-like leaflets. Acacia campbellii is valued for its ornamental appeal and is often cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia campbellii is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and South Africa. It is commonly found in the Kalahari Desert and surrounding areas, where it thrives in sandy soils. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It often grows as a shrub or small tree, providing habitat and forage for local wildlife. Acacia campbellii plays an important ecological role in stabilizing soil and supporting biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acacia campbellii was mainly introduced to South Africa, where it has been planted for its ornamental value and as a source of timber. It is commonly found in gardens and along roadsides due to its hardy nature and ability to thrive in arid conditions. However, its introduction has led to concerns about its potential invasiveness in certain ecosystems. The plant is also cultivated in other parts of Africa and has been used in traditional medicine. Despite its benefits, its spread requires careful management to prevent ecological disruption."
}
