{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella valenzuelana",
    "plant_slug": "acaciella-valenzuelana",
    "plant_name_scientific": "acaciella valenzuelana",
    "intro": "Acaciella valenzuelana, commonly known as the Mexican thornbush, is a shrub native to Mexico and parts of Central America. It is characterized by its compound leaves, which are typically trifoliate and have a rough, hairy texture. The plant produces small, yellowish flowers that are clustered in spikes, followed by flat, leathery pods containing seeds. It thrives in arid and semi-arid environments, often growing in rocky soils. Acaciella valenzuelana is adapted to withstand drought and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella valenzuelana is primarily native to the Caribbean region, particularly the Greater Antilles. It is found in countries such as Cuba, Hispaniola, and the Bahamas. This plant typically grows in coastal areas and is adapted to sandy soils. It is commonly found in dry, open habitats and is often associated with dune environments. Its distribution is limited to specific islands where it thrives in the unique ecological conditions of the region.",
    "distribution_introduced_art_desc": "Acaciella valenzuelana was mainly introduced to the tropical and subtropical regions of the Americas, particularly in countries such as Mexico, Central America, and parts of South America. It is commonly found in disturbed habitats, including roadsides, abandoned fields, and degraded forests. This plant has adapted well to a variety of soil types and can thrive in both full sun and partial shade. Its introduction has led to its establishment in natural and semi-natural environments, sometimes becoming invasive in certain areas. Due to its resilience and rapid growth, it is often considered a pioneer species in ecological succession."
}
