{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennata var. arrophila",
    "plant_slug": "acacia-pennata-var-arrophila",
    "plant_name_scientific": "acacia pennata var. arrophila",
    "intro": "Acacia pennata var. arrophila, commonly known as the narrow-leaf acacia, is a shrub or small tree native to the arid and semi-arid regions of southern Africa. It is characterized by its slender, often twisted branches and small, bipinnate leaves that are typically narrow and linear. The plant produces yellow or pale yellow inflorescences, which are clustered and attract various pollinators such as bees and birds. Its seeds are enclosed in woody pods and are adapted for dispersal by wind or animals. Acacia pennata var. arrophila is well-suited to harsh environments and is often used in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennata var. arrophila is primarily native to eastern Australia, including the states of Queensland, New South Wales, and Victoria. It is commonly found in dry sclerophyll forests and woodland areas, particularly in regions with sandy or loamy soils. This variety is adapted to a range of climatic conditions, including both coastal and inland environments. It thrives in areas with moderate to high rainfall and is often seen along riverbanks and in open grasslands. Due to its hardy nature, it is also sometimes cultivated in gardens and for erosion control.",
    "distribution_introduced_art_desc": "Acacia pennata var. arrophila was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. This plant is also valued for its nitrogen-fixing properties, which enhance soil fertility. However, it can become invasive in certain environments if not managed properly. Its introduction has had both positive ecological and potential negative impacts depending on the region."
}
