{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata var. ornithophora",
    "plant_slug": "acacia-armata-var-ornithophora",
    "plant_name_scientific": "acacia armata var. ornithophora",
    "intro": "Acacia armata var. ornithophora, commonly known as the silver wattle, is a shrub or small tree native to Western Australia. It is characterized by its delicate, feathery foliage and yellow flowers that bloom in spring. The plant has small, flat, grey-green leaves that are often covered in fine hairs. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid environments. The species is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata var. ornithophora is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Botswana, and South Africa. This variant of the acacia species thrives in sandy and rocky soils, often found in scrublands and shrublands. It is well adapted to drought conditions and can survive in areas with low rainfall. The plant is commonly seen in coastal and inland desert environments, where it provides shelter and food for local wildlife. Its distribution is closely linked to the specific ecological conditions of the regions it inhabits.",
    "distribution_introduced_art_desc": "Acacia armata var. ornithophora was mainly introduced to South Australia and Western Australia as a ornamental plant due to its unique appearance and hardiness. It is commonly found in gardens and along roadsides, where it thrives in well-drained soils and full sun. The plant's ability to withstand drought and poor soil conditions has contributed to its widespread use in landscaping. However, its invasive potential has raised concerns in some regions, leading to its classification as a weed in certain areas. Despite its ornamental value, its spread requires careful management to prevent ecological disruption."
}
