{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia prominens var. latifolia",
    "plant_slug": "acacia-prominens-var-latifolia",
    "plant_name_scientific": "acacia prominens var. latifolia",
    "intro": "Acacia prominens var. latifolia, commonly known as the broadleaf acacia, is a shrub or small tree native to southern Africa. It features narrow, linear leaves that are often arranged in spirals along the stems. The plant produces yellow globular flower heads, which are typical of the Acacia genus. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia prominens var. latifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and grassland ecosystems. This variety is adapted to withstand drought conditions and high temperatures, making it a resilient species in its native habitat. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is largely restricted to the specific climatic and soil conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia prominens var. latifolia was mainly introduced to South Africa, where it has been established in various regions, particularly in the Western Cape and Eastern Cape provinces. It is commonly found in coastal and inland areas with a Mediterranean climate, thriving in well-drained soils. This plant is often cultivated for its ornamental value due to its attractive foliage and ability to withstand drought conditions. It has also been reported in some parts of Australia, where it has been introduced as an ornamental or for erosion control. However, its introduction outside its native range has raised concerns about its potential invasiveness in certain ecosystems."
}
