{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia barbinervis subsp. barbinervis",
    "plant_slug": "acacia-barbinervis-subsp-barbinervis",
    "plant_name_scientific": "acacia barbinervis subsp. barbinervis",
    "intro": "Acacia barbinervis subsp. barbinervis, commonly known as the narrow-veined wattle, is a shrub or small tree native to parts of Australia. It is characterized by its slender, often multi-branched stems and phyllodes that are narrow and linear with prominent, parallel veins. The plant produces yellow globular flowerheads, which are typically arranged in clusters at the ends of branches. It thrives in well-drained soils and is often found in coastal and sandy environments. The species is notable for its ecological importance, providing food and habitat for various native wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia barbinervis"
    },
    "taxonomy_art_desc": "Acacia barbinervis subsp. barbinervis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often with compound leaves and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their unique foliage and often used in traditional medicine and as sources of timber. Its species is Acacia barbinervis, a specific type of acacia known for its barbed leaf veins and is native to certain regions in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia barbinervis subsp. barbinervis is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This subspecies thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is a shrub or small tree that is well adapted to the harsh climatic conditions of the region. Its distribution is largely confined to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia barbinervis subsp. barbinervis was mainly introduced to areas with well-drained soils and moderate to high rainfall, typically found in tropical and subtropical regions. It thrives in open woodland and savanna habitats, often colonizing disturbed sites such as roadsides and cleared land. This subspecies is known for its ability to fix nitrogen, which enhances soil fertility and allows it to spread rapidly in new environments. It is commonly found in parts of Australia, Southeast Asia, and the Pacific Islands where it has been introduced for ornamental or agricultural purposes. However, its invasive potential requires careful management to prevent ecological disruption."
}
