{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rugata",
    "plant_slug": "acacia-rugata",
    "plant_name_scientific": "acacia rugata",
    "intro": "Acacia rugata, commonly known as the rough acacia, is a shrub or small tree native to Australia. It is characterized by its feathery, compound leaves that are covered in fine, branched hairs, giving it a distinctive appearance. The plant produces yellow flowers in globular clusters, which are followed by long, slender pods. Acacia rugata thrives in arid and semi-arid environments, often found in coastal and inland regions. It is well adapted to withstand drought and is sometimes used in reforestation efforts due to its hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rugata is primarily native to eastern Australia, including the states of Queensland, New South Wales, and Victoria. It is commonly found in sandy soils along the coast and in heathlands. This plant thrives in coastal regions and is often seen in dunes and open woodlands. It is well adapted to the warm, dry climate of these areas. Acacia rugata is an important component of the local flora and provides habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia rugata was mainly introduced to South Australia for its ornamental value and ability to thrive in arid conditions. It is commonly found in disturbed soils and along roadsides, where it forms dense shrubs. The plant is well adapted to low rainfall and can tolerate poor soil conditions. Its presence has led to concerns about its potential to invade native vegetation in certain areas. However, it is generally considered a minor weed in the region."
}
