{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia calamifolia",
    "plant_slug": "acacia-calamifolia",
    "plant_name_scientific": "acacia calamifolia",
    "intro": "Acacia calamifolia, commonly known as the sickle acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, sickle-shaped leaves and yellow flowers that bloom in clusters. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. Its bark and leaves have been traditionally used in local medicine for their purported healing properties. Acacia calamifolia plays an important ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia calamifolia"
    },
    "taxonomy_art_desc": "Acacia calamifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some ferns. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes and have a symbiotic relationship with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly known as wattles, which are native to Australia and other parts of Africa and Asia. Its species is Acacia calamifolia, a specific type of acacia known for its distinctive yellow flowers and is typically found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia calamifolia is primarily native to New South Wales, South Australia, and Victoria. This species is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands and scrublands. The plant is well adapted to the climate conditions of its native range. It plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia calamifolia was mainly introduced to India as an ornamental plant due to its unique appearance and ability to thrive in arid conditions. It has been cultivated in various regions of the country, particularly in the western and southern states where it adapts well to the climate. Although it is not native to India, it has been used in landscaping and for soil stabilization in certain areas. However, its introduction has raised concerns about its potential to become invasive in local ecosystems. Despite these concerns, it remains a popular choice for gardens and reforestation projects in the region."
}
