{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flabellifolia",
    "plant_slug": "acacia-flabellifolia",
    "plant_name_scientific": "acacia flabellifolia",
    "intro": "Acacia flabellifolia, commonly known as the fan-leaf wattle, is a shrub native to Australia. It is characterized by its slender, compound leaves that are fan-shaped and often have a silver-blue hue. The plant produces bright yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia flabellifolia is adapted to arid and semi-arid environments, making it drought-tolerant. It is often used in landscaping for its ornamental value and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia flabellifolia"
    },
    "taxonomy_art_desc": "Acacia flabellifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their primitive vascular structures and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their diverse floral structures. Its order is Fabales, which includes legumes and related plants, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees found primarily in arid regions, known for their phyllodes and ability to thrive in nutrient-poor soils. Its species is Acacia flabellifolia, a specific type of acacia native to Australia, characterized by its fan-shaped leaves and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flabellifolia is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the south-western part of the state. This species thrives in well-drained soils and is often seen in open woodlands and heathlands. It is well adapted to the semi-arid and Mediterranean climate of its native range. Acacia flabellifolia is an important component of the local flora and plays a role in supporting native wildlife.",
    "distribution_introduced_art_desc": "Acacia flabellifolia was mainly introduced to areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal regions and open woodlands. This plant is often used in landscaping due to its ornamental value and ability to tolerate drought conditions. However, it can become invasive in some environments if not managed properly. Its introduction has raised concerns about its impact on native flora in certain regions."
}
