{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia congesta",
    "plant_slug": "acacia-congesta",
    "plant_name_scientific": "acacia congesta",
    "intro": "Acacia congesta, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant produces small, flat seed pods that contain numerous seeds, which are dispersed by wind. Acacia congesta is well adapted to arid and semi-arid environments, with a deep root system that allows it to survive in dry conditions. It is often found in coastal areas and is valued for its ornamental appeal and ecological importance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia congesta"
    },
    "taxonomy_art_desc": "Acacia congesta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are often legumes, characterized by their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, recognized for their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their unique, often thorny appearance and ability to thrive in arid environments. Its species is Acacia congesta, a specific type of acacia native to Australia, characterized by its dense foliage and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia congesta is primarily native to Western Australia. It is commonly found in the coastal regions and surrounding areas of the state. This plant thrives in sandy soils and is often seen in heathlands and coastal dunes. It is well adapted to the dry and often harsh conditions of its native environment. Acacia congesta plays an important ecological role in supporting local wildlife and stabilizing coastal ecosystems.",
    "distribution_introduced_art_desc": "Acacia congesta was mainly introduced to South Africa, where it has become a significant invasive species. It was originally from Australia and was brought to South Africa for ornamental purposes due to its attractive yellow flowers and hardy nature. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its ability to thrive in a variety of soil types and climates has contributed to its widespread distribution. Efforts are now being made to control its spread and mitigate its ecological impact."
}
