{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia myriadena",
    "plant_slug": "acacia-myriadena",
    "plant_name_scientific": "acacia myriadena",
    "intro": "Acacia myriadena, commonly known as the broad-leafed wattle, is a shrub or small tree native to Australia. It is characterized by its dense, feathery foliage composed of small, oval-shaped leaves. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in arid or semi-arid regions. Acacia myriadena is valued for its ornamental appeal and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia myriadena is primarily native to northern Australia, including regions of Queensland, Western Australia, and the Northern Territory. It is commonly found in arid and semi-arid environments, particularly in rocky outcrops and sandy soils. This species thrives in dry climates with low rainfall, often growing in open woodlands or shrublands. It is well adapted to the harsh conditions of the Australian interior, where it plays a role in stabilizing soil and providing habitat for native wildlife. The plant is also occasionally found in New Guinea, extending its native range slightly beyond the Australian mainland.",
    "distribution_introduced_art_desc": "Acacia myriadena was mainly introduced to South Africa, where it has become a significant invasive species. It is commonly found in the Western Cape and Eastern Cape provinces, thriving in coastal and inland areas. The plant spreads rapidly through its prolific seed production and ability to colonize disturbed soils. It competes aggressively with native vegetation, altering local ecosystems and reducing biodiversity. Management efforts are ongoing to control its spread and mitigate its environmental impact."
}
