{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fluviatilis",
    "plant_slug": "acacia-fluviatilis",
    "plant_name_scientific": "acacia fluviatilis",
    "intro": "Acacia fluviatilis, commonly known as the river acacia, is a flowering plant native to tropical and subtropical regions of Africa. It is a shrub or small tree that typically grows near water sources, such as rivers and swamps, due to its preference for moist soils. The plant features bipinnate leaves with small, oval-shaped leaflets and produces yellow, spherical flower heads that bloom in clusters. Its seeds are enclosed in woody pods and are adapted for dispersal by water, aiding in its spread along riverbanks. The plant is also valued for its hardy nature and ability to thrive in challenging environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fluviatilis is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as South Africa, Namibia, and Botswana. It thrives in sandy or loamy soils along riverbanks and in open woodlands. This species is commonly found in areas with a warm, dry climate and seasonal rainfall. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia fluviatilis is also known for its ability to withstand drought conditions, making it well adapted to its native habitat.",
    "distribution_introduced_art_desc": "Acacia fluviatilis was mainly introduced to areas with riparian zones and floodplain environments. It thrives in moist, sandy soils and is often found near rivers and streams. This plant is commonly used for erosion control due to its deep root system. It has been introduced to several regions in Australia and parts of Southeast Asia. Its rapid growth and adaptability make it a valuable but sometimes invasive species in non-native habitats."
}
