{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia robusta",
    "plant_slug": "acacia-robusta",
    "plant_name_scientific": "acacia robusta",
    "intro": "Acacia robusta, commonly known as the black wattle, is a tall, woody shrub or small tree native to Australia. It is characterized by its dense, dark green foliage and distinctive yellow flowers that bloom in globular clusters. The plant has phyllodes, which are flattened leaf stalks that serve as the primary means of photosynthesis. Acacia robusta is well adapted to dry, sandy soils and is often found in coastal and inland regions. It plays an important ecological role, providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia robusta is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in tropical and subtropical regions, particularly in coastal and inland areas with well-drained soils. This species thrives in open woodlands, grasslands, and along riverbanks. It is also present in some parts of New Guinea. Acacia robusta is well adapted to the hot and dry climate of its native range.",
    "distribution_introduced_art_desc": "Acacia robusta was mainly introduced to Australia, where it has become naturalized in various regions. It is commonly found in coastal areas and disturbed soils, thriving in a range of environmental conditions. The plant is known for its hardy nature and ability to tolerate salt spray, making it well-suited for coastal environments. It has also been introduced to other parts of the world, including Southeast Asia and the Pacific Islands. Due to its adaptability, Acacia robusta has become an invasive species in some regions, posing challenges to native ecosystems."
}
