{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ampeloclada",
    "plant_slug": "acacia-ampeloclada",
    "plant_name_scientific": "acacia ampeloclada",
    "intro": "Acacia ampeloclada, commonly known as the climbing acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twining branches and bipinnate leaves that are finely divided. The plant produces yellow flowers in globular clusters, which are followed by elongated, woody pods containing seeds. It thrives in arid and semi-arid environments, often growing on rocky slopes or in open woodlands. The species is adapted to drought conditions and can tolerate poor soil quality.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ampeloclada is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. This plant thrives in harsh environmental conditions and is well adapted to low rainfall. It is often seen growing in coastal and inland regions with well-drained soils. Acacia ampeloclada plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia ampeloclada was mainly introduced to control soil erosion and stabilize degraded lands in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its rapid growth and deep root system. This plant thrives in poor soils and can tolerate high temperatures and low rainfall. It is also valued for its ability to fix nitrogen, improving soil fertility over time. However, its invasive potential requires careful management to prevent ecological imbalances."
}
