{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paula",
    "plant_slug": "acacia-paula",
    "plant_name_scientific": "acacia paula",
    "intro": "Acacia paula, commonly known as the white wattle, is a shrub native to South Africa. It is characterized by its slender, zigzagging branches and small, yellow flowers that bloom in globular clusters. The plant produces flat, bean-like pods that contain seeds, which are dispersed by wind. Acacia paula thrives in well-drained soils and is often found in rocky or sandy habitats. It is valued for its ornamental appeal and ability to withstand dry conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia paula"
    },
    "taxonomy_art_desc": "Acacia paula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have primitive floral structures and are closely related to the earliest angiosperms. Its order is Fabales, which includes plants with legume fruits and nitrogen-fixing capabilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia paula, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paula is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the areas of the Fitzgerald River National Park and the Stirling Range. This species thrives in sandy soils and is commonly found in coastal and inland shrublands. It is well adapted to the dry and warm climate of its native habitat. Acacia paula plays an important ecological role in the local environment by providing shelter and food for native wildlife.",
    "distribution_introduced_art_desc": "Acacia paula was mainly introduced to Australia as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since spread beyond cultivated areas and is now considered a weed in several regions, particularly in Queensland and New South Wales. The plant's rapid growth and seed dispersal through wind and animals have contributed to its invasive nature. It competes with native vegetation, altering local ecosystems and reducing biodiversity. Management efforts focus on controlling its spread through mechanical removal and herbicide application."
}
