{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia philoxera",
    "plant_slug": "acacia-philoxera",
    "plant_name_scientific": "acacia philoxera",
    "intro": "Acacia philoxera, commonly known as the weeping acacia, is a flowering plant native to Australia. It is characterized by its feathery, pendulous branches and small, yellowish-green flowers that bloom in spring. The plant produces flat, leathery pods that contain seeds, which are dispersed by wind. Acacia philoxera thrives in well-drained soils and is often found in coastal areas and sandy soils. It is valued for its ornamental appeal and ability to tolerate drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia philoxera"
    },
    "taxonomy_art_desc": "Acacia philoxera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acicular or needle-like leaves and often used in traditional medicine. Its species is Acacia philoxera, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia philoxera is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of this state. This species thrives in dry, open habitats such as woodlands and savannas. It is well adapted to the warm and often arid climate of Queensland. Acacia philoxera plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia philoxera was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its ability to fix nitrogen, improving soil fertility over time. Its introduction has been particularly beneficial in areas affected by desertification. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
