{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia inconflagrabilis",
    "plant_slug": "acacia-inconflagrabilis",
    "plant_name_scientific": "acacia inconflagrabilis",
    "intro": "Acacia inconflagrabilis, commonly known as the flame acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive yellow flowers that bloom in clusters, often resembling flames, hence its common name. The plant has bipinnate leaves composed of numerous small leaflets, and it produces long, slender pods that contain seeds. It thrives in dry, well-drained soils and is often found in savanna and woodland habitats. Acacia inconflagrabilis is also known for its ability to fix nitrogen, contributing to soil fertility in its native environment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia inconflagrabilis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savanna and shrubland ecosystems. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is largely confined to the Kalahari and Namib Desert regions.",
    "distribution_introduced_art_desc": "Acacia inconflagrabilis was mainly introduced to control soil erosion and provide shade in degraded lands. It is commonly found in arid and semi-arid regions where it establishes quickly and forms dense thickets. This plant is known for its ability to thrive in poor soils and withstand drought conditions. Its introduction has had both positive and negative ecological impacts, including competition with native species. Due to its rapid growth, it is often considered an invasive species in some areas."
}
