{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catechu var. campylacantha",
    "plant_slug": "acacia-catechu-var-campylacantha",
    "plant_name_scientific": "acacia catechu var. campylacantha",
    "intro": "Acacia catechu var. campylacantha, commonly known as the narrow-leaf catechu, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often thornless stems and bipinnate leaves with small, oval-shaped leaflets. The plant produces yellow to orange flowers that are clustered in racemes, followed by flat, pod-like fruits containing several seeds. It thrives in dry, well-drained soils and is often found in savanna and woodland habitats. The species is valued for its use in traditional medicine and as a source of tannins.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catechu var. campylacantha is primarily native to eastern and southern Africa, including countries such as Tanzania, Kenya, Uganda, and parts of South Africa. This variant of the acacia tree thrives in tropical and subtropical regions, often found in woodland and savanna habitats. It is commonly associated with dry to semi-arid environments, where it plays a significant role in local ecosystems. The plant is well adapted to poor soils and can withstand periods of drought. Its distribution is closely linked to areas with a warm climate and seasonal rainfall patterns.",
    "distribution_introduced_art_desc": "Acacia catechu var. campylacantha was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate rainfall. It is commonly found in parts of Southeast Asia, including India, Malaysia, and Indonesia, where it has been cultivated for its timber and medicinal properties. The plant is often used in traditional medicine for its astringent and antiseptic qualities. It has also been introduced to other parts of the world as an ornamental and for agroforestry purposes. Its distribution is largely influenced by human activity and the demand for its various uses."
}
