{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia perangusta",
    "plant_slug": "acacia-perangusta",
    "plant_name_scientific": "acacia perangusta",
    "intro": "Acacia perangusta, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It features slender, zigzagging stems and small, narrow, dark green leaves. The plant produces bright yellow, fluffy flowers that appear in late winter to early spring. Acacia perangusta is well adapted to dry, sandy soils and is drought-tolerant. It is often used in gardens for its ornamental value and ability to thrive in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia perangusta is primarily native to northern Australia, particularly in the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions, thriving in sandy or rocky soils. This species is often associated with coastal and inland dune environments. It is well adapted to the harsh climate of its native range, including high temperatures and low rainfall. Acacia perangusta plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia perangusta was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardy nature and capacity to provide shade and forage for livestock. Its introduction has helped in restoring degraded lands across parts of Australia and other dry regions. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
