{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia varians",
    "plant_slug": "acacia-varians",
    "plant_name_scientific": "acacia varians",
    "intro": "Acacia varians, commonly known as the variable acacia, is a species of flowering plant in the legume family Fabaceae. It is native to parts of Africa and is characterized by its slender, branching stems and bipinnate leaves. The plant produces yellow flowers in spherical or cylindrical clusters, which are followed by flat, woody pods containing seeds. Acacia varians is often found in arid or semi-arid environments, where it adapts to dry conditions through its deep root system and water-storing tissues. It plays a role in local ecosystems by providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia varians is primarily native to parts of eastern Australia, including New South Wales and Victoria. It is commonly found in dry, open forests and woodlands. This species thrives in sandy or rocky soils and is often associated with eucalyptus forests. It is well adapted to the Mediterranean climate of the region, with periods of drought. Acacia varians plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia varians was mainly introduced to areas with warm, temperate climates and well-drained soils, often in regions where it is used for ornamental purposes or as a source of timber. It thrives in full sun and is known for its ability to withstand drought conditions, making it suitable for xeriscaping and erosion control. The plant is also valued for its nitrogen-fixing capabilities, which can improve soil fertility in agricultural settings. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation. Due to its adaptability, it has been introduced to several countries in the Mediterranean, Australia, and parts of the United States."
}
