{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lucasii",
    "plant_slug": "acacia-lucasii",
    "plant_name_scientific": "acacia lucasii",
    "intro": "Acacia lucasii, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its bright yellow flowers that bloom in spring, forming intricate globular clusters. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. Acacia lucasii thrives in well-drained soils and is often found in dry, open habitats. It is a symbol of Australia and plays an important role in local ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lucasii"
    },
    "taxonomy_art_desc": "Acacia lucasii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and other related families. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia lucasii, a specific type of acacia found in certain regions, recognized by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lucasii is primarily native to New South Wales and Victoria. It is commonly found in the dry, inland regions of these states. This plant thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia lucasii plays an important role in the local ecosystem by providing habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia lucasii was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped restore degraded lands in several countries across Africa and the Middle East. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
