{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catenulata",
    "plant_slug": "acacia-catenulata",
    "plant_name_scientific": "acacia catenulata",
    "intro": "Acacia catenulata, commonly known as the chain acacia, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and produces yellow flowers in clusters. The plant has phyllodes, which are flattened leaf-like structures that perform photosynthesis. Acacia catenulata thrives in arid and semi-arid environments, showing adaptability to harsh conditions. It is also known for its ability to fix nitrogen in the soil, making it ecologically significant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia catenulata"
    },
    "taxonomy_art_desc": "Acacia catenulata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are native to Australia and have a wide range of ecological and economic importance. Its species is Acacia catenulata, a specific type of acacia found in certain regions of Australia, known for its unique morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catenulata is primarily native to the Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions across these areas. It thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. Acacia catenulata is well adapted to the dry climate and can withstand periods of drought. Its distribution reflects its ability to survive in the harsh environmental conditions of northern Australia.",
    "distribution_introduced_art_desc": "Acacia catenulata was mainly introduced to Australia as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since become naturalized in parts of the eastern and southern regions, where it spreads along roadsides and in disturbed soils. The plant is considered a weed in some areas because of its rapid growth and competitive nature. Its introduction has led to ecological concerns due to its potential to invade native habitats. Despite its invasive tendencies, it remains popular in horticulture for its drought tolerance and aesthetic appeal."
}
