{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia uncifolia",
    "plant_slug": "acacia-uncifolia",
    "plant_name_scientific": "acacia uncifolia",
    "intro": "Acacia uncifolia, commonly known as the narrowleaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and small, needle-like phyllodes that are typically green and covered in fine hairs. The plant produces yellow globular flower heads that appear in late winter to early spring, attracting nectar-feeding birds and insects. Acacia uncifolia thrives in well-drained soils and is often found in dry, open habitats such as woodlands and grasslands. It is also valued for its role in ecological restoration and as a source of timber and traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia uncifolia"
    },
    "taxonomy_art_desc": "Acacia uncifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are widespread in tropical and subtropical regions. Its species is Acacia uncifolia, a specific type of acacia known for its distinctive leaf shape and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia uncifolia is primarily native to South Australia, Tasmania, and Victoria. This species is commonly found in coastal and inland areas across these regions. It thrives in a variety of soil types but prefers well-drained soils. The plant is often seen in open woodlands and heathlands. Its distribution is largely restricted to the southern parts of Australia.",
    "distribution_introduced_art_desc": "Acacia uncifolia was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soils and withstand high temperatures. It is commonly found in regions of Australia, where it has been introduced for its ornamental value and ability to fix nitrogen. The plant is also used in reclamation projects due to its fast growth and hardiness. However, its introduction has led to concerns about its potential invasiveness in some ecosystems. Despite its benefits, careful management is required to prevent it from becoming a weed in non-native environments."
}
