{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rhodophloia",
    "plant_slug": "acacia-rhodophloia",
    "plant_name_scientific": "acacia rhodophloia",
    "intro": "Acacia rhodophloia, commonly known as the red-barked acacia, is a flowering plant native to Australia. It is characterized by its slender, erect shrub form and distinctive reddish-brown bark that peels in thin layers. The plant produces small, yellow flowers arranged in dense, globular clusters, which bloom in spring. Its leaves are bipinnate, meaning they are divided into multiple pairs of small, feather-like leaflets. Acacia rhodophloia is adapted to arid and semi-arid environments, making it a hardy species often found in coastal and inland regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rhodophloia"
    },
    "taxonomy_art_desc": "Acacia rhodophloia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphologies. Its order is Fabales, which consists of flowering plants that typically have leaves with stipules and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acicular leaves and often used in traditional medicine. Its species is Acacia rhodophloia, a specific type of acacia known for its red-colored bark and found in specific regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rhodophloia is primarily native to the Northern Territory, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. The plant is well adapted to the hot and dry climate of its native range. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia rhodophloia was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low to moderate rainfall. This plant is often used in landscaping due to its drought tolerance and attractive appearance. It has been introduced to several parts of the United States, particularly in the southern and western states. However, it can become invasive in certain environments if not managed properly."
}
