{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia albicorticata",
    "plant_slug": "acacia-albicorticata",
    "plant_name_scientific": "acacia albicorticata",
    "intro": "Acacia albicorticata, commonly known as the white bark acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, pale grey bark and small, bipinnate leaves. The plant produces yellow, globular flowers that bloom in spring, attracting various pollinators. Its seeds are enclosed in long, cylindrical pods and are often used in traditional medicine. Acacia albicorticata is adapted to arid environments and is commonly found in savannas and rocky areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia albicorticata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Mozambique. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This plant thrives in well-drained soils and is adapted to hot, dry climates. It is often seen growing along roadsides and in open woodland areas. Due to its hardy nature, it is also sometimes cultivated in other regions with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acacia albicorticata was mainly introduced to control soil erosion and as a windbreak in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardy nature and capacity to fix nitrogen, improving soil fertility. It has been introduced to several countries in Africa, the Middle East, and parts of Australia. However, its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments."
}
