{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia abietina",
    "plant_slug": "acacia-abietina",
    "plant_name_scientific": "acacia abietina",
    "intro": "Acacia abietina, commonly known as the white acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant produces long, flat seed pods that contain small, hard seeds. It thrives in arid and semi-arid environments, often growing in sandy or rocky soils. Acacia abietina is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia abietina is primarily native to the Mediterranean region, particularly in southern Europe, North Africa, and the Middle East. It thrives in dry, rocky, and coastal environments, often found along cliffs and in maquis shrublands. This plant is well adapted to arid and semi-arid climates, showing resistance to drought and salt spray. It is commonly found in countries such as Spain, Portugal, Morocco, and parts of Turkey. Due to its hardy nature, it plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia abietina was mainly introduced to control soil erosion and as a source of fuelwood in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its adaptability to harsh conditions. The plant has been widely planted in countries such as India, Pakistan, and parts of Africa for its fast growth and nitrogen-fixing ability. However, its introduction has led to some ecological concerns due to its potential to invade native vegetation. Despite these issues, it remains an important species in reforestation and land rehabilitation efforts."
}
