{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bidwillii var. polytricha",
    "plant_slug": "acacia-bidwillii-var-polytricha",
    "plant_name_scientific": "acacia bidwillii var. polytricha",
    "intro": "Acacia bidwillii var. polytricha, commonly known as the coastal wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, yellow floral spikes that appear during spring. The plant has phyllodes, which are flattened leaf-like structures that reduce water loss in arid conditions. It thrives in coastal and sandy soils, often found in regions with a Mediterranean climate. The species is well adapted to withstand salt spray and drought, making it a resilient component of coastal ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bidwillii var. polytricha is primarily native to the arid and semi-arid regions of Australia, particularly in the central and western parts of the continent. It is commonly found in areas such as the Simpson Desert, the Great Sandy Desert, and the Sturt Desert. This variety thrives in sandy soils and is often seen growing along riverbanks and in open woodlands. It is well adapted to the harsh conditions of the Australian outback, including extreme temperatures and limited rainfall. Its distribution is closely associated with the ecological zones that support its specific growth requirements.",
    "distribution_introduced_art_desc": "Acacia bidwillii var. polytricha was mainly introduced to New South Wales, Australia, as part of ecological restoration and revegetation efforts. It is commonly used in rehabilitation projects due to its ability to stabilize soils and thrive in degraded landscapes. This variety is particularly adapted to dry and semi-arid environments, making it suitable for areas with low rainfall. It has also been planted in urban areas for its ornamental value and capacity to provide habitat for native wildlife. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
