{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stenocarpa var. chariensis",
    "plant_slug": "acacia-stenocarpa-var-chariensis",
    "plant_name_scientific": "acacia stenocarpa var. chariensis",
    "intro": "Acacia stenocarpa var. chariensis, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Western Australia. It is characterized by its slender, often multi-branched stems and narrow, feathery leaves that are typically green with a slight blue or grey tinge. The plant produces yellow globular flowers in late summer to autumn, which are clustered in dense, spherical inflorescences. It is well adapted to arid and semi-arid environments, with a deep root system that allows it to thrive in poor soils. The species is also valued for its ornamental appeal and is often used in landscaping due to its hardy nature and attractive foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stenocarpa var. chariensis is primarily native to the arid regions of southwestern Australia, specifically the wheatbelt and jarrah forest areas. This variety is commonly found in sandy soils and is adapted to the dry, hot climate of its native habitat. It is often seen growing in open woodlands and along the edges of grasslands. The plant is well-suited to the environmental conditions of the region, including low rainfall and high temperatures. It plays an important ecological role in its native environment by providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia stenocarpa var. chariensis was mainly introduced to areas with well-drained soils and a temperate climate, typically found in regions of southern Australia. It is commonly found in open woodlands and along riverbanks where it can thrive in full sun. This variety is known for its ability to tolerate drought conditions, making it suitable for reclamation projects. Its introduction has been primarily for ornamental purposes and soil stabilization. However, it has also been reported to naturalize in some regions, raising concerns about its potential invasiveness."
}
