{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elegans",
    "plant_slug": "acacia-elegans",
    "plant_name_scientific": "acacia elegans",
    "intro": "Acacia elegans, commonly known as the slender acacia, is a shrub native to southern Africa. It is characterized by its slender, branching stems and small, feathery leaves that are often covered in fine hairs. The plant produces yellow flowers in clusters, which are followed by distinctive pod-like fruits containing seeds. Acacia elegans thrives in well-drained soils and is often found in open woodlands or along riverbanks. It is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elegans is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It thrives in arid and semi-arid regions, often found in savannas and rocky outcrops. This species is well adapted to hot, dry climates and can tolerate poor soil conditions. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia elegans is also known for its distinctive, slender acacia pods and is commonly used in traditional medicine and as a source of timber.",
    "distribution_introduced_art_desc": "Acacia elegans was mainly introduced to control erosion and for ornamental purposes in regions with a Mediterranean climate. It is commonly found in disturbed soils and along roadsides due to its ability to thrive in poor soil conditions. The plant spreads primarily through its serotinous seed pods, which release seeds after fire or mechanical disturbance. It has become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Due to its rapid growth and adaptability, it is now considered a potential weed in several parts of the world."
}
