{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia loderi",
    "plant_slug": "acacia-loderi",
    "plant_name_scientific": "acacia loderi",
    "intro": "Acacia loderi, commonly known as the Loder's wattle, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, zigzagging stems and small, feathery leaves that are adapted to conserve water. The plant produces yellow flowers in spring, which are arranged in compact, cylindrical clusters. Acacia loderi is drought-tolerant and thrives in sandy or gravelly soils. It is often used in landscaping for its ornamental value and ability to stabilize soils in dry environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia loderi"
    },
    "taxonomy_art_desc": "Acacia loderi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissues. Its class is Equisetopsida, which consists of ferns and their allies, often featuring jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which comprises plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in landscaping and traditional medicine. Its species is Acacia loderi, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia loderi is primarily native to New South Wales, South Australia, and Victoria. It is commonly found in dry, sandy soils across these regions. This plant thrives in arid and semi-arid environments, often growing in open woodlands or on rocky outcrops. It is well adapted to the harsh climatic conditions of its native range. Acacia loderi plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia loderi was mainly introduced to South Africa, where it has been established in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces. The plant thrives in coastal areas and sandy soils, often growing in disturbed habitats. It is considered an invasive species in some parts of its range due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to ecological concerns, prompting management efforts to control its spread."
}
