{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia colletioides var. nyssophylla",
    "plant_slug": "acacia-colletioides-var-nyssophylla",
    "plant_name_scientific": "acacia colletioides var. nyssophylla",
    "intro": "Acacia colletioides var. nyssophylla, commonly known as the silky acacia, is a shrub or small tree native to parts of southern Africa. It is characterized by its long, feathery leaves that are often covered in fine, silky hairs, giving it a soft, velvety appearance. The plant produces yellow flowers in compact, globular clusters, which are highly attractive to pollinators such as bees and birds. Its wood is durable and has been used traditionally for various purposes, including construction and tool-making. The species is also valued in horticulture for its ornamental qualities and ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia colletioides var. nyssophylla is primarily native to the island of Madagascar. This variant is found in the eastern part of the island, particularly in the northeastern region. It grows in humid, coastal areas and lowland rainforests. The plant is adapted to the tropical climate and is often found in association with other native flora. Its distribution is limited to specific microhabitats within Madagascar.",
    "distribution_introduced_art_desc": "Acacia colletioides var. nyssophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is often used for erosion control due to its rapid growth and hardy nature. However, it has also been identified as a potential invasive species in some areas. Its introduction has raised concerns about its impact on native vegetation and biodiversity."
}
