{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spinosa",
    "plant_slug": "acacia-spinosa",
    "plant_name_scientific": "acacia spinosa",
    "intro": "Acacia spinosa, commonly known as the screwpod wattle, is a shrub native to Australia. It is characterized by its slender, spiny stems and small, yellow flowers that bloom in spring. The plant produces pod-like fruits that contain several seeds, which are dispersed by wind. Acacia spinosa thrives in arid and semi-arid environments, adapting well to poor soil conditions. Its ecological importance includes providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spinosa is primarily native to Australia, particularly in the arid and semi-arid regions of the central and western parts of the country. It is commonly found in areas such as South Australia, Western Australia, and the Northern Territory. This plant thrives in sandy or rocky soils and is well adapted to the harsh, dry climate of these regions. It is often seen growing in open woodlands, scrublands, and along riverbanks. Acacia spinosa plays an important ecological role by providing habitat and food for various native animals and insects.",
    "distribution_introduced_art_desc": "Acacia spinosa was mainly introduced to areas with dry, sandy soils and a warm climate, typically found in regions of Australia and parts of the Mediterranean. It is often used for soil stabilization and as a source of timber and fuel. Due to its adaptability, it has been introduced to other parts of the world, including North America and South Africa. However, its spread can sometimes lead to ecological imbalances in non-native environments. Proper management is necessary to prevent it from becoming invasive in new habitats."
}
