{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brachybotrya f. glabra",
    "plant_slug": "acacia-brachybotrya-f-glabra",
    "plant_name_scientific": "acacia brachybotrya f. glabra",
    "intro": "Acacia brachybotrya f. glabra, commonly known as the smooth acacia, is a shrub native to southern Africa. It is characterized by its slender, often multi-branched stems and small, clustered leaves. The plant produces yellow flowers in dense spikes, which are typical of the Acacia genus. Its leaves are reduced to small, scale-like structures, giving it a distinctive appearance. This species is adapted to arid and semi-arid environments, making it a hardy plant in dry conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brachybotrya f. glabra is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This plant thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. It is well adapted to withstand drought conditions and high temperatures. The species is often seen growing along riverbanks and in open grasslands. Its distribution is largely restricted to the dry inland areas of the region.",
    "distribution_introduced_art_desc": "Acacia brachybotrya f. glabra was mainly introduced to control soil erosion and stabilize degraded lands in arid and semi-arid regions. It is commonly used in reforestation and land rehabilitation projects due to its rapid growth and deep root system. The plant thrives in poor soil conditions and can tolerate drought, making it suitable for marginal agricultural areas. It has been introduced in several countries in Africa and parts of the Middle East as part of ecological restoration efforts. However, its invasive potential requires careful management to prevent unintended environmental impacts."
}
