{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mucronata var. dissitiflora",
    "plant_slug": "acacia-mucronata-var-dissitiflora",
    "plant_name_scientific": "acacia mucronata var. dissitiflora",
    "intro": "Acacia mucronata var. dissitiflora, commonly known as the slender wattle, is a small to medium-sized shrub or tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow, globular flower heads that appear in late winter to early spring. The plant thrives in well-drained soils and is often found in coastal and inland regions. It is adapted to arid and semi-arid environments, showing some drought tolerance. The species is valued for its ornamental appeal and is sometimes used in landscaping due to its attractive foliage and flowering habit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mucronata var. dissitiflora is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in rocky outcrops and sandy soils, often found in savanna and shrubland ecosystems. This variant is well adapted to drought conditions and can tolerate high temperatures. It is commonly seen in coastal and inland areas where rainfall is low and erratic. Due to its hardy nature, it plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia mucronata var. dissitiflora was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential for soil stabilization. It is commonly found in coastal areas and along roadsides, thriving in well-drained soils and full sun. The plant is also used in reforestation projects due to its fast growth rate and ability to tolerate harsh environmental conditions. However, it has raised concerns as a potential invasive species in some regions. Its distribution is primarily limited to areas with suitable climate and soil conditions."
}
