{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macroloba",
    "plant_slug": "acacia-macroloba",
    "plant_name_scientific": "acacia macroloba",
    "intro": "Acacia macroloba, commonly known as the large-leaved acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its long, narrow, and often pubescent leaves that are alternate along the stems. The plant produces yellow flowers in compact clusters, which are typically followed by flat, pod-like fruits. Acacia macroloba thrives in a variety of habitats, including grasslands and rocky areas, and is adapted to arid and semi-arid climates. It is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macroloba is primarily native to tropical and subtropical regions of Africa, including countries such as Sudan, Ethiopia, Kenya, Tanzania, and South Africa. It thrives in dry savannas, woodlands, and along riverbanks where it can access adequate sunlight and water. This species is commonly found in areas with well-drained soils and is often part of the vegetation in arid and semi-arid ecosystems. It plays an important ecological role by providing food and shelter for various wildlife species. Due to its hardy nature, it is also sometimes cultivated in other regions for its ornamental and practical uses.",
    "distribution_introduced_art_desc": "Acacia macroloba was mainly introduced to South Africa, particularly in the Eastern Cape and KwaZulu-Natal provinces. It was brought in for its potential as a source of timber and fuelwood due to its fast growth rate and hardy nature. The plant has since become naturalized in various parts of the region, often colonizing disturbed soils and open habitats. Its introduction has led to concerns about its invasive potential in some areas. However, it is also valued for its ecological benefits, including providing habitat for wildlife and preventing soil erosion."
}
