{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gregorii",
    "plant_slug": "acacia-gregorii",
    "plant_name_scientific": "acacia gregorii",
    "intro": "Acacia gregorii, commonly known as the Gregor's acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular clusters, which are followed by long, flat pods containing seeds. It is well adapted to drought conditions, with deep root systems that allow it to survive in harsh, dry environments. Acacia gregorii plays an important role in its ecosystem, providing habitat and food for various animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gregorii"
    },
    "taxonomy_art_desc": "Acacia gregorii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and ability to thrive in arid environments. Its species is Acacia gregorii, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gregorii is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils and a Mediterranean climate. This plant typically grows in coastal heathlands and dry woodlands. It is well adapted to the arid and semi-arid conditions of its native habitat. Acacia gregorii plays an important role in the local ecosystem by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia gregorii was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This plant is often used in reclamation projects due to its ability to thrive in harsh environmental conditions. Its deep root system helps in improving soil structure and retaining moisture. However, it can become invasive in some ecosystems if not managed properly."
}
