{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia robusta subsp. clavigera",
    "plant_slug": "acacia-robusta-subsp-clavigera",
    "plant_name_scientific": "acacia robusta subsp. clavigera",
    "intro": "Acacia robusta subsp. clavigera, commonly known as the broad-leaf wattle, is a shrub or small tree native to northern Australia. It is characterized by its bipinnate leaves, which are composed of numerous small leaflets arranged in a feathery pattern. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and inland regions. The species is valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia robusta subsp. clavigera is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in coastal and lowland areas, particularly in regions with sandy soils and a tropical or subtropical climate. This subspecies thrives in open habitats such as forests, woodlands, and coastal dunes. It is well adapted to the harsh conditions of the Australian coastline, including salt spray and seasonal droughts. Its distribution is closely linked to the ecological zones where it can access sufficient sunlight and water.",
    "distribution_introduced_art_desc": "Acacia robusta subsp. clavigera was mainly introduced to New Zealand. It was first recorded in the 19th century and has since become naturalized in various parts of the country. The plant is commonly found in coastal and lowland areas, particularly in the North Island. It thrives in a range of soil types but prefers well-drained soils. Due to its rapid growth and adaptability, it has become a common weed in some regions."
}
