{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia notabilis var. validinervia",
    "plant_slug": "acacia-notabilis-var-validinervia",
    "plant_name_scientific": "acacia notabilis var. validinervia",
    "intro": "Acacia notabilis var. validinervia, commonly known as the coastal acacia, is a shrub or small tree native to coastal regions of southern Africa. It features slender, often multi-branched stems with a greyish bark that exfoliates easily. The plant produces yellow flowers in compact globular inflorescences, which bloom during the warmer months. Its leaves are bipinnate, with small, thread-like leaflets that are arranged in a dense, feathery pattern. The species is adapted to sandy soils and is often found in dune environments, where it plays a role in stabilizing coastal ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia notabilis var. validinervia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils and rocky outcrops, thriving in environments with low rainfall. It is often associated with savanna and shrubland ecosystems, where it plays a role in stabilizing soil and providing habitat for local wildlife. The plant is well adapted to withstand drought conditions and high temperatures. Its distribution is largely restricted to specific ecological zones within southern Africa.",
    "distribution_introduced_art_desc": "Acacia notabilis var. validinervia was mainly introduced to South Africa, where it has been cultivated for its ornamental value and ecological benefits. It is commonly found in coastal and inland regions, thriving in well-drained soils and full sun exposure. This variety is known for its attractive foliage and ability to withstand drought conditions, making it suitable for landscaping and reforestation projects. Its introduction has contributed to the biodiversity of local ecosystems, although it requires careful management to prevent potential invasiveness. The plant is also valued for its role in providing habitat for native wildlife."
}
