{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polybotrya",
    "plant_slug": "acacia-polybotrya",
    "plant_name_scientific": "acacia polybotrya",
    "intro": "Acacia polybotrya, commonly known as the silver wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, often silver-gray stems and bipinnate leaves that are finely divided. The plant produces yellow globular flowers in late summer, which are arranged in dense, spherical clusters. Acacia polybotrya is adapted to arid and semi-arid environments, with a deep root system for water conservation. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia polybotrya"
    },
    "taxonomy_art_desc": "Acacia polybotrya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their distinctive phyllodes and nitrogen-fixing abilities. Its species is Acacia polybotrya, a specific type of acacia known for its unique floral structure and adapted to grow in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [
        "Jawa"
    ],
    "distribution_native_art_desc": "Acacia polybotrya is primarily native to New South Wales and Queensland in Australia. This species is commonly found in dry, open habitats such as woodlands and grasslands. It thrives in regions with a subtropical to temperate climate. The plant is well adapted to the local soil and climatic conditions of these areas. It plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia polybotrya was mainly introduced to Jawa. It is a species of acacia that has been documented in the region, likely due to its ecological adaptability and potential uses. The plant is known for its distinctive foliage and ability to thrive in various environmental conditions. It has been observed in both natural and disturbed habitats across Jawa. Its introduction may have been intentional for purposes such as land stabilization or ornamental use."
}
