{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis var. spirocarpa",
    "plant_slug": "acacia-tortilis-var-spirocarpa",
    "plant_name_scientific": "acacia tortilis var. spirocarpa",
    "intro": "Acacia tortilis var. spirocarpa, commonly known as the spiral acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive spiral arrangement of branches, which gives it its common name. The plant produces yellow flowers and flat, bean-like pods that contain seeds. It has small, leathery phyllodes that help reduce water loss in dry environments. Acacia tortilis var. spirocarpa is adapted to survive in harsh conditions with minimal water availability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis var. spirocarpa is primarily native to the Horn of Africa, including countries such as Somalia, Eritrea, and Ethiopia. This variant is commonly found in arid and semi-arid regions, particularly in savannas and rocky habitats. It thrives in areas with low rainfall and high temperatures, adapting well to the harsh conditions of its native environment. The plant is often seen growing along riverbanks and in open woodlands. Its distribution is closely linked to the availability of groundwater and well-drained soils.",
    "distribution_introduced_art_desc": "Acacia tortilis var. spirocarpa was mainly introduced to arid and semi-arid regions of Africa, particularly in countries such as Sudan, Ethiopia, and Somalia. It is commonly found in sandy soils and is often used for its hardy nature and ability to thrive in harsh conditions. This plant is also introduced in some parts of the Middle East and North Africa as a source of firewood and for soil stabilization. Its introduction has helped in reclaiming degraded lands and providing ecological benefits in these regions. However, it is important to monitor its spread to prevent potential impacts on native flora."
}
