{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amabilis",
    "plant_slug": "acacia-amabilis",
    "plant_name_scientific": "acacia amabilis",
    "intro": "Acacia amabilis, commonly known as the velvet acacia, is a flowering plant native to South America, particularly Argentina and Chile. It is characterized by its dense, feathery foliage and produces small, yellow flowers that bloom in clusters. The plant has a woody stem and is often cultivated for its ornamental value due to its attractive appearance. It thrives in well-drained soil and full sun, making it suitable for coastal and temperate climates. Acacia amabilis is also valued for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amabilis is primarily native to South America, specifically found in countries such as Argentina, Bolivia, Chile, Paraguay, and Uruguay. It thrives in temperate to subtropical climates and is commonly found in grasslands, shrublands, and along riverbanks. This species is well adapted to dry conditions and can tolerate poor soil quality. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia amabilis is also known for its ornamental value and is sometimes cultivated for its attractive foliage and flowers.",
    "distribution_introduced_art_desc": "Acacia amabilis was mainly introduced to New Zealand as an ornamental plant due to its attractive yellow flowers and ability to thrive in various soil conditions. It has since become naturalized in several regions, particularly in the North Island, where it spreads along roadsides and in disturbed areas. The plant's rapid growth and adaptability have led to concerns about its potential to invade native habitats. Despite its ecological impact, it remains popular for its aesthetic value and is sometimes used in reforestation projects. However, its introduction has raised questions about its long-term effects on local ecosystems."
}
