{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia papuliformis",
    "plant_slug": "acacia-papuliformis",
    "plant_name_scientific": "acacia papuliformis",
    "intro": "Acacia papuliformis, commonly known as the papular acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branched stems and small, clustered leaves that are typically covered in fine, white hairs. The plant produces yellow flowers in globular inflorescences, which are followed by flat, pod-like fruits containing several seeds. Acacia papuliformis is adapted to arid and semi-arid environments, showing drought tolerance through its succulent stems and reduced leaf surface. It plays a role in local ecosystems by providing habitat and food for various insects and animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia papuliformis is primarily native to eastern Australia, specifically the eastern coast of Queensland and New South Wales. It is commonly found in subtropical and tropical rainforests, as well as in coastal areas and sandstone regions. This species thrives in moist, well-drained soils and is often associated with rocky or cliff habitats. It plays an important role in local ecosystems by providing food and shelter for various wildlife species. Acacia papuliformis is also known for its distinctive papillate (bumpy) leaves and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia papuliformis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for soil stabilization and as a source of timber and forage. Its introduction has sometimes led to ecological concerns due to its aggressive growth in native habitats. It is important to manage its spread to prevent negative impacts on local ecosystems."
}
