{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia demostachya",
    "plant_slug": "acacia-demostachya",
    "plant_name_scientific": "acacia demostachya",
    "intro": "Acacia demostachya, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, greenish-yellow flowers arranged in dense, cylindrical clusters. The plant produces flat, thin pods that contain several seeds, which are dispersed by wind. Acacia demostachya thrives in dry, sandy soils and is often found in coastal regions. It is well adapted to arid environments and is an important component of local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia demostachya is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savanna woodlands and shrublands where the climate is dry and the soil is well-drained. This species thrives in areas with low rainfall and high temperatures, often growing along rocky outcrops or in sandy soils. It plays an important ecological role by providing habitat and food for various animals. Acacia demostachya is also known for its ability to fix nitrogen, which helps improve soil fertility in its native environment.",
    "distribution_introduced_art_desc": "Acacia demostachya was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has been associated with both ecological benefits and potential invasive tendencies in some environments. Due to its adaptability, it has been cultivated in various parts of the world with similar climatic conditions."
}
