{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oreades",
    "plant_slug": "acacia-oreades",
    "plant_name_scientific": "acacia oreades",
    "intro": "Acacia oreades, commonly known as the mountain acacia, is a shrub native to the high altitudes of South America. It is characterized by its slender, often branched stems and small, feathery leaves that are adapted to arid and cold environments. The plant produces yellow flowers in globular clusters, which attract pollinators such as bees and birds. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its survival in harsh mountainous regions. Acacia oreades is well-suited to rocky soils and can thrive in areas with low precipitation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oreades is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in rocky outcrops, grasslands, and along riverbanks in these areas. This plant thrives in well-drained soils and is adapted to withstand periods of drought. It is often seen growing in open habitats with limited vegetation cover. Its distribution is closely linked to the specific environmental conditions of the region.",
    "distribution_introduced_art_desc": "Acacia oreades was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. It has been introduced to several countries in Africa, Asia, and Australia for ecological restoration purposes. However, its invasive potential in some areas has raised concerns about its environmental impact."
}
