{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trichophylloides",
    "plant_slug": "acacia-trichophylloides",
    "plant_name_scientific": "acacia trichophylloides",
    "intro": "Acacia trichophylloides, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and small, feathery leaves that give it a delicate appearance. The plant produces yellow flowers in dense, globular clusters, which are highly attractive to bees and other pollinators. Its seeds are enclosed in woody pods and are often used in traditional medicine. The species is adapted to arid and semi-arid environments, making it a resilient plant in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trichophylloides is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, rocky outcrops, and dry woodlands where it thrives in hot and dry conditions. This species is well adapted to nutrient-poor soils and can survive with minimal water availability. Its distribution is also observed in parts of eastern and southern Africa, particularly in regions with a distinct dry season. Acacia trichophylloides plays an important ecological role in these environments, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia trichophylloides was mainly introduced to control erosion and stabilize soil in degraded lands. It is commonly found in arid and semi-arid regions where it forms dense thickets. The plant is valued for its rapid growth and ability to thrive in poor soil conditions. It has been successfully established in several countries in Africa and the Middle East. However, its invasive potential requires careful management to prevent ecological imbalances."
}
