{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tenuiflora",
    "plant_slug": "acacia-tenuiflora",
    "plant_name_scientific": "acacia tenuiflora",
    "intro": "Acacia tenuiflora, commonly known as the narrow-leaved wattle, is a shrub or small tree native to the arid and semi-arid regions of Australia. It is characterized by its slender, feathery leaves and yellow globular flowers that bloom in spring. The plant is well adapted to drought conditions, with deep roots that allow it to survive in harsh environments. Its flowers are an important food source for native pollinators, including bees and birds. Acacia tenuiflora is also valued for its role in stabilizing soils and preventing erosion in degraded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tenuiflora is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the states of Queensland, New South Wales, and South Australia. This plant thrives in sandy or loamy soils and is often associated with coastal dunes and inland shrublands. It is well adapted to drought and high temperatures, making it a resilient species in its native habitat. Acacia tenuiflora plays an important ecological role by providing habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia tenuiflora was mainly introduced to South Africa as an ornamental plant due to its unique appearance and hardy nature. It has since been cultivated in various regions across the country, including the Western Cape and KwaZulu-Natal. The plant thrives in well-drained soils and full sun, making it suitable for both garden and landscape settings. Its ability to withstand drought conditions has contributed to its popularity among local horticulturists. However, there are concerns about its potential to become invasive in certain ecosystems if not managed properly."
}
