{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia venosa",
    "plant_slug": "acacia-venosa",
    "plant_name_scientific": "acacia venosa",
    "intro": "Acacia venosa, commonly known as the slender wattle, is a shrub native to Australia. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant features small, yellow flowers arranged in dense, cylindrical spikes, which are typical of many acacia species. Its leaves are compound, consisting of multiple pairs of small, oval-shaped leaflets. Acacia venosa is well adapted to arid and semi-arid environments, making it a resilient component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia venosa is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. This plant thrives in environments with high sunlight exposure and is well adapted to withstand drought conditions. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. Acacia venosa is also sometimes cultivated for its ornamental value due to its distinctive foliage and resilience.",
    "distribution_introduced_art_desc": "Acacia venosa was mainly introduced to control soil erosion and as a windbreak in arid and semi-arid regions. It is commonly planted along roadsides and in degraded lands due to its rapid growth and hardy nature. The plant thrives in dry conditions and can tolerate poor soil quality, making it suitable for rehabilitation projects. Its ability to fix nitrogen also improves soil fertility over time. However, it has been reported to spread aggressively and may become invasive in certain environments."
}
