{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia binervosa",
    "plant_slug": "acacia-binervosa",
    "plant_name_scientific": "acacia binervosa",
    "intro": "Acacia binervosa, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is adapted to arid and semi-arid environments, with a deep root system for water storage. Its bark is smooth and often flaky, and it produces pod-like fruits containing seeds. Acacia binervosa plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "[WRONG START] Acacia binerviosa is primarily native to Australia, specifically the southern regions including South Australia, Victoria, and parts of New South Wales. It thrives in arid and semi-arid environments, often found in open woodlands and along coastal areas. This species is well adapted to the harsh conditions of the Australian landscape, including high temperatures and low rainfall. It is commonly seen in sandy soils and is an important component of local ecosystems. Acacia binerviosa is also known as the coastal wattle due to its frequent occurrence along the coastline.",
    "distribution_introduced_art_desc": "[WRONG START] Acacia binerviosa was mainly introduced to control erosion and for its ornamental value in landscaping. It is commonly found in disturbed soils and along roadsides in regions where it has been planted. The plant thrives in dry to semi-arid environments and can spread rapidly due to its ability to resprout from the base after fire or cutting. Its introduction has led to its establishment in several areas beyond its native range. However, it is not considered invasive in most of these regions."
}
