{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pumila",
    "plant_slug": "acacia-pumila",
    "plant_name_scientific": "acacia pumila",
    "intro": "Acacia pumila, commonly known as the stinkwood or white acacia, is a shrub or small tree native to arid and semi-arid regions of Africa, the Middle East, and parts of Australia. It is characterized by its slender, often twisted branches and small, fragrant yellow flowers that bloom in summer. The plant has small, leathery leaves that are typically arranged in pairs, and it produces pod-like fruits containing several seeds. Acacia pumila is well adapted to harsh environments, with deep roots that allow it to survive in drought conditions. It is also known for its use in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pumila is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in desert regions, including parts of Arizona, New Mexico, and Texas. This plant thrives in arid and semi-arid environments, often growing on rocky soils and in scrublands. It is well adapted to hot, dry climates and can tolerate poor soil conditions. Acacia pumila is an important component of the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia pumila was mainly introduced to areas with arid or semi-arid climates, particularly in regions of North America, including parts of the southwestern United States and northern Mexico. It is commonly found in disturbed soils and can thrive in sandy or rocky environments. This species is often used for erosion control due to its hardy nature and ability to establish quickly. Its introduction has sometimes led to it becoming invasive in certain areas outside its native range. The plant's distribution is largely influenced by human activity and environmental conditions."
}
