{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bagsteri",
    "plant_slug": "acacia-bagsteri",
    "plant_name_scientific": "acacia bagsteri",
    "intro": "Acacia bagsteri, commonly known as the narrow-leaf wattle, is a shrub or small tree native to eastern Australia. It is characterized by its slender, often zigzagging branches and small, bipinnate leaves that are typically green and narrow. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical or cylindrical heads. Acacia bagsteri is adapted to dry, sandy soils and is drought-tolerant, making it suitable for coastal and semi-arid environments. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bagsteri is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and is often associated with rocky outcrops and shrublands. This plant thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native habitat. It plays an important ecological role by providing shelter and food for various wildlife species. Due to its resilience, it is also sometimes cultivated in dryland areas for its ornamental and ecological value.",
    "distribution_introduced_art_desc": "Acacia bagsteri was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the coast, thriving in coastal fynbos vegetation. This plant is often used in ornamental horticulture due to its attractive yellow flowers and hardy nature. However, it can sometimes become invasive in areas where it escapes cultivation. Its distribution is largely limited to the regions where it has been deliberately planted or has spread from those areas."
}
