{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia genistifolia subsp. genistifolia",
    "plant_slug": "acacia-genistifolia-subsp-genistifolia",
    "plant_name_scientific": "acacia genistifolia subsp. genistifolia",
    "intro": "Acacia genistifolia subsp. genistifolia, commonly known as the silver wattle, is a shrub or small tree native to the Mediterranean region. It features slender, wiry stems and bipinnate leaves that are finely divided, giving it a feathery appearance. The plant produces yellow globular flowers in spring, which are arranged in dense, cylindrical spikes. It is adapted to dry, well-drained soils and is often found in rocky or coastal areas. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive foliage and flowering display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia genistifolia"
    },
    "taxonomy_art_desc": "Acacia genistifolia subsp. genistifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important families such as the Rosids and Monocots. Its order is Fabales, which consists of flowering plants that include legumes, vetches, and other plants known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and often symbiotic nitrogen-fixing relationships with bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive acicular (needle-like) leaves and often for their ability to thrive in arid environments. Its species is Acacia genistifolia, a specific type of acacia that is characterized by its small, leaf-like stipules and its native habitat in certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia genistifolia subsp. genistifolia is primarily native to New South Wales, South Australia, and Victoria. This species is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. The plant is well adapted to the climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and soil stability.",
    "distribution_introduced_art_desc": "Acacia genistifolia subsp. genistifolia was mainly introduced to areas with Mediterranean climate characteristics, including regions of southern Europe, North Africa, and parts of the Middle East. It thrives in well-drained soils and full sun, making it suitable for coastal and semi-arid environments. This subspecies is often cultivated as an ornamental plant due to its attractive foliage and ability to withstand drought conditions. It has been reported to naturalize in some regions, potentially impacting local ecosystems. Its introduction is primarily associated with horticultural and landscaping purposes."
}
