{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lazaridis",
    "plant_slug": "acacia-lazaridis",
    "plant_name_scientific": "acacia lazaridis",
    "intro": "Acacia lazaridis, commonly known as the Lazarus acacia, is a shrub native to the arid regions of the Middle East and North Africa. It is characterized by its slender, often spiny stems and small, bipinnate leaves that are adapted to reduce water loss. The plant produces yellow flowers in late spring, which are clustered in spherical heads. Its seeds are enclosed in woody pods and are dispersed by wind. Acacia lazaridis is well-suited to harsh, drought-prone environments and is often used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lazaridis"
    },
    "taxonomy_art_desc": "Acacia lazaridis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle that includes both a sporophyte and a gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often a distinctive floral structure. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in landscaping and traditional medicine. Its species is Acacia lazaridis, a specific type of acacia found in certain regions, notable for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lazaridis is primarily native to Queensland. It is found in the arid and semi-arid regions of the state, particularly in the Channel Country and the Simpson Desert areas. This plant thrives in sandy soils and is adapted to the harsh, dry conditions of the inland regions. It is often seen as part of the vegetation in grassy woodlands and open shrublands. Its distribution is limited to specific ecological zones within Queensland due to its specialized environmental requirements.",
    "distribution_introduced_art_desc": "Acacia lazaridis was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This plant has been introduced in several parts of the Middle East and North Africa. Its rapid growth and ability to thrive in harsh conditions make it a popular choice for land rehabilitation. However, it can become invasive if not managed properly."
}
