{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia berteroana",
    "plant_slug": "acacia-berteroana",
    "plant_name_scientific": "acacia berteroana",
    "intro": "Acacia berteroana, commonly known as the white acacia, is a shrub or small tree native to South America. It is characterized by its compound leaves, which are typically bipinnate and feathery in appearance. The plant produces yellow flowers arranged in cylindrical inflorescences, which are often clustered at the ends of branches. Its seeds are enclosed in flat, pod-like fruits that mature into a dark brown color. Acacia berteroana is often found in dry, arid environments and is adapted to thrive in regions with low rainfall.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia berteroana is primarily native to the arid and semi-arid regions of South America, particularly in countries such as Argentina, Bolivia, Chile, and Peru. It is commonly found in the Andean foothills and valleys, where it thrives in dry, rocky soils. This plant is adapted to harsh environmental conditions and often grows in shrublands or along riverbanks. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to the western parts of South America.",
    "distribution_introduced_art_desc": "Acacia berteroana was mainly introduced to regions with a warm, dry climate and well-drained soils, often as an ornamental or for erosion control. It is commonly found in areas with low rainfall and high sunlight exposure, such as coastal and inland dunes. This plant thrives in sandy or gravelly soils and is adapted to withstand drought conditions. Its introduction has sometimes led to it becoming invasive in certain ecosystems. It is widely cultivated in tropical and subtropical regions for its hardy nature and aesthetic appeal."
}
