{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retinodes var. gillii",
    "plant_slug": "acacia-retinodes-var-gillii",
    "plant_name_scientific": "acacia retinodes var. gillii",
    "intro": "Acacia retinodes var. gillii, commonly known as the Gill's wattle, is a shrub native to the arid regions of Western Australia. It features small, yellow, globular flowers that bloom in late winter to early spring. The plant has narrow, linear leaves that are often covered in fine hairs. It is adapted to survive in dry conditions with a deep root system. The species is valued for its ornamental appeal and is often used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia retinodes var. gillii is primarily native to the western United States, particularly in California and Nevada. It thrives in arid and semi-arid environments, often found in rocky soils and along dry streambeds. This variety is commonly associated with desert scrub and chaparral habitats. It is well adapted to the harsh conditions of its native range, including high temperatures and limited rainfall. The plant is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acacia retinodes var. gillii was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the southern and western parts of the country. This plant is often used for soil stabilization and as a source of timber due to its hardy nature. Its introduction has sometimes led to ecological concerns due to its potential to spread aggressively. It is also valued for its ornamental qualities and ability to provide habitat for native wildlife."
}
