{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia torrei",
    "plant_slug": "acacia-torrei",
    "plant_name_scientific": "acacia torrei",
    "intro": "Acacia torrei, commonly known as the Torrey acacia, is a shrub or small tree native to the southwestern United States and northern Mexico. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves that are typically gray-green in color. The plant produces yellow to golden-green flowers in clusters, which bloom in the spring and are followed by flat, pod-like fruits. Acacia torrei is adapted to arid and semi-arid environments, exhibiting drought tolerance and a deep root system. It is often used in xeriscaping due to its low water requirements and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Vachellia",
        "species": "Vachellia torrei"
    },
    "taxonomy_art_desc": "Acacia torrei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, a group of flowering plants that includes legumes, which are known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Vachellia, a group of flowering plants commonly found in arid and semi-arid regions, often referred to as acacias, and known for their thorny stems and compound leaves. Its species is Vachellia torrei, a specific plant within the Vachellia genus, native to certain regions of Africa, and characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mozambique"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia torrei is primarily native to Mozambique. It is commonly found in the coastal regions and along riverbanks in the eastern part of the country. This plant thrives in sandy or loamy soils and is often associated with tropical and subtropical climates. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Acacia torrei is also known for its ability to tolerate drought conditions, making it well adapted to the environmental conditions of Mozambique.",
    "distribution_introduced_art_desc": "Acacia torrei was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This plant is often used for erosion control due to its ability to stabilize soils and its rapid growth rate. However, it can also become invasive in some environments, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
