{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rubiginosa",
    "plant_slug": "acacia-rubiginosa",
    "plant_name_scientific": "acacia rubiginosa",
    "intro": "Acacia rubiginosa, commonly known as the red acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and small, yellow flowers that appear in globular clusters. The plant has phyllodes, which are flattened leaf stalks that function as leaves, and it produces long, thin pods that contain seeds. It thrives in arid and semi-arid environments, showing adaptability to harsh conditions. The species is also valued for its ornamental appeal and historical use in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rubiginosa is primarily native to Australia, particularly in the arid and semi-arid regions of the central and western parts of the country. It is commonly found in areas such as Queensland, New South Wales, South Australia, and Western Australia. This plant thrives in sandy or rocky soils and is well adapted to the harsh, dry conditions of its native environment. It is often seen growing along roadsides, in open woodlands, and on coastal dunes. Acacia rubiginosa plays an important ecological role by providing habitat and food for various native animals and insects.",
    "distribution_introduced_art_desc": "Acacia rubiginosa was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since become naturalized in various regions, particularly in the North Island. The plant thrives in well-drained soils and is often found in disturbed areas such as roadsides and forest edges. Its rapid growth and ability to spread through seeds have led to concerns about its potential invasiveness. Despite its benefits, management strategies are being developed to control its spread in sensitive ecosystems."
}
