{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia megaladena",
    "plant_slug": "acacia-megaladena",
    "plant_name_scientific": "acacia megaladena",
    "intro": "Acacia megaladena, commonly known as the large-flowered wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant produces pod-like fruits that contain seeds covered in a fibrous coating. It thrives in well-drained soils and is often found in coastal and inland areas. Acacia megaladena is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia megaladena is primarily native to eastern Australia, including Queensland, New South Wales, and the island of Tasmania. It thrives in a variety of habitats such as coastal areas, open forests, and heathlands. This species is commonly found in sandy soils and is well adapted to the temperate to subtropical climates of its native range. It plays an important ecological role by providing shelter and food for native wildlife. Acacia megaladena is also known for its distinctive yellow flowers and is often used in horticulture due to its ornamental value.",
    "distribution_introduced_art_desc": "Acacia megaladena was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential for soil stabilization. It is commonly found in gardens and along roadsides, particularly in the Western Cape region. The plant thrives in well-drained soils and full sun, making it adaptable to various environmental conditions. Due to its rapid growth and ability to fix nitrogen, it has also been used in reforestation projects. However, its invasive potential has raised concerns in some areas, leading to careful management practices."
}
