{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lucens",
    "plant_slug": "acacia-lucens",
    "plant_name_scientific": "acacia lucens",
    "intro": "Acacia lucens, commonly known as the shining acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its slender, branching stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellowish-white flowers arranged in cylindrical spikes, which bloom during the warmer months. Acacia lucens thrives in well-drained soils and is often found in savanna and woodland habitats. It is valued for its ornamental appeal and its ability to provide habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lucens"
    },
    "taxonomy_art_desc": "Acacia lucens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as a source of timber. Its species is Acacia lucens, a specific type of acacia known for its unique characteristics and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lucens is primarily native to Madagascar. This species is found throughout various regions of the island, including dry and wet forests. It thrives in a range of habitats, from coastal areas to inland regions. The plant is well adapted to the diverse climates and soils of Madagascar. Its distribution is largely restricted to the island, making it an important part of the local flora.",
    "distribution_introduced_art_desc": "Acacia lucens was mainly introduced to areas with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soil conditions. It has been widely planted in regions of Australia, parts of Africa, and the Middle East as a source of timber and for its nitrogen-fixing properties. The plant's rapid growth and ability to colonize disturbed soils have made it a common invasive species in some areas. However, its introduction has also led to ecological concerns, as it can outcompete native vegetation. Despite these challenges, Acacia lucens remains an important species for land rehabilitation and agroforestry."
}
