{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wallichiana",
    "plant_slug": "acacia-wallichiana",
    "plant_name_scientific": "acacia wallichiana",
    "intro": "Acacia wallichiana, commonly known as the Himalayan acacia, is a deciduous shrub or small tree native to the mountainous regions of the Indian subcontinent. It is characterized by its slender, often thorned stems and bipinnate leaves that are composed of numerous small leaflets. The plant produces yellowish-white flowers arranged in dense, globular clusters, which bloom in the spring. It thrives in well-drained soils and is adapted to temperate to subtropical climates. Acacia wallichiana is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wallichiana is primarily native to the Himalayas, including regions in India, Nepal, Bhutan, and northern Myanmar. It thrives in temperate and subtropical climates, often found in forested areas and on rocky slopes. This species is commonly associated with moist, well-drained soils and can be found at elevations ranging from 1,000 to 3,000 meters. It plays an important ecological role in its native habitat by providing shelter and food for various wildlife species. Acacia wallichiana is also valued for its ornamental qualities and has been introduced to other parts of the world in horticultural settings.",
    "distribution_introduced_art_desc": "Acacia wallichiana was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has since become naturalized in several regions, particularly in coastal and disturbed areas. The plant's ability to thrive in harsh environments has led to its spread beyond cultivated landscapes. However, its introduction has raised concerns about its potential impact on native ecosystems. Despite its aesthetic value, management strategies are being developed to control its spread and mitigate ecological risks."
}
