{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hooperiana var. subcuneata",
    "plant_slug": "acacia-hooperiana-var-subcuneata",
    "plant_name_scientific": "acacia hooperiana var. subcuneata",
    "intro": "Acacia hooperiana var. subcuneata, commonly known as the Hooper's acacia, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, often multi-stemmed form and bipinnate leaves that are reduced to small, scale-like structures in mature plants. The plant produces yellow globular flower heads, which are clustered in dense inflorescences, typical of the Acacia genus. It is adapted to low-nutrient soils and can tolerate drought, making it well-suited to harsh, semi-arid environments. The species is of interest for its ecological role in stabilizing soils and providing habitat for native fauna.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hooperiana var. subcuneata is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the Pilbara and Gascoyne regions, where it thrives in sandy soils and rocky outcrops. This variety is adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its limited distribution, it is considered a rare and restricted species within its native range.",
    "distribution_introduced_art_desc": "Acacia hooperiana var. subcuneata was mainly introduced to New Zealand. It was brought there as part of the broader introduction of Acacia species for ornamental and agricultural purposes. This variety is commonly found in the North Island, particularly in areas with well-drained soils. It thrives in a variety of habitats, including coastal dunes and disturbed sites. However, it is considered a potential weed in some regions due to its rapid growth and ability to spread."
}
