{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia greveana",
    "plant_slug": "acacia-greveana",
    "plant_name_scientific": "acacia greveana",
    "intro": "Acacia greveana, commonly known as the white acacia, is a shrub or small tree native to South Africa. It is characterized by its slender, often thornless stems and bipinnate leaves that are feathery in appearance. The plant produces small, yellow flowers arranged in cylindrical spikes, which bloom in summer. Its seeds are encased in hard, woody pods that split open when mature. Acacia greveana is adapted to arid and semi-arid environments, making it a resilient plant in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia greveana is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, rocky outcrops, and coastal areas where the climate is dry and the soil is well-drained. This species thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native habitat. Its distribution is also observed in parts of Mozambique and Zimbabwe, where it plays a role in local ecosystems. Acacia greveana is an important plant for both wildlife and traditional communities in these regions.",
    "distribution_introduced_art_desc": "Acacia greveana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. The plant thrives in sandy or gravelly soils and is often seen in disturbed areas such as roadsides and farmlands. It is valued for its hardy nature and ability to withstand drought conditions. However, it is also considered a potential invasive species in some areas due to its rapid spread."
}
