{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia caven var. macrocarpa",
    "plant_slug": "acacia-caven-var-macrocarpa",
    "plant_name_scientific": "acacia caven var. macrocarpa",
    "intro": "Acacia caven var. macrocarpa, commonly known as the coastal acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branching stems and bipinnate leaves that are finely divided. The plant produces yellow, globular flower heads that are arranged in dense, cylindrical clusters. It thrives in coastal areas and sandy soils, showing some resistance to salt spray. The seeds are enclosed in woody pods and are an important food source for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia caven var. macrocarpa is primarily native to Argentina, specifically in the provinces of Buenos Aires, La Pampa, and San Luis. It thrives in arid and semi-arid regions, often found in dry grasslands and shrublands. This variant is well adapted to the dry climate and can tolerate poor soil conditions. It is commonly seen in open habitats with low vegetation. Its distribution is limited to the southern part of the country, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia caven var. macrocarpa was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally from South America, specifically Argentina, and was introduced for ornamental purposes due to its attractive foliage and growth habit. The plant thrives in a variety of soil types and is highly adaptable, which contributes to its rapid spread in new environments. It can outcompete native vegetation, leading to ecological imbalances in invaded areas. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
