{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bilimekii var. robusta",
    "plant_slug": "acacia-bilimekii-var-robusta",
    "plant_name_scientific": "acacia bilimekii var. robusta",
    "intro": "Acacia bilimekii var. robusta, commonly known as the robust acacia, is a shrub or small tree native to parts of East Africa. It is characterized by its dense, thorny foliage and elongated, flat pods that contain seeds. The plant produces yellow flowers during the dry season, which are followed by the development of woody pods. It thrives in arid and semi-arid environments, often found in savannas and rocky areas. The species is valued for its hardiness and is sometimes used in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bilimekii var. robusta is primarily native to the Horn of Africa, specifically Somalia and Ethiopia. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This species thrives in areas with low rainfall and high temperatures. It is often associated with coastal and inland dry forests. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acacia bilimekii var. robusta was mainly introduced to areas with a tropical and subtropical climate, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, particularly in countries like South Africa, Namibia, and Botswana. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced to various parts of the world as an ornamental and for erosion control. Its distribution is largely limited to regions where it can receive adequate sunlight and has minimal frost exposure."
}
