{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pentadenia",
    "plant_slug": "acacia-pentadenia",
    "plant_name_scientific": "acacia pentadenia",
    "intro": "Acacia pentadenia, commonly known as the coastal wattle, is a shrub native to southern Australia. It is characterized by its slender, often multi-branched stems and small, yellow flowers that appear in globular heads. The plant produces flat, leathery phyllodes that are typically green and have a distinctive, narrow shape. Acacia pentadenia thrives in coastal and sandy soils, often growing in dune environments. It is well adapted to salt-laden winds and is an important component of coastal ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pentadenia"
    },
    "taxonomy_art_desc": "Acacia pentadenia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features and spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which consists of flowering plants with a distinctive fruit type called a legume and includes well-known families like Fabaceae. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod-like fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species native to Australia and other parts of the world. Its species is Acacia pentadenia, a specific type of acacia characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pentadenia is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often associated with coastal areas. It is a hardy shrub that thrives in arid and semi-arid environments. Acacia pentadenia plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia pentadenia was mainly introduced to regions with a warm, dry climate and well-drained soils, particularly in parts of Australia and other areas of the Southern Hemisphere. It is commonly found in coastal and inland areas where it thrives in full sun and has minimal water requirements. This plant is often used in landscaping due to its hardy nature and ability to withstand harsh environmental conditions. Its introduction has been associated with both ornamental and ecological purposes. However, in some regions, it has become invasive, outcompeting native vegetation."
}
