{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spodiosperma",
    "plant_slug": "acacia-spodiosperma",
    "plant_name_scientific": "acacia spodiosperma",
    "intro": "Acacia spodiosperma, commonly known as the narrow-leaf wattle, is a small shrub native to Australia. It is characterized by its slender, often zigzagging stems and narrow, feathery leaves. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, sandy habitats. Acacia spodiosperma is also valued for its hardy nature and is used in ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spodiosperma is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, rocky outcrops, and sandy soils where it thrives in dry conditions. This species is well adapted to withstand high temperatures and low rainfall, making it a resilient component of the local ecosystem. It plays an important role in preventing soil erosion and providing habitat for various wildlife species. Its distribution is largely restricted to the southern African continent, with limited occurrences in neighboring regions.",
    "distribution_introduced_art_desc": "Acacia spodiosperma was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This species is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has sometimes led to competition with native vegetation in invaded areas. Due to its hardiness, it has become a common plant in disturbed or degraded landscapes."
}
