{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mellei",
    "plant_slug": "acacia-mellei",
    "plant_name_scientific": "acacia mellei",
    "intro": "Acacia mellei, commonly known as the sweet acacia, is a flowering plant native to southern Africa. It is characterized by its slender, erect growth habit and produces small, yellowish-green flowers arranged in cylindrical spikes. The plant is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. Its leaves are bipinnately compound, and it is often found in savanna and woodland habitats. Acacia mellei is also valued for its role in traditional medicine and as a source of honey from its nectar.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mellei is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, particularly in coastal dunes and sandy soils. This plant thrives in coastal areas where it is often used as a stabilizer for dune systems. It is also present in parts of the Horn of Africa, such as Somalia and Eritrea. Acacia mellei is well adapted to the harsh environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia mellei was mainly introduced to regions with a warm, dry climate and well-drained soils, often as an ornamental plant or for its honey-producing capabilities. It is commonly found in areas such as southern Africa, parts of Australia, and the Mediterranean region. The plant thrives in full sun and is relatively drought-tolerant, making it suitable for xeriscaping and landscaping in arid environments. However, it can become invasive in some areas where it outcompetes native vegetation. Its introduction has raised concerns about ecological impact in non-native habitats."
}
