{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latior",
    "plant_slug": "acacia-latior",
    "plant_name_scientific": "acacia latior",
    "intro": "Acacia latior, commonly known as the broad-leaved acacia, is a shrub or small tree native to southern Africa. It is characterized by its bipinnate leaves, which are often divided into small, feather-like segments. The plant produces yellowish to pale green flowers arranged in spherical or cylindrical clusters. Its seed pods are elongated and contain flat, compressed seeds. Acacia latior is adapted to arid and semi-arid environments, making it a resilient plant in dry climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia latior"
    },
    "taxonomy_art_desc": "Acacia latior belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia latior, a specific type of acacia known for its broader leaves and typically found in arid or semi-arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latior is primarily native to Western Australia. It is commonly found in the coastal regions and sandplain areas of the state. This plant thrives in dry, sandy soils and is often seen in heathlands and woodlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia latior plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia latior was mainly introduced to areas with a warm climate and well-drained soils, often as an ornamental plant or for its ability to fix nitrogen. It is commonly found in regions of Australia, particularly in the eastern and southern parts, where it thrives in sunny conditions. The plant has also been introduced to parts of Southeast Asia and the Pacific Islands due to its adaptability and aesthetic value. Its introduction has sometimes led to ecological concerns as it can outcompete native vegetation in certain environments. Despite these challenges, Acacia latior remains a popular choice for landscaping and reforestation projects."
}
