{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia imparilis",
    "plant_slug": "acacia-imparilis",
    "plant_name_scientific": "acacia imparilis",
    "intro": "Acacia imparilis, commonly known as the narrow-leaf wattle, is a flowering plant native to Australia. It is a shrub or small tree that typically grows in arid and semi-arid regions. The plant produces yellow flowers in cylindrical spikes, which bloom during the warmer months. Its leaves are bipinnate, consisting of small, feather-like leaflets. Acacia imparilis is known for its ability to thrive in harsh environments and is often used in landscaping for its hardy nature and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia imparilis"
    },
    "taxonomy_art_desc": "Acacia imparilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle with alternating generations. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is known for its ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic acicular (needle-like) leaves and often used in traditional medicine. Its species is Acacia imparilis, a specific type of acacia found in certain regions of Africa, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia imparilis is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in sandy soils and is often associated with coastal areas. It is a hardy shrub that can withstand dry conditions. Its distribution is largely restricted to the specific ecological zones of Western Australia.",
    "distribution_introduced_art_desc": "Acacia imparilis was mainly introduced to control soil erosion and for its ornamental value in landscaping. It is commonly found in coastal and disturbed areas where it establishes quickly. The plant has become naturalized in several regions, including parts of Australia and the Pacific Islands. Its rapid growth and ability to thrive in poor soils make it a useful but sometimes invasive species. However, its spread can outcompete native vegetation if not managed properly."
}
