{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia abyssinica var. macroloba",
    "plant_slug": "acacia-abyssinica-var-macroloba",
    "plant_name_scientific": "acacia abyssinica var. macroloba",
    "intro": "Acacia abyssinica var. macroloba, commonly known as the large-leaf acacia, is a shrub or small tree native to Ethiopia and parts of Eritrea. It is characterized by its bipinnate leaves, which are composed of numerous small leaflets arranged in a feather-like pattern. The plant produces yellow flowers in compact spherical clusters, followed by long, flat pods containing seeds. It thrives in arid and semi-arid environments, often growing on rocky or sandy soils. The species is valued for its ecological role and has traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia abyssinica var. macroloba is primarily native to the highlands of Ethiopia and Eritrea. It is commonly found in dry, rocky areas and mountainous regions with moderate to high altitudes. This variant is adapted to the arid and semi-arid climates of the Horn of Africa. It thrives in well-drained soils and is often seen in savanna and woodland ecosystems. The plant plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia abyssinica var. macroloba was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate rainfall. It is commonly found in savannas, woodlands, and along riverbanks in eastern and southern Africa. This plant is valued for its hardiness and ability to thrive in poor soil conditions. It has been introduced for use in reforestation and as a source of timber and fodder. However, its spread can sometimes lead to ecological impacts in non-native environments."
}
