{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leucophloea var. microcephala",
    "plant_slug": "acacia-leucophloea-var-microcephala",
    "plant_name_scientific": "acacia leucophloea var. microcephala",
    "intro": "Acacia leucophloea var. microcephala, commonly known as the narrow-headed wattle, is a shrub or small tree native to Australia. It features slender, often spiny stems and is characterized by its small, rounded phyllodes that are typically green with a slight whitish or greyish bloom. The plant produces yellow globular flower heads, which are arranged in clusters and bloom during the warmer months. It thrives in well-drained soils and is often found in coastal and sandy environments. This variety is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardy nature and aesthetic qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leucophloea var. microcephala is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy soils and is commonly found in savannah and woodland ecosystems. This variant is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. It plays an important role in providing habitat and food for local wildlife. Its distribution is closely linked to the ecological conditions of the Namib Desert and surrounding areas.",
    "distribution_introduced_art_desc": "Acacia leucophloea var. microcephala was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, including parts of Namibia, Botswana, and South Africa. This plant is often used for soil stabilization due to its deep root system and ability to tolerate drought conditions. Its introduction has sometimes led to ecological concerns due to its aggressive growth and potential to outcompete native vegetation. Despite these issues, it remains a valuable species for land rehabilitation projects."
}
