{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sesquijuga",
    "plant_slug": "acacia-sesquijuga",
    "plant_name_scientific": "acacia sesquijuga",
    "intro": "Acacia sesquijuga, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It belongs to the Fabaceae family, which is characterized by its nitrogen-fixing capabilities through symbiotic relationships with Rhizobium bacteria. The plant features compound leaves with small, oval-shaped leaflets and produces yellow flowers in clusters. It thrives in well-drained soils and is often found in dry, open habitats. Its ecological importance includes providing nectar for pollinators and habitat for various insects and small animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sesquijuga is primarily native to the eastern United States, specifically the southeastern region. It is found in states such as Georgia, Florida, Alabama, and South Carolina. This plant typically grows in moist, sandy soils along riverbanks and in wetlands. It is commonly associated with the Atlantic Coastal Plain ecosystem. Acacia sesquijuga is often found in open woodlands and is adapted to wetland environments.",
    "distribution_introduced_art_desc": "Acacia sesquijuga was mainly introduced to stabilize soil and prevent erosion in degraded lands. It is commonly found in arid and semi-arid regions where it thrives in poor soil conditions. This plant is valued for its ability to fix nitrogen, improving soil fertility over time. It is often used in reforestation and land rehabilitation projects. Its introduction has helped restore vegetation in areas affected by desertification."
}
