{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia excelsa subsp. excelsa",
    "plant_slug": "acacia-excelsa-subsp-excelsa",
    "plant_name_scientific": "acacia excelsa subsp. excelsa",
    "intro": "Acacia excelsa subsp. excelsa, commonly known as the tall golden wattle, is a striking tree native to Australia. It is characterized by its tall, slender form and golden-yellow flowers that bloom in late winter to early spring. The plant has compound leaves composed of numerous narrow, linear leaflets. It produces woody pods that contain seeds, which are dispersed by wind. This species is well adapted to arid and semi-arid environments, making it a resilient and ecologically important plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia excelsa"
    },
    "taxonomy_art_desc": "Acacia excelsa subsp. excelsa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that often have compound leaves and flowers with a specific arrangement. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used for timber or in traditional medicine. Its species is Acacia excelsa, a specific type of acacia native to certain regions of Africa, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia excelsa subsp. excelsa is primarily native to New South Wales and Queensland. It is commonly found in the eastern parts of Australia, particularly in regions with a subtropical to tropical climate. This subspecies thrives in open woodlands, heathlands, and coastal areas. It is well adapted to the diverse environmental conditions of these regions. Its distribution is largely restricted to the eastern coastal areas of Australia.",
    "distribution_introduced_art_desc": "Acacia excelsa subsp. excelsa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the eastern and western parts of the country, particularly in the coastal areas and along rivers. This species is often associated with disturbed habitats such as roadsides, agricultural fields, and urban environments. Its introduction has led to its spread beyond its native range, contributing to local vegetation dynamics. However, it is not considered an invasive species in most areas where it is established."
}
