{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegalensis",
    "plant_slug": "acacia-senegalensis",
    "plant_name_scientific": "acacia senegalensis",
    "intro": "Acacia senegalensis, commonly known as the gum arabic tree, is a deciduous shrub or small tree native to the Sahel region of Africa. It is characterized by its slender, multi-branched trunk and bipinnate leaves that are often shed during dry seasons. The plant is well adapted to arid and semi-arid environments, with deep roots that help it access water from underground sources. It produces yellow flowers followed by elongated pods containing a sticky, resinous substance known as gum arabic, which is commercially valuable. This species plays an important ecological role in preventing soil erosion and providing habitat for various wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegalensis is primarily native to the Sahel region of Africa, including countries such as Senegal, Mali, Burkina Faso, and Niger. It thrives in dry, semi-arid environments and is commonly found in savannas and along riverbanks. This plant is well adapted to harsh climates and is often used for its gum arabic production. It plays an important ecological role in stabilizing soil and providing habitat for various species. Acacia senegalensis is also valued for its timber and traditional uses in local communities.",
    "distribution_introduced_art_desc": "Acacia senegalensis was mainly introduced to regions where its natural habitat was limited, such as parts of Africa and the Middle East. It was introduced to support local economies through the production of gum arabic, which is used in food, pharmaceuticals, and industrial products. The plant thrives in arid and semi-arid environments, making it suitable for reforestation and soil stabilization efforts. Its introduction has also had ecological impacts, including competition with native species in some areas. Despite its benefits, careful management is required to prevent it from becoming invasive in new ecosystems."
}
