{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella ferrisiae",
    "plant_slug": "acaciella-ferrisiae",
    "plant_name_scientific": "acaciella ferrisiae",
    "intro": "Acaciella ferrisiae, commonly known as the yellow acacia, is a small shrub native to the arid regions of northern Mexico and the southwestern United States. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant has a deep root system that allows it to thrive in dry, sandy soils. Its ability to fix nitrogen makes it an important component of desert ecosystems. Acaciella ferrisiae is also valued for its ornamental appeal and resilience in harsh environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella ferrisiae is primarily native to the arid regions of northern Mexico, particularly in the states of Chihuahua and Coahuila. It is also found in parts of the southwestern United States, including Texas. This plant thrives in sandy or rocky soils and is adapted to low rainfall and high temperatures. It is commonly found in desert scrub and grassland habitats. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acaciella ferrisiae was mainly introduced to the southern United States, particularly in Texas and California, as an ornamental plant due to its unique appearance and drought tolerance. It has since spread into other regions, including parts of Arizona and New Mexico, where it thrives in arid and semi-arid environments. The plant's introduction has led to its establishment in native habitats, sometimes competing with local flora. Its rapid growth and ability to colonize disturbed areas have raised concerns about its potential invasiveness. Despite its ornamental value, its ecological impact remains a topic of ongoing study."
}
