{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acanthocarpa var. uncinella",
    "plant_slug": "acacia-acanthocarpa-var-uncinella",
    "plant_name_scientific": "acacia acanthocarpa var. uncinella",
    "intro": "Acacia acanthocarpa var. uncinella, commonly known as the hooked acacia, is a shrub native to southern Africa. It is characterized by its slender, spiny branches and small, yellow, globular flower heads. The plant produces flat, leathery seed pods that remain on the plant for an extended period. Its leaves are bipinnate, with numerous small, oval leaflets. It thrives in well-drained soils and is often found in coastal and sandy habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acanthocarpa var. uncinella is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. This variety is commonly found in sandy soils and rocky outcrops, where it thrives in dry, hot climates. It is often associated with savanna and woodland ecosystems, contributing to the biodiversity of these habitats. The plant is well adapted to withstand drought conditions due to its deep root system and efficient water-use mechanisms. Its distribution is largely restricted to specific geographic areas within the African continent.",
    "distribution_introduced_art_desc": "Acacia acanthocarpa var. uncinella was mainly introduced to specific regions in Australia, particularly in the southern and western parts of the country. It is commonly found in areas with sandy or gravelly soils, often in coastal and inland dunes. This variety is known for its distinctive hooked thorns and is often used in revegetation projects due to its hardiness. It has also been introduced to some parts of New Zealand and South Africa for similar ecological purposes. However, its spread is carefully managed to prevent it from becoming invasive in non-native environments."
}
