{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spectrum",
    "plant_slug": "acacia-spectrum",
    "plant_name_scientific": "acacia spectrum",
    "intro": "Acacia spectrum, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, lace-like appearance. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense inflorescences. Acacia spectrum thrives in well-drained soils and is often found in coastal and sandy regions. It is also noted for its ability to fix nitrogen, making it beneficial for soil enrichment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spectrum"
    },
    "taxonomy_art_desc": "Acacia spectrum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species and is characterized by a wide variety of flower structures. Its order is Fabales, which consists of flowering plants with a distinctive leaf structure and includes economically important legumes. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its nitrogen-fixing ability and diverse floral morphology. Its genus is Acacia, a large group of shrubs and trees native to Africa and Australia, known for their unique acicular leaves and often used in traditional medicine. Its species is Acacia spectrum, a specific type of acacia known for its striking color variations in its foliage, making it a notable ornamental plant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spectrum is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important ecological role in its native habitat. The plant is well adapted to the harsh environmental conditions of the region.",
    "distribution_introduced_art_desc": "Acacia spectrum was mainly introduced to regions with warm, dry climates and well-drained soils, where it can thrive in full sun. It is commonly found in areas with low rainfall and high temperatures, making it suitable for arid and semi-arid environments. This plant has been introduced to several parts of the world, including Australia, the Mediterranean, and parts of the southwestern United States. Its ability to fix nitrogen in the soil makes it a valuable plant for soil stabilization and land rehabilitation. However, it can become invasive in some areas if not managed properly."
}
