{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brachybotrya var. glaucophylla",
    "plant_slug": "acacia-brachybotrya-var-glaucophylla",
    "plant_name_scientific": "acacia brachybotrya var. glaucophylla",
    "intro": "Acacia brachybotrya var. glaucophylla, commonly known as the glaucophylla acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its dense, thornless foliage and small, pale green to blue-green leaves that are covered in a waxy coating, which helps reduce water loss in dry conditions. The plant produces yellow flowers in globular or cylindrical spikes, which are typical of the Acacia genus. It is often used in landscaping for its drought tolerance and ornamental appearance. This variety is distinguished by its unique leaf coloration and is adapted to thrive in nutrient-poor soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brachybotrya var. glaucophylla is primarily native to the arid and semi-arid regions of Western Australia. This variant is commonly found in the Pilbara and Great Sandy Desert areas. It thrives in sandy soils and is often associated with granite outcrops. The plant is well adapted to the harsh climate with its deep root system and waxy leaf coating. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia brachybotrya var. glaucophylla was mainly introduced to New South Wales, Australia, as part of early colonial land clearing and agricultural expansion. It was commonly used for its hardy nature and ability to thrive in poor soils. The plant was also introduced to other regions of Australia for erosion control and as a source of timber and fuel. Its introduction has led to its establishment in various habitats, sometimes becoming invasive in certain areas. Despite its utility, it is now considered a weed in some parts of its range."
}
