{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dependens",
    "plant_slug": "acacia-dependens",
    "plant_name_scientific": "acacia dependens",
    "intro": "Acacia dependens, commonly known as the hanging acacia, is a shrub or small tree native to southern Africa. It is characterized by its drooping, feathery foliage and distinctive yellow flowers that appear in winter. The plant has compound leaves with small, oval-shaped leaflets, and its bark is smooth and often greyish in color. Acacia dependens is adapted to arid and semi-arid environments, making it a hardy species in dry climates. It is also known for its ability to fix nitrogen, which helps improve soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dependens is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in rocky outcrops, sandy soils, and along riverbanks in these regions. The plant is well adapted to dry conditions and can survive in areas with low rainfall. It is commonly found in the Kalahari Desert and other similar desert ecosystems. Acacia dependens plays an important role in local wildlife habitats and is often used in traditional practices by indigenous communities.",
    "distribution_introduced_art_desc": "Acacia dependens was mainly introduced to South Africa, where it has become an invasive species. It is commonly found in coastal areas and along roadsides, spreading rapidly due to its ability to thrive in disturbed soils. The plant forms dense thickets that outcompete native vegetation, leading to reduced biodiversity. Its seeds are dispersed by wind and animals, contributing to its widespread distribution. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
