{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustissima var. shrevei",
    "plant_slug": "acacia-angustissima-var-shrevei",
    "plant_name_scientific": "acacia angustissima var. shrevei",
    "intro": "Acacia angustissima var. shrevei, commonly known as Shreve's narrow-leaf acacia, is a shrub native to the arid regions of the southwestern United States and northern Mexico. It is characterized by its slender, often spiny stems and small, narrow leaves that reduce water loss in its harsh environment. The plant produces yellow flowers in compact globular clusters, which are typical of the Acacia genus. Its root system is deep and extensive, allowing it to access water from deeper soil layers. This species is well adapted to drought and plays a role in stabilizing sandy soils in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustissima var. shrevei is primarily native to the southern United States, specifically Texas and New Mexico. This variety is commonly found in arid and semi-arid regions, including sandy and rocky soils. It thrives in environments with low rainfall and high temperatures. The plant is often associated with scrubland and thornscrub habitats. Its distribution is limited to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acacia angustissima var. shrevei was mainly introduced to specific regions of the United States, particularly in Texas and New Mexico. It was introduced as a potential ornamental and forage plant due to its hardy nature and ability to thrive in arid conditions. This variety is known for its narrow leaves and yellow flowers, making it an attractive addition to landscapes in dry climates. However, its introduction has raised concerns about its potential to become invasive in native ecosystems. Despite its benefits, careful management is necessary to prevent ecological disruption."
}
