{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mutabilis subsp. mutabilis",
    "plant_slug": "acacia-mutabilis-subsp-mutabilis",
    "plant_name_scientific": "acacia mutabilis subsp. mutabilis",
    "intro": "Acacia mutabilis subsp. mutabilis, commonly known as the variable acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive, feathery, bipinnate leaves that change color throughout the growing season, ranging from bright green to red or even purple. The plant produces yellow to orange globular flower heads, which are clustered in dense, spherical inflorescences. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The species is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mutabilis"
    },
    "taxonomy_art_desc": "Acacia mutabilis subsp. mutabilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes (modified leaves) and often used in traditional medicine and as ornamental plants. Its species is Acacia mutabilis, a specific type of acacia known for its variable leaf morphology and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mutabilis subsp. mutabilis is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the areas around the Fitzgerald River National Park and the coastal regions of the Geraldton area. This subspecies thrives in sandy soils and is commonly found in coastal heathlands and open woodlands. It is well adapted to the Mediterranean climate of Western Australia, characterized by hot, dry summers and mild, wet winters. The plant is known for its distinctive yellow flowers and is an important component of the local flora.",
    "distribution_introduced_art_desc": "Acacia mutabilis subsp. mutabilis was mainly introduced to regions with a warm, temperate to subtropical climate, characterized by well-drained soils and moderate rainfall. It thrives in areas with full sun exposure and is commonly found in coastal and inland regions of southern California. This plant is often cultivated for its ornamental value due to its distinctive foliage and ability to tolerate drought conditions. It has been introduced to several parts of the United States, including Texas and Arizona, where it is used in landscaping and erosion control. However, it is considered an invasive species in some areas, posing a threat to native plant communities."
}
