{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ensifolia",
    "plant_slug": "acacia-ensifolia",
    "plant_name_scientific": "acacia ensifolia",
    "intro": "Acacia ensifolia, commonly known as the narrowleaf acacia, is a flowering plant native to tropical and subtropical regions of Africa, Australia, and the Pacific Islands. It is a shrub or small tree that typically grows to a height of 2–5 meters, with slender, often branched stems and bipinnate leaves. The plant produces yellow or pale yellow flowers in dense, globular clusters, which are highly attractive to pollinators such as bees and birds. Its seeds are enclosed in woody pods and are often used in traditional medicine. The plant is also valued for its ornamental appeal and has been introduced to other parts of the world for horticultural purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ensifolia"
    },
    "taxonomy_art_desc": "Acacia ensifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and vetches. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped acacia flowers and often used in traditional medicine. Its species is Acacia ensifolia, a specific type of acacia known for its leaf shape resembling a sickle, commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ensifolia is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This plant thrives in sandy soils and is often associated with coastal and inland dune environments. It is well adapted to the climate and conditions of Queensland's diverse landscapes. Acacia ensifolia plays an important ecological role in these regions.",
    "distribution_introduced_art_desc": "Acacia ensifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, often growing in sandy or disturbed soils. The plant is known for its distinctive sword-shaped leaves and yellow flowers, which make it a popular ornamental species. However, it has also been reported to spread into native vegetation, raising concerns about its potential invasive nature. Despite its aesthetic appeal, its ecological impact requires further study to understand its role in local ecosystems."
}
