{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decipiens var. praemorsa",
    "plant_slug": "acacia-decipiens-var-praemorsa",
    "plant_name_scientific": "acacia decipiens var. praemorsa",
    "intro": "Acacia decipiens var. praemorsa, commonly known as the death's-head hawkmoth acacia, is a shrub native to southern Africa. It is characterized by its slender, sparsely branched stems and small, yellowish-green flowers arranged in globular inflorescences. The plant produces flat, elliptical seed pods that split open to release small, winged seeds. It thrives in sandy or rocky soils and is often found in coastal and inland savanna regions. The species is notable for its ecological role in supporting pollinators and providing habitat for various insects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decipiens var. praemorsa is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. This variety is commonly found in sandy soils and open woodlands, often growing in association with other shrubs and grasses. It thrives in areas with low rainfall and is well adapted to the harsh environmental conditions of the region. The plant is known for its distinctive phyllodes and ability to survive in nutrient-poor soils. Its distribution is largely restricted to the northern parts of the Australian continent where it plays an important ecological role.",
    "distribution_introduced_art_desc": "Acacia decipiens var. praemorsa was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has since become naturalized in several regions, particularly in the North Island, where it thrives in coastal and disturbed habitats. The plant's rapid growth and ability to colonize open areas have led to its classification as an environmental weed in some areas. Despite its invasive tendencies, it is still valued for its ecological role in stabilizing soils and providing habitat for native wildlife. However, its spread requires careful management to prevent displacement of native vegetation."
}
