{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nubica var. aethiopica",
    "plant_slug": "acacia-nubica-var-aethiopica",
    "plant_name_scientific": "acacia nubica var. aethiopica",
    "intro": "Acacia nubica var. aethiopica, commonly known as the Ethiopian acacia, is a shrub or small tree native to the highlands of Ethiopia and Eritrea. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are feather-like in appearance. The plant produces yellow flowers in compact, spherical inflorescences, which are followed by flat, pod-like fruits containing numerous seeds. It is well adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions. This species plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nubica var. aethiopica is primarily native to the Horn of Africa, including countries such as Eritrea, Ethiopia, and Somalia. It is also found in parts of Sudan and the Arabian Peninsula. This plant thrives in arid and semi-arid regions, often growing in rocky soils and along dry riverbeds. It is well adapted to withstand high temperatures and low rainfall. Its distribution is closely associated with the savanna and woodland ecosystems of these regions.",
    "distribution_introduced_art_desc": "Acacia nubica var. aethiopica was mainly introduced to areas with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in regions of East Africa, including countries like Ethiopia, Eritrea, and Sudan. This plant is often used for its hardy nature and ability to stabilize soils in degraded landscapes. It is also valued for its potential in agroforestry and as a source of fuelwood. Its introduction has helped in rehabilitating degraded lands and supporting local ecosystems."
}
