{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flavescens var. nobilis",
    "plant_slug": "acacia-flavescens-var-nobilis",
    "plant_name_scientific": "acacia flavescens var. nobilis",
    "intro": "Acacia flavescens var. nobilis, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is well adapted to arid and semi-arid environments, with a deep root system that allows it to survive in drought conditions. Its flowers are not only ornamental but also attract a variety of pollinators such as bees and birds. The species is widely cultivated for its aesthetic value and is a symbol of Australia's natural heritage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flavescens var. nobilis is primarily native to eastern Australia, specifically the eastern coast of Queensland and New South Wales. It thrives in a variety of habitats, including coastal areas, sand dunes, and rocky outcrops. This variant is commonly found in regions with a subtropical to temperate climate. It is well adapted to sandy soils and can tolerate salt spray from the ocean. Due to its hardy nature, it is often used in coastal landscaping and reclamation projects.",
    "distribution_introduced_art_desc": "Acacia flavescens var. nobilis was mainly introduced to South Africa, where it has become an invasive species. It was originally from Australia and was brought over for ornamental purposes due to its attractive yellow flowers. The plant thrives in coastal areas and has spread rapidly along the coastline, outcompeting native vegetation. Its introduction has led to ecological concerns as it alters local ecosystems and reduces biodiversity. Management efforts are ongoing to control its spread and mitigate its impact on native flora."
}
