{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tabula",
    "plant_slug": "acacia-tabula",
    "plant_name_scientific": "acacia tabula",
    "intro": "Acacia tabula, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow to golden spherical flowers that appear in clusters, typically during the warmer months. Its seed pods are long, slender, and woody, containing several seeds. Acacia tabula is often found in dry, sandy soils and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tabula"
    },
    "taxonomy_art_desc": "Acacia tabula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group that includes ferns, horsetails, and their relatives, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their showy flowers and diverse leaf structures. Its order is Fabales, which consists of flowering plants with a wide range of morphological features, including legumes and some grasses. Its family is Fabaceae, commonly known as the legume family, which includes plants with distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their thorn-like stems and specialized leaf structures. Its species is Acacia tabula, a specific type of acacia plant that is likely adapted to particular environmental conditions and may have unique ecological roles.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tabula is primarily native to Victoria. It is found in the southeastern region of Australia, specifically within the state of Victoria. This plant typically grows in dry, open habitats such as woodlands and grasslands. It is well adapted to the local climate and soil conditions of the area. Acacia tabula plays an important role in the local ecosystem and is a characteristic species of the region.",
    "distribution_introduced_art_desc": "Acacia tabula was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is often used for erosion control due to its deep root system and drought tolerance. It has been introduced to several parts of the United States, including California and Texas. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
