{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scirpifolia",
    "plant_slug": "acacia-scirpifolia",
    "plant_name_scientific": "acacia scirpifolia",
    "intro": "Acacia scirpifolia, commonly known as the swamp acacia, is a shrub native to wetland areas of southern Africa. It is characterized by its slender, often pendulous branches and small, feathery leaves that help reduce water loss in its moist habitat. The plant produces yellow flowers in globular heads, which are visited by various pollinators. Its root system is adapted to waterlogged soils, making it an important component of aquatic ecosystems. Acacia scirpifolia is also valued for its ability to stabilize soil and prevent erosion in swampy environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia scirpifolia"
    },
    "taxonomy_art_desc": "Acacia scirpifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of parts. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia scirpifolia, a specific type of acacia found in certain regions, known for its unique ecological adaptations and potential uses.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scirpifolia is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often associated with coastal and inland dune environments. It is well adapted to the arid and semi-arid climates of its native range. Acacia scirpifolia plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia scirpifolia was mainly introduced to control erosion and stabilize soils in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant has also been introduced for ornamental purposes because of its distinctive foliage and ability to tolerate drought. However, in some areas, it has become invasive, outcompeting native vegetation. Its introduction has led to both ecological benefits and management challenges."
}
