{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drummondii var. parviflora",
    "plant_slug": "acacia-drummondii-var-parviflora",
    "plant_name_scientific": "acacia drummondii var. parviflora",
    "intro": "Acacia drummondii var. parviflora, commonly known as the small-flowered drummond acacia, is a shrub native to the arid regions of Australia. It is characterized by its slender, wiry stems and small, yellow flowers that bloom in clusters during the warmer months. The plant has small, bipinnate leaves that reduce water loss, adapting it to its harsh environment. It is often found in sandy or rocky soils and is well-suited to dry climates. This variety is valued for its ornamental appeal and its ability to thrive in low-water conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drummondii var. parviflora is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the Pilbara and Goldfields regions, where it thrives in sandy soils and dry climates. This variety is adapted to harsh environmental conditions, making it a resilient component of local ecosystems. It is often seen growing along roadsides, in open woodlands, and on rocky outcrops. Its distribution is closely linked to the unique geological and climatic features of its native habitat.",
    "distribution_introduced_art_desc": "Acacia drummondii var. parviflora was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in arid or semi-arid regions. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used in landscaping due to its drought tolerance and ornamental value. It has also been introduced to other parts of the world where similar environmental conditions exist. However, its spread can sometimes lead to ecological impacts in non-native habitats."
}
