{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia humilis",
    "plant_slug": "acacia-humilis",
    "plant_name_scientific": "acacia humilis",
    "intro": "Acacia humilis, commonly known as the dwarf acacia, is a small shrub native to southern Africa. It is characterized by its slender, wiry stems and small, yellow flowers that bloom in clusters. The plant produces small, flat, green pods that contain seeds, which are dispersed by wind. Acacia humilis is adapted to arid environments and is often found in rocky or sandy soils. It is valued for its ornamental appeal and its ability to thrive in poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia humilis is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in the Karoo and Succulent Karoo biomes. This species thrives in rocky soils and is often associated with shrublands and grasslands. It is well adapted to the dry climate and can survive with minimal rainfall. Acacia humilis plays an important ecological role in its native habitat, providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia humilis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for soil stabilization due to its deep root system and ability to grow in harsh conditions. It has also been introduced to parts of Southeast Asia and the Pacific Islands for ornamental and ecological purposes. However, its introduction has raised concerns about potential invasiveness in non-native environments."
}
