{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia johannis",
    "plant_slug": "acacia-johannis",
    "plant_name_scientific": "acacia johannis",
    "intro": "Acacia johannis, commonly known as the yellow acacia, is a flowering plant native to South Africa. It is a small shrub that typically grows in coastal areas and sandy soils. The plant produces yellow flowers arranged in dense, globular heads, which bloom in summer. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia johannis is well adapted to dry conditions and is often used in landscaping for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia johannis"
    },
    "taxonomy_art_desc": "Acacia johannis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants that typically have legume fruits and are often associated with nitrogen-fixing symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia johannis, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia johannis is primarily native to Queensland. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the harsh climate of Queensland's interior. The plant plays an important role in the local ecosystem and is a characteristic feature of the region's flora.",
    "distribution_introduced_art_desc": "Acacia johannis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Queensland. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It also provides habitat and food for native wildlife. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
