{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cordata",
    "plant_slug": "acacia-cordata",
    "plant_name_scientific": "acacia cordata",
    "intro": "Acacia cordata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, often zigzagging stems and small, leathery, oval-shaped leaves. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense spikes. Acacia cordata is well adapted to dry, sandy soils and is drought tolerant. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cordata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in grassland and savanna regions, often growing along riverbanks and in rocky soils. This species thrives in areas with a temperate to subtropical climate and is well adapted to dry conditions. It plays an important ecological role by providing habitat and food for various animals. Acacia cordata is also known for its distinctive cordate (heart-shaped) leaves and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia cordata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coast and in open woodlands. The plant is known for its distinctive heart-shaped leaves and yellow flowers, which attract various pollinators. It has been used in traditional medicine and as a source of timber. However, its spread has raised concerns about its potential to become invasive in local ecosystems."
}
