{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macilenta",
    "plant_slug": "acacia-macilenta",
    "plant_name_scientific": "acacia macilenta",
    "intro": "Acacia macilenta, commonly known as the slender acacia, is a shrub native to the arid regions of South Africa. It features delicate, feathery leaves that are often clustered at the ends of its branches. The plant produces small, yellow flowers that bloom in summer, attracting pollinators such as bees and birds. Its seed pods are elongated and contain hard, angular seeds. Acacia macilenta is well adapted to drought conditions, making it a resilient plant in harsh environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macilenta is primarily native to northern Australia, including regions of Queensland and the Northern Territory. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This plant is well adapted to drought conditions and can thrive in low-nutrient soils. It is often seen in shrublands and woodlands, contributing to the ecological diversity of these areas. Its distribution is also influenced by its ability to form symbiotic relationships with nitrogen-fixing bacteria.",
    "distribution_introduced_art_desc": "Acacia macilenta was mainly introduced to areas with dry, sandy soils and a warm climate, typically found in regions with low rainfall. It is commonly found in coastal dunes and sandy plains, where it thrives in well-drained environments. This plant is often used for soil stabilization due to its extensive root system. It has also been introduced as an ornamental plant in some parts of the world. However, its spread can sometimes lead to ecological concerns in non-native habitats."
}
