{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ommatosperma",
    "plant_slug": "acacia-ommatosperma",
    "plant_name_scientific": "acacia ommatosperma",
    "intro": "Acacia ommatosperma, commonly known as the eye-seed acacia, is a flowering plant native to southern Africa. It is a shrub or small tree that typically grows in dry, rocky habitats. The plant produces yellow flowers in dense, cylindrical spikes, which are followed by flat, leathery pods containing the distinctive seed structures. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. The species is valued for its hardy nature and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ommatosperma"
    },
    "taxonomy_art_desc": "Acacia ommatosperma belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often protein-rich seed pods. Its species is Acacia ommatosperma, a specific type of acacia known for its unique seed structure and found in specific habitats in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ommatosperma is primarily native to Queensland. This species is found in the tropical and subtropical regions of the state. It typically grows in open forests, woodlands, and along riverbanks. The plant is adapted to the warm and humid climate of Queensland. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia ommatosperma was mainly introduced to areas with arid or semi-arid climates, particularly in regions where it can thrive in well-drained soils. It is commonly found in parts of Australia, where it has been introduced for its hardy nature and ability to stabilize soils. The plant is often used in reforestation and land rehabilitation projects due to its resilience to drought and poor soil conditions. However, its introduction has sometimes led to concerns about its potential to become invasive in certain ecosystems. Despite these concerns, it remains a valuable species for ecological and agricultural purposes in suitable environments."
}
