{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia abstergens",
    "plant_slug": "acacia-abstergens",
    "plant_name_scientific": "acacia abstergens",
    "intro": "Acacia abstergens, commonly known as the white wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its narrow, feathery leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system. It produces pods that contain seeds, which are dispersed by wind, contributing to its ecological role in stabilizing soil. Acacia abstergens is also valued for its ornamental appeal and historical use in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia abstergens is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Angola, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland habitats. This plant is well adapted to dry conditions and can survive with minimal rainfall. It is often seen growing along roadsides and in open grasslands. Its ability to withstand harsh environments makes it an important component of the local flora.",
    "distribution_introduced_art_desc": "Acacia abstergens was mainly introduced to control soil erosion and stabilize sandy soils in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh environmental conditions. The plant has shallow roots that help bind the soil, reducing wind and water erosion. It is also valued for its nitrogen-fixing capabilities, improving soil fertility over time. However, its rapid growth and spread can sometimes lead to ecological imbalances if not managed properly."
}
