{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retinodes",
    "plant_slug": "acacia-retinodes",
    "plant_name_scientific": "acacia retinodes",
    "intro": "Acacia retinodes, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and small, feathery leaves that are covered in fine, silky hairs. The plant produces yellow flowers in globular heads, which are typically visited by various pollinators such as bees and birds. Its seeds are enclosed in long, slender pods and are adapted for dispersal by wind. Acacia retinodes is often found in dry, sandy soils and is well adapted to arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia retinodes"
    },
    "taxonomy_art_desc": "Acacia retinodes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that are often legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower heads and often used in traditional medicine. Its species is Acacia retinodes, a specific type of acacia native to Australia, recognized for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [
        "Argentina Northeast",
        "Assam",
        "Azores",
        "Bolivia",
        "California",
        "Colombia",
        "Costa Rica",
        "Cyprus",
        "Dominican Republic",
        "Easter Is.",
        "Ecuador",
        "Ethiopia",
        "France",
        "Great Britain",
        "Hawaii",
        "Honduras",
        "India",
        "Italy",
        "Jawa",
        "Madeira",
        "Morocco",
        "North Caucasus",
        "Peru",
        "Portugal",
        "Romania",
        "Spain",
        "Tasmania",
        "Transcaucasus",
        "Tunisia"
    ],
    "distribution_native_art_desc": "Acacia retinodes is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen along coastal areas and inland dunes. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. Acacia retinodes is also known for its distinctive yellow flowers that bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia retinodes was mainly introduced to Argentina Northeast, Assam, Azores, Bolivia, California, Colombia, Costa Rica, Cyprus, Dominican Republic, Easter Is., Ecuador, Ethiopia, France, Great Britain, Hawaii, Honduras, India, Italy, Jawa, Madeira, Morocco, North Caucasus, Peru, Portugal, Romania, Spain, Tasmania, Transcaucasus, and Tunisia. It has been widely established in these regions, often thriving in tropical and subtropical climates. The plant is commonly found in disturbed areas, along roadsides, and in degraded habitats. Its introduction has led to its naturalization in many of these locations. It is valued for its hardy nature and ability to colonize various soil types."
}
