{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia albizioides",
    "plant_slug": "acacia-albizioides",
    "plant_name_scientific": "acacia albizioides",
    "intro": "Acacia albizioides, commonly known as the white acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are pinnate and often have a greyish or whitish underside. The plant produces yellow flowers in globular heads, which are typically arranged in clusters at the ends of branches. It thrives in well-drained soils and is often found in savanna and woodland habitats. The species is valued for its ornamental appeal and has been introduced to other regions for horticultural purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia albizioides is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, Malawi, Mozambique, and South Africa. It is commonly found in savanna woodlands, grasslands, and along riverbanks. This species thrives in regions with a tropical or subtropical climate and is often associated with dry to semi-arid environments. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia albizioides is also valued for its timber and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia albizioides was mainly introduced to areas with warm, temperate climates and well-drained soils, often as a decorative or ornamental plant. It is commonly found in regions with mild winters and hot, dry summers, such as parts of California and the Mediterranean. The plant thrives in full sun and is known for its feathery leaves and yellow flowers that bloom in spring. Due to its rapid growth and adaptability, it has been introduced to various parts of the world, including some regions in Australia and the Americas. However, it can become invasive in certain environments if not managed properly."
}
