{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia koa",
    "plant_slug": "acacia-koa",
    "plant_name_scientific": "acacia koa",
    "intro": "Acacia koa, commonly known as the Hawaiian koa tree, is a native species of Hawaii belonging to the Fabaceae family. It is characterized by its straight, sturdy trunk and bipinnately compound leaves that are often covered in a fine, silvery fuzz. The tree produces small, yellow, pod-like fruits that contain seeds encased in a hard, woody shell. Acacia koa is well adapted to the dry, volcanic soils of the Hawaiian Islands and is often found in lowland and upland forests. Due to its historical and cultural significance, it is also a symbol of Hawaiian identity and heritage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia koa"
    },
    "taxonomy_art_desc": "Acacia koa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia koa, a native Hawaiian tree known for its ecological importance and traditional cultural significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Hawaii"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia koa is primarily native to Hawaii. It is found throughout the Hawaiian archipelago, particularly on the islands of Oahu, Maui, Molokai, and Kauai. This species thrives in a variety of habitats, including dry forests, coastal areas, and upland regions. Acacia koa is an important part of Hawaii's native flora and plays a significant role in the local ecosystem. It is also culturally significant to the Native Hawaiian people.",
    "distribution_introduced_art_desc": "Acacia koa was mainly introduced to Hawaii for its ornamental value and its ability to provide shade and habitat for native wildlife. It was also planted for erosion control and as a source of timber. However, its rapid growth and ability to outcompete native plants have led to its classification as an invasive species in some areas. Despite its ecological impacts, it remains an important part of the local landscape and culture. Its introduction has significantly altered the ecosystem dynamics of certain regions in Hawaii."
}
