{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sabeana",
    "plant_slug": "acacia-sabeana",
    "plant_name_scientific": "acacia sabeana",
    "intro": "Acacia sabeana, commonly known as the pale acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often thornless branches and small, bipinnate leaves that are adapted to reduce water loss. The plant produces yellow flowers in clusters, which are followed by long, slender pods containing seeds. Acacia sabeana is well-suited to drought conditions and is often found in savanna and rocky habitats. It plays a role in soil stabilization and provides forage for wildlife in its native environment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sabeana is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of Sudan and the Arabian Peninsula. This plant thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is commonly found in savannas and along coastal areas. Acacia sabeana is well adapted to hot, dry climates and can tolerate poor soil conditions.",
    "distribution_introduced_art_desc": "Acacia sabeana was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soil conditions. It is commonly found in regions of Africa, particularly in countries like Sudan, Somalia, and Ethiopia. This plant is often used for its timber, fodder, and as a source of gum arabic. Its introduction has sometimes led to ecological impacts, including competition with native vegetation. Due to its adaptability, it has been planted in reforestation projects in several dry regions."
}
