{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata f. microcantha",
    "plant_slug": "acacia-armata-f-microcantha",
    "plant_name_scientific": "acacia armata f. microcantha",
    "intro": "Acacia armata f. microcantha, commonly known as the narrow-leaved wattle, is a shrub native to Western Australia. It is characterized by its slender, cylindrical stems and small, narrow phyllodes that are typically green with a faint whitish bloom. The plant produces yellow globular flower heads during the autumn season, which are highly attractive to nectar-feeding birds and insects. It is well adapted to arid and semi-arid environments, thriving in well-drained soils. This form of Acacia is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata f. microcantha is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and South Africa. This subspecies is commonly found in rocky outcrops, gravel plains, and coastal areas where it thrives in dry, well-drained soils. It is well adapted to harsh environmental conditions, including high temperatures and low rainfall. The plant is often used as a source of firewood and has cultural significance in local communities. Its distribution is limited to specific ecological niches that support its growth and survival.",
    "distribution_introduced_art_desc": "Acacia armata f. microcantha was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often in disturbed or open habitats. This form is smaller than the typical Acacia armata and has a more compact growth habit. It is sometimes cultivated for ornamental purposes due to its attractive foliage and ability to thrive in harsh conditions. However, it can also pose a threat to native vegetation by outcompeting local species in invaded areas."
}
