{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia varia var. crassinervis",
    "plant_slug": "acacia-varia-var-crassinervis",
    "plant_name_scientific": "acacia varia var. crassinervis",
    "intro": "Acacia varia var. crassinervis, commonly known as the broad-veined acacia, is a shrub or small tree native to Australia. It is characterized by its compound leaves with prominent, broad veins, which give it its specific epithet \"crassinervis.\" The plant produces yellow globular flowers that are clustered in dense inflorescences, typically during spring. It thrives in well-drained soils and is often found in dry, open habitats. The species is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia varia"
    },
    "taxonomy_art_desc": "Acacia varia var. crassinervis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, a group of flowering plants that includes legumes and other plants with characteristic flowers and symbiotic nitrogen-fixing associations. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acicular leaves and often for their ability to fix atmospheric nitrogen. Its species is Acacia varia, a specific type within the Acacia genus, which is further differentiated by the varietal name crassinervis, indicating its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia varia var. crassinervis is primarily native to Western Australia. It is found in the southern and southwestern regions of the state. This variety is typically associated with sandy soils and open habitats. It is commonly observed in coastal and inland areas. The plant is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia varia var. crassinervis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and drought tolerance. It was first recorded in the early 20th century and has since become established in several regions, particularly in the North Island. The plant is commonly found in coastal and urban areas where it thrives in well-drained soils. Despite its ornamental value, it has raised concerns due to its potential to invade native habitats. Its distribution continues to expand, prompting ongoing monitoring by conservation authorities."
}
