{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eburnea",
    "plant_slug": "acacia-eburnea",
    "plant_name_scientific": "acacia eburnea",
    "intro": "Acacia eburnea, commonly known as the sand acacia, is a small to medium-sized tree native to the arid regions of Africa. It is characterized by its slender, often multi-stemmed trunk and bipinnate leaves that are finely divided. The plant produces yellow flowers in dense, globular clusters, which are followed by elongated, woody pods containing flat, fibrous seeds. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. The wood of Acacia eburnea is valued for its durability and is used in construction and furniture-making.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eburnea is primarily native to the tropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in dry, open woodlands and savannas, often found in areas with well-drained soils. This species is commonly associated with coastal and inland dry forests, where it plays an important ecological role. It is also found in parts of the Arabian Peninsula and the island of Socotra. Acacia eburnea is known for its distinctive white to pale yellow bark and its ability to withstand harsh environmental conditions.",
    "distribution_introduced_art_desc": "Acacia eburnea was mainly introduced to regions with tropical and subtropical climates, particularly in areas where it can thrive in well-drained soils. It is commonly found in parts of Africa, including countries like Kenya, Tanzania, and Uganda, where it has been introduced for its ecological and economic benefits. The plant is valued for its hard, durable wood and its ability to prevent soil erosion. It has also been introduced to some parts of Southeast Asia and the Pacific Islands for similar reasons. However, its introduction has sometimes led to competition with native species, raising concerns about its impact on local ecosystems."
}
