{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparia",
    "plant_slug": "acacia-riparia",
    "plant_name_scientific": "acacia riparia",
    "intro": "Acacia riparia, commonly known as the river acacia, is a shrub or small tree native to Africa and the Arabian Peninsula. It is characterized by its slender, often twisted branches and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellow flowers in clusters, which are followed by long, flat seed pods. Acacia riparia is well adapted to arid and semi-arid environments, often growing near water sources. It plays an important role in local ecosystems and has been used traditionally for its timber and medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparia is primarily native to the African continent, including countries such as Sudan, South Sudan, Ethiopia, Kenya, and Tanzania. It is also found in parts of the Arabian Peninsula and the Indian subcontinent. This plant thrives in arid and semi-arid environments, often growing along riverbanks and in sandy soils. It is commonly associated with savanna and grassland ecosystems. Acacia riparia plays an important ecological role by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia riparia was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and rapid growth rate. Its introduction has helped in restoring degraded lands across various parts of Africa and Australia. However, it can become invasive in some areas if not managed properly."
}
