{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gillettiae",
    "plant_slug": "acacia-gillettiae",
    "plant_name_scientific": "acacia gillettiae",
    "intro": "Acacia gillettiae, commonly known as the Gilbert's wattle, is a shrub native to Western Australia. It is characterized by its feathery, bipinnate leaves and yellow floral spikes that bloom in spring. The plant is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system. It plays a role in stabilizing soils and providing habitat for local wildlife. Acacia gillettiae is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gillettiae is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the sandplain and sandy soils of the Geraldton area. This plant thrives in coastal and inland environments with low rainfall. It is well adapted to the harsh conditions of the Australian outback. Its distribution is limited to specific ecological zones within the state.",
    "distribution_introduced_art_desc": "Acacia gillettiae was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in arid and semi-arid regions of Australia, particularly in Western Australia and South Australia. This plant is valued for its hardy nature and ability to thrive in poor soil conditions. However, it can become invasive in certain environments if not managed properly. Its distribution is largely restricted to areas where it has been deliberately planted for environmental rehabilitation purposes."
}
