{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gonophylla",
    "plant_slug": "acacia-gonophylla",
    "plant_name_scientific": "acacia gonophylla",
    "intro": "Acacia gonophylla, commonly known as the narrow-leaf wattle, is a small, multi-stemmed shrub native to the arid regions of Western Australia. It is characterized by its slender, upright growth habit and compound leaves composed of multiple small, linear leaflets. The plant produces yellow, globular flower heads that appear in late summer, adding a striking visual contrast to its grey-green foliage. Acacia gonophylla is adapted to survive in harsh, dry conditions, with deep root systems that help it access groundwater. It is also an important plant for local wildlife, providing nectar for insects and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gonophylla"
    },
    "taxonomy_art_desc": "Acacia gonophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia gonophylla, a specific type of acacia found in certain regions of Australia, distinguished by its unique floral and morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gonophylla is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species thrives in dry, open habitats such as shrublands and woodlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia gonophylla plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia gonophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces. This plant thrives in sandy or gravelly soils and is often seen in coastal areas. It is valued for its hardy nature and ability to withstand drought conditions. However, it is considered invasive in some parts of its range, posing a threat to native vegetation."
}
