{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mollissima var. stenoloba",
    "plant_slug": "acacia-mollissima-var-stenoloba",
    "plant_name_scientific": "acacia mollissima var. stenoloba",
    "intro": "Acacia mollissima var. stenoloba, commonly known as the narrow-leaved wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and compound leaves composed of numerous small, narrow leaflets. The plant produces yellow flowers in globular or cylindrical spikes, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in rocky or sandy habitats. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its distinctive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mollissima var. stenoloba is primarily native to southern Africa, specifically South Africa. It is found in the eastern and western regions of the country, including the coastal areas and the interior grasslands. This plant thrives in dry, sandy soils and is commonly found in coastal dunes and along the edges of forests. It is well adapted to the arid and semi-arid climates of its native range. The variety is known for its distinctive appearance and is often used in local landscapes for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia mollissima var. stenoloba was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland areas of southern Australia. It is often used for erosion control and as a ornamental plant due to its attractive foliage. Its introduction has been associated with both ecological and agricultural benefits in its new habitats."
}
