{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia incana",
    "plant_slug": "acacia-incana",
    "plant_name_scientific": "acacia incana",
    "intro": "Acacia incana, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spindly branches and small, feathery leaves that are covered in fine, white hairs. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in arid and semi-arid environments, often found in sandy soils. Acacia incana is valued for its ornamental appeal and its ability to stabilize soil in degraded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia incana is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy or gravelly soils and is commonly found in savannas and shrublands. This species is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia incana is also sometimes cultivated for its ornamental value due to its unique foliage and resilience.",
    "distribution_introduced_art_desc": "Acacia incana was mainly introduced to stabilize soils and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant has also been introduced for ornamental purposes because of its distinctive silver foliage and drought tolerance. However, in some areas, it has become invasive, outcompeting native vegetation. Its introduction has had both beneficial and problematic ecological impacts depending on the region."
}
