{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gilesiana",
    "plant_slug": "acacia-gilesiana",
    "plant_name_scientific": "acacia gilesiana",
    "intro": "Acacia gilesiana, commonly known as the Giles' acacia, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, showcasing drought tolerance. Its seeds are enclosed in pod-like fruits and are often dispersed by animals. Acacia gilesiana plays a role in stabilizing soils and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gilesiana"
    },
    "taxonomy_art_desc": "Acacia gilesiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often spiny foliage and the production of pods. Its species is Acacia gilesiana, a specific type of acacia native to certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gilesiana is primarily native to South Australia and Western Australia. It is commonly found in arid and semi-arid regions within these states. This species thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Its distribution is largely restricted to the southern and western parts of Australia.",
    "distribution_introduced_art_desc": "Acacia gilesiana was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its rapid growth and hardy nature make it suitable for landscaping and windbreaks in dry environments. However, it requires careful management to prevent it from becoming invasive in non-native areas."
}
