{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena longistipula",
    "plant_slug": "acaena-longistipula",
    "plant_name_scientific": "acaena longistipula",
    "intro": "Acaena longistipula, commonly known as the long-styled burr bush, is a species of flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, spiny foliage and showy yellow flowers. The plant produces small, red, fleshy fruits that are adapted for animal dispersal. It thrives in coastal and subalpine environments, often growing in rocky or sandy soils. Due to its unique morphology and ecological role, it is an important component of New Zealand's native vegetation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena longistipula is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate and subpolar climates, growing in grasslands, shrublands, and disturbed soils. This species thrives in areas with cool, moist conditions and is often associated with mountainous terrain. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is limited to specific geographic areas within South America due to its climatic and soil requirements.",
    "distribution_introduced_art_desc": "Acaena longistipula was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in a variety of soil types and is particularly problematic in disturbed habitats. Its rapid spread has led to increased management efforts to control its impact on local ecosystems."
}
