{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena microcephala",
    "plant_slug": "acaena-microcephala",
    "plant_name_scientific": "acaena microcephala",
    "intro": "Acaena microcephala, commonly known as New Zealand spinach or mountain spinach, is a flowering plant native to New Zealand. It is a member of the rose family (Rosaceae) and is characterized by its small, spiny fruits and alternate leaves. The plant produces yellow flowers that bloom in spring, followed by the development of its distinctive, spherical, bristly fruits. It thrives in temperate climates and is often found in alpine and subalpine regions. Acaena microcephala is valued for its edible leaves, which are rich in nutrients and have a mild, spinach-like flavor.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena microcephala is primarily native to New Zealand. It is commonly found in the South Island, particularly in the central and southern regions. This plant thrives in dry, open habitats such as grasslands, heathlands, and along coastal areas. It is well adapted to the temperate climate and is often found in areas with well-drained soils. Acaena microcephala is an important component of New Zealand's native flora and is recognized for its ecological significance.",
    "distribution_introduced_art_desc": "Acaena microcephala was mainly introduced to New Zealand. It was brought there as part of the European colonization effort. The plant is now considered an invasive species in several regions of New Zealand. It spreads rapidly in disturbed soils and can outcompete native vegetation. Its distribution has expanded due to human activities and its ability to thrive in a variety of environmental conditions."
}
