{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena ovalifolia var. nirihuaoensis",
    "plant_slug": "acaena-ovalifolia-var-nirihuaoensis",
    "plant_name_scientific": "acaena ovalifolia var. nirihuaoensis",
    "intro": "Acaena ovalifolia var. nirihuaoensis, commonly known as the New Zealand thistle, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny foliage and produces small, yellowish flowers that bloom in spring. The plant has oval-shaped leaves with a rough, hairy texture and is adapted to grow in a variety of soil types. It plays an important role in its native ecosystem, providing habitat and food for native insects and birds. However, it is also considered a potential weed in some regions due to its aggressive growth habit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena ovalifolia var. nirihuaoensis is primarily native to the South Island of New Zealand. It is found in the central and southern regions, particularly in the Mackenzie Basin and the Otago region. This variety thrives in dry, open habitats such as grasslands and rocky outcrops. It is commonly associated with areas of low rainfall and well-drained soils. The plant is part of the native flora that has adapted to the unique environmental conditions of New Zealand's southern landscapes.",
    "distribution_introduced_art_desc": "Acaena ovalifolia var. nirihuaoensis was mainly introduced to New Zealand. It was brought there as part of botanical collections and has since become naturalized in certain regions. The plant is typically found in coastal and lowland areas, often growing in sandy or gravelly soils. It is considered a potential weed in some parts of its introduced range due to its ability to spread rapidly. Its introduction has raised concerns among conservationists due to its impact on native ecosystems."
}
