{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena nivalis",
    "plant_slug": "acaena-nivalis",
    "plant_name_scientific": "acaena nivalis",
    "intro": "Acaena nivalis, commonly known as the snowflax, is a perennial herb native to the alpine regions of South America. It is characterized by its low-growing habit and produces small, yellowish flowers that bloom in the summer. The plant has compound leaves with stiff, bristle-like tips, which help reduce water loss in its harsh environment. Its seeds are encased in a prickly, spiky fruit known as an achene, typical of the Rubiaceae family. Acaena nivalis is adapted to cold, high-altitude conditions and is often found in rocky soils and mountainous areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena nivalis is primarily native to New Zealand. It is commonly found in alpine and subalpine regions, particularly in the Southern Alps. This plant thrives in rocky and gravelly soils at high elevations. It is often seen growing in open areas such as ridgelines and mountain slopes. Acaena nivalis is an important component of the alpine flora in New Zealand's high country.",
    "distribution_introduced_art_desc": "Acaena nivalis was mainly introduced to New Zealand as a decorative plant for gardens and landscapes. It was originally native to South America, where it thrives in temperate climates. The introduction of Acaena nivalis to New Zealand has led to its establishment in various regions, particularly in coastal and subalpine areas. However, it has also been identified as an invasive species in some parts of its introduced range. Its rapid spread has raised concerns due to its ability to outcompete native vegetation."
}
