{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena fuegina",
    "plant_slug": "acaena-fuegina",
    "plant_name_scientific": "acaena fuegina",
    "intro": "Acaena fuegina, commonly known as the Southern Chilean burr plant, is a species of flowering plant native to South America. It belongs to the family Rosaceae and is characterized by its woody stems and spiny fruits. The plant produces small, yellowish flowers that are typically clustered in dense inflorescences. Its fruit, which is a burr-like structure, contains seeds that are adapted for dispersal by attaching to animal fur or clothing. Acaena fuegina is often found in temperate regions and is known for its hardy nature in various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena fuegina is primarily native to the southern Andes, specifically in Chile and Argentina. It is commonly found in the Patagonian region, including the island of Tierra del Fuego. This plant thrives in temperate climates with cool, moist conditions. It typically grows in grasslands, shrublands, and rocky areas. Its native distribution is limited to these specific geographic regions within South America.",
    "distribution_introduced_art_desc": "Acaena fuegina was mainly introduced to New Zealand. It was brought there as part of the broader introduction of South American plant species for ornamental or horticultural purposes. The plant has since spread beyond its original planting sites, becoming established in various habitats. It is considered an environmental weed in some regions due to its ability to invade native vegetation. Its distribution is now widespread across much of the country, particularly in coastal and lowland areas."
}
