{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sanguisorbae subsp. utrinquestrigulosa",
    "plant_slug": "acaena-sanguisorbae-subsp-utrinquestrigulosa",
    "plant_name_scientific": "acaena sanguisorbae subsp. utrinquestrigulosa",
    "intro": "Acaena sanguisorbae subsp. utrinquestrigulosa, commonly known as the red burr plant, is a low-growing perennial shrub native to New Zealand. It is characterized by its dense clusters of small, spiky, red-brown bracts that form conspicuous, persistent burrs. The plant produces yellow flowers in early spring, which are followed by the distinctive, prickly fruits. It thrives in moist, shaded environments and is often found in forest understoreys. The species is notable for its ecological role in providing food for native birds and in stabilizing soil in its natural habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sanguisorbae subsp. utrinquestrigulosa is primarily native to South America, specifically occurring in regions of Argentina, Chile, and parts of southern Brazil. This subspecies is commonly found in temperate to subtropical climates, often growing in grasslands, shrublands, and along riverbanks. It thrives in well-drained soils and is adapted to both full sun and partial shade conditions. The plant is known for its small, spiny fruits and is often part of the local flora in these regions. Its distribution is largely limited to the southern cone of South America.",
    "distribution_introduced_art_desc": "Acaena sanguisorbae subsp. utrinquestrigulosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering characteristics. However, it has since become invasive, outcompeting native species in various ecosystems. The plant thrives in a range of soil types and is particularly persistent in disturbed areas. Its spread has raised concerns among conservationists due to its potential to alter local biodiversity."
}
