{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pinnatifida subsp. pliacantha",
    "plant_slug": "acaena-pinnatifida-subsp-pliacantha",
    "plant_name_scientific": "acaena pinnatifida subsp. pliacantha",
    "intro": "Acaena pinnatifida subsp. pliacantha, commonly known as the New Zealand thistle, is a perennial shrub native to New Zealand. It is characterized by its spiny, bract-like leaves and produces small, yellowish flowers that bloom in spring. The plant is part of the Rosaceae family and is known for its ability to thrive in a variety of soil types. It has a fibrous root system that helps stabilize soil, making it useful in ecological restoration projects. However, it can become invasive in certain environments if not managed properly.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pinnatifida subsp. pliacantha is primarily native to the eastern and southern regions of South America, including countries such as Argentina, Chile, and Uruguay. This species is commonly found in temperate grasslands, shrublands, and coastal areas. It thrives in well-drained soils and is often associated with open habitats. The plant is known for its small, spiny fruits and is adapted to the variable climate of its native range. It plays an important ecological role in its habitat by providing food for various wildlife species.",
    "distribution_introduced_art_desc": "Acaena pinnatifida subsp. pliacantha was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive, outcompeting native species in various ecosystems. The plant thrives in a range of soil types and is particularly problematic in grasslands and forest margins. Its rapid spread has led to increased management efforts to control its impact on biodiversity."
}
