{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena venulosa",
    "plant_slug": "acaena-venulosa",
    "plant_name_scientific": "acaena venulosa",
    "intro": "Acaena venulosa, commonly known as the New Zealand bramble, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its prickly stems and small, dark green leaves. The plant produces yellow flowers that bloom in spring, followed by bright red berries in the autumn. These berries are edible for some bird species but are generally considered toxic to humans. Acaena venulosa plays an important ecological role in its native habitat, providing food and shelter for various wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena venulosa is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate and subantarctic environments, often growing in moist, shaded areas such as forests and shrublands. This plant thrives in cool, humid climates and is adapted to the unique ecological conditions of the Southern Hemisphere. It is an important component of the native flora in these regions, contributing to local biodiversity. Acaena venulosa is also occasionally found in New Zealand, where it has been introduced and sometimes naturalized.",
    "distribution_introduced_art_desc": "Acaena venulosa was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century. The plant was initially cultivated for its ornamental value. However, it has since become an invasive species in several regions of New Zealand. Its rapid spread has led to concerns about its impact on native ecosystems."
}
