{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena multifida subsp. quinquefida",
    "plant_slug": "acaena-multifida-subsp-quinquefida",
    "plant_name_scientific": "acaena multifida subsp. quinquefida",
    "intro": "Acaena multifida subsp. quinquefida, commonly known as the five-lobed burr plant, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny fruiting structures that contain seeds, which are adapted for dispersal by animals. The plant has compound leaves with multiple leaflets and produces small, yellowish flowers during the spring. It thrives in a variety of soil types but prefers well-drained conditions. This species is often found in coastal and subalpine regions, where it plays a role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena multifida subsp. quinquefida is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This species typically grows in dry, open habitats such as grasslands and rocky areas. It is commonly associated with coastal and inland dunes. The plant is well adapted to the temperate climate and nutrient-poor soils of its native range.",
    "distribution_introduced_art_desc": "Acaena multifida subsp. quinquefida was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for ornamental purposes. This subspecies has since become naturalized and is now considered an environmental weed in certain regions. It spreads through its seeds, which are dispersed by birds and can germinate in a variety of soil types. Due to its invasive potential, it is often managed in conservation areas to prevent its spread into native ecosystems."
}
