{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena viridior",
    "plant_slug": "acaena-viridior",
    "plant_name_scientific": "acaena viridior",
    "intro": "Acaena viridior, commonly known as the green bristled nettle, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, yellowish flowers and bristly, hairy stems. The plant produces small, oval fruits that are typically red or black when mature. It thrives in moist, temperate climates and is often found in forested areas. Acaena viridior is known for its ability to form dense colonies, which can contribute to soil stabilization.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena viridior is primarily native to New Zealand. It is found throughout the country, particularly in the South Island. This plant thrives in a variety of habitats, including grasslands, shrublands, and coastal areas. It is commonly associated with disturbed soils and can often be found in open, sunny environments. Acaena viridior is an important component of the local flora and plays a role in the ecosystem by providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acaena viridior was mainly introduced to New Zealand. It was brought there as a ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive, outcompeting native species in various ecosystems. The plant spreads through its burrs, which adhere to animals and clothing, facilitating its spread to new areas. Its introduction has led to ecological concerns, prompting management efforts to control its spread."
}
