{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pinnatifida var. uspallatensis",
    "plant_slug": "acaena-pinnatifida-var-uspallatensis",
    "plant_name_scientific": "acaena pinnatifida var. uspallatensis",
    "intro": "Acaena pinnatifida var. uspallatensis, commonly known as the Chilean burr bush, is a shrub native to South America, particularly Chile and Argentina. It is characterized by its dense, spiny foliage and produces small, spherical fruits that are often referred to as \"burrs.\" The plant is adapted to arid and semi-arid environments, with hairy leaves that help reduce water loss. Its fruit is an important food source for various bird species, contributing to seed dispersal. The plant's unique morphology and ecological role make it a significant component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pinnatifida var. uspallatensis is primarily native to the central and southern regions of Chile, specifically in the Valparaíso and Maule regions. It is commonly found in dry and semi-arid environments, including shrublands and rocky slopes. This variety thrives in temperate climates with moderate rainfall and well-drained soils. It is an important component of the local flora in these areas. The plant is adapted to the unique ecological conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acaena pinnatifida var. uspallatensis was mainly introduced to New Zealand. It was brought there as part of the European colonization efforts in the 19th century. The plant was likely introduced for ornamental purposes due to its attractive foliage and flowers. However, it has since become an invasive species in some regions of New Zealand. Its spread has raised concerns due to its ability to outcompete native vegetation."
}
