{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena × dieckii",
    "plant_slug": "acaena-×-dieckii",
    "plant_name_scientific": "acaena × dieckii",
    "intro": "Acaena × dieckii, commonly known as the New Zealand spinach, is a hybrid plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its hairy, prickly stems and small, yellowish flowers. The plant produces edible, nutrient-rich seeds that are often consumed by both humans and wildlife. It thrives in temperate climates and is often found in coastal and subalpine regions. Due to its adaptability and nutritional value, it has been cultivated in various parts of the world.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena × dieckii is primarily native to South America, specifically the Andean regions of Argentina, Bolivia, and Chile. This hybrid plant occurs in high-altitude grasslands and shrublands, often in areas with cool, temperate climates. It is commonly found in the valleys and slopes of the Andes, where it thrives in well-drained soils. The species is adapted to the harsh environmental conditions of the region, including strong winds and limited nutrient availability. Its native distribution reflects its origin as a hybrid between Acaena magellanica and Acaena crassula.",
    "distribution_introduced_art_desc": "Acaena × dieckii was mainly introduced to New Zealand. It is a hybrid species resulting from the cross between Acaena crassifolia and Acaena hastata. This plant is commonly found in coastal and lowland areas, often growing in disturbed soils. It has become naturalized in several regions and is sometimes considered an invasive species. Its distribution is largely restricted to the northern and central parts of the country."
}
