{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sanguisorbae subsp. caesiiglauca",
    "plant_slug": "acaena-sanguisorbae-subsp-caesiiglauca",
    "plant_name_scientific": "acaena sanguisorbae subsp. caesiiglauca",
    "intro": "Acaena sanguisorbae subsp. caesiiglauca, commonly known as the blue-green acaena, is a low-growing shrub native to New Zealand. It features small, clustered flowers that range in color from blue to purple, typically blooming in spring. The plant produces bristly, spiny fruits that contain seeds, a characteristic feature of the Acaena genus. Its leaves are alternate, simple, and often have a bluish or grayish hue due to a dense covering of fine hairs. This species is adapted to a variety of soil types and is often found in coastal and mountainous regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sanguisorbae subsp. caesiiglauca is primarily native to New Zealand. It is found in the South Island, particularly in the eastern and southern regions. This subspecies grows in a variety of habitats, including grasslands, forest margins, and rocky areas. It is commonly associated with dry, sunny environments and is often found in the lower elevations of the country. The plant is well adapted to the local climate and soil conditions of its native range.",
    "distribution_introduced_art_desc": "Acaena sanguisorbae subsp. caesiiglauca was mainly introduced to New Zealand as an ornamental plant due to its attractive blue-green foliage and compact growth habit. It was initially cultivated for its aesthetic value in gardens and landscaped areas. However, it has since become a weed in certain regions, particularly in disturbed soils and along roadsides. Its establishment is facilitated by its ability to spread through seeds and vegetative growth. Despite its ornamental appeal, it poses challenges to native ecosystems due to its invasive potential."
}
