{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pinnatifida subsp. mansoensis",
    "plant_slug": "acaena-pinnatifida-subsp-mansoensis",
    "plant_name_scientific": "acaena pinnatifida subsp. mansoensis",
    "intro": "Acaena pinnatifida subsp. mansoensis, commonly known as the Manosense New Zealand spinach, is a perennial shrub native to New Zealand. It is characterized by its compound leaves with serrated edges and small, spiny fruits that contain edible seeds. The plant thrives in temperate climates and is often found in coastal and subalpine regions. Its growth habit includes upright stems with dense foliage, and it produces yellow flowers during the spring and summer months. The species is valued for its ornamental appeal and historical use in traditional Māori cuisine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pinnatifida subsp. mansoensis is primarily native to the western United States, particularly in California and Nevada. It is commonly found in coastal and inland regions, including areas with sandy soils and rocky outcrops. This subspecies thrives in Mediterranean climate zones characterized by dry summers and wet winters. It is often associated with chaparral and coastal sage scrub habitats. The plant is well adapted to the harsh environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acaena pinnatifida subsp. mansoensis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, spreading rapidly in natural ecosystems. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its aggressive growth has led to concerns over its impact on native flora and biodiversity."
}
