{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena exigua var. glaberrima",
    "plant_slug": "acaena-exigua-var-glaberrima",
    "plant_name_scientific": "acaena exigua var. glaberrima",
    "intro": "Acaena exigua var. glaberrima, commonly known as the hairy weed or small burr plant, is a low-growing shrub native to South America. It is characterized by its small, spiny fruits that contain seeds enclosed in a fibrous, burr-like structure. The plant typically thrives in moist, disturbed soils and is often found in coastal areas and wetlands. Its leaves are usually alternate, simple, and covered with fine hairs, contributing to its distinctive appearance. The species is known for its ability to colonize and stabilize sandy or coastal soils, making it ecologically significant in certain habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena exigua var. glaberrima is primarily native to South America, specifically Argentina and Chile. This plant is commonly found in the Andean regions, particularly in the Patagonian steppe and surrounding grasslands. It thrives in dry, open habitats with well-drained soils. The variety is characterized by its low-growing habit and spiny structures, which help it survive in harsh environmental conditions. It plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acaena exigua var. glaberrima was mainly introduced to New Zealand. It was brought there as part of the early European settlement and cultivation efforts. The plant is commonly found in disturbed areas such as roadsides and open forests. It has since become naturalized and is now considered a weed in some regions. Its distribution is limited to the northern and central parts of the country."
}
