{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena × anserinacea",
    "plant_slug": "acaena-×-anserinacea",
    "plant_name_scientific": "acaena × anserinacea",
    "intro": "Acaena × anserinacea, commonly known as the New Zealand spinach or silverweed, is a hybrid plant native to New Zealand. It is a low-growing perennial shrub that thrives in temperate climates and is often found in coastal and mountainous regions. The plant features small, silver-green leaves with a fuzzy texture and produces clusters of bright yellow flowers. Its fruit is a round, hairy achene that is adapted for wind dispersal. Acaena × anserinacea is valued for its ornamental appeal and has been introduced to other parts of the world for horticultural purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena × anserinacea is primarily native to New Zealand. It is found in the southern and central regions of the country, particularly in the South Island. This plant thrives in a variety of habitats, including grasslands, shrublands, and rocky areas. It is commonly associated with the coastal and subalpine zones. Its native range is limited to specific ecological conditions that support its growth and survival.",
    "distribution_introduced_art_desc": "Acaena × anserinacea was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and flowering. It has since become naturalized in various regions, including parts of the North Island. The plant is commonly found in disturbed areas such as roadsides, forest edges, and riverbanks. Its spread is facilitated by its ability to produce a large number of seeds that are dispersed by wind and water. However, it is considered a potential weed in some areas due to its aggressive growth habit."
}
