{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pumila var. glaberrima",
    "plant_slug": "acaena-pumila-var-glaberrima",
    "plant_name_scientific": "acaena pumila var. glaberrima",
    "intro": "Acaena pumila var. glaberrima, commonly known as the smooth burrweed, is a low-growing perennial plant native to South America. It is characterized by its dense clusters of small, spiny fruits that form burrs, which are adapted for seed dispersal by attaching to animal fur. The plant typically has soft, hairy leaves that are often mistaken for being smooth, though the variety 'glaberrima' is noted for its reduced hair compared to other varieties. It thrives in moist, shady environments and is often found in forest understories. Its botanical features make it an important component of the ecosystems it inhabits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pumila var. glaberrima is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury region. This plant typically grows in dry, open habitats such as gravelly soils and rocky areas. It is often associated with coastal and inland dunes. Its distribution is limited to specific ecological zones within New Zealand's temperate climate.",
    "distribution_introduced_art_desc": "Acaena pumila var. glaberrima was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for ornamental purposes. This variety is known for its low-growing habit and ability to thrive in a variety of soil conditions. However, it has since become naturalized and is now considered a weed in some areas of New Zealand. Its spread has raised concerns due to its potential to invade native ecosystems."
}
