{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena leptophylla",
    "plant_slug": "acaena-leptophylla",
    "plant_name_scientific": "acaena leptophylla",
    "intro": "Acaena leptophylla, commonly known as the slender-leaved burrplant, is a species of flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, spiny fruits that contain seeds. The plant typically grows in coastal and lowland areas, often in rocky or sandy soils. Its leaves are alternate and have a leathery texture with a distinctive shape. Acaena leptophylla plays a role in local ecosystems by providing food for native birds and insects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena leptophylla is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate climates, often growing in dry, open habitats such as grasslands and rocky slopes. This plant thrives in areas with well-drained soils and is adapted to the variable weather conditions of its native range. It plays an important ecological role in its environment by providing food and habitat for various local wildlife species. Its distribution is closely tied to the specific environmental conditions that support its growth and survival.",
    "distribution_introduced_art_desc": "Acaena leptophylla was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized in various regions across the country. It is commonly found in coastal and lowland areas, often growing in disturbed soils. Due to its invasive tendencies, it is considered a potential weed in some parts of New Zealand."
}
