{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena affinis",
    "plant_slug": "acaena-affinis",
    "plant_name_scientific": "acaena affinis",
    "intro": "Acaena affinis, commonly known as the New Zealand burr bush, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its woody stems and dense clusters of small, yellowish flowers. The plant produces distinctive, spiny fruits that contain seeds enclosed in a tough, leathery pericarp. It thrives in a variety of soil types but prefers well-drained conditions and is often found in coastal and inland forests. Acaena affinis plays an important ecological role, providing food and habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena affinis is primarily native to New Zealand. It is found throughout the country, particularly in the South Island. This plant thrives in a variety of habitats, including forests, shrublands, and coastal areas. It is commonly associated with the eastern and western regions of New Zealand. Acaena affinis is an important component of the local flora and plays a role in the ecosystem by providing food for native birds and insects.",
    "distribution_introduced_art_desc": "Acaena affinis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering habit. However, it has since become invasive, outcompeting native vegetation in various habitats. The plant thrives in a range of soil types and can tolerate both full sun and partial shade. Its spread has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
