{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena × tardans",
    "plant_slug": "acaena-×-tardans",
    "plant_name_scientific": "acaena × tardans",
    "intro": "Acaena × tardans, commonly known as the New Zealand thistle, is a hybrid plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its spiny, bract-like leaves and showy purple to pink flowers. The plant typically grows in coastal and subalpine regions, thriving in well-drained soils. Its fruit is a spherical, hairy achene that disperses easily by wind, aiding in its spread. Due to its invasive nature, it is considered a weed in some areas outside its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena × tardans is primarily native to New Zealand. It is found in the South Island, particularly in the central and southern regions. This plant grows in a variety of habitats, including grasslands, forest margins, and disturbed areas. It is commonly associated with the lower South Island, especially in areas with well-drained soils. Its distribution is largely limited to the natural range of its parent species, which are native to New Zealand.",
    "distribution_introduced_art_desc": "Acaena × tardans was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habit. It has since become naturalized in various regions, particularly in the lower North Island and parts of the South Island. The plant thrives in a variety of soil types but prefers well-drained conditions and full sun. Its spread has raised concerns due to its potential to invade native habitats and compete with indigenous flora. Management efforts are ongoing to control its spread and minimize its impact on local ecosystems."
}
