{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena magellanica",
    "plant_slug": "acaena-magellanica",
    "plant_name_scientific": "acaena magellanica",
    "intro": "Acaena magellanica, commonly known as the Magellanic burr, is a flowering plant native to South America. It belongs to the family Rosaceae and is characterized by its woody stems and spiny bracts. The plant produces small, yellowish flowers that are followed by distinctive, spherical fruits covered in hooked bristles. Acaena magellanica thrives in temperate climates and is often found in grasslands and shrublands. Its unique morphology makes it an important species in ecological studies and conservation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena magellanica"
    },
    "taxonomy_art_desc": "Acaena magellanica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important families such as the roses and magnolias. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other related plants. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and trees. Its genus is Acaena, a group of flowering plants commonly known as \"burnet\" or \"cudweed,\" typically found in temperate regions. Its species is Acaena magellanica, a specific plant species native to South America, characterized by its small, spiny fruits and its adaptation to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Amsterdam-St.Paul Is.",
        "Argentina Northwest",
        "Argentina South",
        "Chile Central",
        "Chile North",
        "Chile South",
        "Crozet Is.",
        "Falkland Is.",
        "Heard-McDonald Is.",
        "Kerguelen",
        "Macquarie Is.",
        "South Georgia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena magellanica is primarily native to the southern regions of South America and the subantarctic islands. It is found in Amsterdam-St. Paul Is., Argentina Northwest, Argentina South, Chile Central, Chile North, Chile South, Crozet Is., Falkland Is., Heard-McDonald Is., Kerguelen, Macquarie Is., and South Georgia. This plant thrives in temperate to cold climates with well-drained soils. It is commonly found in grasslands, coastal areas, and disturbed habitats. Its distribution reflects its adaptation to the harsh environmental conditions of these regions.",
    "distribution_introduced_art_desc": "Acaena magellanica was mainly introduced to New Zealand as part of the European colonization efforts. It was brought to the country for its ornamental value and potential as a forage plant. However, it has since become an invasive species, spreading rapidly in native ecosystems. Its introduction has led to competition with native plants and disruption of local ecological balance. Efforts are ongoing to control its spread and mitigate its impact on the environment."
}
