{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena cylindristachya var. composita",
    "plant_slug": "acaena-cylindristachya-var-composita",
    "plant_name_scientific": "acaena cylindristachya var. composita",
    "intro": "Acaena cylindristachya var. composita, commonly known as the composite acaena, is a shrub native to New Zealand. It features small, yellowish flowers arranged in dense, cylindrical clusters, which are typical of the Asteraceae family. The plant produces small, spiny fruits that contain seeds, aiding in its dispersal by animals. Its leaves are usually narrow and hairy, adapted to the moist, temperate climate of its native habitat. It is often found in forest margins and along stream banks, contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena cylindristachya var. composita is primarily native to South America, particularly in regions of Argentina and Chile. It is commonly found in temperate grasslands and shrublands, often in areas with well-drained soils. This plant thrives in open habitats and is adapted to seasonal climates with distinct wet and dry periods. It is known for its small, spiny fruits and is often part of the vegetation in coastal and inland regions. Due to its hardy nature, it is sometimes cultivated in gardens in similar climates.",
    "distribution_introduced_art_desc": "Acaena cylindristachya var. composita was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive, outcompeting native vegetation in various habitats. The plant spreads rapidly through seed dispersal, often along trails and in disturbed soils. Its introduction has led to ecological concerns, prompting management efforts to control its spread."
}
