{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sanguisorbae var. paucidens",
    "plant_slug": "acaena-sanguisorbae-var-paucidens",
    "plant_name_scientific": "acaena sanguisorbae var. paucidens",
    "intro": "Acaena sanguisorbae var. paucidens, commonly known as the sparse-stemmed bristly burr, is a low-growing perennial plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its hairy, thorny stems and clusters of small, red, berry-like fruits. The plant produces numerous short, upright stems that bear clusters of yellow flowers, which are followed by the distinctive, spiny fruits. It thrives in moist, shady environments and is often found in forest understories or along stream banks. The species is noted for its ornamental value and is sometimes cultivated for its unique appearance and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sanguisorbae var. paucidens is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This variant of the species grows in dry, open habitats such as shrublands and grasslands. It is adapted to the temperate climate and well-drained soils of these areas. The plant is part of the native flora that has evolved in isolation on the New Zealand mainland.",
    "distribution_introduced_art_desc": "Acaena sanguisorbae var. paucidens was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. However, it has since become naturalized and is now considered a potential weed in some areas. The plant is typically found in disturbed soils and along roadsides. Its spread has raised concerns due to its ability to form dense stands and compete with native vegetation."
}
