{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena magellanica subsp. grandiscapa",
    "plant_slug": "acaena-magellanica-subsp-grandiscapa",
    "plant_name_scientific": "acaena magellanica subsp. grandiscapa",
    "intro": "Acaena magellanica subsp. grandiscapa, commonly known as the Magellanic burrweed, is a flowering plant native to South America. It is characterized by its dense, spiny bracts that enclose the small, yellowish flowers. The plant produces spherical, woody fruits that are adapted for dispersal by animals. It thrives in temperate climates and is often found in grasslands and disturbed soils. Its botanical features make it an important component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena magellanica subsp. grandiscapa is primarily native to South America, specifically Chile and Argentina. It is found in the temperate regions of these countries, particularly in the southern parts. This subspecies thrives in coastal and mountainous areas with a Mediterranean climate. It is commonly associated with grasslands and shrublands, often growing in well-drained soils. Its distribution is limited to specific ecological zones where it can tolerate the local environmental conditions.",
    "distribution_introduced_art_desc": "Acaena magellanica subsp. grandiscapa was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species with ornamental and ecological value. This subspecies is often cultivated in gardens and used in landscaping due to its hardy nature and attractive foliage. It has established itself in certain regions, particularly in coastal and subalpine areas. However, its spread is limited compared to other introduced plant species in New Zealand."
}
