{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena andina",
    "plant_slug": "acaena-andina",
    "plant_name_scientific": "acaena andina",
    "intro": "Acaena andina, commonly known as the Andean burr plant, is a flowering plant native to the Andes region of South America. It belongs to the family Rosaceae and is characterized by its dense, spiny bracts that surround its small, yellowish flowers. The plant produces edible fruits that are often used in traditional Andean cuisine. Its growth habit is typically shrub-like, with hairy stems and compound leaves. Acaena andina is adapted to high-altitude environments and plays a role in local ecosystems and cultural practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena andina is primarily native to the Andean regions of South America, including countries such as Peru, Bolivia, Ecuador, and Chile. It is commonly found in high-altitude environments, typically between 2,000 and 4,000 meters above sea level. This plant thrives in temperate climates with cool, moist conditions and well-drained soils. It is often found in grasslands, shrublands, and along the edges of forests in the Andes. Acaena andina is an important component of the local ecosystem and has cultural significance to indigenous communities in the region.",
    "distribution_introduced_art_desc": "Acaena andina was mainly introduced to New Zealand as an ornamental plant due to its attractive, spiny foliage and small, colorful flowers. It was first brought there in the 19th century by European settlers who admired its unique appearance. However, it has since become invasive, spreading rapidly in native ecosystems and outcompeting indigenous plant species. Its aggressive growth and ability to thrive in a variety of soil types have made it a significant ecological concern. Despite its ornamental value, efforts are now underway to control its spread and prevent further environmental damage."
}
