{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena cadilla",
    "plant_slug": "acaena-cadilla",
    "plant_name_scientific": "acaena cadilla",
    "intro": "Acaena cadilla, commonly known as the New Zealand spinach or coastal burr, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its thorny stems and small, greenish-white flowers. The plant produces spherical, spiky fruits that contain seeds, which are adapted for dispersal by attachment to animals or clothing. Acaena cadilla thrives in coastal and sandy environments, often growing in dense mats or low shrubs. Its foliage is sometimes used in traditional Māori medicine for its purported healing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena cadilla is primarily native to South America, specifically Argentina and Chile. It is commonly found in the temperate regions of these countries. This plant thrives in dry, open habitats such as grasslands and shrublands. It is often associated with disturbed soils and can be found in coastal areas as well. Its distribution is limited to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acaena cadilla was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was commonly planted in gardens and along pathways for its decorative value. However, it has since become a problematic invasive species, spreading rapidly and outcompeting native vegetation. Its seeds are small and easily dispersed by wind, water, and animals, contributing to its widespread distribution. Efforts are now being made to control its spread and prevent further ecological damage."
}
