{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena minor",
    "plant_slug": "acaena-minor",
    "plant_name_scientific": "acaena minor",
    "intro": "Acaena minor, commonly known as New Zealand spinach, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, spiny bracts that surround its yellow flowers. The plant produces small, red berries that contain seeds, which are dispersed by animals. It thrives in temperate climates and is often found in moist, shaded environments. Acaena minor is valued for its edible leaves, which are used in traditional Māori cuisine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena minor"
    },
    "taxonomy_art_desc": "Acaena minor belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails, and is known for having vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other related species, known for their showy flowers and fruits. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of plants with diverse morphological features and economic importance. Its genus is Acaena, a group of flowering plants commonly known as \"bursaria\" or \"common burr,\" characterized by their thorny structures and small flowers. Its species is Acaena minor, a specific plant within the genus Acaena, known for its small, thorny shrubs and is native to New Zealand.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Antipodean Is.",
        "Macquarie Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena minor is primarily native to the Antipodean Islands and Macquarie Island. These islands are located in the Southern Ocean, south of New Zealand. The plant thrives in the harsh, cold environments typical of these remote locations. It is commonly found in coastal areas and rocky habitats. Its presence is an indicator of the unique ecological conditions of these islands.",
    "distribution_introduced_art_desc": "Acaena minor was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It was later found to be invasive, spreading rapidly in native ecosystems and outcompeting indigenous plant species. The plant thrives in a variety of soil types and is particularly persistent in disturbed areas. Its introduction has led to significant ecological impacts, prompting management efforts to control its spread. Despite its ornamental value, Acaena minor is now considered a noxious weed in many regions of New Zealand."
}
