{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena anserinifolia",
    "plant_slug": "acaena-anserinifolia",
    "plant_name_scientific": "acaena anserinifolia",
    "intro": "Acaena anserinifolia, commonly known as the silverleaf spinachroot, is a perennial shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its silver-gray foliage and small, clustered flowers. The plant produces burrs with hooked bracts, which aid in seed dispersal by attaching to animal fur. Its leaves are edible and have been used traditionally by Māori for their nutritional value. The plant thrives in coastal and subalpine environments, often growing in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena anserinifolia"
    },
    "taxonomy_art_desc": "Acaena anserinifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Rosales, a group of flowering plants that includes many familiar plants such as roses and strawberries. Its family is Rosaceae, known for its showy flowers and fruit types like drupes and achenes. Its genus is Acaena, a group of flowering plants commonly known as New Zealand burr bushes, characterized by their spiny fruits. Its species is Acaena anserinifolia, a specific plant within the genus Acaena, known for its distinctive features and native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Chatham Is.",
        "New Zealand North",
        "New Zealand South"
    ],
    "distribution_introduced": [
        "Antipodean Is.",
        "Great Britain",
        "Ireland"
    ],
    "distribution_native_art_desc": "Acaena anserinifolia is primarily native to the Chatham Islands, New Zealand North, and New Zealand South. This species is found in various habitats across these regions, including coastal areas and rocky terrain. It is commonly associated with coastal vegetation and can thrive in sandy or gravelly soils. The plant is well adapted to the temperate climate and maritime conditions of these islands. Its distribution is largely restricted to these specific geographic locations.",
    "distribution_introduced_art_desc": "Acaena anserinifolia was mainly introduced to Antipodean Is., Great Britain, and Ireland. It is a species of flowering plant native to South America, specifically Chile and Argentina. The introduction of this plant to these regions is likely due to its ornamental value and potential for erosion control. However, it has been reported as an invasive species in some areas, posing a threat to native flora. Its spread has raised concerns among conservationists due to its competitive nature and ability to thrive in disturbed habitats."
}
