{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena asthenoglochin",
    "plant_slug": "acaena-asthenoglochin",
    "plant_name_scientific": "acaena asthenoglochin",
    "intro": "Acaena asthenoglochin, commonly known as the slender burr plant, is a species of flowering plant in the family Rosaceae. It is native to New Zealand and is characterized by its small, spiny fruits that contain seeds. The plant typically grows in coastal and subalpine environments, where it thrives in well-drained soils. Its foliage consists of alternate, simple leaves with a hairy texture. Acaena asthenoglochin plays a role in local ecosystems by providing food for various insect and bird species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena asthenoglochin is primarily native to New Zealand. It is found in the South Island, particularly in the mountainous regions of the Southern Alps. This plant typically grows in open, sunny habitats such as grasslands and rocky slopes. It is well adapted to the cool, temperate climate of its native range. Acaena asthenoglochin is commonly found in areas with well-drained soils and is part of the native flora of New Zealand's alpine ecosystems.",
    "distribution_introduced_art_desc": "Acaena asthenoglochin was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species valued for their ornamental qualities. The plant is commonly found in gardens and on disturbed sites, where it can form dense mats. Due to its ability to thrive in a variety of soil types, it has become a common weed in some areas. However, it is not considered a major invasive species in New Zealand."
}
