{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena platyacantha",
    "plant_slug": "acaena-platyacantha",
    "plant_name_scientific": "acaena platyacantha",
    "intro": "Acaena platyacantha, commonly known as the broad-leaved spinifex, is a perennial shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, mat-forming growth habit. The plant features small, oval leaves with a hairy texture and produces clusters of yellow flowers in spring. Its fruit is a dry, hairy capsule that contains several seeds, which are dispersed by wind. Acaena platyacantha is adapted to dry, sandy soils and is often found in coastal and inland dunes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena platyacantha"
    },
    "taxonomy_art_desc": "Acaena platyacantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other plants with showy flowers and often thorny stems. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and herbs with a wide range of flower types and fruit forms. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, known for their small, thorny plants and edible fruits. Its species is Acaena platyacantha, a specific plant within the genus Acaena, characterized by its flat, thorny stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Argentina South",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena platyacantha is primarily native to Argentina Northwest, Argentina South, and Chile South. This plant is commonly found in the temperate regions of these areas. It thrives in dry, open habitats such as grasslands and shrublands. The species is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in its native ecosystems.",
    "distribution_introduced_art_desc": "Acaena platyacantha was mainly introduced to New Zealand as an ornamental plant due to its attractive yellow flowers and compact growth habit. It has since become naturalized in various regions, particularly in coastal and lowland areas where it thrives in well-drained soils. The plant spreads through its seeds, which are dispersed by birds and can remain viable in the soil for several years. Its establishment has led to competition with native vegetation, raising concerns about its impact on local ecosystems. Despite its aesthetic appeal, management efforts are ongoing to control its spread and mitigate its ecological effects."
}
