{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena juvenca",
    "plant_slug": "acaena-juvenca",
    "plant_name_scientific": "acaena juvenca",
    "intro": "Acaena juvenca, commonly known as the New Zealand burr bush, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, thorny growth habit. The plant produces small, yellow flowers that bloom in spring, followed by bright red berries in autumn. Its leaves are alternate, ovate, and covered in fine hairs. Acaena juvenca is adapted to a variety of soil types and is often found in coastal and subalpine regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena juvenca"
    },
    "taxonomy_art_desc": "Acaena juvenca belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes green algae and land plants, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other economically significant species. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and trees with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as \"New Zealand burrs,\" characterized by their spiny fruits and often used in horticulture. Its species is Acaena juvenca, a specific type within the Acaena genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena juvenca is primarily native to New Zealand North. It is found in the northern regions of New Zealand, including the North Island and parts of the South Island. This plant typically grows in coastal areas and lowland habitats. It is commonly associated with sandy or gravelly soils in these regions. Acaena juvenca is part of the native flora that contributes to the ecological diversity of New Zealand's northern ecosystems.",
    "distribution_introduced_art_desc": "Acaena juvenca was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized in various regions of the country. It is commonly found in disturbed soils and along roadsides. However, it is not considered invasive and has limited ecological impact."
}
