{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena × ovina",
    "plant_slug": "acaena-×-ovina",
    "plant_name_scientific": "acaena × ovina",
    "intro": "Acaena × ovina, commonly known as New Zealand spinach, is a hybrid plant originating from the cross between Acaena crassipes and Acaena hastata. It is a low-growing, mat-forming shrub characterized by its dense, prickly foliage and bright yellow flowers. The plant produces small, edible berries that are often consumed by birds and other wildlife. It thrives in temperate climates and is often found in coastal and subalpine regions of New Zealand. Due to its hardy nature, it is sometimes considered an invasive species in certain areas outside its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena × ovina"
    },
    "taxonomy_art_desc": "Acaena × ovina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other economically significant plants. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of plants with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as \"Burr bushes\" or \"Cotoneaster,\" characterized by their spiny fruits. Its species is Acaena × ovina, a hybrid plant resulting from the cross between two Acaena species, known for its distinctive spiny fruits and adaptability to various environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "South Australia",
        "Tasmania",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [
        "New Zealand North",
        "New Zealand South"
    ],
    "distribution_native_art_desc": "Acaena × ovina is primarily native to New South Wales, Queensland, South Australia, Tasmania, Victoria, and Western Australia. This plant is commonly found in a variety of habitats within these regions, including coastal areas, grasslands, and heathlands. It is well adapted to the temperate and Mediterranean climates of these states. The species is often seen in disturbed soils and can thrive in both full sun and partial shade. Its distribution reflects its ability to tolerate a range of environmental conditions across southern Australia.",
    "distribution_introduced_art_desc": "Acaena × ovina was mainly introduced to New Zealand North and New Zealand South. It is a hybrid plant resulting from the cross between Acaena novae-zelandiae and Acaena hastata. This species has been widely cultivated for its ornamental value and is commonly found in gardens and landscaped areas. Its introduction has led to its establishment in various habitats across both regions. However, it is considered a potential weed in some areas due to its aggressive growth habit."
}
