{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pumila",
    "plant_slug": "acaena-pumila",
    "plant_name_scientific": "acaena pumila",
    "intro": "Acaena pumila, commonly known as the common burrweed, is a low-growing perennial plant native to South America. It is characterized by its dense, mat-forming growth habit and small, spiny fruits that contain seeds. The plant produces yellow flowers throughout the summer, which are followed by the distinctive, hooked bracts that aid in seed dispersal. Acaena pumila thrives in a variety of soil types but prefers well-drained conditions. It is often found in disturbed areas, along roadsides, and in grasslands.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena pumila"
    },
    "taxonomy_art_desc": "Acaena pumila belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other economically significant plants. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and herbs. Its genus is Acaena, a group of flowering plants commonly known as \"New Zealand burr bushes,\" characterized by their spiny fruits. Its species is Acaena pumila, a specific type of Acaena plant known for its small, spiny fruits and is native to New Zealand.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile South",
        "Falkland Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pumila is primarily native to Argentina South, Chile South, and Falkland Islands. This species is commonly found in coastal and grassland habitats across these regions. It thrives in temperate climates with well-drained soils. The plant is well adapted to the harsh environmental conditions of its native range. It plays an important ecological role in stabilizing soil and providing food for local wildlife.",
    "distribution_introduced_art_desc": "Acaena pumila was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species of flowering plants. The introduction of Acaena pumila has had significant ecological impacts, particularly in areas where it has become invasive. It is often found in disturbed soils and can outcompete native vegetation. Due to its aggressive growth, it is considered a weed in many regions of New Zealand."
}
