{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena hirsutula",
    "plant_slug": "acaena-hirsutula",
    "plant_name_scientific": "acaena hirsutula",
    "intro": "Acaena hirsutula, commonly known as the hairy acaena, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, spiny foliage and showy yellow flowers. The plant produces small, spherical fruits that are often covered in hooked bracts, aiding in seed dispersal by attaching to animals. It thrives in a variety of habitats, including rocky soils and coastal areas, and is often found in native New Zealand gardens. Acaena hirsutula is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena hirsutula"
    },
    "taxonomy_art_desc": "Acaena hirsutula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Rosales, a group of flowering plants that includes the rose family and is known for its diverse morphological features. Its family is Rosaceae, commonly known as the rose family, which includes plants such as roses, apples, and strawberries. Its genus is Acaena, a group of flowering plants commonly known as \"devil's cress\" and typically found in temperate regions. Its species is Acaena hirsutula, a specific plant within the genus Acaena that is characterized by its hairy appearance and is native to certain regions of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena hirsutula is primarily native to New Zealand South. It is found in the southern regions of New Zealand, including the South Island. This plant typically grows in coastal and lowland areas, often in sandy or gravelly soils. It is part of the bramble family and is known for its spiny stems and small, urn-shaped flowers. Acaena hirsutula plays an important ecological role in its native habitat, providing food and shelter for various native wildlife species.",
    "distribution_introduced_art_desc": "Acaena hirsutula was mainly introduced to New Zealand. It was brought there as part of the early European settlement and has since become naturalized in various regions. The plant thrives in disturbed soils and is commonly found in coastal areas and on farmland. It is considered an invasive species in some parts of New Zealand due to its ability to spread rapidly. Its distribution is now widespread across the country, particularly in the North Island."
}
