{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena microphylla var. pallideolivacea",
    "plant_slug": "acaena-microphylla-var-pallideolivacea",
    "plant_name_scientific": "acaena microphylla var. pallideolivacea",
    "intro": "Acaena microphylla var. pallideolivacea, commonly known as the pale olive acacia, is a shrub native to New Zealand. It features small, rounded leaves that are typically pale olive in color, giving it its common name. The plant produces yellow flowers that bloom in spring, followed by small, spiny fruits. It is adapted to grow in a variety of soil types but prefers well-drained conditions. This species is often found in coastal and subalpine regions, contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena microphylla"
    },
    "taxonomy_art_desc": "Acaena microphylla var. pallideolivacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other economically significant plants. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and trees with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as \"burnet\" or \"mouse-ear,\" characterized by their small, spiny fruits. Its species is Acaena microphylla, a specific variety within the genus Acaena, known for its small, dark green leaves and distinctive fruit structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena microphylla var. pallideolivacea is primarily native to New Zealand South. This variety is found in the southern regions of New Zealand, particularly in the South Island. It typically grows in coastal and subantarctic environments. The plant is adapted to the cool, temperate climate of these areas. It is commonly found in rocky soils and on coastal cliffs.",
    "distribution_introduced_art_desc": "Acaena microphylla var. pallideolivacea was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering. However, it has since become invasive, spreading rapidly in native ecosystems. The plant competes with indigenous species for resources, leading to ecological concerns. Its distribution is now widespread across various regions of New Zealand."
}
