{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena exigua",
    "plant_slug": "acaena-exigua",
    "plant_name_scientific": "acaena exigua",
    "intro": "Acaena exigua, commonly known as the small burr bush, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, spiny fruits that contain seeds. The plant typically grows in coastal and lowland areas, thriving in well-drained soils. Its leaves are alternate and have a serrated edge, while its flowers are small and white or pink in color. Acaena exigua plays a role in local ecosystems by providing food for native birds and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena exigua"
    },
    "taxonomy_art_desc": "Acaena exigua belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Rosales, a group of flowering plants that includes the rose family and is known for its diverse ecological roles. Its family is Rosaceae, commonly known as the rose family, which includes plants such as roses, apples, and strawberries. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, often referred to as \"burning bush\" due to their bright red fruits. Its species is Acaena exigua, a specific type of plant within the Acaena genus known for its small, spiny fruits and its adaptation to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena exigua is primarily native to New Zealand. It is found in various regions across the country, including the North and South Islands. This plant typically grows in open habitats such as grasslands, shrublands, and coastal areas. It is well adapted to the temperate climate and diverse soils of New Zealand. Acaena exigua plays an important role in the local ecosystem, providing food and habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acaena exigua was mainly introduced to New Zealand. It is considered an invasive species in several regions of the country. The plant was originally from South America, specifically Chile and Argentina. It has spread rapidly in disturbed habitats such as roadsides and forest edges. Its aggressive growth and ability to form dense mats have led to concerns over its impact on native ecosystems."
}
