{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena anserinifolia subsp. pusilla",
    "plant_slug": "acaena-anserinifolia-subsp-pusilla",
    "plant_name_scientific": "acaena anserinifolia subsp. pusilla",
    "intro": "Acaena anserinifolia subsp. pusilla, commonly known as the small silverweed, is a low-growing herbaceous plant native to southern South America. It is characterized by its dense, mat-forming growth habit and hairy, silver-gray foliage. The plant produces small, yellowish flowers that are clustered in spherical heads, typical of the Asteraceae family. Its fruits are burrs with hooked bracts, which aid in seed dispersal by attaching to animals. This subspecies is adapted to dry, sunny environments and is often found in grasslands and disturbed soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena anserinifolia"
    },
    "taxonomy_art_desc": "Acaena anserinifolia subsp. pusilla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse lineages, such as magnolias and laurels. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other economically important species. Its family is Rosaceae, known as the rose family, which includes a wide variety of plants with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as \"mouse-ear\" or \"burr\" plants, characterized by their spiny fruits. Its species is Acaena anserinifolia, a specific plant within the genus Acaena, distinguished by its distinctive leaf and fruit structures, with the subspecies pusilla being a smaller variant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [
        "Great Britain",
        "Ireland"
    ],
    "distribution_native_art_desc": "Acaena anserinifolia subsp. pusilla is primarily native to New Zealand South. This subspecies is found in the southern regions of New Zealand, particularly in the South Island. It typically grows in coastal and subalpine environments. The plant is adapted to the cooler and more temperate climates of these areas. It is commonly found in rocky and sandy soils along the coastline.",
    "distribution_introduced_art_desc": "Acaena anserinifolia subsp. pusilla was mainly introduced to Great Britain and Ireland. It was likely introduced as an ornamental plant due to its attractive foliage and growth habit. The species has since become naturalized in these regions, often found in disturbed soils and along coastal areas. Its establishment has raised concerns due to its potential to become invasive in certain habitats. Despite its ornamental value, management efforts are ongoing to control its spread."
}
