{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena torilicarpa subvar. parvifolia",
    "plant_slug": "acaena-torilicarpa-subvar-parvifolia",
    "plant_name_scientific": "acaena torilicarpa subvar. parvifolia",
    "intro": "Acaena torilicarpa subvar. parvifolia, commonly known as the small-leaved New Zealand spinach, is a low-growing shrub native to New Zealand. It features small, ovate to elliptical leaves that are typically hairy and have a serrated margin. The plant produces yellow flowers that are clustered in dense, spherical inflorescences, which are characteristic of the genus Acaena. Its fruits are small, dry achenes surrounded by a woolly bract, typical of the family Rosaceae. This subvariety is often found in coastal and inland areas, thriving in well-drained soils and full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena torilicarpa subvar. parvifolia is primarily native to New Zealand, specifically the South Island. It is commonly found in the lower South Island, including regions such as Canterbury and Otago. This subshrub thrives in dry, rocky habitats and is often associated with open vegetation types like scrub and grasslands. It is well adapted to the temperate and semi-arid climates of its native range. The plant plays an important ecological role in its native environment, providing habitat and food for local fauna.",
    "distribution_introduced_art_desc": "Acaena torilicarpa subvar. parvifolia was mainly introduced to New Zealand. It was brought there as part of the early European settlement and has since become naturalized in various regions. The plant thrives in temperate climates and is commonly found in disturbed soils and open vegetation. It is considered a potential weed in some areas due to its ability to spread rapidly. However, it is also valued for its ornamental qualities and ecological role in stabilizing soil."
}
