{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena multifida var. minor",
    "plant_slug": "acaena-multifida-var-minor",
    "plant_name_scientific": "acaena multifida var. minor",
    "intro": "Acaena multifida var. minor, commonly known as the lesser New Zealand spinach, is a low-growing shrub native to New Zealand. It features dense clusters of small, spiny leaves that are often covered in fine hairs. The plant produces yellow flowers that bloom in spring, followed by spherical, berry-like fruits that contain numerous seeds. It thrives in moist, well-drained soils and is often found in coastal and subalpine environments. Due to its hardy nature, it is sometimes cultivated as a decorative plant or for its potential medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena multifida var. minor is primarily native to New Zealand. It is found in the northern and central regions of the country, including the North Island and parts of the South Island. This plant typically grows in coastal and subalpine areas, often in rocky or sandy soils. It is commonly associated with open vegetation types such as grasslands and shrublands. Its distribution is limited to specific ecological niches within New Zealand's diverse landscape.",
    "distribution_introduced_art_desc": "Acaena multifida var. minor was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native vegetation in various habitats. Its spread is particularly rapid in disturbed areas and along stream banks. This plant poses a significant threat to local ecosystems and is now considered a noxious weed in many regions of New Zealand."
}
