{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena californica var. remotiflorens",
    "plant_slug": "acaena-californica-var-remotiflorens",
    "plant_name_scientific": "acaena californica var. remotiflorens",
    "intro": "Acaena californica var. remotiflorens, commonly known as the California burclover, is a perennial herb native to coastal regions of California. It features slender, erect stems with alternate, trifoliate leaves that are hairy and often covered in fine, white pubescence. The plant produces small, yellowish-white flowers in dense, spherical heads, which are surrounded by bracts. Its fruits are dry, indehiscent achenes enclosed in a persistent, spiny pappus, aiding in wind dispersal. This species thrives in sandy or gravelly soils and is often found in coastal scrub and dunes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena californica var. remotiflorens is primarily native to coastal regions of central and southern California, including the Santa Barbara and San Luis Obispo counties. This variety thrives in sandy soils along the coastline and in dunes, often found in areas with mild, temperate climates. It is commonly associated with maritime chaparral and coastal scrub habitats. The plant is well adapted to the harsh conditions of the coastal environment, including salt spray and strong winds. Its distribution is limited to specific ecological niches within the California coast.",
    "distribution_introduced_art_desc": "Acaena californica var. remotiflorens was mainly introduced to stabilize soil and prevent erosion in disturbed areas. It is commonly used in restoration projects due to its ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, including its bright yellow flowers and persistent seed heads. However, it can become invasive in certain regions if not managed properly. Its distribution is primarily limited to coastal and inland areas with well-drained soils."
}
