{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena eupatoria",
    "plant_slug": "acaena-eupatoria",
    "plant_name_scientific": "acaena eupatoria",
    "intro": "Acaena eupatoria, commonly known as the New Zealand spinach or the mountain spinach, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, spiny fruits that contain edible seeds. The plant typically grows in alpine and subalpine regions, thriving in cool, moist environments. Its leaves are edible and have a slightly spinach-like flavor, making it a traditional food source for Māori. The plant's unique morphology and ecological role make it an important species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena eupatoria"
    },
    "taxonomy_art_desc": "Acaena eupatoria belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other plants with a characteristic floral morphology. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs, trees, and herbs with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as \"burs\" or \"cushion plants,\" characterized by their spiny fruits and often used in horticulture. Its species is Acaena eupatoria, a specific type of cushion plant native to New Zealand, known for its dense growth habit and ability to thrive in harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena eupatoria is primarily native to Argentina Northeast, Brazil South, Brazil Southeast, and Uruguay. This plant is commonly found in grasslands and open habitats within these regions. It thrives in temperate climates with well-drained soils. The species is adapted to the environmental conditions of South America's southern regions. Its native range reflects its ecological preferences and historical distribution across these areas.",
    "distribution_introduced_art_desc": "Acaena eupatoria was mainly introduced to New Zealand. It was brought there as part of the European flora introduced during the colonial period. The plant has since become naturalized and is now found in various habitats across the country. It is considered a weed in some areas due to its ability to spread rapidly. However, it also plays a role in stabilizing soils and providing habitat for native wildlife."
}
