{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena triglochin",
    "plant_slug": "acaena-triglochin",
    "plant_name_scientific": "acaena triglochin",
    "intro": "Acaena triglochin, commonly known as the New Zealand burr bush, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, spiny foliage and small, yellowish flowers. The plant produces spherical, prickly fruits that contain seeds, which are dispersed by animals. Acaena triglochin thrives in moist, well-drained soils and is often found in coastal and subalpine regions. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena triglochin is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the southern part of Chile. This plant thrives in coastal and mountainous areas, often growing in sandy or rocky soils. It is adapted to the mild climate and seasonal rainfall patterns of its native habitat. Acaena triglochin is an important component of the local flora and plays a role in the ecological balance of its environment.",
    "distribution_introduced_art_desc": "Acaena triglochin was mainly introduced to New Zealand as a decorative plant due to its attractive, spiny fruits and its ability to thrive in a variety of soil conditions. It was likely brought there during the 19th century by European settlers who were interested in ornamental gardening. However, it has since become a problematic invasive species, outcompeting native plants and altering local ecosystems. Its rapid spread has led to its classification as a noxious weed in several regions of New Zealand. Efforts to control its distribution have been challenging due to its hardy nature and ability to reproduce prolifically."
}
