{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena adenocarpa var. undiquearmata",
    "plant_slug": "acaena-adenocarpa-var-undiquearmata",
    "plant_name_scientific": "acaena adenocarpa var. undiquearmata",
    "intro": "Acaena adenocarpa var. undiquearmata, commonly known as the New Zealand spinach bush, is a shrub native to New Zealand. It is characterized by its dense, spiny foliage and small, bright yellow flowers that appear in clusters. The plant produces berries that are typically red or orange when mature, containing seeds that are dispersed by animals. It thrives in a variety of soil types but prefers well-drained conditions and full sun. This species is often used in horticulture for its ornamental value and ability to stabilize soil in erosion-prone areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena adenocarpa var. undiquearmata is primarily native to New Zealand. It is found in the northern and central regions of the country, particularly in the North Island and parts of the South Island. This plant typically grows in coastal and lowland areas, often in sandy or gravelly soils. It is commonly associated with open vegetation such as coastal scrub and dunes. The variety is well adapted to the temperate climate and maritime conditions of New Zealand.",
    "distribution_introduced_art_desc": "Acaena adenocarpa var. undiquearmata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and compact growth habit. However, it has since become an invasive species, spreading rapidly in native ecosystems. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its aggressive growth has led to the displacement of native vegetation, prompting efforts to control its spread."
}
