{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena poterioides",
    "plant_slug": "acaena-poterioides",
    "plant_name_scientific": "acaena poterioides",
    "intro": "Acaena poterioides, commonly known as the New Zealand bramble, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its prickly stems and small, yellowish flowers. The plant produces small, dark reddish-brown berries that are edible but have a tart flavor. It thrives in a variety of soil types and is often found in coastal and mountainous regions. Acaena poterioides plays an important role in the local ecosystem by providing food for birds and other wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena poterioides is primarily native to New Zealand. It is found throughout the country, particularly in the northern and central regions. This plant thrives in a variety of habitats, including forests, shrublands, and coastal areas. It is commonly associated with the lower North Island and parts of the South Island. Acaena poterioides is an important component of New Zealand's native flora and is often found in association with other indigenous plant species.",
    "distribution_introduced_art_desc": "Acaena poterioides was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and flowering habit. It has since become naturalized in various regions, particularly in coastal and subalpine areas. The plant spreads through its seeds, which are dispersed by birds and can germinate in disturbed soils. Its introduction has led to concerns about its potential to become invasive in certain ecosystems. However, it is not currently classified as a noxious weed in New Zealand."
}
