{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena tenera",
    "plant_slug": "acaena-tenera",
    "plant_name_scientific": "acaena tenera",
    "intro": "Acaena tenera, commonly known as New Zealand burr or mountain burr, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its woody stems and persistent, bristly foliage. The plant produces small, yellow flowers that bloom in spring, followed by distinctive, spiny fruits that contain seeds. Acaena tenera thrives in moist, cool environments and is often found in forested areas or along stream banks. Its unique morphology and ecological role make it an important component of New Zealand's native flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena tenera"
    },
    "taxonomy_art_desc": "Acaena tenera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other related species. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and herbs. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, often referred to as \"burs\" due to their prickly fruits. Its species is Acaena tenera, a specific plant within the Acaena genus known for its hairy stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena tenera is primarily native to Argentina South and Chile South. This plant is commonly found in the temperate regions of these countries. It thrives in grasslands and shrublands, often in areas with well-drained soils. The species is well adapted to the climate and environmental conditions of southern South America. Its distribution reflects its natural habitat preferences in this region.",
    "distribution_introduced_art_desc": "Acaena tenera was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century. The plant was initially cultivated for its ornamental value due to its attractive yellow flowers. However, it has since become invasive, spreading rapidly in native ecosystems. Its introduction has led to concerns about its impact on local biodiversity and land management."
}
