{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena decumbens",
    "plant_slug": "acaena-decumbens",
    "plant_name_scientific": "acaena decumbens",
    "intro": "Acaena decumbens, commonly known as the prostrate New Zealand spinach, is a low-growing shrub native to New Zealand. It features small, spiny leaves and produces yellow flowers that develop into spherical, dry fruits containing seeds. The plant is characterized by its prostrate growth habit, with stems that lie close to the ground. It thrives in temperate climates and is often found in coastal and subalpine regions. Acaena decumbens is valued for its ornamental appeal and historical use by Māori for food and traditional practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena decumbens is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the southern part of Chile. This plant typically grows in dry, open habitats such as grasslands, shrublands, and rocky areas. It is well adapted to the climate and soil conditions of its native range. Acaena decumbens is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acaena decumbens was mainly introduced to New Zealand. It was brought there as part of the early European settlement and has since become naturalized in various regions. The plant thrives in disturbed soils and can be found in grasslands, roadsides, and agricultural areas. It is considered a weed in some parts of New Zealand due to its ability to spread rapidly. Its distribution is now widespread across the country, particularly in the North Island."
}
