{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena lucida var. abbreviata",
    "plant_slug": "acaena-lucida-var-abbreviata",
    "plant_name_scientific": "acaena lucida var. abbreviata",
    "intro": "Acaena lucida var. abbreviata, commonly known as the small-flowered spinulose nettle, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny foliage and small, yellowish-white flowers that appear in clusters. The plant produces small, round, hard seeds enclosed in a prickly burr, which aid in seed dispersal by attaching to animals. It thrives in coastal and subalpine environments, often growing in rocky or sandy soils. The species is notable for its ecological role in supporting native insect populations and its resilience to harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena lucida var. abbreviata is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This plant typically grows in dry, open habitats such as shrublands and rocky areas. It is commonly associated with limestone soils and is often found in coastal and inland areas. The species is known for its small, spiny fruits and is part of the bramble family.",
    "distribution_introduced_art_desc": "Acaena lucida var. abbreviata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and compact growth habit. However, it has since become invasive, outcompeting native species in various habitats. The plant thrives in a range of soil types and can tolerate both full sun and partial shade. Its rapid spread has raised concerns among conservationists due to its impact on local ecosystems."
}
