{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena adscendens subsp. georgiae-australis",
    "plant_slug": "acaena-adscendens-subsp-georgiae-australis",
    "plant_name_scientific": "acaena adscendens subsp. georgiae-australis",
    "intro": "Acaena adscendens subsp. georgiae-australis, commonly known as the New Zealand spinach bush, is a low-growing shrub native to New Zealand. It features small, spiny leaves and produces bright yellow flowers that bloom in spring. The plant is characterized by its dense, mat-forming growth habit and is often found in coastal and subalpine regions. Its fruits are small, hairy achenes that are dispersed by wind. This subspecies is valued for its ornamental appeal and resilience in harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena adscendens subsp. georgiae-australis is primarily native to southern Australia, specifically the states of South Australia and Victoria. This subspecies is commonly found in dry, open habitats such as grasslands, woodlands, and heathlands. It thrives in regions with a Mediterranean climate, characterized by hot, dry summers and cool, wet winters. The plant is often associated with sandy or loamy soils and is well adapted to the variable rainfall patterns of its native range. Its distribution is limited to specific areas within these states, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acaena adscendens subsp. georgiae-australis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The species has since become naturalized in certain regions, particularly in the North Island. It is commonly found in coastal and subcoastal areas, often growing in disturbed soils. However, it is not considered invasive and has a limited ecological impact."
}
