{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena hirsutula var. glabricupula",
    "plant_slug": "acaena-hirsutula-var-glabricupula",
    "plant_name_scientific": "acaena hirsutula var. glabricupula",
    "intro": "Acaena hirsutula var. glabricupula, commonly known as the smooth cupule acaena, is a low-growing shrub native to New Zealand. It is characterized by its dense, mat-forming growth habit and small, spiny leaves. The plant produces yellow flowers followed by distinctive, cup-shaped fruits that enclose the seeds. Its foliage is generally hairy, though the variety glabricupula has reduced hair on the cupules. It thrives in moist, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena hirsutula"
    },
    "taxonomy_art_desc": "Acaena hirsutula var. glabricupula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other related species. Its family is Rosaceae, commonly known as the rose family, which includes a variety of shrubs and trees with showy flowers and fruit types such as berries. Its genus is Acaena, a group of flowering plants commonly known as \"New Zealand burrs,\" characterized by their spiny fruits and often found in temperate regions. Its species is Acaena hirsutula, a specific type within the genus Acaena, distinguished by its hairy appearance and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena hirsutula var. glabricupula is primarily native to New Zealand South. This variant is found in the southern regions of New Zealand, including the South Island. It typically grows in coastal and lowland areas, often in dry, sandy soils. The plant is part of the bramble family and is adapted to the temperate climate of the region. Its distribution is limited to specific habitats in the southern part of the country.",
    "distribution_introduced_art_desc": "Acaena hirsutula var. glabricupula was mainly introduced to New Zealand. It was brought there as part of the early European settlement and has since become naturalized in various regions. This plant is often found in disturbed soils and open habitats, such as roadsides and forest edges. Its introduction has led to concerns about its potential impact on native ecosystems. However, it is not currently classified as an invasive species in New Zealand."
}
