{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena argentea var. interruptepinnata",
    "plant_slug": "acaena-argentea-var-interruptepinnata",
    "plant_name_scientific": "acaena argentea var. interruptepinnata",
    "intro": "Acaena argentea var. interruptepinnata, commonly known as the silverweed with interrupted pinnate leaves, is a low-growing shrub native to New Zealand. It features silver-gray leaves that are deeply divided into a pinnate pattern, though the leaflets are interrupted, giving it a distinctive appearance. The plant produces small, fluffy, yellowish flowers that bloom in spring, followed by spherical, berry-like fruits. It thrives in moist, shaded environments and is often found in forest understories. Its leaves and fruits are sometimes used in traditional Māori medicine for their purported healing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena argentea var. interruptepinnata is primarily native to New Zealand. It is found in the South Island, particularly in the regions of Canterbury and Otago. This plant typically grows in open, sunny habitats such as grasslands, shrublands, and along coastal areas. It is commonly associated with disturbed soils and can thrive in both coastal and inland environments. Its distribution is limited to specific ecological zones within New Zealand.",
    "distribution_introduced_art_desc": "Acaena argentea var. interruptepinnata was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, likely for ornamental purposes due to its attractive silver foliage. The plant has since become naturalized in certain regions, particularly in the North Island. It is commonly found in disturbed areas such as roadsides and forest margins. However, it is not considered invasive and has minimal impact on native ecosystems."
}
