{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena masafuerana",
    "plant_slug": "acaena-masafuerana",
    "plant_name_scientific": "acaena masafuerana",
    "intro": "Acaena masafuerana, commonly known as the Chilean burr bush, is a shrub native to southern Chile and Argentina. It belongs to the family Rosaceae and is characterized by its dense, thorny growth habit. The plant produces small, yellowish flowers that bloom in spring, followed by distinctive spiny fruits. Its leaves are alternate, simple, and often have a hairy texture. Acaena masafuerana is adapted to coastal and dry environments, making it a hardy species in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena masafuerana"
    },
    "taxonomy_art_desc": "Acaena masafuerana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their complex flower structures and diverse morphological features. Its order is Rosales, which includes a wide range of flowering plants, many of which are economically important for their fruits and ornamental value. Its family is Rosaceae, commonly known as the rose family, which includes plants such as roses, strawberries, and raspberries. Its genus is Acaena, a group of flowering plants commonly known as \"bursaria\" or \"panicled everlet,\" characterized by their small, spiny fruits. Its species is Acaena masafuerana, a specific type of plant within the Acaena genus, native to certain regions and distinguished by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Juan Fernández Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena masafuerana is primarily native to the Juan Fernández Islands. This species is found in the archipelago, which is located in the southern Pacific Ocean off the coast of Chile. It grows in the native vegetation of these islands, typically in coastal areas and shrublands. The plant is adapted to the unique environmental conditions of the Juan Fernández Is. It plays a role in the local ecosystem and is part of the biodiversity found in this remote region.",
    "distribution_introduced_art_desc": "Acaena masafuerana was mainly introduced to New Zealand. It was brought there as part of the introduction of other plants for agricultural or ornamental purposes. The plant has since become naturalized in certain regions of the country. It is commonly found in coastal and lowland areas, often in disturbed soils. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
