{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sericea var. sericella",
    "plant_slug": "acaena-sericea-var-sericella",
    "plant_name_scientific": "acaena sericea var. sericella",
    "intro": "Acaena sericea var. sericella, commonly known as silverweed, is a perennial herb native to temperate regions of the Northern Hemisphere. It is characterized by its densely hairy, silver-gray foliage that gives it its common name. The plant produces small, yellow flowers arranged in clusters, followed by burr-like fruits that aid in seed dispersal. It thrives in moist, well-drained soils and is often found in meadows, streambanks, and woodland edges. Its botanical features make it an important component of native plant communities and a subject of ecological study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sericea var. sericella is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate and subpolar climates, often in moist, shaded environments such as forests and shrublands. This variety thrives in areas with cool, humid conditions and is often associated with native vegetation in these regions. It is a member of the Rosaceae family and is known for its small, hairy leaves and bright red berries. The plant plays an important ecological role in its native habitat, supporting local wildlife and contributing to soil stability.",
    "distribution_introduced_art_desc": "Acaena sericea var. sericella was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive silver foliage and compact growth habit. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in disturbed soils and can spread rapidly in coastal and lowland environments. Its introduction has led to management efforts to control its spread and protect local ecosystems."
}
