{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena echinata var. subglabricalyx",
    "plant_slug": "acaena-echinata-var-subglabricalyx",
    "plant_name_scientific": "acaena echinata var. subglabricalyx",
    "intro": "Acaena echinata var. subglabricalyx, commonly known as the smooth-fruited burr bush, is a low-growing shrub native to New Zealand. It features compound leaves with spiny margins and produces small, red, edible berries that are often consumed by birds. The plant has a mat-forming growth habit, with stems that root at the nodes, allowing it to spread vegetatively. Its flowers are inconspicuous, consisting of five sepals and no petals, and it relies on wind pollination. The species is adapted to a variety of soil types and is often found in coastal and forested areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena echinata var. subglabricalyx is primarily native to South America, specifically Chile and Argentina. This plant is commonly found in temperate regions, particularly in the southern part of these countries. It thrives in dry, open habitats such as grasslands and shrublands. The species is adapted to withstand harsh environmental conditions, including strong winds and low precipitation. Its distribution is closely associated with the Andes mountain range, where it grows in rocky and coastal areas.",
    "distribution_introduced_art_desc": "Acaena echinata var. subglabricalyx was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century. The plant was likely introduced as an ornamental species due to its attractive, thorny foliage. However, it has since become naturalized and is now considered a weed in some areas. Its spread has raised concerns due to its potential to invade native ecosystems."
}
