{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena leptacantha var. brachyacantha",
    "plant_slug": "acaena-leptacantha-var-brachyacantha",
    "plant_name_scientific": "acaena leptacantha var. brachyacantha",
    "intro": "Acaena leptacantha var. brachyacantha, commonly known as the short-stemmed common burr, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny fruiting structures that contain seeds enclosed in a fibrous, woody capsule. The plant produces small, yellowish flowers that are pollinated by insects, followed by the development of the distinctive burrs. It thrives in a variety of soil types but prefers well-drained conditions and full sun. This species is often found in coastal and inland areas, contributing to the ecological diversity of its habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena leptacantha var. brachyacantha is primarily native to New Zealand. It is found in the North and South Islands, particularly in the lower elevations of the South Island. This plant thrives in rocky and sandy soils, often growing in coastal and inland areas. It is commonly found in scrublands and open forests. Its distribution is limited to specific regions within New Zealand, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acaena leptacantha var. brachyacantha was mainly introduced to New Zealand. It was brought there as part of the early European settlement and has since become naturalized in various regions. This plant is commonly found in coastal and inland areas, particularly in disturbed soils and along roadsides. It has a creeping growth habit and produces small, spiny fruits that are adapted for animal dispersal. Due to its invasive potential, it is now considered a weed in some parts of New Zealand."
}
