{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena ovalifolia subsp. chamaephyllon",
    "plant_slug": "acaena-ovalifolia-subsp-chamaephyllon",
    "plant_name_scientific": "acaena ovalifolia subsp. chamaephyllon",
    "intro": "Acaena ovalifolia subsp. chamaephyllon, commonly known as the dwarf nettle tree, is a shrub native to South America, particularly found in regions of Chile and Argentina. It is characterized by its dense, thorny growth habit and small, elliptical leaves that are often covered in fine hairs. The plant produces yellowish-green flowers that are clustered in heads, followed by small, spherical fruits that are typically reddish or black when mature. It thrives in temperate climates and is adapted to well-drained soils, often growing in coastal or mountainous areas. Due to its hardy nature and ornamental value, it is occasionally cultivated in gardens, though it can be invasive in certain environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena ovalifolia subsp. chamaephyllon is primarily native to southern South America, specifically Chile and Argentina. It is commonly found in temperate regions with a Mediterranean climate. This subspecies thrives in open, sunny habitats such as grasslands and coastal areas. It is well adapted to withstand seasonal droughts and cold temperatures. Its distribution is limited to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acaena ovalifolia subsp. chamaephyllon was mainly introduced to New Zealand. It was brought there as part of the European colonization efforts. The plant was likely introduced intentionally for ornamental purposes or as a potential agricultural crop. However, it has since become naturalized and is now considered a weed in some regions. Its spread has raised concerns due to its ability to outcompete native vegetation."
}
