{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena microphylla var. inermis",
    "plant_slug": "acaena-microphylla-var-inermis",
    "plant_name_scientific": "acaena microphylla var. inermis",
    "intro": "Acaena microphylla var. inermis, commonly known as the silverweed, is a low-growing perennial plant native to New Zealand. It features dense clusters of small, silver-gray leaves that are covered in fine hairs, giving it a distinctive appearance. The plant produces bright yellow flowers in early spring, which are followed by spiny, berry-like fruits that contain seeds. It thrives in moist, well-drained soils and is often found in coastal and subalpine regions. Its unique morphology and ecological role make it an important species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena microphylla var. inermis is primarily native to New Zealand. It is found throughout the North and South Islands, particularly in coastal and lowland areas. This plant thrives in a variety of soil types but prefers well-drained conditions. It is commonly found in open habitats such as grasslands, shrublands, and along coastal dunes. The variety is known for its small, spiny fruits and is an important component of New Zealand's native flora.",
    "distribution_introduced_art_desc": "Acaena microphylla var. inermis was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century as part of the introduction of exotic plant species. This plant has since become naturalized and is now found in various habitats across the country. It is commonly found in disturbed areas, such as roadsides and forest margins. However, it is considered a potential weed in some regions due to its ability to spread rapidly."
}
