{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena petiolulata",
    "plant_slug": "acaena-petiolulata",
    "plant_name_scientific": "acaena petiolulata",
    "intro": "Acaena petiolulata, commonly known as the small-leaf burrplant, is a low-growing shrub native to New Zealand. It is characterized by its dense, mat-forming growth habit and is often found in coastal and subalpine environments. The plant produces small, prickly fruits that contain seeds surrounded by a hairy, spiny husk. Its leaves are typically narrow and have a distinctive, serrated edge. Acaena petiolulata plays an important ecological role in stabilizing soil and providing habitat for native invertebrates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena petiolulata is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the Andes mountain range. This plant thrives in high-altitude environments, often growing in rocky or grassy slopes. It is adapted to the cool, dry conditions typical of its native habitat. Acaena petiolulata is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acaena petiolulata was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species native to South America. The plant was likely introduced for ornamental purposes due to its distinctive appearance. However, it has since become a problematic invasive species in certain regions of New Zealand. Its spread has raised concerns due to its ability to outcompete native vegetation and alter local ecosystems."
}
