{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena aculeata",
    "plant_slug": "acaena-aculeata",
    "plant_name_scientific": "acaena aculeata",
    "intro": "Acaena aculeata, commonly known as New Zealand thistle, is a flowering plant native to New Zealand. It is a low-growing shrub that produces small, spiny fruits known as achenes. The plant has dark green, hairy leaves and produces purple or pink flowers during the spring and summer months. It thrives in a variety of habitats, including grasslands and forest edges. Acaena aculeata is often considered a weed in agricultural areas due to its aggressive growth and persistent seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena aculeata is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate and subantarctic areas, growing in grasslands, shrublands, and coastal environments. This plant thrives in well-drained soils and is often associated with open habitats. It is also present in parts of New Zealand, where it has been introduced and naturalized. Acaena aculeata is known for its spiny fruits and is an important component of the local flora in its native range.",
    "distribution_introduced_art_desc": "Acaena aculeata was mainly introduced to New Zealand as an ornamental plant due to its attractive yellow flowers and thorny structure. It was later found to be invasive, spreading rapidly in native ecosystems and outcompeting indigenous vegetation. The plant thrives in a variety of soil types and is particularly persistent in disturbed areas such as roadsides and forest margins. Its introduction has led to significant ecological impacts, including reduced biodiversity and altered habitat structures. Management efforts are ongoing to control its spread and mitigate its effects on local flora and fauna."
}
