{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena macrocephala var. negeri",
    "plant_slug": "acaena-macrocephala-var-negeri",
    "plant_name_scientific": "acaena macrocephala var. negeri",
    "intro": "Acaena macrocephala var. negeri, commonly known as the New Zealand thistle, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny foliage and produces spherical, reddish-brown flower heads that bloom in spring. The plant has small, white to pale yellow flowers arranged in tight clusters, and its stems are often covered in short, stiff hairs. It thrives in a variety of soil types but prefers well-drained conditions and full sun. This species is known for its ecological importance, providing nectar for native pollinators and habitat for various invertebrates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena macrocephala var. negeri is primarily native to the temperate regions of South America, particularly in Chile and Argentina. This plant thrives in coastal and subcoastal areas, often found in sandy or gravelly soils. It is commonly associated with open habitats such as dunes, grasslands, and disturbed sites. The species is well adapted to maritime climates with cool, moist conditions. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acaena macrocephala var. negeri was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for ornamental purposes. This variety is commonly found in gardens and along roadsides in the country. It has since become naturalized in certain regions, particularly in the North Island. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
