{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena buchananii var. buchananii",
    "plant_slug": "acaena-buchananii-var-buchananii",
    "plant_name_scientific": "acaena buchananii var. buchananii",
    "intro": "Acaena buchananii var. buchananii, commonly known as the New Zealand thistle, is a perennial shrub native to New Zealand. It features dense clusters of spiny, yellow flowers that bloom in spring, followed by bright red or orange berries. The plant has woody stems and hairy leaves, which are adapted to the cool, temperate climate of its native habitat. It is often found in coastal and subalpine regions, where it thrives in well-drained soils. Due to its invasive potential, it is sometimes considered a weed in areas outside its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena buchananii"
    },
    "taxonomy_art_desc": "Acaena buchananii var. buchananii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Rosales, a group of flowering plants that includes many economically important species such as roses, apples, and strawberries. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and trees with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as \"mouse beans,\" characterized by their spiny fruits and often used in horticulture. Its species is Acaena buchananii, a specific variety within the genus Acaena, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena buchananii var. buchananii is primarily native to New Zealand South. It is found in the southern regions of New Zealand, including the South Island. This plant typically grows in rocky and coastal areas, often in dry and sunny environments. It is adapted to the unique ecological conditions of these regions. Its distribution is limited to specific habitats within New Zealand's southern ecosystems.",
    "distribution_introduced_art_desc": "Acaena buchananii var. buchananii was mainly introduced to New Zealand. It was brought there during the 19th century as part of the European flora introduced for ornamental purposes. This plant has since become naturalized and is now found in various habitats across the country. It is commonly found in coastal areas, dry hills, and disturbed sites. However, it is considered a potential weed in some regions due to its ability to spread rapidly."
}
