{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena elongata var. villosula",
    "plant_slug": "acaena-elongata-var-villosula",
    "plant_name_scientific": "acaena elongata var. villosula",
    "intro": "Acaena elongata var. villosula, commonly known as the hairy spinulose burr, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny foliage and produces small, red berries that are an important food source for native birds. The plant has a woody stem with a rough, hairy texture, and its leaves are alternate, simple, and often covered in fine hairs. It thrives in coastal and subalpine environments, often growing in rocky or sandy soils. The species is notable for its ability to form dense thickets, which can play a role in soil stabilization and habitat provision.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena elongata var. villosula is primarily native to New Zealand. It is found throughout the mainland, including the North and South Islands. This plant is commonly associated with coastal and inland areas, particularly in the lower North Island and parts of the South Island. It thrives in a variety of habitats, including grasslands, scrublands, and rocky outcrops. Its distribution is largely limited to the temperate regions of New Zealand.",
    "distribution_introduced_art_desc": "Acaena elongata var. villosula was mainly introduced to New Zealand. It was brought there as a ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native species in various ecosystems. The plant thrives in disturbed areas and can spread rapidly through seed dispersal by birds. Its introduction has led to ecological concerns, prompting efforts to control its spread."
}
