{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena montevidensis",
    "plant_slug": "acaena-montevidensis",
    "plant_name_scientific": "acaena montevidensis",
    "intro": "Acaena montevidensis, commonly known as the Chilean burrweed, is a flowering plant native to South America, particularly Chile and Argentina. It belongs to the family Rosaceae and is characterized by its small, spiny fruits that contain seeds. The plant typically grows in coastal areas and is adapted to sandy or gravelly soils. Its foliage consists of alternate, simple leaves with a rough, hairy texture. Acaena montevidensis is often found in disturbed habitats and is known for its ability to thrive in harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena montevidensis is primarily native to South America, specifically Argentina, Chile, and Uruguay. It is commonly found in temperate regions, particularly in the southern part of the continent. This plant thrives in grasslands, shrublands, and coastal areas where the climate is relatively mild. It is well adapted to the local soil conditions and can tolerate a range of environmental stresses. Its distribution is closely linked to the natural vegetation patterns of these regions.",
    "distribution_introduced_art_desc": "Acaena montevidensis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first brought there in the late 19th century by European settlers who were interested in cultivating exotic plants. Despite its initial appeal, the plant has since become invasive in some areas, outcompeting native species and altering local ecosystems. Its spread has been facilitated by its ability to thrive in a variety of soil types and its production of small, persistent seeds. Conservation efforts are now underway to control its spread and protect native biodiversity."
}
