{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena cylindristachya subvar. pusilla",
    "plant_slug": "acaena-cylindristachya-subvar-pusilla",
    "plant_name_scientific": "acaena cylindristachya subvar. pusilla",
    "intro": "Acaena cylindristachya subvar. pusilla, commonly known as the dwarf strawberry burr, is a low-growing perennial plant native to New Zealand. It features dense, mat-forming growth with small, dark green leaves that are covered in fine hairs. The plant produces small, yellowish flowers that bloom in spring, followed by bright red, berry-like fruits that are edible but have a gritty texture. Its unique morphology and habitat preferences make it an important component of its native ecosystems. It is often found in moist, shaded areas such as forest floors and rocky habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena cylindristachya subvar. pusilla is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This subvariety grows in rocky and gravelly soils, often in open habitats such as hillsides and dry valleys. It is commonly associated with the tussock grasslands and shrublands of the region. The plant is adapted to the temperate climate and can tolerate both drought and frost.",
    "distribution_introduced_art_desc": "Acaena cylindristachya subvar. pusilla was mainly introduced to New Zealand. It was brought there as part of the ornamental plant trade due to its attractive small yellow flowers and compact growth habit. This subshrub has since become naturalized in various regions, particularly in the northern and central parts of the country. It thrives in a range of soil types but prefers well-drained conditions and full sun. However, it is considered a potential weed in some areas due to its ability to spread through seed dispersal."
}
