{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena macrostemon subsp. longiplumosa",
    "plant_slug": "acaena-macrostemon-subsp-longiplumosa",
    "plant_name_scientific": "acaena macrostemon subsp. longiplumosa",
    "intro": "Acaena macrostemon subsp. longiplumosa, commonly known as the long-fruited spinulose burr, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, spiny growth habit. The plant produces small, red or orange fruits that are often covered in hooked bracts, aiding in seed dispersal by attaching to animals. Its leaves are typically alternate and have a rough, hairy texture. It thrives in a variety of habitats, including forests and shrublands, and is often found in coastal and subalpine regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena macrostemon subsp. longiplumosa is primarily native to New Zealand. It is found in the northern and central regions of the country, including the North Island and parts of the South Island. This subspecies typically grows in coastal and subcoastal areas, often in sandy or gravelly soils. It is commonly associated with shrublands and coastal dunes. The plant is well adapted to the temperate climate and salt-laden winds of its native habitat.",
    "distribution_introduced_art_desc": "Acaena macrostemon subsp. longiplumosa was mainly introduced to New Zealand. It was brought there intentionally for ornamental purposes due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in a variety of soil types and is particularly persistent in disturbed habitats. Its spread has raised concerns among conservationists due to its potential impact on local ecosystems."
}
