{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sanguisorbae var. viridissima",
    "plant_slug": "acaena-sanguisorbae-var-viridissima",
    "plant_name_scientific": "acaena sanguisorbae var. viridissima",
    "intro": "Acaena sanguisorbae var. viridissima, commonly known as the green-stemmed acacia, is a variant of the acacia plant native to South America. It is characterized by its dark green, slender stems and small, clustered yellow flowers that bloom in late spring. The plant produces tiny, spiny fruits that contain seeds, which are dispersed by wind. It thrives in well-drained soils and full sun, making it suitable for rock gardens or as a decorative plant in arid landscapes. Due to its unique appearance and hardy nature, it is often cultivated for ornamental purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sanguisorbae var. viridissima is primarily native to New Zealand. It is found in the South Island, particularly in the mountainous regions of the central and southern parts. This variety grows in rocky and alpine environments, often on exposed ridges and scree slopes. It is commonly associated with tussock grasslands and is well adapted to the harsh climatic conditions of its native habitat. The plant is part of the Rubiaceae family and is known for its distinctive green foliage and small, spiky fruits.",
    "distribution_introduced_art_desc": "Acaena sanguisorbae var. viridissima was mainly introduced to control erosion and as an ornamental plant in gardens and landscapes. It is commonly found in disturbed soils and along roadsides due to its ability to thrive in poor soil conditions. This variety is known for its dense growth habit and bright green foliage, making it a popular choice for ground cover. However, it can become invasive in certain regions, outcompeting native vegetation. Its introduction has led to ecological concerns in some areas where it spreads beyond cultivated sites."
}
