{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena novae-zelandiae",
    "plant_slug": "acaena-novae-zelandiae",
    "plant_name_scientific": "acaena novae-zelandiae",
    "intro": "Acaena novae-zelandiae, commonly known as New Zealand burr or bracken burr, is a flowering plant native to New Zealand. It is a member of the rose family (Rosaceae) and is characterized by its spiny, woody fruits that contain seeds. The plant typically grows in forest understories and is adapted to the temperate climate of its native habitat. Its foliage consists of compound leaves with serrated edges, and it produces small, white to pinkish flowers. Acaena novae-zelandiae plays a role in the local ecosystem by providing food for birds and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena novae-zelandiae"
    },
    "taxonomy_art_desc": "Acaena novae-zelandiae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Rosales, a group of flowering plants that includes well-known families such as Rosaceae, characterized by their simple flowers and often showy petals. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of plants such as roses, apples, and strawberries, all sharing similar floral and fruit structures. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, commonly known as \"burs\" due to their prickly, seed-bearing structures. Its species is Acaena novae-zelandiae, a specific type of plant found in New Zealand, characterized by its shrub-like growth and unique seed structures adapted for dispersal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Antipodean Is.",
        "Chatham Is.",
        "New Guinea",
        "New South Wales",
        "New Zealand North",
        "New Zealand South",
        "Queensland",
        "South Australia",
        "Tasmania",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [
        "California",
        "Great Britain",
        "Ireland",
        "Oregon"
    ],
    "distribution_native_art_desc": "Acaena novae-zelandiae is primarily native to the Antipodean Is., Chatham Is., New Guinea, New South Wales, New Zealand North, New Zealand South, Queensland, South Australia, Tasmania, Victoria, and Western Australia. This plant is commonly found in a variety of habitats, including grasslands, shrublands, and coastal areas. It thrives in temperate climates and is often associated with well-drained soils. The species is known for its distinctive yellow flowers and prickly fruits. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native regions.",
    "distribution_introduced_art_desc": "Acaena novae-zelandiae was mainly introduced to California, Great Britain, Ireland, and Oregon. It was likely brought to these regions as an ornamental plant due to its unique appearance. However, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its spread has raised concerns among conservationists in regions where it has established itself."
}
