{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sanguisorbae var. robusta",
    "plant_slug": "acaena-sanguisorbae-var-robusta",
    "plant_name_scientific": "acaena sanguisorbae var. robusta",
    "intro": "Acaena sanguisorbae var. robusta, commonly known as the robust brackenweed, is a perennial herbaceous plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its upright growth habit and compound leaves. The plant produces small, greenish-white flowers that are clustered in dense inflorescences, typically appearing in spring. Its fruit is a bur-like structure with hooked bracts, which aid in seed dispersal by attaching to animal fur or clothing. This species is often found in open, sunny habitats such as grasslands and forest margins.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sanguisorbae var. robusta is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This plant typically grows in dry, open habitats such as scrublands and rocky areas. It is well adapted to the temperate climate and seasonal rainfall patterns of these regions. The variety is known for its distinctive spiny fruits and is part of the Rubiaceae family.",
    "distribution_introduced_art_desc": "Acaena sanguisorbae var. robusta was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species with similar ecological characteristics. The plant is considered an invasive species in some regions of New Zealand due to its rapid growth and ability to outcompete native vegetation. It thrives in disturbed soils and can form dense stands, altering local ecosystems. Efforts to control its spread have been ongoing, as it poses a threat to biodiversity in certain habitats."
}
