{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena californica var. polyarthrotricha",
    "plant_slug": "acaena-californica-var-polyarthrotricha",
    "plant_name_scientific": "acaena californica var. polyarthrotricha",
    "intro": "Acaena californica var. polyarthrotricha, commonly known as the California burrweed, is a flowering plant native to the western United States. It is a low-growing perennial shrub characterized by its hairy stems and small, clustered leaves. The plant produces bright yellow flowers that bloom in the spring, followed by distinctive burrs containing seeds. Its fruiting structures are adapted for dispersal by attaching to animal fur or clothing. This species is often found in dry, disturbed soils and is part of the Rosaceae family.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena californica var. polyarthrotricha is primarily native to the western United States, particularly California. It is found in coastal and inland areas, including the Santa Monica Mountains and the San Francisco Bay region. This variant thrives in sandy soils and is commonly associated with coastal scrub and chaparral habitats. It is also present in parts of Oregon and Washington, where it grows in similar environmental conditions. The plant is well adapted to the Mediterranean climate of these regions, characterized by dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Acaena californica var. polyarthrotricha was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in restoration projects due to its ability to thrive in poor soils and withstand harsh environmental conditions. This plant is often found in coastal and inland regions with sandy or gravelly soils. Its introduction has led to its establishment in several areas beyond its native range. However, it is considered a potential weed in some regions due to its aggressive growth habit."
}
