{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena eupatoria var. glomerulans",
    "plant_slug": "acaena-eupatoria-var-glomerulans",
    "plant_name_scientific": "acaena eupatoria var. glomerulans",
    "intro": "Acaena eupatoria var. glomerulans, commonly known as the clustered burr plant, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny clusters of fruits that form in the axils of the leaves. The plant produces small, yellowish flowers that bloom in spring, followed by the development of the distinctive, woody, barbed burrs. It thrives in a variety of soil types but prefers well-drained conditions and full sun. This species is often found in coastal and subalpine habitats, where it plays a role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena eupatoria var. glomerulans is primarily native to New Zealand. It is found throughout the North and South Islands, particularly in coastal and lowland areas. This variety is commonly associated with sandy or gravelly soils in coastal dunes and scrublands. It is part of the New Zealand flora and is adapted to the temperate maritime climate of the region. The plant is also known for its distinctive spiny structures and is often found in coastal vegetation communities.",
    "distribution_introduced_art_desc": "Acaena eupatoria var. glomerulans was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized in various habitats, including coastal areas and disturbed soils. It is considered a weed in some regions due to its aggressive growth and ability to form dense stands. However, it also plays a role in stabilizing soils and providing habitat for native insects."
}
