{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena anserinifolia var. antarctica",
    "plant_slug": "acaena-anserinifolia-var-antarctica",
    "plant_name_scientific": "acaena anserinifolia var. antarctica",
    "intro": "Acaena anserinifolia var. antarctica, commonly known as the Antarctic hairgrass, is a low-growing perennial plant native to the Southern Hemisphere. It is characterized by its dense, mat-forming growth habit and its ability to thrive in harsh, alpine or subantarctic environments. The plant features small, dark green leaves that are covered in fine, silky hairs, giving it a distinctive appearance. Its flowers are inconspicuous, producing small, greenish-yellow blooms that are followed by spiny, burr-like fruits. This species plays an important ecological role in stabilizing soil in its native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena anserinifolia var. antarctica is primarily native to the subantarctic islands of the Southern Ocean, including the South Orkney Islands, South Shetland Islands, and the Antarctic Peninsula. This plant thrives in the harsh, cold environments of these regions, where it is adapted to strong winds and low temperatures. It is commonly found in coastal areas and on rocky slopes, often growing in sparse vegetation communities. The variety is well-suited to the nutrient-poor soils typical of these remote locations. Its distribution is limited to the southernmost parts of the world, where it plays a role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acaena anserinifolia var. antarctica was mainly introduced to New Zealand. It was brought there for its ornamental value and its ability to thrive in various soil conditions. The plant is commonly found in coastal areas and open habitats. It has become naturalized in some regions, posing a potential threat to native vegetation. Due to its invasive potential, it is now monitored in certain areas to prevent its spread."
}
