{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena rorida",
    "plant_slug": "acaena-rorida",
    "plant_name_scientific": "acaena rorida",
    "intro": "Acaena rorida, commonly known as the silver weed, is a low-growing shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, mat-forming growth habit. The plant produces small, yellow flowers that bloom in spring, followed by bright red, berry-like fruits. Its leaves are alternate, simple, and covered in fine, silvery hairs, giving it a distinctive appearance. Acaena rorida is adapted to a variety of soil types and is often found in coastal and alpine regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena rorida"
    },
    "taxonomy_art_desc": "Acaena rorida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Rosales, which is a group of flowering plants that includes roses, strawberries, and other related species. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of plants such as apples, cherries, and roses. Its genus is Acaena, a group of flowering plants commonly known as \"burs\" or \"mouse-ear,\" which are typically shrubs or herbs. Its species is Acaena rorida, a specific type of plant within the Acaena genus, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena rorida is primarily native to New Zealand North. It is commonly found in the northern regions of New Zealand, including the North Island. This plant thrives in a variety of habitats, such as forests, shrublands, and coastal areas. It is often associated with areas that have a temperate climate and well-drained soils. Acaena rorida plays an important role in the local ecosystem, providing food and habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acaena rorida was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and flowering. It was also used in horticulture for its ability to thrive in a variety of soil conditions. However, it has since become invasive, outcompeting native vegetation in certain areas. Its spread is particularly rapid in disturbed soils and along riverbanks. Efforts are ongoing to control its distribution and prevent further ecological impact."
}
