{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena anserinifolia var. microphylla",
    "plant_slug": "acaena-anserinifolia-var-microphylla",
    "plant_name_scientific": "acaena anserinifolia var. microphylla",
    "intro": "Acaena anserinifolia var. microphylla, commonly known as the small-leaved New Zealand spinach, is a low-growing perennial plant native to New Zealand. It features finely divided, feathery leaves that are often covered in a dense layer of soft, white hairs. The plant produces small, yellowish flowers that develop into spherical, spiky fruits containing numerous seeds. It thrives in moist, well-drained soils and is often found in forest margins and wetlands. Its unique morphology and ecological role make it an important species in New Zealand's native flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena anserinifolia var. microphylla is primarily native to New Zealand. It is found in the South Island, particularly in the central and southern regions. This plant typically grows in coastal and subantarctic environments. It thrives in sandy or gravelly soils and is often found in open vegetation types. The variety is characterized by its small, narrow leaves and is adapted to the harsh conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acaena anserinifolia var. microphylla was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century as part of the broader introduction of ornamental and agricultural plants. This variety is known for its dense growth and ability to thrive in a variety of soil conditions. It has since become naturalized in several regions of New Zealand, often found in coastal and disturbed areas. However, it is not considered invasive and does not pose significant ecological threats in its introduced range."
}
