{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena antarctica",
    "plant_slug": "acaena-antarctica",
    "plant_name_scientific": "acaena antarctica",
    "intro": "Acaena antarctica, commonly known as the Antarctic hairweed, is a flowering plant native to the southern regions of South America and the Antarctic Peninsula. It is a low-growing perennial shrub that thrives in harsh, cold environments. The plant produces small, spiny fruits that contain seeds, which are adapted for dispersal by wind and animals. Its leaves are typically covered in fine, hairy structures that help reduce water loss in arid conditions. Acaena antarctica plays a vital role in stabilizing soil and providing habitat for local wildlife in its native ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena antarctica"
    },
    "taxonomy_art_desc": "Acaena antarctica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other plants with showy flowers and often thorny stems. Its family is Rosaceae, commonly known as the rose family, which includes a wide range of shrubs and trees with typically five-petaled flowers. Its genus is Acaena, a group of flowering plants commonly known as \"burnet bushes,\" characterized by their bristly appearance and small flowers. Its species is Acaena antarctica, a flowering plant native to Antarctica, known for its hardy nature and ability to thrive in extreme environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile Central",
        "Chile South",
        "Falkland Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena antarctica is primarily native to Argentina South, Chile Central, Chile South, and Falkland Islands. This plant is commonly found in temperate and subantarctic regions of these areas. It thrives in coastal and inland habitats, often in grasslands and shrublands. The species is well adapted to the cold and dry conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acaena antarctica was mainly introduced to New Zealand. It was brought there as part of the European colonization efforts. The plant was likely introduced for its ornamental value or as a potential forage crop. However, it has since become invasive in certain areas, outcompeting native species. Its spread highlights the ecological impacts of non-native plant introductions."
}
