{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena tridactyla",
    "plant_slug": "acaena-tridactyla",
    "plant_name_scientific": "acaena tridactyla",
    "intro": "Acaena tridactyla, commonly known as the New Zealand thistle, is a perennial shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its spiny, woody stems and small, clustered flowers. The plant produces bright yellow flowers that bloom in spring, followed by small, dry fruits called achenes. Its leaves are typically trifoliate, with three leaflets, and the plant is often found in dry, open habitats. Acaena tridactyla is also known for its ability to thrive in harsh environments, making it an important component of New Zealand's native flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena tridactyla is primarily native to South America, specifically found in regions of Chile and Argentina. It thrives in temperate climates and is commonly found in grasslands and shrublands. This plant is well adapted to dry and semi-arid environments. It plays an important ecological role in its native habitat by providing food and shelter for various wildlife species. Its distribution is largely confined to the southern parts of South America.",
    "distribution_introduced_art_desc": "Acaena tridactyla was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized and is now found in various habitats across the country. It is commonly associated with disturbed sites and can form dense stands in grasslands and shrublands. However, it is not considered invasive and has limited ecological impact in New Zealand."
}
