{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena fuscescens",
    "plant_slug": "acaena-fuscescens",
    "plant_name_scientific": "acaena fuscescens",
    "intro": "Acaena fuscescens, commonly known as the blackberry lichen, is a species of flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, clustered growth habit. The plant produces tiny, red or black fruits that are edible and often used in traditional Māori cuisine. It thrives in moist, shaded environments, typically found in forest understories. Acaena fuscescens plays an important ecological role by providing food for various native birds and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena fuscescens"
    },
    "taxonomy_art_desc": "Acaena fuscescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes vascular plants with a distinct life cycle and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other economically significant plants. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and herbs. Its genus is Acaena, a group of flowering plants commonly known as \"burs\" due to their thistle-like appearance. Its species is Acaena fuscescens, a specific type of plant within the Acaena genus, characterized by its shrub-like growth and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil South",
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena fuscescens is primarily native to Brazil South and Brazil Southeast. This plant is commonly found in the southern and southeastern regions of Brazil. It thrives in a variety of habitats within these areas, including grasslands and shrublands. The species is well adapted to the climate and soil conditions of these regions. Its native range is limited to these specific areas in Brazil.",
    "distribution_introduced_art_desc": "Acaena fuscescens was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized and is now found in various habitats across the country. It is considered an invasive species in some regions due to its ability to spread rapidly. Its distribution is largely restricted to the northern and central parts of New Zealand."
}
