{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pinnatifida var. aconcaguensis",
    "plant_slug": "acaena-pinnatifida-var-aconcaguensis",
    "plant_name_scientific": "acaena pinnatifida var. aconcaguensis",
    "intro": "Acaena pinnatifida var. aconcaguensis, commonly known as the Aconcagua burr plant, is a species native to South America, particularly Chile and Argentina. It is a low-growing shrub characterized by its dense, spiny foliage and small, bright yellow flowers that bloom in spring. The plant produces spherical, woody fruits that contain seeds, which are dispersed by animals and wind. Its thick, hairy leaves are adapted to withstand harsh, dry conditions, making it a resilient plant in arid environments. This species is often used in landscaping for its ornamental value and ability to thrive in poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pinnatifida var. aconcaguensis is primarily native to the coastal regions of southern Chile, specifically within the Valdivian temperate rainforest ecosystem. This variety is found in areas characterized by high rainfall, mild temperatures, and nutrient-rich soils. It thrives in shaded understory environments and is commonly associated with native forests and shrublands. The plant is well adapted to the humid climate and is often found in association with other endemic species of the region. Its distribution is limited to specific microhabitats within its native range.",
    "distribution_introduced_art_desc": "Acaena pinnatifida var. aconcaguensis was mainly introduced to New Zealand. It was brought there during the 19th century as part of the European colonization effort. This plant is now considered an invasive species in many parts of New Zealand. It spreads rapidly and competes with native vegetation, altering local ecosystems. Efforts are ongoing to control its spread and protect native flora."
}
