{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena deserticola",
    "plant_slug": "acaena-deserticola",
    "plant_name_scientific": "acaena deserticola",
    "intro": "Acaena deserticola, commonly known as the desert knapweed, is a low-growing perennial shrub native to arid and semi-arid regions of Australia. It has small, hairy leaves and produces clusters of yellow flowers that bloom in spring. The plant is adapted to survive in harsh, dry conditions with minimal water requirements. Its fruit is a burr-like structure that aids in seed dispersal by attaching to animals or clothing. Acaena deserticola plays a role in stabilizing sandy soils and providing habitat for small wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena deserticola is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often growing in association with other drought-tolerant shrubs and grasses. This plant thrives in environments with low rainfall and high temperatures, adapting to the harsh conditions of its native habitat. Its distribution is largely restricted to the Namib Desert and surrounding areas, where it plays a role in stabilizing soil and providing habitat for small fauna. Acaena deserticola is an important component of the local flora, contributing to the ecological balance of its native ecosystems.",
    "distribution_introduced_art_desc": "Acaena deserticola was mainly introduced to control erosion and stabilize soil in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in harsh environmental conditions. The plant is well adapted to low-nutrient soils and can tolerate drought and high temperatures. It has been introduced in several countries in Africa, the Middle East, and parts of Australia. However, its invasive potential has raised concerns in some regions where it may outcompete native vegetation."
}
