{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena patagonica",
    "plant_slug": "acaena-patagonica",
    "plant_name_scientific": "acaena patagonica",
    "intro": "Acaena patagonica, commonly known as the Patagonian burr bush, is a flowering plant native to South America. It belongs to the family Rosaceae and is characterized by its woody stems and spiny, bristly fruit capsules. The plant produces small white or pink flowers that are typically visited by insects for pollination. Its leaves are alternate, simple, and often have a hairy texture. Acaena patagonica is adapted to harsh environments, thriving in dry, rocky soils and coastal areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena patagonica"
    },
    "taxonomy_art_desc": "Acaena patagonica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other related plants. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and trees. Its genus is Acaena, a group of flowering plants commonly known as \"burnet\" or \"mouse-ear,\" typically found in temperate regions. Its species is Acaena patagonica, a specific plant within the Acaena genus native to South America, characterized by its small, spiny fruits and herbaceous growth habit.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena patagonica is primarily native to Argentina South and Chile South. It is commonly found in the southern regions of these countries, particularly in the Patagonian area. This plant thrives in temperate climates with well-drained soils. It is often seen in grasslands and shrublands, contributing to the local biodiversity. Its distribution is closely linked to the unique environmental conditions of the southern Andes.",
    "distribution_introduced_art_desc": "Acaena patagonica was mainly introduced to New Zealand. It was brought there as part of the broader introduction of Chilean flora during the 19th century. The plant was likely introduced through horticultural exchanges or accidental transport with other plant species. It has since become naturalized in several regions of New Zealand, particularly in the North Island. However, it is not considered invasive and has not caused significant ecological disruption."
}
