{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena confertissima",
    "plant_slug": "acaena-confertissima",
    "plant_name_scientific": "acaena confertissima",
    "intro": "Acaena confertissima, commonly known as the New Zealand burr bush, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its woody shrub form with dense, spiny foliage. The plant produces small, yellowish flowers that are followed by bright red, spherical fruits containing seeds enclosed in a tough, spiky husk. Its fruits are known for their persistent, prickly appearance and are often used in traditional Māori practices. Acaena confertissima is adapted to a wide range of soil types and is commonly found in coastal and inland areas of New Zealand.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena confertissima"
    },
    "taxonomy_art_desc": "Acaena confertissima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and apples. Its order is Rosales, a group of flowering plants known for their diverse morphology and ecological significance. Its family is Rosaceae, commonly known as the rose family, which includes shrubs, trees, and herbs with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as \"thimbleweed,\" characterized by their small, spiny fruits. Its species is Acaena confertissima, a specific type of thimbleweed native to New Zealand, known for its dense, spiny growth and small, red berries.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena confertissima is primarily native to Argentina South. This plant is found in the southern regions of Argentina, particularly in the Patagonian steppe and surrounding areas. It thrives in dry, open habitats with well-drained soils. Acaena confertissima is commonly found in grasslands and shrublands at low to moderate elevations. Its distribution is largely restricted to the southern part of the country, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acaena confertissima was mainly introduced to New Zealand. It was brought there as a decorative plant due to its attractive, spiny foliage and small, showy flowers. However, it has since become an invasive species, outcompeting native vegetation in certain areas. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its rapid growth and ability to spread through seeds have made it a challenge for land managers in controlling its spread."
}
