{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena adscendens var. glabriscapa",
    "plant_slug": "acaena-adscendens-var-glabriscapa",
    "plant_name_scientific": "acaena adscendens var. glabriscapa",
    "intro": "Acaena adscendens var. glabriscapa, commonly known as the silky burr or slender spinifex, is a low-growing shrub native to New Zealand. It features dense, mat-forming growth with woody stems that are often covered in fine, silky hairs. The plant produces small, spiny fruits that are adapted for animal dispersal, and its leaves are narrow and often have a bluish-green hue. It thrives in coastal and sandy environments, tolerating salt spray and poor soil conditions. This species is valued for its erosion control capabilities and ecological role in stabilizing coastal dunes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena adscendens var. glabriscapa is primarily native to the southern Andes of South America, including parts of Chile and Argentina. This species is typically found in high-altitude grasslands and shrublands, often in regions with a temperate to cold climate. It thrives in well-drained soils and is commonly associated with mountainous terrain. The plant is adapted to harsh environmental conditions, including strong winds and limited nutrients. Its distribution is limited to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acaena adscendens var. glabriscapa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering characteristics. However, it has since become invasive, outcompeting native species in various habitats. The plant thrives in a variety of soil types and is particularly persistent in disturbed areas. Its spread has raised concerns among conservationists due to its potential to alter local ecosystems."
}
