{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena splendens",
    "plant_slug": "acaena-splendens",
    "plant_name_scientific": "acaena splendens",
    "intro": "Acaena splendens, commonly known as the golden burr or New Zealand burr, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its distinctive, spiny, spherical fruits. The plant produces yellowish-green flowers that bloom in spring, followed by the development of woody, thorny fruits. Its leaves are alternate, simple, and covered with fine hairs, and it thrives in temperate climates. Acaena splendens is often found in coastal and forested areas, where it plays a role in stabilizing soil and supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena splendens"
    },
    "taxonomy_art_desc": "Acaena splendens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Rosales, a group of flowering plants that includes well-known families such as Rosaceae and Moraceae. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of plants such as roses, strawberries, and cherries. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, known for their spiny structures and small flowers. Its species is Acaena splendens, a specific plant within the Acaena genus characterized by its bright yellow flowers and is commonly found in New Zealand.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Chile Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena splendens is primarily native to Argentina Northwest and Chile Central. This species is commonly found in the temperate regions of these areas. It thrives in a variety of habitats, including grasslands and shrublands. The plant is well adapted to the climate and soil conditions of its native range. Its distribution is largely restricted to these specific geographic regions.",
    "distribution_introduced_art_desc": "Acaena splendens was mainly introduced to New Zealand. It was brought there during the 19th century as an ornamental plant due to its attractive yellow flowers. Despite its beauty, it has since become invasive, outcompeting native species in various ecosystems. The plant thrives in a wide range of soil types and can tolerate both full sun and partial shade. Its rapid growth and seed dispersal have led to its spread across many regions of the country."
}
