{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena exigua var. subtusstrigulosa",
    "plant_slug": "acaena-exigua-var-subtusstrigulosa",
    "plant_name_scientific": "acaena exigua var. subtusstrigulosa",
    "intro": "Acaena exigua var. subtusstrigulosa, commonly known as the slender burrweed, is a low-growing, herbaceous perennial native to New Zealand. It features small, spiny fruits that are adapted for seed dispersal by attaching to the fur of animals. The plant has compound leaves with serrated edges, and its stems are often covered in fine, stiff hairs. It thrives in moist, temperate environments and is often found in coastal and subalpine regions. The species is notable for its ecological role in stabilizing soil and providing habitat for native invertebrates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena exigua var. subtusstrigulosa is primarily native to New Zealand. It is found in the South Island, particularly in the eastern and southern regions. This variety grows in a range of habitats, including grasslands, forest margins, and rocky areas. It is commonly associated with coastal and subalpine environments. The plant is well adapted to the temperate climate and diverse soils of its native range.",
    "distribution_introduced_art_desc": "Acaena exigua var. subtusstrigulosa was mainly introduced to New Zealand. It was brought there as part of the early European settlement and has since become naturalized in various habitats. This plant is commonly found in coastal and subantarctic regions, where it thrives in moist, nutrient-poor soils. Its introduction has led to its spread across several islands, including the Chatham Islands. However, it is not considered invasive and has not displaced native vegetation significantly."
}
