{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena fissistipula",
    "plant_slug": "acaena-fissistipula",
    "plant_name_scientific": "acaena fissistipula",
    "intro": "Acaena fissistipula, commonly known as the New Zealand thistle, is a flowering plant native to New Zealand. It is a member of the Rosaceae family and is characterized by its spiny, hairy stems and small, yellow flowers. The plant produces achene fruits that are often covered in hooked bristles, aiding in seed dispersal by attaching to animals. It thrives in a variety of habitats, including coastal areas and dry forests, and is adapted to the temperate climate of New Zealand. Due to its hardy nature, it is considered an invasive species in some regions outside its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena fissistipula"
    },
    "taxonomy_art_desc": "Acaena fissistipula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other plants with showy flowers and often thorny stems. Its family is Rosaceae, commonly known as the rose family, which includes a variety of plants with simple flowers and fruits such as apples and cherries. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, typically characterized by their small, spiny fruits and often used in horticulture. Its species is Acaena fissistipula, a specific type of plant within the Acaena genus known for its distinctive leaf structure and growth habits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena fissistipula is primarily native to the southern regions of New Zealand. It is commonly found in the South Island, particularly in areas with dry, open vegetation such as grasslands and shrublands. This plant thrives in coastal and inland environments with well-drained soils. It is an important component of the local flora and is often found in association with other native shrubs and herbs. Its distribution is largely limited to the southern parts of the country due to its specific environmental requirements.",
    "distribution_introduced_art_desc": "Acaena fissistipula was mainly introduced to New Zealand as a ornamental plant due to its attractive foliage and potential for erosion control. It was first recorded in the 19th century and has since spread throughout various regions of the country. The plant thrives in a range of soil types but prefers well-drained conditions and full sun. It has become naturalized in many areas, often invading native habitats and outcompeting indigenous species. Due to its invasive nature, it is now considered a weed of concern in several parts of New Zealand."
}
