{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena × rubescentiglauca",
    "plant_slug": "acaena-×-rubescentiglauca",
    "plant_name_scientific": "acaena × rubescentiglauca",
    "intro": "Acaena × rubescentiglauca, commonly known as the red-leaf acaena, is a hybrid plant species within the genus Acaena, which belongs to the family Rosaceae. It is characterized by its distinctive reddish foliage, which becomes more pronounced in cooler weather, and its small, spiny fruits that contain seeds. The plant is native to New Zealand and is often found in coastal and subalpine regions, where it thrives in well-drained soils. It has a low-growing, mat-forming habit and is often used in landscaping for its ornamental value. Due to its unique appearance and hardy nature, it is a popular choice for erosion control and garden planting in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena × rubescentiglauca is primarily native to South America, specifically the Andean regions of Chile and Argentina. This species is commonly found in high-altitude grasslands and shrublands, where it thrives in temperate and cool climates. It is often associated with rocky soils and mountainous terrain, adapting well to the harsh environmental conditions of its native habitat. The plant is part of the genus Acaena, which includes several species known for their unique ecological roles in South American ecosystems. Its distribution is limited to specific altitudinal ranges, reflecting its specialized adaptation to the region's climate and soil types.",
    "distribution_introduced_art_desc": "Acaena × rubescentiglauca was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there by horticulturalists interested in cultivating novel plant varieties for garden use. However, it has since become naturalized in certain areas, raising concerns about its potential to spread beyond cultivated landscapes. The plant's ability to thrive in a variety of soil types and its tolerance to different climatic conditions have contributed to its establishment in the wild. Despite its ornamental value, its introduction has led to discussions about its ecological impact on local native flora."
}
