{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena glabra var. diandra",
    "plant_slug": "acaena-glabra-var-diandra",
    "plant_name_scientific": "acaena glabra var. diandra",
    "intro": "Acaena glabra var. diandra, commonly known as the slender burr plant, is a species of flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its spiny, spherical fruits that contain seeds. The plant typically grows in coastal and subalpine regions, thriving in well-drained soils. Its leaves are alternate, simple, and have a hairy texture, while its stems are erect and often branched. The species is known for its ability to form dense colonies, contributing to soil stabilization in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena glabra var. diandra is primarily native to New Zealand. It is found in the northern and central regions of the country, including the North Island and parts of the South Island. This variety thrives in a range of habitats, such as forest margins, shrublands, and rocky areas. It is commonly associated with coastal and lowland environments. The plant plays an important ecological role in its native range, supporting local wildlife and contributing to soil stability.",
    "distribution_introduced_art_desc": "Acaena glabra var. diandra was mainly introduced to New Zealand. It was brought there as part of the early European settlement and has since become naturalized in various regions. This plant is commonly found in coastal and lowland areas, particularly in disturbed soils. It is often considered a weed due to its ability to spread rapidly and outcompete native vegetation. Its introduction has had significant ecological impacts on local ecosystems."
}
