{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena antarctica var. argutidentata",
    "plant_slug": "acaena-antarctica-var-argutidentata",
    "plant_name_scientific": "acaena antarctica var. argutidentata",
    "intro": "Acaena antarctica var. argutidentata, commonly known as the Antarctic hairynet, is a perennial shrub native to the Southern Hemisphere, particularly found in New Zealand and parts of South America. It is characterized by its dense, spiny growth habit and small, persistent bracts that give it a distinctive appearance. The plant produces bright yellow flowers in spring, which are followed by small, berry-like fruits that are an important food source for local wildlife. It thrives in cold, temperate climates and is often found in coastal and alpine environments. Due to its hardy nature, it is sometimes cultivated in gardens for its ornamental value and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena antarctica var. argutidentata is primarily native to the southern regions of South America, particularly in Chile and Argentina. It is commonly found in coastal areas and high-altitude environments, such as the Andes Mountains. This plant thrives in temperate climates with cool, moist conditions and is often associated with rocky or sandy soils. It is well adapted to harsh environmental conditions, including strong winds and limited nutrients. Its distribution is closely linked to the specific ecological niches it occupies in these regions.",
    "distribution_introduced_art_desc": "Acaena antarctica var. argutidentata was mainly introduced to New Zealand. It was brought there as part of the broader introduction of Acaena species for ornamental purposes. This variety is particularly adapted to the cooler, wetter climates found in the South Island. It has since naturalized in certain areas, often thriving in disturbed soils and along forest margins. However, its spread is limited compared to other Acaena species due to its specific ecological requirements."
}
