{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena leptacantha",
    "plant_slug": "acaena-leptacantha",
    "plant_name_scientific": "acaena leptacantha",
    "intro": "Acaena leptacantha, commonly known as the slender bristled nettle, is a low-growing perennial plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its hairy, erect stems and small, clustered flowers. The plant produces bright yellow flowers that bloom in spring, followed by reddish-brown, spiny fruits. Its leaves are alternate, with a serrated margin and a rough texture. Acaena leptacantha is often found in dry, rocky habitats and is adapted to withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena leptacantha"
    },
    "taxonomy_art_desc": "Acaena leptacantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns, horsetails, and their allies, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with simple flower structures. Its order is Rosales, a group of flowering plants that includes economically important families such as Rosaceae and Fabaceae. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs, trees, and herbs with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as \"burnet\" or \"burs,\" characterized by their bristly fruits and often found in temperate regions. Its species is Acaena leptacantha, a specific type of burnet plant known for its slender stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile Central",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena leptacantha is primarily native to Argentina South, Chile Central, and Chile South. This plant is commonly found in the temperate regions of these areas. It thrives in a variety of habitats, including grasslands and rocky slopes. The species is well adapted to the climate and soil conditions of its native range. Its distribution reflects its ecological preferences and historical dispersal patterns.",
    "distribution_introduced_art_desc": "Acaena leptacantha was mainly introduced to New Zealand. It was brought there during the 19th century as part of the introduction of ornamental plants. The species has since become naturalized and is now found in various regions across the country. It thrives in a range of habitats, including coastal areas and disturbed soils. However, it is considered a potential weed in some parts of its range."
}
