{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena buchananii var. picta",
    "plant_slug": "acaena-buchananii-var-picta",
    "plant_name_scientific": "acaena buchananii var. picta",
    "intro": "Acaena buchananii var. picta, commonly known as the painted burr. This plant is a perennial shrub native to New Zealand, characterized by its distinctive, spiny, spherical fruits. The foliage consists of small, dark green, alternate leaves with a rough texture. It produces bright red or orange berries that are often used in traditional Māori medicine. The plant thrives in well-drained soils and is adapted to temperate climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena buchananii"
    },
    "taxonomy_art_desc": "Acaena buchananii var. picta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Rosales, a group of flowering plants that includes many fruit-bearing species such as roses and strawberries. Its family is Rosaceae, commonly known as the rose family, which includes a wide range of plants with showy flowers and often edible fruits. Its genus is Acaena, a group of flowering plants commonly known as \"cudweed\" or \"pineapple weed,\" characterized by their spiny structures and small flowers. Its species is Acaena buchananii, a specific type within the genus Acaena, distinguished by its unique morphological features and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena buchananii var. picta is primarily native to New Zealand South. This variety is found in the southern regions of New Zealand, including the South Island. It typically grows in coastal and subalpine areas, often in rocky or gravelly soils. The plant is well adapted to the temperate climate and maritime conditions of these regions. It is an important component of the local flora and contributes to the ecological diversity of the area.",
    "distribution_introduced_art_desc": "Acaena buchananii var. picta was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, colorful bracts. The plant has since become naturalized in certain regions, particularly in the North Island. It is often found in disturbed soils and along roadsides. However, it is not considered a major invasive species in New Zealand."
}
