{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena trifida var. valdiviensis",
    "plant_slug": "acaena-trifida-var-valdiviensis",
    "plant_name_scientific": "acaena trifida var. valdiviensis",
    "intro": "Acaena trifida var. valdiviensis, commonly known as the Valdivian thornbush, is a shrub native to southern South America, particularly in the temperate rainforests of Chile and Argentina. It is characterized by its dense, spiny growth habit and small, dark green leaves that are often covered in fine hairs. The plant produces bright yellow flowers in spring, which are followed by spherical, woody fruits containing seeds. It thrives in moist, cool climates and is adapted to the high rainfall and humidity of its native habitat. This species plays an important ecological role in its ecosystem, providing shelter and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena trifida var. valdiviensis is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate rainforests and coastal regions of these countries. This variety thrives in moist, shaded environments along the edges of forests and in mountainous areas. It is particularly associated with the Valdivian temperate rainforest ecosystem. Its distribution is limited to specific geographic regions within South America, reflecting its adaptation to local climatic conditions.",
    "distribution_introduced_art_desc": "Acaena trifida var. valdiviensis was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. This species is commonly found in disturbed areas such as roadsides and forest margins. It has since become naturalized and is now considered a weed in some regions. Its spread is facilitated by its ability to thrive in a variety of soil types and its persistent seed production."
}
