{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena confertissima var. majuscula",
    "plant_slug": "acaena-confertissima-var-majuscula",
    "plant_name_scientific": "acaena confertissima var. majuscula",
    "intro": "Acaena confertissima var. majuscula, commonly known as the large burr plant, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny seed heads that form large, spherical clusters, which are a key feature of its botanical appearance. The plant has compound leaves with serrated margins and produces small, yellowish-green flowers during the spring. It thrives in well-drained soils and is often found in coastal and subalpine regions. The species is notable for its ability to form extensive stands and its role in stabilizing soils in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena confertissima var. majuscula is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This plant typically grows in dry, open habitats such as grasslands and rocky areas. It is commonly associated with lowland and subalpine environments. The species is part of the genus Acaena, which is well-represented in New Zealand's flora.",
    "distribution_introduced_art_desc": "Acaena confertissima var. majuscula was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for ornamental purposes. This variety is characterized by its larger, more robust foliage compared to other varieties within the species. It has since become naturalized in certain regions, particularly in coastal and disturbed habitats. However, its spread is limited compared to other invasive Acaena species in the country."
}
