{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena californica",
    "plant_slug": "acaena-californica",
    "plant_name_scientific": "acaena californica",
    "intro": "Acaena californica, commonly known as the California burr bush, is a shrub native to coastal regions of California. It features woody stems covered in dense, spiny bracts that form a prickly, spherical structure. The plant produces small, yellowish flowers that bloom in late spring, followed by bright red, berry-like fruits. Its adaptations include hairy leaves and a deep root system, which help it survive in coastal and sandy soils. It plays a role in local ecosystems by providing food for birds and small mammals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena californica is primarily native to western North America, specifically California and Oregon. It is commonly found in coastal and inland regions, growing in a variety of habitats such as grasslands, woodlands, and disturbed areas. This plant thrives in temperate climates and is often associated with dry, sunny environments. It is particularly common in the coastal areas of California, where it contributes to local biodiversity. Acaena californica is well adapted to the Mediterranean climate of the region, with its growth patterns aligning with seasonal rainfall patterns.",
    "distribution_introduced_art_desc": "Acaena californica was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in restoration projects due to its ability to thrive in poor soil conditions. However, its rapid growth and dense mat formation can lead to the displacement of native vegetation. This plant is often found in coastal and inland areas with sandy or gravelly soils. Despite its ecological benefits, it is considered a potential invasive species in some regions."
}
