{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pinnatifida var. longiuscula",
    "plant_slug": "acaena-pinnatifida-var-longiuscula",
    "plant_name_scientific": "acaena pinnatifida var. longiuscula",
    "intro": "Acaena pinnatifida var. longiuscula, commonly known as the long-seed burrplant, is a flowering plant native to New Zealand. It belongs to the genus Acaena in the family Rosaceae, characterized by its thorny stems and compound leaves. The plant produces small, showy flowers that are typically white or pink, followed by distinctive, spiny fruits. Its foliage is usually alternate and pinnately divided, with serrated leaflets. This species is adapted to a variety of soil types and is often found in coastal and subalpine habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pinnatifida var. longiuscula is primarily native to New Zealand. It is found in the South Island, particularly in the regions of Canterbury and Otago. This variety thrives in dry, open habitats such as grasslands and scrublands. It is commonly associated with limestone soils and can often be found along coastal areas. The plant is part of the bramble family and is known for its spiny stems and small, yellow flowers.",
    "distribution_introduced_art_desc": "Acaena pinnatifida var. longiuscula was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which was historically used for soil stabilization and as a forage plant. This variant is now considered an invasive species in certain regions of New Zealand, where it outcompetes native vegetation. Its spread has been facilitated by its ability to thrive in a variety of soil types and its persistent seed bank. Efforts to control its spread have included mechanical removal and the use of herbicides in affected areas."
}
