{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena tesca",
    "plant_slug": "acaena-tesca",
    "plant_name_scientific": "acaena tesca",
    "intro": "Acaena tesca, commonly known as the New Zealand spinach, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its hairy stems and small, yellowish flowers. The plant produces spherical, burr-like fruits that contain several seeds. It thrives in temperate climates and is often found in moist, well-drained soils. Acaena tesca is valued for its edible leaves, which have a mild, spinach-like flavor.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena tesca"
    },
    "taxonomy_art_desc": "Acaena tesca belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Rosales, which consists of flowering plants with a variety of forms, including shrubs, trees, and herbs, many of which produce showy flowers. Its family is Rosaceae, commonly known as the rose family, which includes familiar plants like roses, apples, and strawberries. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, typically characterized by their spiny stems and small flowers. Its species is Acaena tesca, a specific type of plant within the Acaena genus, known for its distinctive features and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena tesca is primarily native to New Zealand South. It is found in the southern regions of New Zealand, including the South Island. This plant typically grows in coastal and subalpine areas. It is adapted to the cool, temperate climate of these regions. Acaena tesca is part of the native flora that thrives in the unique ecosystems of southern New Zealand.",
    "distribution_introduced_art_desc": "Acaena tesca was mainly introduced to New Zealand. It was brought there as part of the ornamental plant trade. The plant has since become naturalized and is now found in various regions across the country. It thrives in a variety of soil types and can tolerate both full sun and partial shade. However, it is considered a potential weed in some areas due to its aggressive growth habit."
}
