{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena integerrima",
    "plant_slug": "acaena-integerrima",
    "plant_name_scientific": "acaena integerrima",
    "intro": "Acaena integerrima, commonly known as the New Zealand burr or bristly knapweed, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny bracts that form a bur-like structure, which helps in seed dispersal by attaching to animals or clothing. The plant produces small, yellowish flowers that bloom in spring, followed by the development of its distinctive, prickly fruits. It thrives in a variety of soil types but prefers well-drained conditions and full sun. Acaena integerrima is often found in coastal and inland habitats, including forest margins and rocky areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena integerrima"
    },
    "taxonomy_art_desc": "Acaena integerrima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Rosales, which consists of flowering plants that typically have simple leaves and flowers with five parts. Its family is Rosaceae, known for including roses, apples, and strawberries, characterized by their showy flowers and fruit types. Its genus is Acaena, a group of flowering plants commonly known as \"burnet\" or \"cudweed,\" often found in temperate regions. Its species is Acaena integerrima, a specific type of plant within the genus Acaena, characterized by its hairy stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile Central",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena integerrima is primarily native to Argentina South, Chile Central, and Chile South. This plant is commonly found in the temperate regions of these areas. It thrives in a variety of habitats, including grasslands and shrublands. Acaena integerrima is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in the local ecosystems of South America.",
    "distribution_introduced_art_desc": "Acaena integerrima was mainly introduced to New Zealand. It was brought there as part of the European agricultural expansion and has since become naturalized in various regions. The plant is commonly found in disturbed areas such as roadsides, pastures, and forest edges. It is considered an invasive species in some areas due to its ability to spread rapidly and outcompete native vegetation. Its distribution is now widespread across much of the country, particularly in the North Island."
}
