{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena macrostemon subsp. barbaticupula",
    "plant_slug": "acaena-macrostemon-subsp-barbaticupula",
    "plant_name_scientific": "acaena macrostemon subsp. barbaticupula",
    "intro": "Acaena macrostemon subsp. barbaticupula, commonly known as the hairy burr plant, is a low-growing perennial shrub native to New Zealand. It is characterized by its dense, spiny foliage and produces small, yellowish flowers that bloom in spring. The plant's unique feature is its cup-shaped, barbed bracts that enclose the seeds, aiding in seed dispersal by attaching to animals or clothing. It thrives in moist, temperate climates and is often found in coastal and subalpine regions. The species is valued for its ornamental appeal and ecological role in supporting native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena macrostemon subsp. barbaticupula is primarily native to New Zealand. It is found in the South Island, particularly in the central and southern regions. This subspecies grows in a variety of habitats, including grasslands, shrublands, and rocky areas. It is commonly associated with coastal and inland environments. Its distribution is limited to specific areas within New Zealand, reflecting its ecological preferences and historical range.",
    "distribution_introduced_art_desc": "Acaena macrostemon subsp. barbaticupula was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for ornamental purposes. This subspecies is commonly found in coastal and lowland areas, particularly in the northern regions of the country. It has since become naturalized in several parts of New Zealand, often thriving in disturbed soils and open habitats. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
