{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena trifida var. glabrescens",
    "plant_slug": "acaena-trifida-var-glabrescens",
    "plant_name_scientific": "acaena trifida var. glabrescens",
    "intro": "Acaena trifida var. glabrescens, commonly known as the smooth thimbleweed, is a low-growing perennial plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, mat-forming growth habit. The plant features small, oval to egg-shaped leaves that are typically covered in fine hairs, though the variety glabrescens is noted for its smoother texture. Its flowers are yellow and clustered in heads, and it produces small, berry-like fruits that are edible but often considered unpalatable. This species is often found in moist, shaded environments such as forest floors and stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena trifida var. glabrescens is primarily native to New Zealand. It is found in the northern and central regions of the country. This variety thrives in coastal and lowland areas, often growing in sandy or gravelly soils. It is commonly associated with open vegetation such as coastal dunes and shrublands. The plant is well adapted to the temperate climate and can tolerate moderate grazing pressure.",
    "distribution_introduced_art_desc": "Acaena trifida var. glabrescens was mainly introduced to New Zealand. It was brought there during the 19th century as part of the broader introduction of New Zealand flora for horticultural and ornamental purposes. This variety is a variant of the common Acaena trifida, which is native to South America. It has since become established in certain regions of New Zealand, particularly in the North Island. However, it is not considered invasive and is often found in cultivation rather than natural ecosystems."
}
