{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena × ovina var. retrosumpilosa",
    "plant_slug": "acaena-×-ovina-var-retrosumpilosa",
    "plant_name_scientific": "acaena × ovina var. retrosumpilosa",
    "intro": "Acaena × ovina var. retrosumpilosa, commonly known as the silver mat grass, is a low-growing perennial plant native to South America. It features dense, mat-forming growth with silver-gray foliage due to a waxy coating on its leaves. The plant produces small, yellowish flowers that bloom in summer, followed by spiny, spherical fruits. It thrives in well-drained soils and is often used in erosion control and ornamental landscaping. Its botanical characteristics make it well-suited for coastal and dry garden environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena × ovina var. retrosumpilosa is primarily native to the southern Andes of South America, specifically in regions spanning Chile and Argentina. This plant is commonly found in high-altitude grasslands and shrublands, often growing in areas with cool, temperate climates. It thrives in well-drained soils and is often associated with montane ecosystems. The species is adapted to the unique environmental conditions of its native habitat, including strong winds and seasonal precipitation. Its distribution is limited to these specific geographic and ecological zones, making it a characteristic component of the local flora.",
    "distribution_introduced_art_desc": "Acaena × ovina var. retrosumpilosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and hardy nature. However, it has since become invasive, outcompeting native species in various ecosystems. Its spread has been facilitated by its ability to thrive in a wide range of soil types and climates. Conservation efforts are now underway to control its spread and protect local biodiversity."
}
