{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena subincisa",
    "plant_slug": "acaena-subincisa",
    "plant_name_scientific": "acaena subincisa",
    "intro": "Acaena subincisa, commonly known as the narrow-leaved burrweed, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, prickly fruits that contain seeds. The plant has compound leaves with serrated edges and produces yellow flowers in spring. It thrives in a variety of habitats, including forests and shrublands, and is often found in moist, well-drained soils. Acaena subincisa plays a role in local ecosystems by providing food for birds and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena subincisa"
    },
    "taxonomy_art_desc": "Acaena subincisa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct vascular system and a life cycle that involves alternating generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient evolutionary history. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures and diverse habitats. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other economically significant plants, known for their diverse forms and ecological roles. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs, trees, and herbs with showy flowers and economically valuable fruits. Its genus is Acaena, a group of flowering plants commonly known as \"mouse-ear\" or \"burs\" due to their small, thistle-like appearance and unique seed structures. Its species is Acaena subincisa, a specific type of plant within the genus Acaena, characterized by its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Ecuador"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena subincisa is primarily native to Colombia and Ecuador. This species is commonly found in the Andean regions of these countries. It typically grows in moist, temperate climates at higher elevations. The plant is often associated with forest understory and rocky slopes. Its native distribution is limited to specific ecological niches within these South American nations.",
    "distribution_introduced_art_desc": "Acaena subincisa was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized in various regions of the country. It is commonly found in coastal areas and disturbed soils. However, it is considered a potential weed in some parts of its introduced range."
}
