{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena multifida var. utrinquepilosa",
    "plant_slug": "acaena-multifida-var-utrinquepilosa",
    "plant_name_scientific": "acaena multifida var. utrinquepilosa",
    "intro": "Acaena multifida var. utrinquepilosa, commonly known as the tufted burrweed, is a species native to New Zealand. It is a low-growing perennial shrub characterized by its dense, mat-forming growth habit. The plant features compound leaves with multiple lobes, and its stems are often covered in fine, silky hairs. It produces small, yellowish flowers that are clustered in inflorescences, followed by woody, spiky fruits that are adapted for animal dispersal. The species is notable for its ecological role in stabilizing soil and providing habitat for native invertebrates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena multifida var. utrinquepilosa is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the central and southern parts. This plant thrives in grasslands, shrublands, and along the edges of forests. It is adapted to a variety of soil types but prefers well-drained soils. Its distribution is closely associated with the Andean foothills and coastal areas of the region.",
    "distribution_introduced_art_desc": "Acaena multifida var. utrinquepilosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become an invasive species, spreading rapidly in native ecosystems. The plant's ability to thrive in various soil types and its prolific seed production contribute to its invasive nature. Efforts are ongoing to control its spread and protect local biodiversity."
}
