{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena ovalifolia var. elegans",
    "plant_slug": "acaena-ovalifolia-var-elegans",
    "plant_name_scientific": "acaena ovalifolia var. elegans",
    "intro": "Acaena ovalifolia var. elegans, commonly known as the elegant burr grass, is a low-growing perennial plant native to New Zealand. It features small, oval-shaped leaves that are often covered in fine hairs, giving them a soft texture. The plant produces bright yellow flowers that bloom in spring, followed by spiny, berry-like fruits that contain seeds. It thrives in well-drained soils and is often found in coastal and subalpine regions. Due to its unique appearance and ecological role, it is valued in both horticulture and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena ovalifolia var. elegans is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This plant typically grows in dry, open habitats such as tussock grasslands and rocky areas. It is adapted to the temperate climate and well-drained soils of these regions. The variety is known for its distinctive yellow flowers and is part of the bramble family.",
    "distribution_introduced_art_desc": "Acaena ovalifolia var. elegans was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and compact growth habit. Despite its aesthetic appeal, it has since become invasive in some regions, outcompeting native vegetation. The plant thrives in a variety of soil types and is tolerant of both full sun and partial shade. Its spread has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
