{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena magellanica f. robusta",
    "plant_slug": "acaena-magellanica-f-robusta",
    "plant_name_scientific": "acaena magellanica f. robusta",
    "intro": "Acaena magellanica f. robusta, commonly known as the robust acaena, is a flowering plant native to South America, particularly Chile and Argentina. It belongs to the family Rosaceae and is characterized by its dense, thorny growth habit. The plant produces small, yellowish flowers that are typically clustered in spherical inflorescences. Its leaves are alternate, simple, and often have a serrated edge. The fruit is a dry, spiky capsule that contains seeds covered in hooked bristles, aiding in seed dispersal by attaching to animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena magellanica f. robusta is primarily native to southern South America, including regions of Chile and Argentina. It is commonly found in the temperate and subantarctic areas of the southern hemisphere. This plant thrives in coastal and mountainous environments, often in rocky or sandy soils. It is part of the Rubiaceae family and is known for its hardy nature in harsh climates. Its distribution is closely associated with the Magellanic vegetation zone.",
    "distribution_introduced_art_desc": "Acaena magellanica f. robusta was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species with ornamental and ecological value. The plant is commonly found in disturbed areas such as roadsides, forest edges, and wastelands. It has become naturalized in certain regions, contributing to local plant communities. However, its spread is generally limited due to its preference for specific soil and climatic conditions."
}
