{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena splendens var. angustior",
    "plant_slug": "acaena-splendens-var-angustior",
    "plant_name_scientific": "acaena splendens var. angustior",
    "intro": "Acaena splendens var. angustior, commonly known as the narrowleaf wood rose, is a flowering plant native to New Zealand. It is a low-growing shrub characterized by its dense, spiny stems and small, clustered flowers. The plant produces bright yellow to orange flowers that bloom in spring, followed by red, berry-like fruits. Its foliage consists of narrow, lance-shaped leaves with a slightly hairy texture. It thrives in well-drained soils and is often found in coastal and subalpine regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena splendens var. angustior is primarily native to the southern Andes of South America, specifically in Chile and Argentina. This plant is commonly found in high-altitude regions, such as the Patagonian steppe and surrounding grasslands. It thrives in temperate climates with cool, moist conditions and well-drained soils. The species is adapted to harsh environmental conditions, including strong winds and low temperatures. It plays an important ecological role in its native habitat by providing food and shelter for local wildlife.",
    "distribution_introduced_art_desc": "Acaena splendens var. angustior was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in a variety of soil types and is particularly common in coastal and lowland regions. Its rapid spread has raised concerns among conservationists due to its impact on local ecosystems."
}
