{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena microphylla var. microphylla",
    "plant_slug": "acaena-microphylla-var-microphylla",
    "plant_name_scientific": "acaena microphylla var. microphylla",
    "intro": "Acaena microphylla var. microphylla, commonly known as New Zealand spinach, is a herbaceous plant native to New Zealand. It is characterized by its small, trifoliate leaves and produces bright yellow flowers that develop into spiny, spherical fruits. The plant is adapted to temperate climates and thrives in well-drained soils. It is often cultivated for its edible leaves, which have a spinach-like flavor. Its botanical features make it a distinctive member of the rose family (Rosaceae).",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena microphylla"
    },
    "taxonomy_art_desc": "Acaena microphylla var. microphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive structures. Its order is Rosales, which includes flowering plants with a wide range of growth forms, including shrubs and trees. Its family is Rosaceae, commonly known as the rose family, which includes many economically important plants like roses and apples. Its genus is Acaena, a group of flowering plants commonly known as \"thimbleweed\" or \"devil's bit,\" characterized by their prickly stems and small flowers. Its species is Acaena microphylla, a specific variety within the genus Acaena, known for its small, delicate leaves and clusters of yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand North",
        "New Zealand South"
    ],
    "distribution_introduced": [
        "Czechia-Slovakia"
    ],
    "distribution_native_art_desc": "Acaena microphylla var. microphylla is primarily native to New Zealand North and New Zealand South. This species is commonly found in various habitats across both regions, including grasslands, shrublands, and coastal areas. It thrives in temperate climates and is often associated with nutrient-poor soils. The plant plays an important ecological role in its native range, supporting local wildlife and contributing to soil stability. Its distribution is largely restricted to the islands of New Zealand, where it has adapted to the unique environmental conditions.",
    "distribution_introduced_art_desc": "Acaena microphylla var. microphylla was mainly introduced to Czechia-Slovakia as an ornamental plant due to its attractive foliage and unique appearance. It is commonly found in gardens and landscaped areas, where it is cultivated for its aesthetic value. However, it has the potential to become invasive in certain environments if not managed properly. The plant's spread is often associated with human activity, such as gardening and landscaping practices. Its introduction has raised concerns among local conservationists due to its potential ecological impact."
}
