{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena grandistipula",
    "plant_slug": "acaena-grandistipula",
    "plant_name_scientific": "acaena grandistipula",
    "intro": "Acaena grandistipula, commonly known as the large-bracted spinifex, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, mat-forming growth habit. The plant produces small, red or yellow flowers that are clustered in heads, which are often visited by native bees and other pollinators. Its leaves are alternate, simple, and have a hairy texture, while the stems are prostrate and often covered in spines. Acaena grandistipula is adapted to a variety of soil types and is commonly found in coastal and subalpine regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena grandistipula is primarily native to New Zealand. It is commonly found in the southern regions of the country, particularly in the South Island. This plant thrives in a variety of habitats, including grasslands, shrublands, and coastal areas. It is often associated with disturbed soils and can be found in both coastal and inland environments. Acaena grandistipula is an important component of the local flora and plays a role in the ecological balance of its native range.",
    "distribution_introduced_art_desc": "Acaena grandistipula was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering. However, it has since become invasive, outcompeting native species in various habitats. The plant thrives in a range of soil types and is particularly problematic in grasslands and forest margins. Its spread has led to concerns over its impact on local biodiversity and ecosystem health."
}
