{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena longiscapa",
    "plant_slug": "acaena-longiscapa",
    "plant_name_scientific": "acaena longiscapa",
    "intro": "Acaena longiscapa, commonly known as the long-stemmed burr plant, is a species of flowering plant in the family Rosaceae. It is native to New Zealand and is characterized by its woody, shrub-like structure with dense, spiny bracts. The plant produces small, yellow flowers that are typically clustered in inflorescences, followed by the development of persistent, spherical burrs. These burrs contain seeds that are adapted for dispersal by animals, contributing to the plant's ecological role in its native habitat. Acaena longiscapa is often found in coastal and mountainous regions, where it thrives in well-drained soils and full sunlight.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena longiscapa"
    },
    "taxonomy_art_desc": "Acaena longiscapa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Rosales, a group of flowering plants that includes well-known families such as Rosaceae and Fabaceae, and is characterized by a variety of leaf and flower forms. Its family is Rosaceae, commonly known as the rose family, which includes many ornamental and fruit-bearing plants such as roses, apples, and strawberries. Its genus is Acaena, a group of flowering plants commonly known as \"spearheads\" or \"devil's grass,\" typically found in New Zealand and characterized by their spiny, woody stems. Its species is Acaena longiscapa, a specific type of Acaena plant known for its long, spiny stems and is native to New Zealand, often growing in coastal and subalpine regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena longiscapa is primarily native to Bolivia. It is found in the southern part of the country, particularly in the department of Potosí. This plant thrives in high-altitude grasslands and rocky areas. It is adapted to the harsh climate and limited soil nutrients of its native habitat. Acaena longiscapa plays an important role in the local ecosystem and is part of the native flora of Bolivia.",
    "distribution_introduced_art_desc": "Acaena longiscapa was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized in various parts of the country. It is commonly found in disturbed areas such as roadsides and forest edges. However, it is considered a potential weed in some regions due to its ability to spread rapidly."
}
