{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena macrophyes",
    "plant_slug": "acaena-macrophyes",
    "plant_name_scientific": "acaena macrophyes",
    "intro": "Acaena macrophyes, commonly known as New Zealand bramble, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its prickly stems and small, white or pink flowers. The plant produces burrs with hooked bracts that aid in seed dispersal by attaching to animal fur. Its leaves are alternate, simple, and often have a serrated margin. Acaena macrophyes thrives in a variety of habitats, including forest margins and rocky areas, and is adapted to the temperate climate of New Zealand.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena macrophyes is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate grasslands and shrublands, often in areas with well-drained soils. This species thrives in open habitats and is adapted to seasonal rainfall patterns. It is also known to occur in parts of southern Brazil and the Falkland Islands. Its distribution is closely linked to the Andean mountain range and surrounding lowlands.",
    "distribution_introduced_art_desc": "Acaena macrophyes was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly found in coastal and inland regions where its deep root system helps prevent soil degradation. This plant thrives in well-drained soils and is often used in restoration projects. However, its rapid growth can lead to competition with native species in some environments. Despite its benefits, it is considered a potential invasive species in certain regions."
}
