{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena cadilla f. epistemonocoma",
    "plant_slug": "acaena-cadilla-f-epistemonocoma",
    "plant_name_scientific": "acaena cadilla f. epistemonocoma",
    "intro": "Acaena cadilla f. epistemonocoma, commonly known as the tufted acacia, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, mat-forming growth habit. The plant features small, yellow flowers that are clustered in heads, followed by spiny, berry-like fruits. Its leaves are alternate, simple, and often covered with fine hairs. This species is adapted to grow in a variety of soil types and is often found in coastal and inland areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena cadilla f. epistemonocoma is primarily native to South America, specifically Chile and Argentina. It is found in the temperate regions of these countries, particularly in the Valdivian temperate rainforests. This species thrives in moist, shaded environments along riverbanks and in forest understories. It is commonly associated with coastal and mountainous areas, where it forms part of the native vegetation. The plant is known for its distinctive yellow flowers and is an important component of the local flora.",
    "distribution_introduced_art_desc": "Acaena cadilla f. epistemonocoma was mainly introduced to New Zealand. It was brought there as part of the ornamental plant trade due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in disturbed soils and can spread rapidly in coastal and lowland areas. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
