{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena lucida",
    "plant_slug": "acaena-lucida",
    "plant_name_scientific": "acaena lucida",
    "intro": "Acaena lucida, commonly known as the shining weed, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, yellow flowers and prickly, spherical fruits. The plant typically grows in moist, coastal environments and is often found in sandy or gravelly soils. Its leaves are alternate, simple, and have a waxy coating, which helps reduce water loss. The species is known for its ornamental value and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena lucida"
    },
    "taxonomy_art_desc": "Acaena lucida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Rosales, a group of flowering plants that includes many familiar species such as roses, strawberries, and apples. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and trees with showy flowers and edible fruits. Its genus is Acaena, a group of flowering plants commonly known as \"mouse-ear\" or \"burr\" plants, characterized by their small, spiny fruits. Its species is Acaena lucida, a specific type of Acaena plant native to New Zealand, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile South",
        "Falkland Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena lucida is primarily native to Argentina South, Chile South, and Falkland Islands. This plant is commonly found in temperate regions of southern South America. It thrives in coastal and grassland habitats, often in areas with well-drained soils. Acaena lucida is adapted to the cool, maritime climate of these regions. Its distribution reflects its ecological preference for southern Patagonia and the subantarctic zones.",
    "distribution_introduced_art_desc": "Acaena lucida was mainly introduced to New Zealand. It was brought there as a potential ornamental plant due to its attractive yellow flowers and compact growth habit. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in a variety of soil types and is particularly common in coastal and disturbed habitats. Its rapid spread has raised concerns among conservationists due to its impact on local ecosystems."
}
