{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena eupatoria var. simplex",
    "plant_slug": "acaena-eupatoria-var-simplex",
    "plant_name_scientific": "acaena eupatoria var. simplex",
    "intro": "Acaena eupatoria var. simplex, commonly known as the simple eupatoria, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, spiny fruits and dense, evergreen foliage. The plant typically grows in coastal and lowland areas, thriving in well-drained soils. Its flowers are usually white or pink, appearing in clusters, and it is often found in rocky or sandy habitats. The species is noted for its ornamental value and is sometimes cultivated for its hardy nature and aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena eupatoria var. simplex is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This plant typically grows in dry, open habitats such as grasslands and rocky slopes. It is well adapted to the temperate climate and nutrient-poor soils of its native range. The variety is distinguished by its simple, unbranched stems and small, spiky leaves.",
    "distribution_introduced_art_desc": "Acaena eupatoria var. simplex was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in restoration projects due to its ability to thrive in poor soil conditions. The plant forms dense mats that help prevent soil erosion and reduce sediment runoff. However, it has the potential to become invasive in some environments if not managed properly. Its introduction has been both beneficial for ecological restoration and a concern for native plant communities."
}
