{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena anserinella var. elatissima",
    "plant_slug": "acaena-anserinella-var-elatissima",
    "plant_name_scientific": "acaena anserinella var. elatissima",
    "intro": "Acaena anserinella var. elatissima, commonly known as the giant New Zealand burr, is a perennial shrub native to New Zealand. It is characterized by its spiny, spherical fruits that contain seeds enclosed in a fibrous, hairy husk. The plant thrives in moist, shaded environments and is often found in forested areas. Its foliage consists of alternate, simple, and ovate leaves with a rough, hairy texture. The species is notable for its unique morphology and ecological role in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena anserinella var. elatissima is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the Andean foothills and valleys. This plant thrives in moist, well-drained soils and is often associated with shrublands and grassy slopes. It is an important component of the native flora in these areas, contributing to local biodiversity. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acaena anserinella var. elatissima was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive silver foliage and compact growth habit. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in a variety of soil types and is highly adaptable to different environmental conditions. Its spread has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
