{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaenops pilosus",
    "plant_slug": "acaenops-pilosus",
    "plant_name_scientific": "acaenops pilosus",
    "intro": "Acaenops pilosus, commonly known as the silky acacia, is a shrub native to southern Africa. It is characterized by its slender, wiry stems and small, clustered leaves that are covered in fine, silky hairs. The plant produces yellow flowers arranged in dense, globular inflorescences, which bloom during the summer months. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaenops pilosus is primarily native to southern Africa, specifically South Africa. It is found in the eastern and southern regions of the country, including the Eastern Cape and the Western Cape provinces. This plant thrives in coastal and sandy soils, often growing in shrubland and coastal dunes. It is commonly associated with the fynbos biome, which is known for its biodiversity and unique vegetation. Acaenops pilosus is well adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters.",
    "distribution_introduced_art_desc": "Acaenops pilosus was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in a variety of soil types and is tolerant of both full sun and partial shade. Its rapid growth and ability to spread through seeds have made it a challenge for land managers."
}
