{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena cadilla f. pusilla",
    "plant_slug": "acaena-cadilla-f-pusilla",
    "plant_name_scientific": "acaena cadilla f. pusilla",
    "intro": "Acaena cadilla f. pusilla, commonly known as the small-stemmed New Zealand bramble, is a low-growing shrub native to New Zealand. It features small, oval leaves with a slightly hairy surface and produces clusters of yellowish-green flowers. The plant is characterized by its small, spiny fruits that contain seeds surrounded by a fibrous, woolly coating. It thrives in moist, shaded environments and is often found in forest understories. Due to its unique morphology and ecological role, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena cadilla f. pusilla is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the Andean foothills and surrounding grasslands. This plant thrives in well-drained soils and is often associated with rocky or mountainous terrain. It is a member of the Rosaceae family and is known for its small, spiny fruits. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acaena cadilla f. pusilla was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in restoration projects due to its ability to thrive in poor soil conditions. This plant has been introduced in various regions, including parts of New Zealand and the United States. However, it can become invasive if not managed properly. Its rapid growth and seed production make it both useful and potentially problematic."
}
