{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena krausei var. meionandra",
    "plant_slug": "acaena-krausei-var-meionandra",
    "plant_name_scientific": "acaena krausei var. meionandra",
    "intro": "Acaena krausei var. meionandra, commonly known as the small-flowered wood rose, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, spiny growth habit. The plant produces small, pink or white flowers that bloom in spring, followed by distinctive burr-like fruits. Its leaves are alternate, ovate, and often covered in fine hairs. This species is adapted to a variety of soil types and is often found in forest margins and rocky areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena krausei var. meionandra is primarily native to New Zealand. It is found in the South Island, particularly in the regions of Canterbury and Otago. This plant typically grows in dry, open habitats such as scrublands and rocky areas. It is often associated with coastal and inland areas where the soil is well-drained. The species is part of the Rubiaceae family and is known for its distinctive yellow flowers and spiny fruits.",
    "distribution_introduced_art_desc": "Acaena krausei var. meionandra was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species with ornamental and ecological value. This variant is often found in coastal and subalpine regions, where it thrives in well-drained soils. Its introduction has led to its establishment in native habitats, sometimes competing with indigenous plant species. Due to its adaptability, it has become a common component of the local flora in certain areas."
}
