{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena poeppigiana",
    "plant_slug": "acaena-poeppigiana",
    "plant_name_scientific": "acaena poeppigiana",
    "intro": "Acaena poeppigiana, commonly known as the New Zealand burr bush, is a flowering plant native to New Zealand. It is a shrub that typically grows in coastal and subalpine regions, characterized by its dense, thorny growth habit. The plant produces small, yellowish flowers that bloom in spring, followed by spherical, spiky fruits that contain seeds. Its foliage consists of alternate, narrow, and leathery leaves that are often covered in fine hairs. Acaena poeppigiana plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena poeppigiana"
    },
    "taxonomy_art_desc": "Acaena poeppigiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Rosales, a group of flowering plants that includes roses, apples, and other plants with typically alternate leaves and showy flowers. Its family is Rosaceae, commonly known as the rose family, which includes a wide range of plants with a variety of growth forms and flower structures. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, often characterized by their spiny fruits and small, clustered flowers. Its species is Acaena poeppigiana, a specific plant within the Acaena genus known for its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Argentina South",
        "Chile Central",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena poeppigiana is primarily native to Argentina Northwest, Argentina South, Chile Central, and Chile South. This plant is commonly found in the temperate regions of these areas. It thrives in dry, open habitats such as grasslands and shrublands. The species is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in the local ecosystems.",
    "distribution_introduced_art_desc": "Acaena poeppigiana was mainly introduced to New Zealand. It was brought there as part of the early European settlement and has since become naturalized in various regions. The plant thrives in a range of soil types but prefers well-drained conditions. It is commonly found in disturbed areas, such as roadsides and forest margins. However, it is considered a potential weed in some parts of its introduced range."
}
