{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena argentea var. pluribracteata",
    "plant_slug": "acaena-argentea-var-pluribracteata",
    "plant_name_scientific": "acaena argentea var. pluribracteata",
    "intro": "Acaena argentea var. pluribracteata, commonly known as the silverweed or silver cushion, is a low-growing perennial plant native to New Zealand. It features dense clusters of small, silver-gray leaves that are covered in fine hairs, giving it a distinctive appearance. The plant produces tiny, yellow flowers that appear in early spring, followed by spiny, berry-like fruits that are adapted for animal dispersal. It thrives in moist, shaded environments and is often found in forest floors or along stream banks. Its botanical characteristics make it an important component of New Zealand's native flora and a subject of ecological study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena argentea var. pluribracteata is primarily native to the southern Andes of South America, including parts of Chile and Argentina. This variety thrives in high-altitude environments, typically found in alpine and subalpine regions. It is commonly associated with rocky soils and open habitats such as grasslands and shrublands. The plant is well adapted to the cold and harsh climate of its native range. Its distribution is limited to specific areas within the Andean range due to its ecological requirements.",
    "distribution_introduced_art_desc": "Acaena argentea var. pluribracteata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive silver foliage and unique appearance. However, it has since become invasive, outcompeting native species in various habitats. The plant thrives in disturbed soils and can spread rapidly through its seeds. Its introduction has led to concerns about its ecological impact on local biodiversity."
}
