{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena ovalifolia subsp. glabricaulis",
    "plant_slug": "acaena-ovalifolia-subsp-glabricaulis",
    "plant_name_scientific": "acaena ovalifolia subsp. glabricaulis",
    "intro": "Acaena ovalifolia subsp. glabricaulis, commonly known as the smooth-stemmed New Zealand bramble, is a shrub native to New Zealand. It is characterized by its smooth, cylindrical stems and small, oval-shaped leaves. The plant produces yellow flowers that bloom in spring, followed by edible, nut-like fruits. It thrives in coastal and subalpine environments, often growing in rocky or sandy soils. Due to its hardy nature, it is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena ovalifolia subsp. glabricaulis is primarily native to southern South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the valleys and coastal areas. This subspecies thrives in a variety of habitats, including grasslands, shrublands, and disturbed soils. It is often associated with maritime climates and can be found in both coastal and inland areas. Its distribution is limited to specific ecological zones where the climate and soil conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Acaena ovalifolia subsp. glabricaulis was mainly introduced to New Zealand. It was brought there during the 19th century as part of the European flora introduced for ornamental purposes. This subspecies is now considered an environmental weed in certain regions of New Zealand. It has spread through disturbed areas and along roadsides, often outcompeting native vegetation. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
