{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena leptacantha var. negeri",
    "plant_slug": "acaena-leptacantha-var-negeri",
    "plant_name_scientific": "acaena leptacantha var. negeri",
    "intro": "Acaena leptacantha var. negeri, commonly known as the New Zealand spinach bush, is a low-growing shrub native to New Zealand. It features small, spiny leaves and produces clusters of yellow flowers that develop into distinctive, hairy, woody fruits. The plant is adapted to a variety of soil types but prefers well-drained conditions. It is often found in coastal and subalpine regions, where it thrives in full sun. The species is notable for its ornamental value and is sometimes cultivated for its hardy, drought-resistant characteristics.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena leptacantha var. negeri is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This plant typically grows in dry, open habitats such as tussock grasslands and rocky outcrops. It is adapted to the temperate climate and well-drained soils of these areas. The variety is known for its small, prickly fruits and is part of the bramble family.",
    "distribution_introduced_art_desc": "Acaena leptacantha var. negeri was mainly introduced to New Zealand as a ornamental plant due to its attractive foliage and unique appearance. It was initially cultivated in gardens and public spaces for its aesthetic value. However, it has since become an invasive species, spreading beyond cultivated areas into native ecosystems. Its establishment has led to competition with native plants and disruption of local biodiversity. Efforts are now being made to control its spread and prevent further ecological damage."
}
