{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena micranthera",
    "plant_slug": "acaena-micranthera",
    "plant_name_scientific": "acaena micranthera",
    "intro": "Acaena micranthera, commonly known as the small-flowered burr plant, is a species of flowering plant in the family Rosaceae. It is native to South America, particularly Chile and Argentina, and is characterized by its thorny, spiny bracts that surround its small flowers. The plant produces spherical, woody fruits that contain several seeds, which are dispersed by animals. It thrives in temperate climates and is often found in dry, open habitats such as grasslands and shrublands. Acaena micranthera is noted for its ability to tolerate harsh environmental conditions, making it a resilient component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena micranthera is primarily native to New Zealand. It is found throughout the country, particularly in the South Island. This plant grows in a variety of habitats, including shrublands, grasslands, and forest margins. It is commonly found in the alpine and subalpine regions of the Southern Alps. Acaena micranthera is an important component of the native flora and is adapted to the cool, temperate climate of New Zealand.",
    "distribution_introduced_art_desc": "Acaena micranthera was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first recorded in the 19th century and has since spread throughout various regions of the country. Despite its ornamental value, it has become invasive in some areas, outcompeting native vegetation. The plant thrives in a variety of soil types and is highly resilient, making it difficult to control. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
