{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena montana",
    "plant_slug": "acaena-montana",
    "plant_name_scientific": "acaena montana",
    "intro": "Acaena montana, commonly known as the mountain spinulose burr, is a low-growing shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, spiny foliage and small, clustered flowers. The plant produces bright red berries that are an important food source for native birds. Its stems are often covered in stiff, hooked bristles that aid in seed dispersal. Acaena montana thrives in moist, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena montana"
    },
    "taxonomy_art_desc": "Acaena montana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other plants with showy flowers and often thorny stems. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of plants such as apples, cherries, and roses, characterized by their distinctive flower structures. Its genus is Acaena, a group of flowering plants commonly known as New Zealand burr bushes, which are typically shrubs with spiny fruits. Its species is Acaena montana, a specific type of Acaena found in New Zealand, known for its small, spiny fruits and its ability to thrive in various soil types.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tasmania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena montana is primarily native to Tasmania. It is commonly found in various habitats across the island, including grasslands, heathlands, and open forests. This plant thrives in well-drained soils and is often seen in coastal and inland areas. It plays an important ecological role in supporting local wildlife and maintaining biodiversity. Its distribution is largely restricted to Tasmania, with no known presence on the mainland of Australia.",
    "distribution_introduced_art_desc": "Acaena montana was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized and is now found in various regions across the country. It thrives in a range of habitats, including disturbed soils and coastal areas. However, it is considered a potential weed in some ecosystems due to its ability to spread rapidly."
}
