{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena argentea",
    "plant_slug": "acaena-argentea",
    "plant_name_scientific": "acaena argentea",
    "intro": "Acaena argentea, commonly known as silver burr, is a low-growing perennial plant native to New Zealand. It features wiry, silver-tomentose stems and produces small, spherical fruits that are covered in hooked bracts. The plant's leaves are alternate, ovate, and covered with fine, silky hairs. It thrives in dry, sunny environments and is often found in open grasslands and coastal areas. Acaena argentea is known for its ornamental value and is sometimes cultivated for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena argentea"
    },
    "taxonomy_art_desc": "Acaena argentea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and apples. Its order is Rosales, a group of flowering plants that includes many species with showy flowers and fruits. Its family is Rosaceae, commonly known as the rose family, which includes a wide range of plants such as roses, strawberries, and raspberries. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, often referred to as \"burs\" due to their prickly fruits. Its species is Acaena argentea, a shrub known for its silver-gray foliage and is commonly found in New Zealand, where it thrives in coastal and subalpine environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile Central",
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [
        "Juan Fernández Is."
    ],
    "distribution_native_art_desc": "Acaena argentea is primarily native to Argentina South, Chile Central, Ecuador, and Peru. This plant is commonly found in temperate regions across these countries. It thrives in a variety of habitats, including grasslands and shrublands. Acaena argentea is well adapted to the local climate and soil conditions of its native range. Its distribution reflects its ecological preferences and historical dispersal patterns.",
    "distribution_introduced_art_desc": "Acaena argentea was mainly introduced to the Juan Fernández Is. as an ornamental plant due to its attractive silver foliage. It has since become naturalized in certain areas, particularly in coastal and disturbed habitats. The plant's ability to thrive in sandy soils and its resilience to harsh environmental conditions have contributed to its spread. However, it is considered a potential weed in some parts of the archipelago. Its introduction has raised concerns about its impact on native flora and ecosystem balance."
}
