{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena glabra",
    "plant_slug": "acaena-glabra",
    "plant_name_scientific": "acaena glabra",
    "intro": "Acaena glabra, commonly known as the smooth thimbleweed, is a low-growing perennial plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, mat-forming growth habit. The plant produces small, white to pinkish flowers that bloom in spring, followed by spiny, woody fruits called achenes. Its leaves are alternate, simple, and have a hairy texture, contributing to its distinctive appearance. Acaena glabra is often found in moist, shaded areas and is adapted to thrive in temperate climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena glabra"
    },
    "taxonomy_art_desc": "Acaena glabra belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Rosales, which consists of flowering plants with a wide range of forms, including roses, apples, and hawthorns. Its family is Rosaceae, known for its diverse flowering plants, many of which are economically significant for fruit and ornamental purposes. Its genus is Acaena, a group of flowering plants commonly known as \"bursaria\" or \"mouse-ear,\" typically found in temperate regions. Its species is Acaena glabra, a specific type within the genus Acaena characterized by its smooth, glabrous stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena glabra is primarily native to New Zealand South. It is commonly found in the southern regions of New Zealand, including the South Island. This plant typically grows in coastal areas, shrublands, and rocky habitats. It is well adapted to the temperate climate and nutrient-poor soils of its native range. Acaena glabra plays an important ecological role in its environment, supporting local wildlife and contributing to soil stability.",
    "distribution_introduced_art_desc": "Acaena glabra was mainly introduced to New Zealand as part of the early European settlement and land clearing efforts. It was brought for its hardy nature and ability to thrive in disturbed soils. The plant has since spread widely across various habitats, including grasslands and shrublands. Its introduction has led to it becoming an invasive species in some areas, outcompeting native flora. Despite its ecological impact, it remains a common component of the New Zealand flora."
}
