{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sanguisorbae var. brevibracteata",
    "plant_slug": "acaena-sanguisorbae-var-brevibracteata",
    "plant_name_scientific": "acaena sanguisorbae var. brevibracteata",
    "intro": "Acaena sanguisorbae var. brevibracteata, commonly known as the short-bracted burrplant, is a low-growing perennial shrub native to New Zealand. It features dense clusters of small, spiny, globe-shaped fruits that are characteristic of the genus Acaena. The plant has dark green, leathery leaves that are often covered in fine hairs. It thrives in well-drained soils and is typically found in coastal and subalpine regions. The species is valued for its ornamental appeal and ecological role in stabilizing soil in harsh environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sanguisorbae var. brevibracteata is primarily native to New Zealand. It is found in the South Island, particularly in the Canterbury and Otago regions. This plant typically grows in open, sunny habitats such as grasslands, shrublands, and rocky areas. It is adapted to the temperate climate and well-drained soils of these regions. The variety is known for its distinctive bract structure and is part of the genus Acaena, which is commonly referred to as \"mouse-ear\" or \"burr clover.\"",
    "distribution_introduced_art_desc": "Acaena sanguisorbae var. brevibracteata was mainly introduced to New Zealand. It was brought there as a potential ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive, outcompeting native species in various ecosystems. Its spread has been facilitated by its ability to thrive in disturbed soils and its prolific seed production. Conservation efforts are now underway to control its spread and protect native biodiversity."
}
