{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena microphylla",
    "plant_slug": "acaena-microphylla",
    "plant_name_scientific": "acaena microphylla",
    "intro": "Acaena microphylla, commonly known as New Zealand thistle, is a flowering plant native to New Zealand. It is a member of the family Rosaceae and is characterized by its small, woolly leaves and showy yellow flowers. The plant produces bracts that form a spiny, spherical structure, which helps protect its seeds. It thrives in a variety of habitats, including forests, grasslands, and coastal areas. Acaena microphylla is also known for its ability to form dense colonies, which can sometimes become invasive in non-native environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena microphylla"
    },
    "taxonomy_art_desc": "Acaena microphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Rosales, which consists of flowering plants known for their diverse forms and includes many fruit-bearing plants. Its family is Rosaceae, commonly known as the rose family, which includes roses, apples, and strawberries. Its genus is Acaena, a group of flowering plants commonly known as \"burnet\" or \"mouse-ear,\" characterized by their small, spiny fruits. Its species is Acaena microphylla, a specific type of plant within the genus Acaena, known for its small leaves and distinctive fruit structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand North",
        "New Zealand South"
    ],
    "distribution_introduced": [
        "Czechia-Slovakia"
    ],
    "distribution_native_art_desc": "Acaena microphylla is primarily native to New Zealand North and New Zealand South. It is commonly found in a variety of habitats including grasslands, shrublands, and coastal areas. This plant is well adapted to the temperate climate of New Zealand. It plays an important ecological role in its native environment. Its distribution reflects its historical range across both the North and South Islands of New Zealand.",
    "distribution_introduced_art_desc": "Acaena microphylla was mainly introduced to Czechia-Slovakia as an ornamental plant due to its attractive foliage and compact growth habit. It is commonly found in gardens and landscaped areas, where it is valued for its aesthetic appeal. However, it has also been reported to naturalize in some regions, raising concerns about its potential invasiveness. The plant is typically found in disturbed soils and can thrive in a variety of environmental conditions. Its introduction has led to discussions about its ecological impact in local ecosystems."
}
