{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena magellanica var. subtuspilosa",
    "plant_slug": "acaena-magellanica-var-subtuspilosa",
    "plant_name_scientific": "acaena magellanica var. subtuspilosa",
    "intro": "Acaena magellanica var. subtuspilosa, commonly known as the Magellanic burrplant, is a low-growing shrub native to South America. It is characterized by its dense, mat-forming growth habit and produces small, spiny fruits that are adapted for animal dispersal. The plant features compound leaves with numerous small, oval-shaped leaflets, and its flowers are typically yellow or greenish-yellow. It thrives in temperate climates and is often found in coastal and subantarctic regions. The species is notable for its ability to colonize disturbed soils and its ecological role in stabilizing coastal ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena magellanica var. subtuspilosa is primarily native to South America, specifically Chile and Argentina. It is commonly found in the southern regions of these countries, particularly in the Patagonian steppe and surrounding areas. This plant thrives in dry, open habitats such as grasslands and rocky slopes. It is well adapted to the harsh climate of the Southern Hemisphere, with its small, spiny fruits providing protection and aiding in seed dispersal. Its distribution is closely linked to the unique ecological conditions of the Andean and Patagonian regions.",
    "distribution_introduced_art_desc": "Acaena magellanica var. subtuspilosa was mainly introduced to New Zealand. It was brought there as part of the broader introduction of Acaena species for ornamental purposes. This variety is known for its distinctive yellowish-green foliage and small, spiny fruits. It has since become naturalized in certain regions, particularly in coastal and disturbed areas. However, its spread is limited compared to other Acaena species in the region."
}
