{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena × eglochidiata",
    "plant_slug": "acaena-×-eglochidiata",
    "plant_name_scientific": "acaena × eglochidiata",
    "intro": "Acaena × eglochidiata, commonly known as the coastal brambles or New Zealand thistles, is a hybrid shrub native to New Zealand. It is characterized by its dense, spiny growth habit and produces small, showy yellow flowers. The plant has compound leaves with serrated edges and is often found in coastal and subalpine regions. It plays a role in stabilizing soils and providing habitat for native wildlife. However, it can become invasive in certain environments if not managed properly.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena × eglochidiata is primarily native to South America, specifically the Andean region. This plant is found in countries such as Argentina, Bolivia, Chile, and Peru. It thrives in high-altitude environments, often in mountainous areas with cool and temperate climates. The species is commonly associated with rocky soils and is part of the native flora in these regions. It plays a role in local ecosystems and is sometimes used in traditional practices by indigenous communities.",
    "distribution_introduced_art_desc": "Acaena × eglochidiata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It is a hybrid species resulting from the cross between Acaena forsteri and Acaena berteroi. Despite its ornamental value, it has become invasive in some regions, outcompeting native vegetation and altering local ecosystems. The plant thrives in a variety of soil types and is particularly common in disturbed areas such as roadsides and forest margins. Its rapid spread has led to increased management efforts to control its impact on native biodiversity."
}
