{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pterocarpa",
    "plant_slug": "acaena-pterocarpa",
    "plant_name_scientific": "acaena pterocarpa",
    "intro": "Acaena pterocarpa, commonly known as the mountain nettle, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its hairy, spiny stems and small, clustered flowers. The plant produces bright yellow flowers that are followed by distinctive, three-lobed, berry-like fruits. Its leaves are alternate, ovate, and often have serrated edges. Acaena pterocarpa is adapted to grow in rocky and alpine environments, showcasing its resilience in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pterocarpa is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate and subpolar climates, often growing in mountainous areas and on rocky slopes. This plant thrives in well-drained soils and is adapted to cooler, moist environments. It is part of the Rosaceae family and is known for its small, thorny stems and yellow flowers. Acaena pterocarpa plays an important ecological role in its native habitats, supporting local wildlife and contributing to biodiversity.",
    "distribution_introduced_art_desc": "Acaena pterocarpa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, spreading rapidly in natural ecosystems. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its rapid growth and ability to form dense stands have led to concerns about its impact on native biodiversity."
}
