{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena ovalifolia var. cadilla",
    "plant_slug": "acaena-ovalifolia-var-cadilla",
    "plant_name_scientific": "acaena ovalifolia var. cadilla",
    "intro": "Acaena ovalifolia var. cadilla, commonly known as the Cadilla burr bush, is a shrub native to South America, particularly found in regions of Argentina and Chile. It is characterized by its dense, spiny growth habit and produces small, yellowish flowers that bloom in spring. The plant's unique feature is its fruiting bodies, which are spherical, woody capsules containing numerous seeds. These capsules are often referred to as \"burs\" and are adapted for dispersal by attaching to the fur of animals. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardy nature and distinctive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena ovalifolia var. cadilla is primarily native to the western and central regions of South America, particularly in Argentina, Bolivia, and Chile. It is commonly found in dry to semi-arid habitats, including grasslands, shrublands, and rocky slopes. This variety thrives in temperate to subtropical climates and is often associated with disturbed or open soil environments. Its distribution is closely linked to the Andean mountain range, where it occupies a variety of ecological niches. The plant is well adapted to the region's climate and plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acaena ovalifolia var. cadilla was mainly introduced to control erosion and stabilize soil in degraded areas. It is commonly used in restoration projects due to its ability to thrive in poor soil conditions. The plant forms dense mats that help prevent soil erosion and reduce sediment runoff. It is particularly effective in coastal and sandy environments. However, its rapid growth can sometimes lead to competition with native vegetation."
}
