{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena lappacea",
    "plant_slug": "acaena-lappacea",
    "plant_name_scientific": "acaena lappacea",
    "intro": "Acaena lappacea, commonly known as the New Zealand burr bush, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, thorny growth habit. The plant produces small, yellowish flowers followed by distinctive, spherical fruits that contain numerous seeds. Its leaves are typically alternate and have a serrated edge, while its stems are woody and often covered in spines. Acaena lappacea is adapted to a variety of soil types and is often found in coastal and inland scrub habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena lappacea is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate and subpolar climates, often in areas with rocky or coastal soils. This plant thrives in open habitats such as grasslands, shrublands, and coastal dunes. It is well adapted to harsh environmental conditions, including strong winds and salt spray. Its distribution is closely linked to the unique ecological zones of the southern Andes and the Patagonian region.",
    "distribution_introduced_art_desc": "Acaena lappacea was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized in various regions, particularly in the North Island. It thrives in disturbed soils and can be found in areas with moderate to high rainfall. However, it is considered a potential weed in some parts of its introduced range."
}
