{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena minor var. minor",
    "plant_slug": "acaena-minor-var-minor",
    "plant_name_scientific": "acaena minor var. minor",
    "intro": "Acaena minor var. minor, commonly known as New Zealand spinach, is a low-growing perennial plant native to New Zealand. It features small, trifoliate leaves and produces yellow flowers that develop into spiny, berry-like fruits. The plant is adapted to temperate climates and thrives in well-drained soils. It is often cultivated for its edible leaves, which are similar in taste to spinach. However, the plant is also known for its ornamental value due to its compact growth habit and attractive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena minor"
    },
    "taxonomy_art_desc": "Acaena minor var. minor belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Rosales, a group of flowering plants that includes the rose family and is known for its diverse forms and ecological importance. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs, trees, and herbs with showy flowers and economically significant fruits. Its genus is Acaena, a group of flowering plants commonly known as \"burnet\" or \"mouse-ear,\" typically found in temperate regions. Its species is Acaena minor, a specific variety within the genus Acaena, characterized by its small, thorny stems and yellow flowers, commonly found in New Zealand.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Antipodean Is.",
        "Macquarie Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena minor var. minor is primarily native to the Antipodean Islands and Macquarie Island. This plant is found in the Southern Ocean region, specifically on these remote islands. It thrives in coastal and subantarctic environments, often in rocky or sandy soils. The species is adapted to the harsh climatic conditions of these southern territories. Its distribution is limited to these specific locations, reflecting its ecological niche in the southern hemisphere.",
    "distribution_introduced_art_desc": "Acaena minor var. minor was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized in various regions of the country. It is commonly found in coastal and subalpine areas, often forming dense mats. Its introduction has had both ecological and horticultural impacts in its new environment."
}
