{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena hieronymi var. robusta",
    "plant_slug": "acaena-hieronymi-var-robusta",
    "plant_name_scientific": "acaena hieronymi var. robusta",
    "intro": "Acaena hieronymi var. robusta, commonly known as the robust acaena, is a shrub native to South America, particularly Chile. It belongs to the family Rosaceae and is characterized by its dense, prickly foliage and small, spherical fruits. The plant produces yellow flowers that bloom in spring, followed by the development of hard, dry fruits that contain seeds. It thrives in temperate climates and is often found in coastal and mountainous regions. Due to its hardy nature, it is sometimes cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena hieronymi var. robusta is primarily native to the temperate regions of South America, specifically Chile and Argentina. It is commonly found in the central and southern parts of these countries, particularly in areas with a Mediterranean climate. This plant thrives in rocky soils and open habitats such as grasslands and shrublands. It is often associated with coastal and inland regions where the climate is relatively dry. Due to its specific habitat requirements, its distribution is limited to these particular geographic areas.",
    "distribution_introduced_art_desc": "Acaena hieronymi var. robusta was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species with potential ecological impacts. This variety is known for its robust growth and ability to thrive in a variety of environmental conditions. It has since become established in certain regions, raising concerns about its potential to invade native ecosystems. Its introduction highlights the importance of monitoring non-native plant species for their ecological effects."
}
