{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pearcei var. glabrinervis",
    "plant_slug": "acaena-pearcei-var-glabrinervis",
    "plant_name_scientific": "acaena pearcei var. glabrinervis",
    "intro": "Acaena pearcei var. glabrinervis, commonly known as the smooth-veined New Zealand brake, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, clustered flowers and spiny fruit structures. The leaves are alternate, with a smooth, glabrous surface and prominent, parallel veins. This variety is distinguished by its reduced pubescence compared to other varieties of Acaena pearcei. It thrives in moist, shaded environments and is often found in forest understoreys.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pearcei var. glabrinervis is primarily native to the eastern and central parts of New Zealand. It is commonly found in coastal and lowland areas, particularly in the North Island and parts of the South Island. This variant thrives in a variety of habitats, including grasslands, shrublands, and rocky slopes. It is often associated with disturbed soils and can be found in both natural and anthropogenic environments. The plant is an important component of the local flora and is well adapted to the temperate climate of New Zealand.",
    "distribution_introduced_art_desc": "Acaena pearcei var. glabrinervis was mainly introduced to New Zealand. It was brought there as a horticultural ornamental due to its attractive foliage and potential for erosion control. However, it has since become an invasive species, spreading rapidly in native habitats. Its introduction has led to competition with native plants and disruption of local ecosystems. Management efforts are ongoing to control its spread and mitigate its environmental impact."
}
