{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pinnatifida var. elatior",
    "plant_slug": "acaena-pinnatifida-var-elatior",
    "plant_name_scientific": "acaena pinnatifida var. elatior",
    "intro": "Acaena pinnatifida var. elatior, commonly known as the tall bentweed, is a flowering plant native to New Zealand. It is a member of the Rosaceae family and is characterized by its prickly, bristly stems and small, inconspicuous flowers. The plant produces yellowish-green flowers that bloom in spring, followed by bright orange to red berries. Its leaves are alternate, pinnately compound, and have serrated edges, contributing to its distinctive appearance. This species thrives in moist, temperate climates and is often found in forest margins and along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pinnatifida var. elatior is primarily native to New Zealand. It is found in the northern and central regions of the country, including the North Island and parts of the South Island. This plant typically grows in open habitats such as grasslands, scrublands, and coastal areas. It is well adapted to the temperate climate and can thrive in a variety of soil types. Its distribution is closely associated with the ecological zones of New Zealand's native vegetation.",
    "distribution_introduced_art_desc": "Acaena pinnatifida var. elatior was mainly introduced to New Zealand. It was brought there as part of the European flora introduced during the colonial period. This plant has since become naturalized and is now found in various habitats across the country. It is commonly associated with disturbed soils and can thrive in a range of environmental conditions. However, it is considered a potential weed in some regions due to its ability to spread rapidly."
}
