{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena alpina",
    "plant_slug": "acaena-alpina",
    "plant_name_scientific": "acaena alpina",
    "intro": "Acaena alpina, commonly known as the Alpine woodrose, is a low-growing shrub native to the mountainous regions of South America. It belongs to the family Rosaceae and is characterized by its dense, spiny stems and small, clustered flowers. The plant produces yellowish to reddish flowers that bloom in spring, followed by red, berry-like fruits. Its leaves are alternate, simple, and often covered in fine hairs. Acaena alpina is well adapted to harsh alpine environments, thriving in rocky soils and cold climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena alpina"
    },
    "taxonomy_art_desc": "Acaena alpina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with diverse structures and includes many economically important species. Its order is Rosales, which consists of flowering plants with simple flowers and includes well-known families like Rosaceae. Its family is Rosaceae, commonly known as the rose family, which includes plants with showy flowers and fruits like apples and strawberries. Its genus is Acaena, a group of flowering plants typically found in temperate regions, characterized by their spiny structures and small flowers. Its species is Acaena alpina, a specific type of plant native to alpine regions, known for its hardy nature and ability to thrive in cold climates.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Argentina South",
        "Chile Central",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena alpina is primarily native to Argentina Northwest, Argentina South, Chile Central, and Chile South. This plant is commonly found in high-altitude regions within these areas. It thrives in alpine and subalpine environments, often growing on rocky slopes and in grasslands. Acaena alpina is well adapted to the cold and harsh climatic conditions of its native range. Its distribution is largely restricted to these specific geographic regions in South America.",
    "distribution_introduced_art_desc": "Acaena alpina was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized in various regions of the country. It is commonly found in coastal and inland areas, often in disturbed or open habitats. Its introduction has had both ecological and agricultural impacts."
}
