{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena krausei var. hirsuta",
    "plant_slug": "acaena-krausei-var-hirsuta",
    "plant_name_scientific": "acaena krausei var. hirsuta",
    "intro": "Acaena krausei var. hirsuta, commonly known as the hairy spinulose burr, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny foliage and produces small, red, berry-like fruits that are edible for some bird species. The plant thrives in moist, shaded environments and is often found in forest understories. Its hairy leaves and persistent fruits contribute to its distinctive appearance and ecological role. The species is valued for its ornamental qualities and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena krausei var. hirsuta is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the Andean foothills and surrounding areas. This plant thrives in dry, rocky, and often sunny habitats, such as slopes and grasslands. It is well adapted to the climate and soil conditions of its native range. Its distribution is largely restricted to the southern parts of South America where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acaena krausei var. hirsuta was mainly introduced to New Zealand. It was brought there as part of the ornamental plant trade due to its attractive, fuzzy foliage and small flowers. This variety is now considered an invasive species in some regions of New Zealand, where it outcompetes native vegetation. It thrives in a variety of soil types and can spread rapidly in disturbed areas. Efforts are ongoing to control its spread and protect local ecosystems."
}
