{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena emittens",
    "plant_slug": "acaena-emittens",
    "plant_name_scientific": "acaena emittens",
    "intro": "Acaena emittens, commonly known as the spreading burr bush, is a low-growing shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, mat-forming growth habit. The plant produces small, yellowish flowers that bloom in early spring, followed by the development of spiny, berry-like fruits. Its foliage consists of simple, alternate leaves with a rough, hairy texture. Acaena emittens is adapted to rocky and coastal environments, showcasing its resilience to harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena emittens"
    },
    "taxonomy_art_desc": "Acaena emittens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Rosales, which comprises flowering plants with a wide range of growth forms, including shrubs and trees. Its family is Rosaceae, commonly known as the rose family, which includes many ornamental and fruit-bearing plants. Its genus is Acaena, a group of flowering plants commonly known as \"burs\" due to their prickly fruits, often found in temperate regions. Its species is Acaena emittens, a specific type within the Acaena genus known for its distinctive appearance and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena emittens is primarily native to New Zealand North. It is found in the northern regions of New Zealand, including the North Island and parts of the South Island. This plant typically grows in coastal and subalpine habitats. It is commonly associated with rocky and gravelly soils. Acaena emittens is part of the native flora that contributes to the ecological diversity of New Zealand's northern environments.",
    "distribution_introduced_art_desc": "Acaena emittens was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century. The plant was initially planted for ornamental purposes due to its attractive yellow flowers. However, it has since become a weed in some areas, outcompeting native vegetation. Its spread has raised concerns among conservationists in New Zealand."
}
