{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena incisa",
    "plant_slug": "acaena-incisa",
    "plant_name_scientific": "acaena incisa",
    "intro": "Acaena incisa, commonly known as the New Zealand burr bush, is a flowering plant native to New Zealand. It is a member of the Rosaceae family and is characterized by its spiny, bramble-like growth habit. The plant produces small, yellowish flowers that are followed by distinctive, woody, spiky fruits known as achenes. Acaena incisa thrives in a variety of soil types and is often found in coastal and mountainous regions. Its unique morphology and ecological role make it an important species in New Zealand's native flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena incisa is primarily native to New Zealand. It is found throughout the country, including the North and South Islands. The plant thrives in a variety of habitats, such as forests, shrublands, and coastal areas. It is commonly associated with the northern and eastern regions of New Zealand. Acaena incisa is part of the Rubiaceae family and is known for its small, spiky fruits.",
    "distribution_introduced_art_desc": "Acaena incisa was mainly introduced to New Zealand as part of the European flora during the 19th century. It was initially brought for ornamental purposes due to its attractive, bristly foliage and small, yellow flowers. However, it has since become naturalized and is now considered a weed in many parts of the country. The plant thrives in disturbed soils and can form dense stands, impacting native vegetation. Its spread has raised concerns among conservationists due to its invasive potential in certain ecosystems."
}
