{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena argentea var. humilis",
    "plant_slug": "acaena-argentea-var-humilis",
    "plant_name_scientific": "acaena argentea var. humilis",
    "intro": "Acaena argentea var. humilis, commonly known as silverweed, is a low-growing perennial plant native to New Zealand. It features small, silver-gray leaves that are covered in fine, silky hairs, giving it a distinctive appearance. The plant produces tiny, yellow flowers that bloom in clusters, followed by spiny, burr-like fruits that aid in seed dispersal. It thrives in moist, temperate climates and is often found in wetlands and along stream banks. Its unique morphology and ecological role make it an important species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena argentea var. humilis is primarily native to New Zealand. It is found in the North Island and parts of the South Island. This plant typically grows in coastal and lowland areas, often in sandy or gravelly soils. It is commonly associated with coastal dunes and open grasslands. The species is well adapted to the temperate climate and salt-laden winds of its native habitat.",
    "distribution_introduced_art_desc": "Acaena argentea var. humilis was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for ornamental purposes. This variant is known for its silver foliage and compact growth habit, making it a popular choice for garden landscapes. However, it has since become naturalized in certain areas, raising concerns about its potential ecological impact. Despite its ornamental value, its invasive tendencies have led to its classification as a noxious weed in some regions."
}
