{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena hirsuta",
    "plant_slug": "acaena-hirsuta",
    "plant_name_scientific": "acaena hirsuta",
    "intro": "Acaena hirsuta, commonly known as the hairy wood sorrel, is a low-growing perennial plant native to New Zealand. It is characterized by its trifoliate leaves, which are hairy and heart-shaped, and its distinctive yellow flowers that bloom in spring. The plant produces small, round, berry-like fruits that contain several seeds. It thrives in moist, temperate climates and is often found in forest understories or along stream banks. Acaena hirsuta has a fibrous root system and is sometimes used in traditional Māori medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena hirsuta is primarily native to South America, particularly in regions of Chile and Argentina. It is commonly found in temperate and subpolar climates, often growing in grasslands and shrublands. This species thrives in well-drained soils and is adapted to a variety of environmental conditions. It is also known to occur in parts of New Zealand, where it has been introduced. Acaena hirsuta plays an important ecological role in its native habitats, contributing to soil stability and providing food for local wildlife.",
    "distribution_introduced_art_desc": "Acaena hirsuta was mainly introduced to New Zealand. It was brought there as part of the European colonization efforts. The plant has since become naturalized in various parts of the country. It is commonly found in disturbed soils and along roadsides. However, it is considered a potential weed in some regions due to its ability to spread rapidly."
}
