{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena cylindristachya var. pilosinervis",
    "plant_slug": "acaena-cylindristachya-var-pilosinervis",
    "plant_name_scientific": "acaena cylindristachya var. pilosinervis",
    "intro": "Acaena cylindristachya var. pilosinervis, commonly known as the silky burr or silky acaena, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its distinctive, spiny, woody fruits that persist throughout the year. The plant has compound leaves with soft, hairy veins, giving it a distinctive silvery appearance. It thrives in moist, shaded environments and is often found in forest understories. The species is known for its ecological importance, providing food and habitat for various native wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena cylindristachya var. pilosinervis is primarily native to South America, particularly in regions of Argentina and Chile. This plant is commonly found in temperate grasslands and shrublands, often growing in disturbed or open habitats. It thrives in areas with well-drained soils and is adapted to the variable climate conditions of the southern Andes. The variety is distinguished by its hairy leaf veins and compact growth form. It plays a role in local ecosystems by providing food and habitat for various invertebrates and small mammals.",
    "distribution_introduced_art_desc": "Acaena cylindristachya var. pilosinervis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habit. It was commonly used in gardens and landscapes for its dense, mat-forming structure and ability to thrive in a variety of soil conditions. However, it has since become invasive, spreading beyond cultivated areas and colonizing natural habitats. Its rapid growth and seed production contribute to its success in establishing dense stands. This plant is now considered a weed in many regions of New Zealand, posing a threat to native biodiversity."
}
