{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena adscendens var. utrinqueglabrescens",
    "plant_slug": "acaena-adscendens-var-utrinqueglabrescens",
    "plant_name_scientific": "acaena adscendens var. utrinqueglabrescens",
    "intro": "Acaena adscendens var. utrinqueglabrescens, commonly known as the smooth thimbleweed, is a flowering plant native to New Zealand. It is a low-growing perennial with a mat-forming habit, characterized by its dense clusters of small, spiny fruits. The plant features alternate, hairy leaves that are often covered with fine, soft hairs, especially on the underside. Its flowers are typically pink or purple, appearing in early spring, and it thrives in moist, shaded environments. This variety is distinguished by its smooth, glabrous stems and leaves, setting it apart from other varieties of Acaena.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena adscendens var. utrinqueglabrescens is primarily native to New Zealand. It is found in the South Island, particularly in the mountainous regions of the western and central parts. This variety thrives in rocky and alpine environments, often growing in open vegetation or on slopes. It is commonly associated with the Southern Alps and the surrounding areas. The plant is well adapted to the cool, temperate climate of these regions.",
    "distribution_introduced_art_desc": "Acaena adscendens var. utrinqueglabrescens was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, fuzzy foliage and compact growth habit. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in a variety of soil types and is tolerant of both full sun and partial shade. Its spread has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
