{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena splendens var. brevisericea",
    "plant_slug": "acaena-splendens-var-brevisericea",
    "plant_name_scientific": "acaena splendens var. brevisericea",
    "intro": "Acaena splendens var. brevisericea, commonly known as the short-hairy spinster bush, is a low-growing shrub native to New Zealand. It features dense, mat-forming growth with small, oval leaves that are covered in fine, short hairs. The plant produces bright yellow flowers in early spring, followed by spherical, hairy fruits that contain several seeds. It thrives in well-drained soils and is often found in coastal and subalpine regions. Due to its ornamental value and ecological benefits, it is sometimes cultivated in gardens and restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena splendens var. brevisericea is primarily native to South America, specifically found in regions of Chile and Argentina. This plant thrives in temperate climates and is commonly found in grasslands and shrublands. It is adapted to well-drained soils and can tolerate seasonal droughts. The species is often associated with coastal and inland areas where it forms part of the local flora. Its distribution is limited to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acaena splendens var. brevisericea was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowers. This species has since become naturalized in certain regions, particularly in the North Island. It is commonly found in disturbed areas such as roadsides and forest margins. However, it is not considered invasive and has limited ecological impact in its introduced range."
}
