{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena novemdentata",
    "plant_slug": "acaena-novemdentata",
    "plant_name_scientific": "acaena novemdentata",
    "intro": "Acaena novemdentata, commonly known as the nine-toothed burrplant, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its woody stems and spiny, bristly fruits. The plant produces small, yellowish flowers that bloom in spring, followed by the distinctive, three-lobed, prickly fruits. Its leaves are alternate, simple, and have a serrated margin, contributing to its unique appearance. Acaena novemdentata is often found in coastal and subalpine regions, where it thrives in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena novemdentata is primarily native to New Zealand. It is found throughout the country, particularly in the North and South Islands. This plant thrives in a variety of habitats, including forests, shrublands, and coastal areas. It is commonly associated with the vegetation of the upper North Island and the southern regions of the South Island. Acaena novemdentata is an important component of the native flora in these areas.",
    "distribution_introduced_art_desc": "Acaena novemdentata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It was later found to be invasive, spreading rapidly in native ecosystems and outcompeting indigenous plant species. The plant thrives in a variety of soil types and is particularly successful in disturbed areas such as roadsides and forest margins. Its spread has led to management efforts aimed at controlling its population to protect biodiversity. Despite its ornamental value, its invasive tendencies have made it a concern for ecological conservation in New Zealand."
}
