{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena saccaticupula",
    "plant_slug": "acaena-saccaticupula",
    "plant_name_scientific": "acaena saccaticupula",
    "intro": "Acaena saccaticupula, commonly known as the cup-shaped burr plant, is a species of flowering plant in the genus Acaena, which belongs to the family Rosaceae. It is native to New Zealand and is characterized by its distinctive, spiny, cup-shaped fruits that contain seeds. The plant typically grows in coastal and subalpine habitats, where it thrives in well-drained soils. Its foliage consists of alternate, trifoliate leaves, and it produces small white or pinkish flowers. Acaena saccaticupula is known for its ecological role in stabilizing soils and providing food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena saccaticupula"
    },
    "taxonomy_art_desc": "Acaena saccaticupula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem, roots, and leaves. Its class is Equisetopsida, which includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other plants with showy flowers and often thorny stems. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and trees with simple leaves and flowers that have five petals. Its genus is Acaena, a group of flowering plants commonly known as \"thornbushes\" or \"pincushion plants,\" characterized by their spiny stems and small flowers. Its species is Acaena saccaticupula, a specific type of thornbush found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena saccaticupula is primarily native to the South Island of New Zealand. It is commonly found in the southern regions, including the Marlborough and Otago areas. This plant typically grows in dry, open habitats such as grasslands and heathlands. It is well adapted to the temperate climate and nutrient-poor soils of its native range. Its distribution is largely restricted to the southern parts of the country.",
    "distribution_introduced_art_desc": "Acaena saccaticupula was mainly introduced to New Zealand. It was brought there as part of the ornamental plant trade. The plant has since become naturalized in several regions of the country. It is now considered a weed in some areas due to its aggressive growth habit. Its distribution is primarily confined to the northern and central parts of New Zealand."
}
