{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena ovalifolia var. subsexjuga",
    "plant_slug": "acaena-ovalifolia-var-subsexjuga",
    "plant_name_scientific": "acaena ovalifolia var. subsexjuga",
    "intro": "Acaena ovalifolia var. subsexjuga, commonly known as the narrow-leaved burr plant, is a low-growing shrub native to New Zealand. It features dense, mat-forming growth with small, oval-shaped leaves that are often hairy on the underside. The plant produces spherical, prickly burrs that contain seeds, a characteristic feature of the genus Acaena. Its flowers are small and yellow, typically appearing in clusters, and it thrives in dry, open habitats. This variety is distinguished by its narrower leaves compared to other Acaena species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena ovalifolia var. subsexjuga is primarily native to the western South Island of New Zealand. It is commonly found in the lower elevations of the region, particularly in coastal and lowland areas. This variety thrives in sandy or gravelly soils and is often associated with open vegetation such as scrub and coastal dunes. It is adapted to the temperate climate of New Zealand, with mild winters and warm, dry summers. The plant plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acaena ovalifolia var. subsexjuga was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for ornamental purposes. This variety is commonly found in coastal and lowland areas, where it thrives in well-drained soils. It has since become naturalized in certain regions, sometimes posing a challenge to native vegetation. Its introduction highlights the ecological impacts of non-native plant species in invaded habitats."
}
