{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pinnatifida var. longifolia",
    "plant_slug": "acaena-pinnatifida-var-longifolia",
    "plant_name_scientific": "acaena pinnatifida var. longifolia",
    "intro": "Acaena pinnatifida var. longifolia, commonly known as the long-leaved burr bush, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its woody stems and dense, spiny foliage. The plant produces small, yellow flowers that are followed by spherical, prickly fruits containing seeds. Its leaves are pinnately divided, with long, slender lobes, and it thrives in coastal and inland areas with well-drained soils. It is often used in ecological restoration projects due to its ability to stabilize soil and provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pinnatifida var. longifolia is primarily native to New Zealand. It is commonly found in the South Island, particularly in the Marlborough and Canterbury regions. This plant thrives in coastal and lowland areas, often growing in sandy or gravelly soils. It is a member of the rose family and is known for its spiny, shrub-like appearance. The variety longifolia is distinguished by its longer leaves compared to other varieties of Acaena pinnatifida.",
    "distribution_introduced_art_desc": "Acaena pinnatifida var. longifolia was mainly introduced to New Zealand. It was brought there during the 19th century as part of the ornamental plant trade. The plant has since become naturalized and is now found in various regions across the country. It thrives in a range of soil types and is often found in disturbed areas and along roadsides. However, it is considered a potential weed in some parts of its range."
}
