{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena macropoda",
    "plant_slug": "acaena-macropoda",
    "plant_name_scientific": "acaena macropoda",
    "intro": "Acaena macropoda, commonly known as the New Zealand spinach or mountain spinach, is a flowering plant native to New Zealand. It is a member of the rose family (Rosaceae) and is characterized by its dense, spiny growth habit. The plant produces small, yellow flowers that develop into spherical, woody fruits containing numerous seeds. Its leaves are edible and have a spinach-like flavor, making it a traditional food source for Māori. Acaena macropoda thrives in moist, temperate climates and is often found in forested areas and along streambanks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena macropoda is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the Andes Mountains. This plant thrives in dry, rocky soils and is often seen in open habitats such as grasslands and shrublands. It is well adapted to the climate and environmental conditions of its native range. Acaena macropoda plays an important ecological role in its native ecosystems.",
    "distribution_introduced_art_desc": "Acaena macropoda was mainly introduced to New Zealand. It was brought there as a potential ornamental plant due to its attractive foliage and unique appearance. However, it has since become an invasive species, spreading rapidly in native ecosystems. The plant's ability to thrive in disturbed soils and its prolific seed production contribute to its invasive nature. It poses a significant threat to biodiversity by outcompeting native plants for resources."
}
