{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sanguisorbae var. epilasia",
    "plant_slug": "acaena-sanguisorbae-var-epilasia",
    "plant_name_scientific": "acaena sanguisorbae var. epilasia",
    "intro": "Acaena sanguisorbae var. epilasia, commonly known as the New Zealand bramble, is a shrub native to New Zealand. It features small, spiny stems and produces bright red berries that are attractive to birds. The plant has compound leaves with serrated edges, and its flowers are typically yellow or orange, appearing in clusters. It thrives in moist, shaded environments and is often found in forested areas. The species is noted for its ornamental value and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sanguisorbae var. epilasia is primarily native to New Zealand. It is found in the North Island and parts of the South Island. This plant typically grows in moist, well-drained soils in forested areas. It is often associated with the understory of native forests and is part of the local flora. The variety is known for its distinctive spiny fruits and is adapted to the temperate climate of New Zealand.",
    "distribution_introduced_art_desc": "Acaena sanguisorbae var. epilasia was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species with similar ecological characteristics. This variant is particularly noted for its ability to thrive in disturbed soils and its potential to outcompete native vegetation. Its introduction has led to concerns about its impact on local ecosystems and biodiversity. Due to its invasive tendencies, it is now considered a potential weed in certain regions of New Zealand."
}
