{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sarmentosa",
    "plant_slug": "acaena-sarmentosa",
    "plant_name_scientific": "acaena sarmentosa",
    "intro": "Acaena sarmentosa, commonly known as the trailing acaena, is a perennial shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its creeping growth habit with numerous stolons. The plant produces small, yellowish flowers that are clustered in dense inflorescences. Its fruit is a dry, hairy achene, which is adapted for wind dispersal. Acaena sarmentosa is often found in coastal and subalpine regions, where it thrives in well-drained soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena sarmentosa"
    },
    "taxonomy_art_desc": "Acaena sarmentosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Rosales, which is a group of flowering plants that includes roses, strawberries, and other related species. Its family is Rosaceae, known as the rose family, which includes a wide variety of plants with showy flowers and fruits. Its genus is Acaena, a group of flowering plants commonly known as the \"burs\" or \"mouse-ear\" plants, characterized by their spiny fruits. Its species is Acaena sarmentosa, a specific type of plant within the Acaena genus known for its creeping growth habit and small, spiny fruits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tristan da Cunha"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sarmentosa is primarily native to Tristan da Cunha. This plant is found in the southern Atlantic Ocean, specifically on the island of Tristan da Cunha. It thrives in the region's temperate climate and rocky coastal habitats. Acaena sarmentosa is well adapted to the harsh environmental conditions of the island. It plays an important ecological role in the local flora of Tristan da Cunha.",
    "distribution_introduced_art_desc": "Acaena sarmentosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering. However, it has since become invasive, outcompeting native vegetation in various regions. The plant thrives in a variety of soil types and is particularly persistent in disturbed areas. Its spread has led to concerns over its ecological impact on local ecosystems."
}
