{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena chubutensis",
    "plant_slug": "acaena-chubutensis",
    "plant_name_scientific": "acaena chubutensis",
    "intro": "Acaena chubutensis, commonly known as the Chubut burr bush, is a shrub native to southern South America, particularly Argentina and Chile. It belongs to the family Rosaceae and is characterized by its spiny, woody stems and dense clusters of small, yellowish flowers. The plant produces distinctive, spherical, bristly fruits that contain seeds covered in hooked hairs, aiding in seed dispersal by attaching to animals. It thrives in dry, rocky environments and is adapted to withstand harsh climatic conditions. Acaena chubutensis plays an important ecological role in its native habitats, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena chubutensis is primarily native to southern South America, specifically Argentina and Chile. It is commonly found in the Patagonian region, particularly in the provinces of Chubut and Neuquén. This plant thrives in dry, temperate climates and is often found in grasslands and shrublands. It is well adapted to the harsh environmental conditions of the Andean foothills. Its distribution is closely associated with the natural vegetation of the southern Andes.",
    "distribution_introduced_art_desc": "Acaena chubutensis was mainly introduced to New Zealand. It was brought there as part of the broader introduction of South American plant species for ornamental or horticultural purposes. The plant is now considered an invasive species in some regions of New Zealand due to its aggressive growth and ability to outcompete native flora. It thrives in a variety of soil types and can establish itself in both disturbed and undisturbed habitats. Efforts to control its spread have been ongoing, but its persistence poses a challenge for conservationists."
}
