{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena pinnatifida",
    "plant_slug": "acaena-pinnatifida",
    "plant_name_scientific": "acaena pinnatifida",
    "intro": "Acaena pinnatifida, commonly known as the New Zealand brackenburry, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its prickly, spiny stems and compound leaves. The plant produces small, yellowish flowers that are typically clustered in dense inflorescences. Its fruit is a dry, woody achene that contains a single seed, and it is adapted to grow in a variety of soil types. Acaena pinnatifida plays a role in its native ecosystem, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena pinnatifida"
    },
    "taxonomy_art_desc": "Acaena pinnatifida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and apples. Its order is Rosales, a group of flowering plants that includes the rose family and is known for its diverse morphology and ecological significance. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of plants such as roses, apples, and strawberries. Its genus is Acaena, a group of flowering plants commonly known as \"cudweed\" or \"burrweed,\" characterized by their thorny stems and small, clustered flowers. Its species is Acaena pinnatifida, a specific plant within the genus Acaena, distinguished by its pinnately divided leaves and is native to New Zealand.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Argentina South",
        "California",
        "Chile Central",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena pinnatifida is primarily native to Argentina Northeast, Argentina Northwest, Argentina South, California, Chile Central, and Chile South. This plant is commonly found in temperate regions of South America and parts of California. It thrives in a variety of habitats, including grasslands, shrublands, and coastal areas. The species is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in its native ecosystems.",
    "distribution_introduced_art_desc": "Acaena pinnatifida was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century. The plant is now considered an invasive species in many parts of the country. It thrives in a variety of habitats, including forests, grasslands, and disturbed areas. Its rapid growth and ability to form dense stands have led to concerns about its impact on native ecosystems."
}
