{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena subnitens",
    "plant_slug": "acaena-subnitens",
    "plant_name_scientific": "acaena subnitens",
    "intro": "Acaena subnitens, commonly known as the silky acaena, is a species of flowering plant in the family Rosaceae. It is native to New Zealand and is characterized by its dense, mat-forming growth habit. The plant produces small, yellowish flowers that are clustered in heads, followed by distinctive, spiny fruits. Its leaves are alternate, with a silvery-green upper surface and a hairy underside. Acaena subnitens is often found in coastal and subalpine environments, where it thrives in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena subnitens is primarily native to New Zealand. It is found in the southern and western regions of the country, including the South Island and parts of the North Island. This plant typically grows in coastal and lowland areas, often in sandy or gravelly soils. It is commonly associated with open habitats such as dunes, coastal scrub, and disturbed sites. Acaena subnitens is an important component of the local flora and plays a role in stabilizing coastal environments.",
    "distribution_introduced_art_desc": "Acaena subnitens was mainly introduced to New Zealand. It was brought there as a horticultural ornamental due to its attractive foliage and growth habit. However, it has since become an invasive species, spreading rapidly in native ecosystems. Its establishment has led to competition with indigenous plants, altering local biodiversity. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
