{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaenops vulgaris",
    "plant_slug": "acaenops-vulgaris",
    "plant_name_scientific": "acaenops vulgaris",
    "intro": "Acaenops vulgaris, commonly known as the common burr plant, is a flowering plant native to parts of Europe and Asia. It is characterized by its erect, branched stems and small, oval-shaped leaves. The plant produces clusters of yellow flowers that bloom in the summer months. Its most distinctive feature is the presence of prickly, three-lobed bracts that enclose the fruits. Acaenops vulgaris is often found in disturbed soils and is considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaenops vulgaris is primarily native to South Africa. It is found in the coastal regions of the country, particularly in the Eastern and Western Cape provinces. This plant thrives in sandy soils and is commonly associated with fynbos vegetation. It is often found in areas with a Mediterranean climate, characterized by dry summers and wet winters. Acaenops vulgaris is well adapted to the specific environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acaenops vulgaris was mainly introduced to new habitats through human activity, such as horticultural trade and accidental transport. It has established itself in various regions outside its native range, including parts of Southeast Asia and the Pacific Islands. The plant thrives in disturbed soils and sunny environments, allowing it to spread rapidly in these areas. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, careful monitoring is necessary to prevent unintended ecological impacts."
}
