{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena adenocarpa var. basiinermis",
    "plant_slug": "acaena-adenocarpa-var-basiinermis",
    "plant_name_scientific": "acaena adenocarpa var. basiinermis",
    "intro": "Acaena adenocarpa var. basiinermis, commonly known as the smooth burrplant, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny foliage and small, yellowish flowers that bloom in spring. The plant produces spherical, woody fruits that contain numerous seeds, which are dispersed by wind and animals. It thrives in well-drained soils and is often found in coastal and subalpine habitats. Due to its hardy nature, it is sometimes considered an invasive species in non-native regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena adenocarpa var. basiinermis is primarily native to South America, specifically the Andean regions of Chile and Peru. This variant is commonly found in high-altitude environments, including grasslands and shrublands. It thrives in temperate climates with cool, moist conditions and well-drained soils. The plant is adapted to the rugged terrain and variable weather patterns of the Andes. It plays an important ecological role in its native habitat by providing food and habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acaena adenocarpa var. basiinermis was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for horticultural and ornamental purposes. This variant is characterized by its reduced leaf pubescence compared to the typical form. It has since become naturalized in certain regions of New Zealand, particularly in coastal and disturbed habitats. However, it is not considered invasive and does not pose a significant ecological threat."
}
