{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena capitata",
    "plant_slug": "acaena-capitata",
    "plant_name_scientific": "acaena capitata",
    "intro": "Acaena capitata, commonly known as the New Zealand bramble, is a flowering plant native to New Zealand. It is a shrub that typically grows in coastal and subalpine regions, characterized by its dense, prickly foliage. The plant produces small, yellowish-white flowers that bloom in clusters, followed by spherical, woody fruits. Its leaves are compound, with multiple pairs of leaflets, and the plant is known for its ability to thrive in harsh environmental conditions. Acaena capitata plays an important role in the local ecosystem, providing habitat and food for various native wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena capitata is primarily native to New Zealand. It is commonly found in the southern regions of the country, including the South Island and some parts of the North Island. This plant thrives in a variety of habitats, such as forests, grasslands, and coastal areas. It is well adapted to the temperate climate and can tolerate both wet and dry conditions. Acaena capitata is an important component of the local flora and plays a role in supporting native wildlife.",
    "distribution_introduced_art_desc": "Acaena capitata was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century as an ornamental plant. The species has since become naturalized and is now found in various habitats across the country. It is commonly found in disturbed areas, such as roadsides and forest margins. However, it is considered a potential weed in some regions due to its ability to spread rapidly."
}
