{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena magellanica var. glabrescens",
    "plant_slug": "acaena-magellanica-var-glabrescens",
    "plant_name_scientific": "acaena magellanica var. glabrescens",
    "intro": "Acaena magellanica var. glabrescens, commonly known as the Magellan burr, is a perennial shrub native to South America. It is characterized by its dense, spiny fruiting structures that contain seeds enclosed in a fibrous husk. The plant typically grows in coastal and subantarctic regions, thriving in sandy or gravelly soils. Its leaves are alternate, ovate, and often covered with fine hairs, while its stems are woody and branched. The species is valued for its ecological role in stabilizing coastal dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena magellanica var. glabrescens is primarily native to South America, specifically the southern regions of Chile and Argentina. It is commonly found in temperate grasslands and shrublands, often growing in well-drained soils. This variety is adapted to a variety of environmental conditions, including seasonal rainfall and cooler temperatures. It is often associated with coastal and mountainous habitats in its native range. The plant plays an important role in local ecosystems by providing food and habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acaena magellanica var. glabrescens was mainly introduced to New Zealand. It was brought there as part of the ornamental plant trade due to its attractive, fluffy seed heads. The plant has since become naturalized in certain regions, particularly in the northern and central parts of the country. It thrives in sunny, well-drained soils and is often found in disturbed areas such as roadsides and forest margins. However, it is considered a potential weed in some areas due to its ability to spread rapidly."
}
