{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena californica var. grandis",
    "plant_slug": "acaena-californica-var-grandis",
    "plant_name_scientific": "acaena californica var. grandis",
    "intro": "Acaena californica var. grandis, commonly known as the large burclover, is a perennial shrub native to California. It is characterized by its hairy, spiny stems and small, yellowish flowers that appear in late spring. The plant produces distinctive, spherical burrs that contain seeds, which are adapted for dispersal by attachment to animals or clothing. It thrives in dry, sandy soils and is often found in coastal scrub and chaparral habitats. Due to its prickly nature, it is considered a weed in some agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena californica var. grandis is primarily native to coastal and inland regions of California, particularly in the central and southern parts of the state. It thrives in a variety of habitats, including coastal bluffs, grasslands, and disturbed soils. This plant is commonly found in areas with a Mediterranean climate, characterized by dry summers and mild, wet winters. It is often associated with open, sunny environments where it can establish itself along the edges of shrublands and coastal dunes. Its distribution is largely limited to the western United States, with a strong presence in California's coastal ecosystems.",
    "distribution_introduced_art_desc": "Acaena californica var. grandis was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in restoration projects due to its ability to thrive in poor soil conditions. The plant forms dense mats that help prevent soil erosion and reduce runoff. However, it can become invasive in some regions, outcompeting native vegetation. Its introduction has led to both ecological benefits and management challenges in certain environments."
}
