{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena dumicola",
    "plant_slug": "acaena-dumicola",
    "plant_name_scientific": "acaena dumicola",
    "intro": "Acaena dumicola, commonly known as the New Zealand burr bush, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, spiny growth habit. The plant produces small, yellowish flowers that are followed by distinctive, three-lobed burrs containing seeds. Its leaves are simple, alternate, and have a slightly hairy texture. Acaena dumicola is often found in coastal and mountainous regions, thriving in well-drained soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena dumicola"
    },
    "taxonomy_art_desc": "Acaena dumicola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and retention of primitive features. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Rosales, a group of flowering plants that includes economically important families such as Rosaceae and includes plants with a variety of growth forms and habitats. Its family is Rosaceae, commonly known as the rose family, which includes shrubs, trees, and herbs with showy flowers and often edible fruits. Its genus is Acaena, a group of flowering plants commonly known as \"mouse-ear\" or \"tangi\" in New Zealand, characterized by their small, spiny fruits and often found in arid environments. Its species is Acaena dumicola, a specific type within the genus Acaena, native to New Zealand, known for its shrub-like growth and adapted to rocky and dry habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena dumicola is primarily native to the southern regions of New Zealand. It is commonly found in the South Island, particularly in areas with rocky or gravelly soils. This plant thrives in coastal and inland environments, often growing in open vegetation or on disturbed ground. It is well adapted to the temperate climate and can tolerate both dry and wet conditions. Acaena dumicola plays an important ecological role in its native habitat, contributing to soil stabilization and providing food for local wildlife.",
    "distribution_introduced_art_desc": "Acaena dumicola was mainly introduced to New Zealand. It was brought there as part of the ornamental plant trade. This species has since become naturalized and is now found in various regions across the country. It thrives in disturbed soils and can often be seen along roadsides and in forest margins. However, it is considered a potential weed in some areas due to its ability to spread rapidly."
}
