{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena hieronymi var. elegantula",
    "plant_slug": "acaena-hieronymi-var-elegantula",
    "plant_name_scientific": "acaena hieronymi var. elegantula",
    "intro": "Acaena hieronymi var. elegantula, commonly known as the elegant bullock's wheat, is a low-growing perennial plant native to New Zealand. It features dense clusters of small, spiny fruits that are typically red or orange in color. The plant has compound leaves with numerous stiff, bristle-like leaflets. It thrives in moist, shaded environments and is often found in forest undergrowth. Its botanical characteristics make it an important component of New Zealand's native flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena hieronymi var. elegantula is primarily native to the western regions of South America, specifically in Chile and Argentina. This plant is commonly found in the temperate and subpolar zones of these countries. It thrives in moist, shaded environments such as forests and rocky slopes. The species is part of the Rosaceae family and is known for its distinctive bracts and small, edible berries. Its native distribution is closely tied to the specific climatic and ecological conditions of these South American regions.",
    "distribution_introduced_art_desc": "Acaena hieronymi var. elegantula was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in a variety of soil types and is particularly successful in disturbed habitats. Its spread has raised concerns among conservationists due to its potential impact on local ecosystems."
}
