{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena krausei",
    "plant_slug": "acaena-krausei",
    "plant_name_scientific": "acaena krausei",
    "intro": "Acaena krausei, commonly known as the New Zealand thornbush, is a shrub native to New Zealand. It belongs to the family Rosaceae and is characterized by its dense, thorny stems and small, hairy leaves. The plant produces yellowish flowers that bloom in spring, followed by red, berry-like fruits that are edible for birds. Acaena krausei is adapted to a variety of soil types and is often found in coastal and forested areas. Its ecological importance includes providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena krausei is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the Valdivian rainforest and coastal areas. This plant thrives in moist, shaded environments and is often associated with forest understories. It is also present in parts of southern Brazil and the Falkland Islands. Acaena krausei plays an important ecological role in its native habitats, contributing to soil stability and providing food for local wildlife.",
    "distribution_introduced_art_desc": "Acaena krausei was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance. However, it has since become an invasive species, outcompeting native vegetation in various regions. The plant thrives in a variety of soil types and can spread rapidly through its seeds. Its introduction has led to significant ecological concerns, prompting management efforts to control its spread."
}
