{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena magellanica subsp. venulosa",
    "plant_slug": "acaena-magellanica-subsp-venulosa",
    "plant_name_scientific": "acaena magellanica subsp. venulosa",
    "intro": "Acaena magellanica subsp. venulosa, commonly known as the Magellanic burr, is a flowering plant native to southern South America. It is a perennial shrub characterized by its spiny, globe-shaped fruits that contain seeds. The plant has compound leaves with serrated margins and produces small yellow flowers in early spring. It thrives in temperate climates and is often found in coastal and mountainous regions. Its unique morphology and ecological role make it an important species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena magellanica subsp. venulosa is primarily native to South America, specifically Chile and Argentina. It is found in the temperate regions of these countries, particularly in the southern part of Chile and the western regions of Argentina. This subspecies thrives in grasslands, shrublands, and disturbed soils, often in areas with a Mediterranean climate. It is commonly associated with coastal and inland areas where the climate is cool and moist. Its distribution is limited to specific ecological zones that provide the right conditions for its growth.",
    "distribution_introduced_art_desc": "Acaena magellanica subsp. venulosa was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus for ornamental or horticultural purposes. This subspecies is now considered an invasive species in some regions of New Zealand due to its rapid spread and ecological impact. It thrives in a variety of soil types and can colonize disturbed areas quickly. Its introduction has led to concerns about its effect on native ecosystems and biodiversity."
}
