{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena minor var. antarctica",
    "plant_slug": "acaena-minor-var-antarctica",
    "plant_name_scientific": "acaena minor var. antarctica",
    "intro": "Acaena minor var. antarctica, commonly known as the Antarctic pearlwort, is a low-growing perennial plant native to the southern regions of South America. It is characterized by its dense, mat-forming growth habit and small, spiny fruits that contain nutritious seeds. The plant thrives in cold, dry environments and is often found in alpine and subantarctic regions. Its leaves are typically covered in fine hairs, which help reduce water loss in harsh climates. Acaena minor var. antarctica plays an important ecological role in stabilizing soil and providing habitat for small invertebrates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena minor"
    },
    "taxonomy_art_desc": "Acaena minor var. antarctica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient evolutionary lineage. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is distinguished by its diverse floral structures. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other plants with showy flowers and often edible fruits. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of shrubs and trees with simple leaves and flowers that typically have five petals. Its genus is Acaena, a group of flowering plants commonly known as \"spearheads\" or \"cushion plants,\" characterized by their small, spiny fruits and often used in horticulture. Its species is Acaena minor, a specific variety of Acaena known for its small, spiny fruits and its ability to thrive in harsh environments such as alpine and coastal regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Antipodean Is.",
        "Macquarie Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena minor var. antarctica is primarily native to the Antipodean Islands and Macquarie Island. This plant is found in the subantarctic regions of the Southern Hemisphere. It thrives in coastal and rocky habitats, often in areas with strong winds and cool temperatures. The species is adapted to the harsh environmental conditions of these remote islands. Its distribution is limited to these specific locations due to its specialized ecological requirements.",
    "distribution_introduced_art_desc": "Acaena minor var. antarctica was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and hardy nature. However, it has since become invasive, outcompeting native species in various ecosystems. Its spread is facilitated by its ability to thrive in a range of soil types and its prolific seed production. Conservation efforts are now underway to control its spread and protect native biodiversity."
}
