{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena hirsutula var. hirticupula",
    "plant_slug": "acaena-hirsutula-var-hirticupula",
    "plant_name_scientific": "acaena hirsutula var. hirticupula",
    "intro": "Acaena hirsutula var. hirticupula, commonly known as the hairy burr plant, is a perennial shrub native to New Zealand. It is characterized by its dense, spiny foliage and produces small, spherical fruits that contain numerous seeds. The plant has compound leaves with multiple leaflets, and its stems are often covered in fine, hairy structures. It thrives in a variety of soil types but prefers well-drained conditions. This species is often found in coastal and inland regions, contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena hirsutula"
    },
    "taxonomy_art_desc": "Acaena hirsutula var. hirticupula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their diverse floral structures. Its order is Rosales, a group of flowering plants that includes roses, strawberries, and other plants with typically simple flowers and fruits. Its family is Rosaceae, commonly known as the rose family, which includes a wide variety of plants with showy flowers and diverse fruit types. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, known for their spiny, shrub-like growth and small, clustered flowers. Its species is Acaena hirsutula, a specific type within the genus Acaena, distinguished by its hairy stems and small, yellow flowers, with the variety hirticupula exhibiting specific morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena hirsutula var. hirticupula is primarily native to the southern regions of New Zealand. This variant is commonly found in the South Island, particularly in the coastal and subalpine areas. It thrives in rocky and gravelly soils, often growing in open habitats such as coastal dunes and hillsides. The plant is well adapted to the temperate climate and strong winds of the region. It plays an important role in the local ecosystem by providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acaena hirsutula var. hirticupula was mainly introduced to New Zealand. It was brought there as a horticultural ornamental due to its attractive foliage and growth habit. This variety is commonly found in gardens and along roadsides in the North Island. It has since naturalized in some areas, posing a potential threat to native ecosystems. Its spread is often associated with human activity and the disturbance of natural habitats."
}
