{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena parvifolia",
    "plant_slug": "acaena-parvifolia",
    "plant_name_scientific": "acaena parvifolia",
    "intro": "Acaena parvifolia, commonly known as the small-leaved burrseed, is a flowering plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its small, rounded leaves and dense, spiny fruits. The plant typically grows in moist, shaded environments such as forest floors and rocky areas. Its flowers are usually white or pale yellow, and it produces achenes enclosed in a prickly bur. Acaena parvifolia plays a role in local ecosystems by providing food for various birds and small mammals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena parvifolia is primarily native to New Zealand. It is commonly found in the southern regions of the country, particularly in the South Island. This plant thrives in a variety of habitats, including grasslands, shrublands, and forest margins. It is well adapted to the temperate climate and can tolerate both dry and moist conditions. Acaena parvifolia is an important component of the local flora and plays a role in supporting native wildlife.",
    "distribution_introduced_art_desc": "Acaena parvifolia was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive yellow flowers and compact growth habit. However, it has since become invasive, spreading rapidly in native ecosystems. The plant thrives in a variety of soil types and is particularly problematic in disturbed areas. Its introduction has led to concerns about its impact on local biodiversity and land management practices."
}
