{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sericea",
    "plant_slug": "acaena-sericea",
    "plant_name_scientific": "acaena sericea",
    "intro": "Acaena sericea, commonly known as silver burr, is a flowering plant native to New Zealand. It is a member of the rose family (Rosaceae) and is characterized by its hairy stems and small, yellowish flowers. The plant produces burrs with hooked bracts that aid in seed dispersal by attaching to animals. Acaena sericea thrives in a variety of habitats, including forests, shrublands, and coastal areas. It is often found in moist, well-drained soils and can tolerate a range of environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sericea is primarily native to South America, particularly in regions of Chile and Argentina. It thrives in temperate climates and is commonly found in grasslands, shrublands, and coastal areas. This plant is well adapted to dry and sunny environments, often growing in disturbed soils. It is an important component of the native flora in these regions, contributing to local biodiversity. Acaena sericea is also known for its small, spiny fruits that provide food for various wildlife species.",
    "distribution_introduced_art_desc": "Acaena sericea was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive silver foliage and flowering stems. However, it has since become a weed in some areas, particularly in the Canterbury region. The plant spreads through seeds dispersed by birds and can form dense stands in disturbed soils. Its establishment has led to concerns about its impact on native ecosystems and agricultural land."
}
