{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena sanguisorbae var. gracilis",
    "plant_slug": "acaena-sanguisorbae-var-gracilis",
    "plant_name_scientific": "acaena sanguisorbae var. gracilis",
    "intro": "Acaena sanguisorbae var. gracilis, commonly known as the slender bristly burr, is a low-growing perennial plant native to New Zealand. It belongs to the family Rosaceae and is characterized by its hairy, spiny fruits that form dense, spherical clusters. The plant has small, alternate leaves that are typically covered in fine hairs, contributing to its distinctive appearance. It thrives in moist, well-drained soils and is often found in coastal and subalpine regions. Due to its unique morphology and ecological role, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena sanguisorbae var. gracilis is primarily native to New Zealand. It is found in the South Island, particularly in the lower South Island and parts of the North Island. This variety thrives in coastal and subalpine environments. It is commonly found in rocky soils and open vegetation types. The plant is part of the New Zealand flora and is adapted to the region's temperate climate.",
    "distribution_introduced_art_desc": "Acaena sanguisorbae var. gracilis was mainly introduced to control erosion and as an ornamental plant in garden settings. It is known for its dense growth habit and ability to thrive in disturbed soils. This plant has been reported in several regions, including parts of North America and Europe. However, it has raised concerns due to its potential to become invasive in certain environments. Its introduction has led to discussions about its ecological impact and management strategies."
}
