{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena macrocephala",
    "plant_slug": "acaena-macrocephala",
    "plant_name_scientific": "acaena macrocephala",
    "intro": "Acaena macrocephala, commonly known as New Zealand spinach or mountain spinach, is a flowering plant native to New Zealand. It is a member of the Rosaceae family and is characterized by its small, bright yellow flowers that appear in clusters. The plant produces small, round, red berries that contain seeds, which are dispersed by animals. It thrives in cool, temperate climates and is often found in mountainous regions. Acaena macrocephala is valued for its edible leaves, which have a spinach-like flavor and are used in traditional Māori cuisine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Rosales",
        "family": "Rosaceae",
        "genus": "Acaena",
        "species": "Acaena macrocephala"
    },
    "taxonomy_art_desc": "Acaena macrocephala belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which includes ferns, horsetails, and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Rosales, which consists of flowering plants with a wide range of habitats, including shrubs and trees. Its family is Rosaceae, commonly known as the rose family, which includes plants like roses, apples, and strawberries. Its genus is Acaena, a group of flowering plants native to the Southern Hemisphere, often referred to as \"mouse-ear\" or \"burr\" plants due to their distinctive seed structures. Its species is Acaena macrocephala, a specific type of Acaena plant known for its large, showy flower heads and is commonly found in New Zealand.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile Central",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena macrocephala is primarily native to Argentina South, Chile Central, and Chile South. This plant is commonly found in the temperate regions of these areas. It thrives in a variety of habitats, including grasslands and shrublands. The species is well adapted to the local climate and soil conditions. Its distribution reflects its ecological significance in the Southern Hemisphere.",
    "distribution_introduced_art_desc": "Acaena macrocephala was mainly introduced to New Zealand. It was brought there as part of the European flora during the colonial period. The plant has since become naturalized and is now found in various habitats across the country. It is commonly associated with disturbed sites and can form dense stands in grasslands and coastal areas. However, it is considered a potential weed in some regions due to its rapid growth and competitive nature."
}
