{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaena stricta var. valdepilosa",
    "plant_slug": "acaena-stricta-var-valdepilosa",
    "plant_name_scientific": "acaena stricta var. valdepilosa",
    "intro": "Acaena stricta var. valdepilosa, commonly known as the Chilean burr plant, is a flowering plant native to southern South America. It belongs to the family Rosaceae and is characterized by its dense, thorny growth habit. The plant produces small, yellowish flowers that bloom in spring, followed by red, spherical fruits that contain seeds. Its leaves are alternate, simple, and often covered with fine hairs. The species is adapted to dry, rocky environments and is often found in coastal and mountainous regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaena stricta var. valdepilosa is primarily native to southern South America, specifically Chile and Argentina. It is commonly found in the temperate regions of these countries, particularly in the Andes foothills. This plant thrives in dry, rocky, and often sunny habitats. It is well adapted to the Mediterranean climate of the region, with mild, wet winters and dry summers. Its distribution is largely restricted to the western part of South America, where it grows in open grasslands and shrublands.",
    "distribution_introduced_art_desc": "Acaena stricta var. valdepilosa was mainly introduced to New Zealand. It was brought there as part of the broader introduction of the Acaena genus, which includes several species valued for their ornamental and ecological properties. The plant has since become naturalized in certain regions, particularly in the southern and western parts of the country. It thrives in a variety of soil types but prefers well-drained conditions. However, it is considered a potential weed in some areas due to its ability to spread aggressively."
}
