{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acajuba occidentalis",
    "plant_slug": "acajuba-occidentalis",
    "plant_name_scientific": "acajuba occidentalis",
    "intro": "Acajuba occidentalis, commonly known as the West Indian mahogany, is a tropical tree native to the Caribbean and parts of Central America. It belongs to the family Rubiaceae and is characterized by its glossy, dark green leaves and fragrant white flowers. The tree produces small, red fruits that contain a single seed, which is often used in traditional medicine. Its wood is highly valued for its durability and fine grain, making it a significant resource in local economies. However, due to overharvesting and habitat loss, it is now considered an endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acajuba occidentalis is primarily native to the tropical regions of South America, particularly Brazil, Colombia, and Peru. It is commonly found in the Amazon rainforest and other humid lowland areas. This plant thrives in moist, shaded environments and is often associated with riverine forests. It is an important component of the local flora and plays a role in the ecosystem by providing habitat and food for various species. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acajuba occidentalis was mainly introduced to the Caribbean region for its ornamental value and potential use in traditional medicine. It has been documented in several islands including Cuba, Hispaniola, and Jamaica. The plant thrives in tropical and subtropical climates, often growing in disturbed habitats such as roadsides and clearings. Due to its rapid growth and ability to spread through seeds, it has become an invasive species in some areas. Conservation efforts are underway to manage its spread and protect native flora."
}
