{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha retifera",
    "plant_slug": "acalypha-retifera",
    "plant_name_scientific": "acalypha retifera",
    "intro": "Acalypha retifera, commonly known as the spiked glorybower, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, showy bracts that resemble flowers. The plant typically grows as an upright shrub with opposite, ovate leaves that are often glossy and dark green. Its small, inconspicuous flowers are clustered in cyathia, typical of the Euphorbiaceae family. Acalypha retifera is valued for its ornamental appeal and is often cultivated in gardens for its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha retifera"
    },
    "taxonomy_art_desc": "Acalypha retifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical species and is known for its diverse morphology and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup-bearing plants,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha retifera, a specific plant within the genus Acalypha known for its distinctive features and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Honduras"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha retifera is primarily native to Honduras. It is found in the tropical regions of the country, particularly in humid lowland areas. This plant thrives in shaded to semi-shaded environments within tropical forests. It is commonly observed in the understory vegetation of these forests. Its distribution is limited to specific ecological niches within Honduras.",
    "distribution_introduced_art_desc": "Acalypha retifera was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in disturbed soils and can spread rapidly along stream banks and forest edges. Its distribution is now widespread across much of the North Island."
}
