{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neptunica var. glabrescens",
    "plant_slug": "acalypha-neptunica-var-glabrescens",
    "plant_name_scientific": "acalypha neptunica var. glabrescens",
    "intro": "Acalypha neptunica var. glabrescens, commonly known as the silky copperleaf, is a tropical shrub native to Southeast Asia. It is characterized by its striking, palmate leaves with a soft, velvety texture. The plant produces small, clustered greenish-white flowers that are followed by distinctive, inflated seed pods. It thrives in humid, shaded environments and is often cultivated for its ornamental value. The variety glabrescens is distinguished by its reduced pubescence compared to other forms of Acalypha neptunica.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neptunica var. glabrescens is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. This variant is commonly found in lowland rainforests and moist, shaded environments. It thrives in humid climates with high rainfall and partial to full shade. The plant is often associated with riverine forests and is sometimes found near water bodies. Its native distribution is limited to these specific ecological zones within the region.",
    "distribution_introduced_art_desc": "Acalypha neptunica var. glabrescens was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was first documented in the early 20th century and has since become established in wet forest habitats. The plant's rapid growth and ability to thrive in moist environments have led to its spread beyond cultivated areas. It is considered an invasive species in some regions, outcompeting native vegetation. Conservation efforts are underway to control its spread and protect local ecosystems."
}
