{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrodonta",
    "plant_slug": "acalypha-macrodonta",
    "plant_name_scientific": "acalypha macrodonta",
    "intro": "Acalypha macrodonta, commonly known as the giant curlleaf mallow, is a tropical plant native to Southeast Asia. It is characterized by its large, palmately lobed leaves that often have a waxy coating. The plant produces showy, red or pink bract-based flowers that are clustered in inflorescences. It thrives in humid, shaded environments and is often found in forest understories. Acalypha macrodonta is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha macrodonta"
    },
    "taxonomy_art_desc": "Acalypha macrodonta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with various growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupseed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha macrodonta, a specific plant within the genus Acalypha, distinguished by its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrodonta is primarily native to Ecuador and Peru. It is found in the tropical regions of these South American countries. The plant typically grows in humid, forested areas with rich soil. It is commonly seen in lowland and montane habitats. Its native distribution is limited to these specific regions in the western Amazon basin.",
    "distribution_introduced_art_desc": "Acalypha macrodonta was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since become naturalized in certain areas, particularly in coastal and urban environments. The plant is known for its rapid growth and ability to thrive in disturbed soils, which has contributed to its spread beyond cultivated areas. However, its invasive potential remains a topic of debate among ecologists. Despite its ornamental value, management efforts are ongoing to prevent its encroachment into native ecosystems."
}
