{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mapirensis var. scabra",
    "plant_slug": "acalypha-mapirensis-var-scabra",
    "plant_name_scientific": "acalypha mapirensis var. scabra",
    "intro": "Acalypha mapirensis var. scabra, commonly known as rough mapire hibiscus, is a flowering plant native to tropical regions of Central and South America. It is characterized by its hairy, rough-textured leaves and showy, violet to pink bracts that resemble petals. The plant produces small, yellow flowers clustered in inflorescences, which are often surrounded by the colorful bracts. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded areas in the wild. This species is valued for its ornamental qualities and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mapirensis var. scabra is primarily native to the tropical regions of Central America, specifically found in countries such as Belize, Guatemala, Honduras, and El Salvador. It thrives in humid, lowland areas with well-drained soils, often growing in disturbed or secondary forests. This variant is commonly associated with riverine habitats and is often found along the banks of streams and rivers. It is also present in parts of southern Mexico, particularly in the states of Chiapas and Tabasco. Due to its specific habitat requirements, it is considered a relatively rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Acalypha mapirensis var. scabra was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in disturbed habitats such as roadsides, clearings, and along riverbanks. This plant is known for its attractive, palmate leaves and can spread rapidly through vegetative reproduction. It has been reported in several regions of South America, particularly in Brazil and Argentina. Due to its adaptability, it has become a common weed in agricultural and urban settings."
}
