{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wilderi",
    "plant_slug": "acalypha-wilderi",
    "plant_name_scientific": "acalypha wilderi",
    "intro": "Acalypha wilderi, commonly known as the velvetleaf or wild spurflower, is a species of flowering plant native to tropical and subtropical regions. It is characterized by its striking, colorful bracts that resemble petals, which are actually modified leaves. The plant typically grows as an annual herb, reaching heights of up to 2 meters, with smooth, often hairy stems. Its leaves are usually heart-shaped and have a velvety texture, contributing to its common name. Acalypha wilderi produces small, inconspicuous flowers that are clustered in dense inflorescences, often surrounded by the showy bracts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha wilderi"
    },
    "taxonomy_art_desc": "Acalypha wilderi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphological features. Its genus is Acalypha, a group of flowering plants known for their often showy inflorescences and varied leaf shapes. Its species is Acalypha wilderi, a specific type within the genus Acalypha, characterized by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha wilderi is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks or in dense forest understories. It is also present in parts of India and the Pacific Islands. Its native distribution reflects its adaptation to warm, humid climates with abundant rainfall.",
    "distribution_introduced_art_desc": "Acalypha wilderi was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there in the late 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant spreads primarily through seeds dispersed by birds and water, contributing to its rapid colonization of new habitats. Its introduction highlights the ecological risks associated with non-native ornamental species."
}
