{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha multipartita",
    "plant_slug": "acalypha-multipartita",
    "plant_name_scientific": "acalypha multipartita",
    "intro": "Acalypha multipartita, commonly known as the Chinese nettle or false nettle, is a herbaceous plant native to Southeast Asia. It is characterized by its striking, palmately lobed leaves that often display a vibrant green or reddish hue. The plant produces small, inconspicuous greenish-white flowers that are clustered in dense inflorescences. Acalypha multipartita is often cultivated as an ornamental plant due to its attractive foliage. It thrives in moist, well-drained soil and prefers partial to full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha multipartita is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland forests and along riverbanks. This plant thrives in humid environments with well-drained soil and partial to full sunlight. It is often seen growing in wetlands and disturbed areas, showcasing its adaptability to different habitats. Its native range also extends to parts of Australia and the Pacific Islands.",
    "distribution_introduced_art_desc": "Acalypha multipartita was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive, colorful foliage. However, it has since spread rapidly, outcompeting native plants and altering local ecosystems. The plant thrives in disturbed areas and can form dense stands that reduce biodiversity. Efforts are ongoing to control its spread and mitigate its impact on native habitats."
}
