{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha integrifolia var. concolor",
    "plant_slug": "acalypha-integrifolia-var-concolor",
    "plant_name_scientific": "acalypha integrifolia var. concolor",
    "intro": "Acalypha integrifolia var. concolor, commonly known as the velvetleaf or red-rooted iron plant, is a shrub native to tropical and subtropical regions. It features striking, velvety leaves that are typically reddish or purple in color, with a smooth, waxy texture. The plant produces small, clustered greenish-white flowers that bloom in summer, followed by capsule fruits containing numerous seeds. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Its ornamental value makes it a popular choice for landscaping in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha integrifolia var. concolor is primarily native to tropical and subtropical regions of Asia, including countries such as India, Sri Lanka, Thailand, and parts of Southeast Asia. It thrives in humid climates and is commonly found in lowland areas, forests, and along riverbanks. This variant is known for its striking foliage and is often cultivated as an ornamental plant. It prefers well-drained soil and partial to full sunlight. Its native distribution includes regions with warm temperatures and high rainfall throughout the year.",
    "distribution_introduced_art_desc": "Acalypha integrifolia var. concolor was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. However, it has since become naturalized and is now considered a potential weed in certain regions. The plant thrives in moist, sunny environments and can spread rapidly through seed dispersal. Its introduction has raised concerns about its impact on native ecosystems."
}
