{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha benguelensis var. trichogyne",
    "plant_slug": "acalypha-benguelensis-var-trichogyne",
    "plant_name_scientific": "acalypha benguelensis var. trichogyne",
    "intro": "Acalypha benguelensis var. trichogyne, commonly known as the velvetleaf or trichogyne acalypha, is a shrub native to tropical regions of Africa. It is characterized by its hairy, velvety leaves that give it its common name. The plant produces small, clustered flowers that are typically greenish or yellowish in color. Its leaves are often used in traditional medicine for their purported healing properties. The species is also valued for its ornamental appeal due to its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha benguelensis var. trichogyne is primarily native to Central and East Africa, including countries such as Angola, the Democratic Republic of the Congo, and Tanzania. It is commonly found in tropical and subtropical regions, particularly in areas with moist, well-drained soils. This variant thrives in open woodlands, savannas, and along riverbanks. It is often associated with disturbed habitats and can be found in both natural and cultivated environments. The plant is known for its distinctive foliage and is sometimes used in ornamental horticulture.",
    "distribution_introduced_art_desc": "Acalypha benguelensis var. trichogyne was mainly introduced to areas with tropical and subtropical climates, where it thrives in moist, well-drained soils. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant is often used as an ornamental due to its attractive foliage and ability to grow quickly. However, it can become invasive in some regions, outcompeting native vegetation. Its distribution is largely limited by environmental conditions and human activity."
}
