{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ceraceopunctata",
    "plant_slug": "acalypha-ceraceopunctata",
    "plant_name_scientific": "acalypha ceraceopunctata",
    "intro": "Acalypha ceraceopunctata, commonly known as the silver-leaf acalypha, is a flowering plant native to Southeast Asia. It is characterized by its striking, silver-gray foliage with a waxy texture. The plant produces small, inconspicuous greenish-white flowers arranged in clusters. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Its unique appearance makes it a popular choice for indoor and outdoor gardening.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha ceraceopunctata"
    },
    "taxonomy_art_desc": "Acalypha ceraceopunctata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle and includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and citrus. Its order is Malpighiales, a large group of flowering plants that includes species with diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their hairy leaves and showy flowers. Its species is Acalypha ceraceopunctata, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Benin",
        "Burkina",
        "Cameroon",
        "Chad",
        "Ghana",
        "Nigeria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ceraceopunctata is primarily native to Benin, Burkina, Cameroon, Chad, Ghana, and Nigeria. This species is commonly found in tropical and subtropical regions within these countries. It typically grows in moist, shaded environments such as forests and shrublands. The plant is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acalypha ceraceopunctata was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in coastal and lowland areas. Its rapid growth and ability to spread through seeds have made it a significant ecological concern. Efforts are ongoing to control its spread and protect native ecosystems."
}
