{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pinnata",
    "plant_slug": "acalypha-pinnata",
    "plant_name_scientific": "acalypha pinnata",
    "intro": "Acalypha pinnata, commonly known as the Chinese lantern plant, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, papery bracts that resemble small lanterns. The plant typically grows as an upright shrub or small tree, reaching heights of up to 5 meters. Its leaves are opposite, ovate, and have a smooth or slightly hairy surface. Acalypha pinnata thrives in tropical and subtropical climates and is often cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pinnata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is also found in parts of tropical regions in Africa, such as Kenya and Tanzania. This plant thrives in moist, shady environments and is commonly found in lowland forests. It is often seen growing along stream banks and in swampy areas. Acalypha pinnata is known for its distinctive foliage and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acalypha pinnata was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activity, such as accidental transport in soil or on vehicles. The plant thrives in disturbed areas and can outcompete native vegetation. Its rapid growth and ability to spread via seeds make it a significant ecological threat. Efforts are ongoing to control its spread and protect native ecosystems."
}
