{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ornata var. bracteosa",
    "plant_slug": "acalypha-ornata-var-bracteosa",
    "plant_name_scientific": "acalypha ornata var. bracteosa",
    "intro": "Acalypha ornata var. bracteosa, commonly known as the velvetleaf or bracteosa spurflower, is a striking ornamental plant native to Southeast Asia. It is characterized by its velvety, dark green leaves and clusters of small, bright red bracts that resemble flowers. The plant produces tiny, inconspicuous yellow flowers that are surrounded by the showy red bracts, making it popular in ornamental horticulture. It thrives in warm, humid climates and prefers well-drained soil. Its unique appearance and ability to thrive in shaded conditions make it a favored choice for gardeners seeking visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ornata var. bracteosa is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This variant of Acalypha ornata thrives in moist, shaded environments, often growing along riverbanks and in dense forests. It is also present in parts of the Indian subcontinent, including India and Sri Lanka. The plant is well adapted to warm climates and is often cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Acalypha ornata var. bracteosa was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was brought there during the 19th century by horticulturists and gardeners who admired its unique leaf patterns and vibrant colors. Despite its aesthetic appeal, it has since become an invasive species in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through both seeds and vegetative reproduction have made it a challenge for land managers. Efforts to control its spread include manual removal, herbicides, and public awareness campaigns."
}
