{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hainanensis",
    "plant_slug": "acalypha-hainanensis",
    "plant_name_scientific": "acalypha hainanensis",
    "intro": "Acalypha hainanensis, commonly known as Hainan mallow, is a flowering plant native to the island of Hainan in China. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that resemble flowers. The plant typically grows as an upright shrub, reaching heights of up to 2 meters, with palmate leaves that are often covered in fine hairs. Its flowers are small and inconspicuous, clustered in dense inflorescences, while the showy bracts attract pollinators. Acalypha hainanensis is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha hainanensis"
    },
    "taxonomy_art_desc": "Acalypha hainanensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and algae that have a complex life cycle with a dominant sporophyte stage. Its class is Equisetopsida, which comprises ferns and their allies, characterized by vascular tissue and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical species with diverse growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide range of plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha hainanensis, a specific plant native to Hainan, China, characterized by its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Hainan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hainanensis is primarily native to Hainan. It is a species of flowering plant found in the tropical regions of this island province. This plant typically grows in moist, shaded areas within the mountainous regions of Hainan. It is part of the Euphorbiaceae family and is known for its distinctive foliage. Due to its limited distribution, it is considered a rare and endemic species in the region.",
    "distribution_introduced_art_desc": "Acalypha hainanensis was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage. It is commonly found in gardens and greenhouses where it thrives in warm, humid climates. The plant prefers well-drained soil and partial to full sunlight, making it suitable for various landscaping applications. Its introduction has been documented in several countries, including the United States and Australia, where it is cultivated for its aesthetic value. However, its invasive potential in certain environments remains a topic of ongoing study."
}
