{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha integrifolia var. crateriana",
    "plant_slug": "acalypha-integrifolia-var-crateriana",
    "plant_name_scientific": "acalypha integrifolia var. crateriana",
    "intro": "Acalypha integrifolia var. crateriana, commonly known as the mountain hibiscus, is a flowering plant native to the mountainous regions of Central America. It is characterized by its striking, palmate leaves that are typically bright green and deeply lobed. The plant produces showy, red or orange flowers that bloom in clusters, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and requires full sun to partial shade for optimal growth. This species is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha integrifolia var. crateriana is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in wetland habitats such as swamps, marshes, and along the edges of ponds and streams. This variety is commonly found in the Florida Panhandle and along the Gulf Coast. It is well adapted to moist, sandy soils and can tolerate periodic flooding. The plant is often part of the understory vegetation in these wetland ecosystems.",
    "distribution_introduced_art_desc": "Acalypha integrifolia var. crateriana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there during the late 19th and early 20th centuries by horticulturists and gardeners who sought to diversify the local plant palette. The plant thrives in tropical and subtropical climates, making it well-suited to the warm, humid conditions of these regions. However, it has since become naturalized in some areas, raising concerns about its potential impact on native ecosystems. Despite its ornamental value, its introduction has led to discussions about ecological management and control."
}
