{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gillespieae",
    "plant_slug": "acalypha-gillespieae",
    "plant_name_scientific": "acalypha gillespieae",
    "intro": "Acalypha gillespieae, commonly known as the Gillespie's spurflower, is a flowering plant native to the island of Guam in the western Pacific. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its distinctive, spiky inflorescence and small, inconspicuous flowers. It thrives in coastal and lowland habitats, often growing in sandy or rocky soils. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha gillespieae"
    },
    "taxonomy_art_desc": "Acalypha gillespieae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes species with a wide range of morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a variety of growth forms. Its genus is Acalypha, a group of flowering plants known for their showy, often colorful bracts and are commonly found in tropical and subtropical regions. Its species is Acalypha gillespieae, a specific plant within the genus Acalypha that is native to a particular region and has unique characteristics that distinguish it from other species in the genus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gillespieae is primarily native to Madagascar. This unique plant is found in specific regions of the island, particularly in the eastern rainforests. It thrives in humid, tropical conditions with high rainfall. Due to its restricted habitat, it is considered a rare and endemic species. Conservation efforts are essential to protect its natural environment from threats like deforestation.",
    "distribution_introduced_art_desc": "Acalypha gillespieae was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first recorded in the early 20th century and has since spread to other tropical regions. The plant thrives in moist, shady environments and is often found in disturbed areas such as roadsides and forest edges. Its rapid growth and ability to reproduce vegetatively have contributed to its establishment in non-native habitats. However, it is not considered invasive in most areas where it has been introduced."
}
