{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis",
    "plant_slug": "acalypha-communis",
    "plant_name_scientific": "acalypha communis",
    "intro": "Acalypha communis, commonly known as the velvetleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its palmate leaves, which are often covered in a fine, velvety texture. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, shady environments and is often found in wetlands or along stream banks. Acalypha communis is also known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha communis"
    },
    "taxonomy_art_desc": "Acalypha communis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants known for their varied habitats and ecological significance. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their showy bracts and hairy foliage. Its species is Acalypha communis, a specific plant within the genus Acalypha, known for its ornamental value and adaptability to various environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Paraguay",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Brazil North, Brazil Northeast, Brazil South, Brazil Southeast, Brazil West-Central, Paraguay, and Uruguay. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in a variety of habitats, including disturbed soils and open areas. The species is known for its adaptability to different environmental conditions. Its native range spans much of South America, particularly in the eastern and central regions.",
    "distribution_introduced_art_desc": "Acalypha communis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and growth habit. It was likely brought there by early settlers or through horticultural trade in the 19th or early 20th century. The plant has since become naturalized in certain areas, spreading through both seed dispersal and vegetative propagation. Its introduction has led to its presence in disturbed habitats and along roadsides. However, it is not considered invasive in these regions and is primarily managed as a non-native species."
}
