{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha minima",
    "plant_slug": "acalypha-minima",
    "plant_name_scientific": "acalypha minima",
    "intro": "Acalypha minima, commonly known as the small-leaf spurflower, is a flowering plant native to tropical regions of Africa and Southeast Asia. It belongs to the Euphorbiaceae family, characterized by its unique floral structures and milky sap. The plant typically grows as an annual herb with small, ovate leaves that are often covered in fine hairs. Its flowers are clustered in small, greenish-yellow cyathia, which are surrounded by modified leaves called bracts. Acalypha minima is often found in moist, disturbed soils and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha minima is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing near rivers, swamps, or in dense forest undergrowth. It is also known to occur in parts of India and the Pacific Islands. Due to its adaptability, it can be found in a variety of wetland and riparian habitats across its native range.",
    "distribution_introduced_art_desc": "Acalypha minima was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in areas with warm climates and high humidity, such as parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in well-drained soil and full sun to partial shade, making it suitable for both garden beds and container planting. Its rapid growth and ability to spread through vegetative propagation have contributed to its establishment in some non-native environments. However, it is generally not considered invasive and is often cultivated for its aesthetic value rather than its ecological impact."
}
