{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cinnamomifolia",
    "plant_slug": "acalypha-cinnamomifolia",
    "plant_name_scientific": "acalypha cinnamomifolia",
    "intro": "Acalypha cinnamomifolia, commonly known as cinnamon leaf acalypha, is a shrub native to tropical regions of Africa and Asia. It features lance-shaped leaves with a distinctive reddish or purplish hue on the underside, giving it a striking appearance. The plant produces small, greenish-white flowers that are clustered in dense inflorescences. Its ornamental value comes from its vibrant foliage and compact growth habit. It thrives in moist, well-drained soils and is often cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cinnamomifolia is primarily native to the Pacific Islands, including Hawaii, the Marquesas, and parts of Polynesia. It is commonly found in coastal areas and lowland forests, thriving in humid and tropical climates. This plant is often associated with volcanic soils and is adapted to the unique ecological conditions of these regions. It plays an important role in the local flora and is sometimes used in traditional practices by indigenous communities. Its distribution is limited to specific islands where it has developed over time.",
    "distribution_introduced_art_desc": "Acalypha cinnamomifolia was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and unique growth habit. It is commonly used in tropical and subtropical regions as a decorative plant in gardens and public spaces. The plant thrives in warm, humid climates and requires well-drained soil to prevent root rot. Its introduction has led to its cultivation in various parts of the world, including the United States, Australia, and parts of Southeast Asia. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
