{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha radians",
    "plant_slug": "acalypha-radians",
    "plant_name_scientific": "acalypha radians",
    "intro": "Acalypha radians, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Asia. It belongs to the family Euphorbiaceae and is characterized by its striking, colorful foliage with deep green veins and red or purple undersides. The plant produces small, inconspicuous flowers that are clustered in inflorescences called cyathia. It is often cultivated as an ornamental plant due to its vibrant leaf patterns. Acalypha radians thrives in humid, warm climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha radians"
    },
    "taxonomy_art_desc": "Acalypha radians belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with a wide range of morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupseed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha radians, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southwest",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha radians is primarily native to Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Southwest, and Texas. This plant thrives in the warm and humid climates typical of these regions. It is commonly found in tropical and subtropical areas within its native range. The plant often grows in disturbed soils and along roadsides. Its distribution reflects its adaptability to diverse environmental conditions in these parts of Mexico and Texas.",
    "distribution_introduced_art_desc": "Acalypha radians was mainly introduced to the Pacific Islands through human activity, including horticultural trade and accidental transport. It is commonly found in disturbed habitats such as roadsides, gardens, and coastal areas. The plant thrives in warm, sunny environments and has shown rapid growth and spread in these regions. Due to its adaptability, it has become an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
