{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha intermedia",
    "plant_slug": "acalypha-intermedia",
    "plant_name_scientific": "acalypha intermedia",
    "intro": "Acalypha intermedia, commonly known as the red-rooted spurge, is a flowering plant native to the southeastern United States. It is a herbaceous annual that typically grows to a height of 1 to 3 feet, featuring lance-shaped leaves with a slightly hairy texture. The plant produces small, greenish-yellow flowers in clusters, which are followed by distinctive, three-lobed seed capsules. It thrives in moist, disturbed soils and is often found in wetlands, ditches, and along stream banks. Acalypha intermedia is noted for its rapid growth and ability to colonize open areas, making it both a common weed and a plant of ecological interest.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha intermedia"
    },
    "taxonomy_art_desc": "Acalypha intermedia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with often milky sap. Its genus is Acalypha, which consists of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" often characterized by their unique leaf structures. Its species is Acalypha intermedia, a specific plant within the genus Acalypha that is known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "DR Congo"
    ],
    "distribution_introduced": [
        "Mexico Southeast"
    ],
    "distribution_native_art_desc": "Acalypha intermedia is primarily native to DR Congo. It is commonly found in the tropical rainforests of this region. The plant thrives in humid and shaded environments. It is often seen growing along riverbanks and in dense undergrowth. Its native distribution is largely confined to the central and western parts of DR Congo.",
    "distribution_introduced_art_desc": "Acalypha intermedia was mainly introduced to Mexico Southeast. It is commonly found in disturbed areas such as roadsides, waste places, and along riverbanks. This plant thrives in tropical and subtropical climates, making it well-suited to the environmental conditions of southern Mexico. Its rapid growth and ability to spread through seeds contribute to its success in invaded habitats. However, it is considered a potential weed that can outcompete native vegetation in certain ecosystems."
}
