{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha peduncularis var. angustata",
    "plant_slug": "acalypha-peduncularis-var-angustata",
    "plant_name_scientific": "acalypha peduncularis var. angustata",
    "intro": "Acalypha peduncularis var. angustata, commonly known as narrow-leaved hibiscus, is a species of flowering plant in the family Euphorbiaceae. It is native to tropical regions of Africa, particularly Kenya and Tanzania. The plant is characterized by its narrow, lance-shaped leaves and showy, red bracts that surround small yellow flowers. It typically grows as an erect shrub or small tree, reaching heights of up to 3 meters. This species is often cultivated for its ornamental value due to its striking foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha peduncularis var. angustata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical lowland areas, particularly in moist, shaded undergrowth of primary and secondary forests. This plant thrives in humid climates and is often associated with riverine and coastal habitats. It is also known to occur in parts of the Indian subcontinent, including India and Sri Lanka. Its distribution is largely restricted to regions with high rainfall and warm temperatures throughout the year.",
    "distribution_introduced_art_desc": "Acalypha peduncularis var. angustata was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and coastal dunes. It thrives in full sun and is commonly found in tropical and subtropical regions. This plant is often considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It has been reported in several countries in the Pacific and Southeast Asia. Its distribution is largely influenced by human activities and environmental disturbances."
}
