{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ornata var. pilosa",
    "plant_slug": "acalypha-ornata-var-pilosa",
    "plant_name_scientific": "acalypha ornata var. pilosa",
    "intro": "Acalypha ornata var. pilosa, commonly known as the velvetleaf or woolly acalypha, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its soft, fuzzy leaves that give it a distinctive, velvety texture. The plant produces small, inconspicuous greenish-white flowers clustered in spikes, which are often surrounded by modified leaves called bracts. It thrives in warm, humid climates and is often grown as an ornamental plant for its unique foliage. The species is also valued in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ornata var. pilosa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland forests and along riverbanks. This plant is commonly associated with humid climates and is often seen in shaded or semi-shaded environments. It is also found in parts of India and Sri Lanka, where it grows in similar ecological conditions. Its native range extends to the Pacific islands of the Philippines and parts of New Guinea.",
    "distribution_introduced_art_desc": "Acalypha ornata var. pilosa was mainly introduced to ornamental horticulture due to its attractive foliage and unique appearance. It is commonly cultivated in gardens and landscapes for its vibrant, colorful leaves. The plant is often used as a decorative plant in tropical and subtropical regions. However, it has been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its distribution is now expanding in regions with warm climates where it can thrive."
}
