{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rhomboidea var. deamii",
    "plant_slug": "acalypha-rhomboidea-var-deamii",
    "plant_name_scientific": "acalypha rhomboidea var. deamii",
    "intro": "Acalypha rhomboidea var. deamii, commonly known as the Deam's velvetleaf, is a tropical shrub native to Southeast Asia. It is characterized by its heart-shaped leaves that are typically covered in a dense, velvety pubescence. The plant produces small, inconspicuous greenish-yellow flowers arranged in spikes, which are followed by triangular, winged seeds. It thrives in moist, shaded environments and is often found in lowland forests. The species is valued for its ornamental foliage and is sometimes cultivated in subtropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rhomboidea var. deamii is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variant is commonly found in wetland habitats such as swamps, marshes, and along the edges of ponds. It thrives in moist, acidic soils and is often associated with disturbed or swampy areas. The plant is known for its distinctive rhomboid-shaped leaves and is sometimes referred to as \"arrowleaf\" due to the shape of its foliage. It plays an important ecological role in supporting local wildlife and maintaining wetland ecosystems.",
    "distribution_introduced_art_desc": "Acalypha rhomboidea var. deamii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was first recorded in the early 20th century and has since become naturalized in several regions. The plant is known for its vibrant, maple-like leaves that change color with the seasons. Despite its aesthetic appeal, it has raised concerns due to its potential to become invasive in certain ecosystems. Its spread has been documented in coastal areas and disturbed habitats across the islands."
}
