{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha allenii",
    "plant_slug": "acalypha-allenii",
    "plant_name_scientific": "acalypha allenii",
    "intro": "Acalypha allenii, commonly known as the Allen's glorybower, is a tropical shrub native to Southeast Asia. It is characterized by its striking, showy inflorescences that consist of clusters of small, vibrant red or orange bracts. The plant has opposite, ovate leaves that are often covered in fine hairs, giving them a soft texture. It thrives in moist, well-drained soils and prefers partial to full sunlight. Acalypha allenii is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha allenii"
    },
    "taxonomy_art_desc": "Acalypha allenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is known for its diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations, such as the ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha allenii, a specific plant within the genus Acalypha, known for its distinctive foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Malawi",
        "Mozambique",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha allenii is primarily native to Botswana, Malawi, Mozambique, Zambia, and Zimbabwe. This species is commonly found in the savanna and woodland regions of these countries. It thrives in areas with well-drained soils and moderate to high rainfall. The plant is often seen growing along riverbanks and in open grasslands. Its native distribution reflects its adaptation to the diverse ecological conditions of southern Africa.",
    "distribution_introduced_art_desc": "Acalypha allenii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners who sought exotic plants for landscaping purposes. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, shaded environments and spreads primarily through seed dispersal by birds and water. Its introduction highlights the ecological risks associated with non-native plant species in island ecosystems."
}
