{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha angustifolia var. genuina",
    "plant_slug": "acalypha-angustifolia-var-genuina",
    "plant_name_scientific": "acalypha angustifolia var. genuina",
    "intro": "Acalypha angustifolia var. genuina, commonly known as the narrow-leaved spurge, is a shrub native to tropical and subtropical regions of Asia. It features lance-shaped leaves that are typically dark green and glossy, with a smooth texture. The plant produces small, inconspicuous greenish-white flowers arranged in clusters, which are followed by three-lobed, capsule-like fruits. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and forest edges. Its ornamental value is limited, but it is sometimes cultivated for its distinctive foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha angustifolia var. genuina is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, fertile soils. This variant thrives in humid environments and is often associated with forest understories or disturbed sites. It is also present in parts of northern Australia and the Pacific Islands. The plant is known for its ornamental value and has been introduced to other regions for horticultural purposes.",
    "distribution_introduced_art_desc": "Acalypha angustifolia var. genuina was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. The plant thrives in tropical and subtropical climates, making it well-suited to the environmental conditions of these regions. However, it has since naturalized in some areas, raising concerns about its potential impact on native ecosystems. Its introduction has contributed to the diversity of plant species in these regions but also highlights the need for careful management of non-native plants."
}
