{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha anadenia",
    "plant_slug": "acalypha-anadenia",
    "plant_name_scientific": "acalypha anadenia",
    "intro": "Acalypha anadenia, commonly known as the red-veined nettle, is a herbaceous plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its striking red veins on its lance-shaped leaves. The plant produces small, inconspicuous green flowers arranged in clusters, which are often surrounded by modified leaves called bracts. It thrives in moist, shaded environments and is often found in forest understories. Acalypha anadenia is valued for its ornamental appeal and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha anadenia"
    },
    "taxonomy_art_desc": "Acalypha anadenia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants known for their varied leaf and flower structures, including many tropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha anadenia, a specific type within the genus Acalypha, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha anadenia is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in dry, rocky soils and is often seen in desert scrublands. It is adapted to the harsh climate of the region with its drought-resistant characteristics. This species is an important part of the local flora in its native habitat.",
    "distribution_introduced_art_desc": "Acalypha anadenia was mainly introduced to new environments as an ornamental plant due to its attractive foliage and adaptability. It has been reported in several regions outside its native range, including parts of Southeast Asia and the Pacific Islands. The plant's rapid growth and ability to thrive in disturbed areas have contributed to its spread in these regions. However, it is considered a potential invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns among conservationists due to its ecological impact."
}
