{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha explorationis",
    "plant_slug": "acalypha-explorationis",
    "plant_name_scientific": "acalypha explorationis",
    "intro": "Acalypha explorationis, commonly known as the red-hot poker or fireplant, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, tubular red bracts that resemble poker chips, giving it its common name. The plant produces small, yellowish flowers inside the bracts, which are often overlooked due to the vibrant color of the foliage. Acalypha explorationis typically grows as an upright shrub, reaching heights of up to 3 meters. It thrives in full sun and well-drained soil, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha explorationis is primarily native to the Pacific Islands, including Hawaii, Tahiti, and other tropical regions of Oceania. It is commonly found in coastal areas and lowland forests where the climate is warm and humid. This plant thrives in well-drained soils and is often seen growing in shaded or semi-shaded environments. It is an important part of the local ecosystem, providing habitat and food for various native species. Due to its ornamental value, it has also been introduced to other parts of the world.",
    "distribution_introduced_art_desc": "Acalypha explorationis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has since spread beyond cultivated areas and is now found in disturbed habitats such as roadsides, stream banks, and forest margins. The plant's rapid growth and ability to thrive in different environments have contributed to its establishment in natural ecosystems. It is considered a potential weed in some regions due to its competitive nature and lack of natural predators. Efforts are ongoing to monitor its spread and assess its impact on native plant communities."
}
