{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha variabilis var. elliptica",
    "plant_slug": "acalypha-variabilis-var-elliptica",
    "plant_name_scientific": "acalypha variabilis var. elliptica",
    "intro": "Acalypha variabilis var. elliptica, commonly known as the variable hibiscus or red-veined begonia, is a flowering plant native to tropical regions of Asia. It is characterized by its striking, colorful leaves that often display vibrant red, orange, or yellow veins against a green background. The plant produces small, inconspicuous flowers that are typically clustered in inflorescences. It thrives in moist, well-drained soil and prefers partial to full shade. Due to its ornamental value, it is often cultivated as a houseplant or in shaded garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha variabilis var. elliptica is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also present in parts of the Indian subcontinent, including India and Sri Lanka. Its distribution extends to some Pacific islands, where it has been introduced as an ornamental plant.",
    "distribution_introduced_art_desc": "Acalypha variabilis var. elliptica was mainly introduced to new habitats in tropical and subtropical regions due to its ornamental value and adaptability. It is commonly found in disturbed areas such as roadsides, gardens, and abandoned fields. This plant has been reported in several countries including Australia, Hawaii, and parts of Southeast Asia. Its introduction has led to concerns about its potential to become invasive in some ecosystems. Despite its beauty, careful management is recommended to prevent its spread into native habitats."
}
