{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha integrifolia var. gracilipes",
    "plant_slug": "acalypha-integrifolia-var-gracilipes",
    "plant_name_scientific": "acalypha integrifolia var. gracilipes",
    "intro": "Acalypha integrifolia var. gracilipes, commonly known as the slender-leaf copperleaf, is a flowering plant native to tropical regions of Asia. It is characterized by its striking, palmate leaves that are typically bright green with a reddish or purplish tinge on the underside. The plant produces small, clustered flowers that are often yellow or orange in color. It thrives in moist, well-drained soils and is often cultivated as an ornamental plant. Its rapid growth and attractive foliage make it a popular choice for gardeners and landscapers.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha integrifolia var. gracilipes is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant thrives in humid climates and is often associated with disturbed habitats like roadsides, abandoned fields, and forest edges. It is also present in parts of northern Australia and has been introduced to other tropical regions around the world. The plant is known for its attractive foliage and is sometimes cultivated as an ornamental species.",
    "distribution_introduced_art_desc": "Acalypha integrifolia var. gracilipes was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The distribution of this plant has been primarily confined to cultivated areas and gardens. However, it has occasionally escaped into the wild, leading to localized naturalization. Despite its introduction, it is not considered a major invasive species in New Zealand."
}
