{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mortoniana",
    "plant_slug": "acalypha-mortoniana",
    "plant_name_scientific": "acalypha mortoniana",
    "intro": "Acalypha mortoniana, commonly known as the Morton's glorybower, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the Euphorbiaceae family, which includes many species with distinctive floral structures. The plant is characterized by its vibrant, showy bracts that resemble petals, often displaying shades of red, orange, or yellow. Its leaves are typically heart-shaped and covered in a fine, powdery coating. Acalypha mortoniana is often cultivated as an ornamental plant due to its striking appearance and ability to thrive in warm, humid climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha mortoniana"
    },
    "taxonomy_art_desc": "Acalypha mortoniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Malpighiales, a large group of flowering plants with a wide range of morphological diversity. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper spurge,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha mortoniana, a specific type of plant within the genus Acalypha, known for its unique characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Costa Rica",
        "Guatemala",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mortoniana is primarily native to Belize, Costa Rica, Guatemala, and southeastern Mexico. This plant is found in tropical and subtropical regions within these countries. It typically grows in humid, lowland areas with rich soil. The species is often associated with secondary forests and disturbed habitats. Its distribution reflects its adaptation to the diverse ecological conditions of Central America.",
    "distribution_introduced_art_desc": "Acalypha mortoniana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there by horticulturists or gardeners seeking to diversify the local flora with exotic species. Despite its ornamental value, it has since become invasive in some areas, outcompeting native plants and altering local ecosystems. The plant thrives in moist, shaded environments and spreads rapidly through both seeds and vegetative growth. Its introduction highlights the ecological risks associated with non-native species in island ecosystems."
}
