{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hispaniolae",
    "plant_slug": "acalypha-hispaniolae",
    "plant_name_scientific": "acalypha hispaniolae",
    "intro": "Acalypha hispaniolae, commonly known as the Hispaniola beautyberry, is a flowering plant native to the Caribbean island of Hispaniola. It belongs to the Euphorbiaceae family and is characterized by its striking clusters of violet to purple berries. The plant typically grows as a shrub, reaching heights of up to 2 meters, and thrives in moist, well-drained soils. Its leaves are usually ovate with a glossy surface, and it produces small, inconspicuous yellowish-green flowers. The berries, which are an important food source for birds, mature in the fall and are a notable feature of the plant's ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hispaniolae is primarily native to the island of Hispaniola, which includes the countries of Haiti and the Dominican Republic. This plant is typically found in moist, shaded areas within tropical forests. It thrives in the humid climate and rich soils of the island's interior regions. Acalypha hispaniolae is often associated with secondary growth and disturbed habitats. Its distribution is limited to the native range of Hispaniola, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha hispaniolae was mainly introduced to Hawaii as an ornamental plant due to its attractive foliage and adaptability to tropical climates. It has since become naturalized in various coastal and disturbed areas across the island. The plant's rapid growth and ability to thrive in poor soils have led to its spread beyond cultivated gardens. However, its introduction has raised concerns due to its potential to outcompete native vegetation. Despite its aesthetic appeal, management efforts are underway to control its spread and prevent ecological harm."
}
