{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha variabilis",
    "plant_slug": "acalypha-variabilis",
    "plant_name_scientific": "acalypha variabilis",
    "intro": "Acalypha variabilis, commonly known as the variable spurflower, is a flowering plant native to tropical regions of Africa and Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that often resemble flowers. The plant typically grows as an herb or shrub, reaching heights of up to 2 meters. Its leaves are usually alternate, simple, and vary in shape, contributing to its common name. Acalypha variabilis is valued in horticulture for its ornamental appeal and is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha variabilis"
    },
    "taxonomy_art_desc": "Acalypha variabilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with various leaf and flower adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of morphological features. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupseed,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha variabilis, a specific type within the genus Acalypha, known for its variable leaf shapes and is native to tropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Paraguay",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha variabilis is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Brazil South, Brazil Southeast, Brazil West-Central, Paraguay, and Uruguay. This species is commonly found in tropical and subtropical regions across these South American countries. It typically grows in moist, shaded environments such as forests and riverbanks. The plant is well adapted to the humid climate and fertile soils of its native range. Its distribution reflects its preference for warm, humid conditions with adequate moisture.",
    "distribution_introduced_art_desc": "Acalypha variabilis was mainly introduced to new environments as an ornamental plant due to its attractive foliage and adaptability. It has been reported in several regions outside its native range, including parts of the United States and Australia. The plant's rapid growth and ability to thrive in disturbed soils have contributed to its spread in these areas. However, it is considered invasive in some regions where it outcompetes native vegetation. Its distribution is often linked to human activities such as gardening and landscaping."
}
