{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha inaequilatera",
    "plant_slug": "acalypha-inaequilatera",
    "plant_name_scientific": "acalypha inaequilatera",
    "intro": "Acalypha inaequilatera, commonly known as the unequal-veined spurflower, is a flowering plant native to tropical regions of Africa and Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that often resemble flowers. The plant features palmate leaves with irregularly arranged veins, giving it its scientific name. It produces small, clustered yellow flowers surrounded by modified leaves called bracts. Acalypha inaequilatera is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha inaequilatera"
    },
    "taxonomy_art_desc": "Acalypha inaequilatera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include horsetails and their relatives, known for their unique anatomical features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by diverse flower structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with distinctive floral and vegetative features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with often milky sap and diverse growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha inaequilatera, a specific plant within the genus Acalypha that is distinguished by its unique morphological traits and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha inaequilatera is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing in forest understories or along riverbanks. It is also present in parts of Australia and the Pacific Islands. Its native range extends across various islands in the Indo-Pacific region.",
    "distribution_introduced_art_desc": "Acalypha inaequilatera was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by human activity, such as horticultural trade or intentional planting for aesthetic purposes. The plant has since become naturalized in some areas, spreading through seed dispersal by wind, water, or animals. It is considered an invasive species in certain regions because of its rapid growth and ability to outcompete native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
