{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rubra",
    "plant_slug": "acalypha-rubra",
    "plant_name_scientific": "acalypha rubra",
    "intro": "Acalypha rubra, commonly known as red hibiscus, is a flowering plant native to tropical regions of the Americas. It is characterized by its striking red bracts that resemble petals, which are actually modified leaves. The plant produces showy yellow flowers that bloom beneath the bracts, adding to its ornamental value. Its leaves are ovate with serrated edges and are often covered in fine hairs. Acalypha rubra thrives in moist, well-drained soils and is often cultivated for its vibrant color and ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rubra is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in open habitats like forests, shrublands, and along riverbanks. It is also present in parts of Australia and the Pacific Islands. Its distribution is largely restricted to warm climates where it can grow as an annual or perennial herb.",
    "distribution_introduced_art_desc": "Acalypha rubra was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since become naturalized in several regions, particularly in coastal and disturbed areas. The plant spreads primarily through seed dispersal by wind and water, contributing to its rapid colonization of new habitats. Its introduction has raised concerns due to its potential to outcompete native species in certain environments. Despite its aesthetic appeal, management efforts are ongoing to control its spread in sensitive ecosystems."
}
