{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rivularis",
    "plant_slug": "acalypha-rivularis",
    "plant_name_scientific": "acalypha rivularis",
    "intro": "Acalypha rivularis, commonly known as the river hibiscus, is a flowering plant native to tropical and subtropical regions. It is characterized by its showy, trumpet-shaped flowers that range in color from red to yellow. The plant typically grows in moist environments such as riverbanks and wetlands, thriving in humid climates. Its leaves are usually ovate or heart-shaped, with a smooth or slightly hairy surface. Acalypha rivularis is often cultivated for its ornamental value and ability to attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha rivularis"
    },
    "taxonomy_art_desc": "Acalypha rivularis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with distinctive floral structures and often show a wide range of ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their often hairy foliage and unique inflorescences. Its species is Acalypha rivularis, a specific plant within the genus Acalypha that is typically found in wet or marshy habitats and is known for its distinctive appearance and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rivularis is primarily native to Fiji. It is commonly found in moist, coastal areas and lowland regions throughout the country. This plant thrives in tropical and subtropical climates, often growing near water sources such as streams and riverbanks. It is an important part of the local flora and is adapted to the humid and warm conditions of Fiji. Its distribution is largely restricted to the islands of Fiji due to its specific ecological requirements.",
    "distribution_introduced_art_desc": "Acalypha rivularis was mainly introduced to new habitats through human activities such as landscaping and horticultural trade. It is commonly found in disturbed areas, along roadsides, and in urban environments where it can thrive in moist, nutrient-rich soils. The plant's rapid growth and ability to spread via seeds make it an invasive species in many regions outside its native range. It often outcompetes native vegetation, leading to ecological imbalances in invaded ecosystems. Due to its adaptability, it has become a significant concern in areas where it has been introduced."
}
