{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rottleroides",
    "plant_slug": "acalypha-rottleroides",
    "plant_name_scientific": "acalypha rottleroides",
    "intro": "Acalypha rottleroides, commonly known as the velvetleaf or redleaf plant, is a tropical shrub native to Southeast Asia. It is characterized by its striking, velvety leaves that range in color from deep red to bronze, often with a contrasting lighter underside. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences. It thrives in humid, warm climates and is often cultivated as an ornamental plant. Its foliage is sometimes used in traditional medicine for its purported therapeutic properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha rottleroides"
    },
    "taxonomy_art_desc": "Acalypha rottleroides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with often milky sap and a wide range of growth forms. Its genus is Acalypha, which comprises shrubs and herbs commonly known for their showy inflorescences and often hairy foliage. Its species is Acalypha rottleroides, a specific plant within the genus Acalypha known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rottleroides is primarily native to Madagascar. It is found throughout the island, particularly in moist, shaded areas such as forests and riverine habitats. This plant thrives in tropical climates and is commonly seen in the island's diverse ecosystems. It is known for its striking foliage and is often used in ornamental gardening. Its native range is largely confined to Madagascar, where it plays an important ecological role.",
    "distribution_introduced_art_desc": "Acalypha rottleroides was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since become naturalized in certain areas, particularly in coastal and disturbed habitats. The plant spreads primarily through seeds dispersed by wind, water, and animals. Its rapid growth and ability to thrive in diverse environments have led to concerns about its potential invasiveness. Despite its ornamental value, management efforts are ongoing to prevent its spread into native ecosystems."
}
