{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha totonaca",
    "plant_slug": "acalypha-totonaca",
    "plant_name_scientific": "acalypha totonaca",
    "intro": "Acalypha totonaca, commonly known as Mexican marvelberry, is a flowering plant native to Mexico and Central America. It belongs to the Euphorbiaceae family, which includes many species with milky sap. The plant is characterized by its vibrant, showy bracts that resemble flowers, often displaying shades of red, orange, and yellow. Its leaves are typically heart-shaped and have a smooth texture. Acalypha totonaca is often cultivated for ornamental purposes due to its striking appearance and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha totonaca is primarily native to southern Mexico, specifically the states of Oaxaca, Veracruz, and Puebla. It is also found in parts of Central America, including Guatemala and Honduras. This plant thrives in tropical and subtropical regions, often growing in moist, shaded environments within forests. It is commonly associated with humid lowland areas and is part of the Euphorbiaceae family. Its native distribution is closely linked to the biodiversity hotspots of Mesoamerica.",
    "distribution_introduced_art_desc": "Acalypha totonaca was mainly introduced to the southern United States, particularly in Texas and Florida, as an ornamental plant due to its vibrant foliage. It is commonly found in cultivated gardens and along roadsides where it thrives in disturbed soils and sunny environments. The plant has also been reported in parts of California and the Gulf Coast states, where it has established itself in natural and urban landscapes. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to its classification as an invasive species in some regions. Despite its ornamental value, its introduction has raised concerns about its impact on native plant communities."
}
