{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha leptostachya var. popayanensis",
    "plant_slug": "acalypha-leptostachya-var-popayanensis",
    "plant_name_scientific": "acalypha leptostachya var. popayanensis",
    "intro": "Acalypha leptostachya var. popayanensis, commonly known as the Popayan spurflower, is a flowering plant native to South America, particularly Colombia. It belongs to the Euphorbiaceae family and is characterized by its distinctive, spiky inflorescences. The plant typically grows in humid, tropical environments and thrives in shaded to semi-shaded conditions. Its leaves are often hairy and have a rough texture, while its flowers are small and clustered in dense, spiny structures. This variant is noted for its ornamental value and is sometimes cultivated for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha leptostachya var. popayanensis is primarily native to the highlands of Colombia, particularly in the departments of Cauca and Nariño. This plant thrives in tropical and subtropical regions with well-drained soils and moderate to high humidity. It is commonly found in shaded understory environments within humid montane forests. The species is known for its ornamental value and is sometimes cultivated for its unique foliage. Its native range is limited to specific elevations, typically between 1,500 and 2,500 meters above sea level.",
    "distribution_introduced_art_desc": "Acalypha leptostachya var. popayanensis was mainly introduced to regions with warm, humid climates and well-drained soils, typically found in tropical and subtropical areas. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant thrives in full sun to partial shade and is often used as an ornamental due to its attractive foliage. It has been reported in several countries in South America, including Colombia and Ecuador. Its rapid growth and adaptability make it a potential invasive species in some areas."
}
