{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha comorensis",
    "plant_slug": "acalypha-comorensis",
    "plant_name_scientific": "acalypha comorensis",
    "intro": "Acalypha comorensis, commonly known as the Comoros ironwood, is a small to medium-sized shrub or tree native to the Comoros archipelago. It is characterized by its simple, opposite leaves that are usually ovate to elliptic in shape. The plant produces small, clustered greenish-white flowers followed by distinctive, inflated seed pods. It thrives in moist, well-drained soils and is often found in coastal or lowland areas. Due to its unique appearance and ecological importance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha comorensis is primarily native to the Comoros Islands, an archipelago in the Indian Ocean. It is found in the tropical regions of these islands, particularly in the coastal and lowland areas. The plant thrives in humid and warm climates, often growing in shaded or semi-shaded environments. It is commonly seen in moist soils near the coast or in disturbed habitats. Due to its restricted range, it is considered a rare and endemic species within the Comoros.",
    "distribution_introduced_art_desc": "Acalypha comorensis was mainly introduced to the Pacific Islands, particularly in Hawaii and other tropical regions. It was brought there for ornamental purposes due to its attractive foliage and vibrant flowers. The plant has since become naturalized in some areas, thriving in moist, shady environments. However, it is considered a potential invasive species in certain regions due to its rapid growth and ability to spread easily. Its introduction has raised concerns among local ecologists about its impact on native flora."
}
