{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica var. deamii",
    "plant_slug": "acalypha-virginica-var-deamii",
    "plant_name_scientific": "acalypha virginica var. deamii",
    "intro": "Acalypha virginica var. deamii, commonly known as the Deam's ironweed, is a flowering plant native to the southeastern United States. It is a herbaceous perennial that typically grows to a height of 1 to 3 feet. The plant features showy, spiky inflorescences that range in color from red to purple, which attract pollinators like bees and butterflies. Its leaves are usually ovate to lanceolate, with a hairy texture and a reddish or purplish underside. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica var. deamii is primarily native to the southeastern United States, specifically the coastal plain regions of South Carolina, Georgia, and Florida. This variety is commonly found in wetlands, marshes, and along the edges of swamps where it thrives in moist to saturated soil conditions. It is often associated with disturbed habitats and can be found in areas with partial to full sun exposure. The plant is known for its distinctive red bracts that give it a striking appearance, making it a notable species in its native range. It plays an important role in supporting local wildlife and maintaining the ecological balance of its wetland environments.",
    "distribution_introduced_art_desc": "Acalypha virginica var. deamii was mainly introduced to the southeastern United States, particularly in states like Florida, Georgia, and South Carolina. It is commonly found in disturbed areas such as roadsides, ditches, and open woods. This variety is known for its striking red bracts that appear in late summer and early fall. It has been reported as an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Despite its ornamental value, its spread requires careful management to prevent ecological disruption."
}
