{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sericea var. baurii",
    "plant_slug": "acalypha-sericea-var-baurii",
    "plant_name_scientific": "acalypha sericea var. baurii",
    "intro": "Acalypha sericea var. baurii, commonly known as silverleaf ironweed, is a shrub native to tropical regions of Africa. It is characterized by its striking silver-gray foliage, which is covered in fine, silky hairs. The plant produces small, greenish-white flowers arranged in clusters, which are often concealed by the foliage. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Due to its attractive appearance and drought tolerance, it is often used in xeriscaping and as a landscape plant in warm climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha sericea"
    },
    "taxonomy_art_desc": "Acalypha sericea var. baurii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and often produce toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their unique leaf structures and often showy flowers. Its species is Acalypha sericea, a specific type within the genus known for its silky-haired leaves and is a variant of the species with the botanical name Acalypha sericea var. baurii.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sericea var. baurii is primarily native to the Galápagos. This variant of the species is found in the unique ecosystems of the Galápagos Islands. It thrives in the volcanic soils and coastal environments of the archipelago. The plant is adapted to the specific climate and conditions of the Galápagos. It plays a role in the local flora and is part of the island's distinctive biodiversity.",
    "distribution_introduced_art_desc": "Acalypha sericea var. baurii was mainly introduced to ornamental horticulture due to its striking silver-green foliage and compact growth habit. It is commonly used in landscapes for its aesthetic appeal and ability to thrive in a variety of soil conditions. This plant is often cultivated in gardens and as a potted plant because of its tolerance to urban environments. It has been reported as an invasive species in some regions where it can outcompete native vegetation. Proper management is recommended to prevent its spread beyond cultivated areas."
}
