{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reptans var. brevipes",
    "plant_slug": "acalypha-reptans-var-brevipes",
    "plant_name_scientific": "acalypha reptans var. brevipes",
    "intro": "Acalypha reptans var. brevipes, commonly known as the creeping spurflower, is a low-growing, herbaceous perennial native to tropical regions of Africa. It features slender, trailing stems that root at the nodes, allowing it to spread across the ground or climb supports. The plant produces small, inconspicuous greenish-white flowers arranged in dense clusters, which are often overlooked but contribute to its ornamental value. Its leaves are elliptical, slightly hairy, and have a velvety texture, adding a tactile interest to gardens. It thrives in moist, well-drained soils and is often used in landscaping for its ability to cover ground and prevent erosion.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reptans var. brevipes is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in shaded to semi-shaded environments, often growing in forest understories or along stream banks. It is known for its distinctive foliage and is sometimes cultivated as an ornamental plant. Its native range extends to parts of New Guinea and the Pacific islands as well.",
    "distribution_introduced_art_desc": "Acalypha reptans var. brevipes was mainly introduced to stabilize soil and prevent erosion in coastal and sandy areas. It is commonly used in restoration projects due to its rapid growth and ability to thrive in harsh conditions. This plant is also valued for its ornamental qualities, with its vibrant foliage making it a popular choice for landscaping. However, it has the potential to become invasive in certain environments if not managed properly. Its introduction has had both ecological and aesthetic benefits in specific regions."
}
