{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha stricta",
    "plant_slug": "acalypha-stricta",
    "plant_name_scientific": "acalypha stricta",
    "intro": "Acalypha stricta, commonly known as the narrowleaf ironweed, is a flowering plant native to tropical regions of Africa and the Americas. It belongs to the Euphorbiaceae family and is characterized by its upright growth habit and narrow, lance-shaped leaves. The plant produces clusters of small, yellowish-green flowers, which are often surrounded by modified leaves called bracts. It is often cultivated as an ornamental plant due to its attractive foliage and unique floral structure. Acalypha stricta is also used in traditional medicine for its purported healing properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha stricta"
    },
    "taxonomy_art_desc": "Acalypha stricta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and root system. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malpighiales, a diverse group of flowering plants that includes species with specialized structures like tendrils and latex-producing cells. Its family is Euphorbiaceae, commonly known as the spurge family, which is characterized by the presence of milky sap and often showy flowers. Its genus is Acalypha, a group of flowering plants known for their showy bracts and often used in ornamental horticulture. Its species is Acalypha stricta, a specific type within the genus Acalypha that is characterized by its upright growth habit and distinctive foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha stricta is primarily native to Bolivia, Brazil North, Ecuador, and Peru. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments such as forests and undergrowth. The species is known for its distinctive foliage and is often used in local horticulture. Its native distribution reflects its adaptation to the diverse ecosystems of South America.",
    "distribution_introduced_art_desc": "Acalypha stricta was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th century by European settlers who admired its vibrant leaves. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments and spreads rapidly through its extensive root system. Conservation efforts are now underway to control its spread and protect local ecosystems."
}
