{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha variabilis var. longifolia",
    "plant_slug": "acalypha-variabilis-var-longifolia",
    "plant_name_scientific": "acalypha variabilis var. longifolia",
    "intro": "Acalypha variabilis var. longifolia, commonly known as the \"Chinese nettle\" or \"Mexican nettle,\" is a herbaceous perennial plant native to tropical regions of the Americas. It features striking, palmately lobed leaves that are often covered in fine hairs, giving them a velvety texture. The plant produces small, greenish-white flowers arranged in dense, spike-like clusters, which are typically borne in the axils of the leaves. Its growth habit is usually shrub-like, with multiple stems that can reach heights of up to 2 meters. This species is valued in horticulture for its ornamental foliage and adaptability to a range of growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha variabilis var. longifolia is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in shaded to semi-shaded environments, often growing in forests or along riverbanks. It is also occasionally found in the Indian subcontinent, including parts of India and Sri Lanka. The plant is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha variabilis var. longifolia was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners seeking exotic plant species for cultivation. The plant has since naturalized in certain areas, spreading through both seed dispersal and vegetative propagation. It is often found growing in disturbed soils and along roadsides, which has led to its classification as an invasive species in some regions. Its rapid growth and adaptability have made it a challenge for native plant communities in the islands."
}
