{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha variabilis var. albescens",
    "plant_slug": "acalypha-variabilis-var-albescens",
    "plant_name_scientific": "acalypha variabilis var. albescens",
    "intro": "Acalypha variabilis var. albescens, commonly known as the white-veined spurflower, is a herbaceous plant native to tropical regions of Africa. It is characterized by its striking, palmate leaves with white veins that contrast sharply against the green foliage. The plant produces small, clustered flowers that are typically pink or red, adding to its ornamental value. It thrives in moist, well-drained soils and prefers partial to full sunlight. Due to its unique appearance, it is often cultivated as a decorative plant in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha variabilis var. albescens is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in humid, warm climates and is commonly found in lowland forests, wetlands, and along riverbanks. This variant is known for its striking white or pale green foliage, which distinguishes it from other varieties of Acalypha. It is often cultivated as an ornamental plant due to its aesthetic appeal. The plant plays a role in local ecosystems by providing habitat and food for various insects and birds.",
    "distribution_introduced_art_desc": "Acalypha variabilis var. albescens was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various environmental conditions. It has since become naturalized in certain regions, particularly in the North Island, where it thrives in disturbed soils and along riverbanks. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its establishment in native ecosystems. However, its introduction has raised concerns about potential impacts on local biodiversity and habitat structure. Despite these concerns, it remains a popular choice for gardeners seeking low-maintenance, visually appealing plants."
}
