{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neptunica var. vestita",
    "plant_slug": "acalypha-neptunica-var-vestita",
    "plant_name_scientific": "acalypha neptunica var. vestita",
    "intro": "Acalypha neptunica var. vestita, commonly known as the velvetleaf or silverleaf acalypha, is a striking ornamental plant native to tropical regions. It is characterized by its velvety, silver-green foliage that shimmers in the sunlight. The leaves are typically ovate to lanceolate in shape and often have a soft, fuzzy texture. It produces small, inconspicuous greenish-white flowers that are not particularly showy. This plant thrives in warm, humid climates and is often used in landscaping for its unique leaf appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neptunica var. vestita is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. This plant thrives in humid, warm climates and is commonly found in lowland forests and along riverbanks. It is also present in parts of northern Australia, where it has been introduced and naturalized. The species is often associated with disturbed habitats and can be found in coastal areas and wetlands. Its native range reflects its adaptability to diverse tropical environments.",
    "distribution_introduced_art_desc": "Acalypha neptunica var. vestita was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain areas, particularly in coastal and lowland regions. It is commonly found in gardens and along roadsides where it thrives in moist, well-drained soils. However, its spread has raised concerns due to its potential to become invasive in local ecosystems."
}
