{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha punctata",
    "plant_slug": "acalypha-punctata",
    "plant_name_scientific": "acalypha punctata",
    "intro": "Acalypha punctata, commonly known as the velvetleaf or redleaf plant, is a species of flowering plant in the Euphorbiaceae family. It is native to tropical and subtropical regions of Asia, Africa, and the Pacific Islands. The plant is characterized by its striking, velvety foliage with deep green to reddish hues, often featuring a distinctive red or purple vein pattern. Its leaves are typically ovate to elliptical in shape, and it produces small, inconspicuous yellow flowers clustered in spikes. Acalypha punctata is often cultivated as an ornamental plant for its attractive foliage and ability to thrive in a variety of growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha punctata"
    },
    "taxonomy_art_desc": "Acalypha punctata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often having a distinct morphology. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large order of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha punctata, a specific type within the genus Acalypha, known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces",
        "Free State",
        "KwaZulu-Natal",
        "Lesotho",
        "Northern Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha punctata is primarily native to the Cape Provinces, Free State, KwaZulu-Natal, Lesotho, and Northern Provinces. This plant is commonly found in these regions across southern Africa. It thrives in a variety of habitats, including grasslands, rocky outcrops, and disturbed soils. The distribution of Acalypha punctata is closely linked to its adaptability to different environmental conditions. It plays an important ecological role in the local flora of these areas.",
    "distribution_introduced_art_desc": "Acalypha punctata was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners who admired its vibrant green leaves and unique appearance. Despite its ornamental value, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, disturbed soils and can spread rapidly through both seeds and vegetative reproduction. Its introduction highlights the ecological risks associated with non-native ornamental plants."
}
