{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha nusbaumeri",
    "plant_slug": "acalypha-nusbaumeri",
    "plant_name_scientific": "acalypha nusbaumeri",
    "intro": "Acalypha nusbaumeri, commonly known as the golden nettle, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, palmately lobed leaves that are often covered in fine hairs. The plant produces small, clustered flowers that are typically greenish or reddish in color. It thrives in moist, shaded environments and is often found in forest understories. Acalypha nusbaumeri is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha nusbaumeri"
    },
    "taxonomy_art_desc": "Acalypha nusbaumeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphologies and ecological roles. Its genus is Acalypha, a group of flowering plants known for their often showy inflorescences and a wide distribution in tropical and subtropical regions. Its species is Acalypha nusbaumeri, a specific plant within the genus Acalypha, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ]
}
