{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fertilis",
    "plant_slug": "acalypha-fertilis",
    "plant_name_scientific": "acalypha fertilis",
    "intro": "Acalypha fertilis, commonly known as the fertilis spurflower, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its showy, spade-shaped leaves and clusters of small, yellowish flowers. It thrives in moist, well-drained soils and is often found in wetlands or along riverbanks. Acalypha fertilis is valued for its ornamental appeal and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fertilis is primarily native to tropical and subtropical regions of Africa, including countries such as Kenya, Tanzania, and Uganda. It is commonly found in moist, lowland areas and along riverbanks. This plant thrives in humid climates and is often seen in forest understories or open grasslands. It is also present in parts of southern Arabia and the Indian subcontinent. Its distribution is closely linked to areas with consistent rainfall and well-drained soil.",
    "distribution_introduced_art_desc": "Acalypha fertilis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first brought to the islands in the early 20th century by horticulturists and gardeners seeking exotic plants for landscaping purposes. Despite its initial popularity, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, disturbed habitats and spreads rapidly through both seeds and vegetative reproduction. Its introduction has raised concerns among conservationists due to its potential to disrupt native biodiversity."
}
