{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha silvestri",
    "plant_slug": "acalypha-silvestri",
    "plant_name_scientific": "acalypha silvestri",
    "intro": "Acalypha silvestri, commonly known as the silky mallow, is a flowering plant native to tropical regions of Africa. It is characterized by its soft, hairy leaves and showy, red or pink bract-based inflorescences. The plant typically grows as an annual herb, reaching heights of up to 1 meter. It thrives in moist, well-drained soils and is often found in disturbed habitats. Its ornamental value makes it a popular choice for garden cultivation in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha silvestri is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, lowland environments, often found in secondary forests and along riverbanks. This plant is well adapted to the warm and moist climate of these areas, where it grows as an understorey species. It is commonly found in areas with rich, well-drained soil. Its native distribution is closely tied to the ecological conditions of these tropical habitats.",
    "distribution_introduced_art_desc": "Acalypha silvestri was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by human activity, such as through horticultural trade or intentional planting. The plant has since become naturalized in some areas, spreading beyond cultivated gardens. Its introduction has raised concerns due to its potential to outcompete native vegetation. Despite its aesthetic appeal, its invasive potential requires careful management to prevent ecological disruption."
}
