{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha maestrensis",
    "plant_slug": "acalypha-maestrensis",
    "plant_name_scientific": "acalypha maestrensis",
    "intro": "Acalypha maestrensis, commonly known as the Maestrensis spurflower, is a flowering plant native to the tropical regions of South America. It belongs to the Euphorbiaceae family, which is known for its diverse and often ornamental species. The plant is characterized by its striking, spiky inflorescences that are often brightly colored, attracting pollinators such as bees and birds. Its leaves are typically ovate to lanceolate in shape, with a smooth or slightly hairy surface. Acalypha maestrensis is often cultivated for its ornamental value in gardens and greenhouses due to its unique appearance and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha maestrensis"
    },
    "taxonomy_art_desc": "Acalypha maestrensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Malpighiales, a large order of flowering plants that includes many species with diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which consists of plants often with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha maestrensis, a specific type within the Acalypha genus native to certain regions, known for its unique morphological traits and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha maestrensis is primarily native to Cuba. It is found in the island's diverse ecosystems, including tropical dry forests and coastal areas. This species is adapted to the warm, humid climate typical of the Caribbean region. It plays a role in local biodiversity and is often found in low-lying areas with well-drained soils. Due to its limited distribution, it is considered a regional endemic plant.",
    "distribution_introduced_art_desc": "Acalypha maestrensis was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It thrives in environments with high sunlight exposure and moderate to high rainfall. This plant is commonly found in disturbed habitats such as roadsides, abandoned fields, and along stream banks. Its rapid growth and ability to spread through both seeds and vegetative propagation contribute to its invasive potential in new regions. Due to its adaptability, it has been reported in several countries across the Americas and parts of Southeast Asia."
}
