{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha uleana",
    "plant_slug": "acalypha-uleana",
    "plant_name_scientific": "acalypha uleana",
    "intro": "Acalypha uleana, commonly known as the red-twig dogwood, is a flowering plant native to the southeastern United States. It is characterized by its striking red stems that stand out against its green foliage, especially during the winter months. The plant produces small, white flowers in clusters, which are often surrounded by bracts that give it a showy appearance. Its leaves are typically ovate or elliptic, with a smooth texture and a slightly waxy surface. Acalypha uleana is often used in ornamental gardening for its seasonal color and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha uleana"
    },
    "taxonomy_art_desc": "Acalypha uleana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex structures. Its class is Equisetopsida, a group of vascular plants that includes horsetails and ferns, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, characterized by their complex floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with diverse morphologies, often featuring distinctive leaves and flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha uleana, a specific plant within the genus Acalypha, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha uleana is primarily native to Brazil South. It is commonly found in the southern regions of Brazil, including the states of Paraná, Santa Catarina, and Rio Grande do Sul. This plant thrives in tropical and subtropical climates, often growing in moist, shaded areas within forests. It is also occasionally found in cultivated environments and along riverbanks. Its native distribution is closely tied to the unique ecological conditions of southern Brazil.",
    "distribution_introduced_art_desc": "Acalypha uleana was mainly introduced to ornamental horticulture due to its attractive foliage and compact growth habit. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been distributed across various countries in the Pacific, including Hawaii, Guam, and the Philippines. It is often used in landscaping and as a houseplant because of its ability to thrive in shaded environments. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
