{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha punctata var. longifolia",
    "plant_slug": "acalypha-punctata-var-longifolia",
    "plant_name_scientific": "acalypha punctata var. longifolia",
    "intro": "Acalypha punctata var. longifolia, commonly known as the velvetleaf or red leaf acalypha, is a flowering plant native to tropical regions of Asia. It is characterized by its striking, velvety foliage that ranges from deep green to reddish hues. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in warm, humid climates and prefers well-drained soil. Acalypha punctata var. longifolia is often cultivated as an ornamental plant for its attractive leaves and ease of care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha punctata var. longifolia is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along forest edges or in disturbed habitats. It is also known to occur in parts of northern Australia and New Guinea. Its distribution is closely linked to areas with warm climates and seasonal rainfall patterns.",
    "distribution_introduced_art_desc": "Acalypha punctata var. longifolia was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and growth habit. It was brought to these regions during the 19th and early 20th centuries by horticulturists and gardeners seeking to diversify local landscapes. Despite its aesthetic appeal, it has since become an invasive species in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid spread is attributed to its ability to thrive in disturbed soils and its prolific seed production. Efforts are ongoing to control its spread and mitigate its ecological impact in invaded habitats."
}
