{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pauciflora var. umbrosa",
    "plant_slug": "acalypha-pauciflora-var-umbrosa",
    "plant_name_scientific": "acalypha pauciflora var. umbrosa",
    "intro": "Acalypha pauciflora var. umbrosa, commonly known as the shadow acalypha, is a shade-tolerant shrub native to tropical regions of Southeast Asia. It features palmately lobed leaves that are often variegated with shades of green, white, and pink, adding visual interest to shaded gardens. The plant produces small, clustered flowers that are typically greenish-white in color, followed by ornamental, winged bracts that persist for weeks. It thrives in moist, well-drained soil and prefers partial to full shade, making it ideal for woodland or container gardens. Its unique foliage and adaptability make it a popular choice for ornamental landscaping in tropical and subtropical climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pauciflora var. umbrosa is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This variant thrives in humid, shaded environments, often found in lowland forests and secondary growth areas. It is commonly associated with the understory of dense tropical rainforests where it receives indirect sunlight. The plant is well-adapted to high humidity and well-drained, nutrient-rich soils. Due to its specific habitat requirements, it is not widely distributed outside of its native range.",
    "distribution_introduced_art_desc": "Acalypha pauciflora var. umbrosa was mainly introduced to shaded, moist environments in tropical and subtropical regions. It thrives in areas with high humidity and partial to full shade. This variety is commonly found in forest understories and along stream banks. It is valued for its ornamental foliage and ability to tolerate low light conditions. However, it is considered an invasive species in some regions where it outcompetes native vegetation."
}
