{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rubroserrata",
    "plant_slug": "acalypha-rubroserrata",
    "plant_name_scientific": "acalypha rubroserrata",
    "intro": "Acalypha rubroserrata, commonly known as the red-serrated hibiscus, is a flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its striking, palmate leaves with red-tinged margins and serrated edges. The plant produces showy, pink to red flowers that bloom in clusters, attracting pollinators such as bees and butterflies. It thrives in moist, well-drained soils and prefers partial to full sunlight. Acalypha rubroserrata is often cultivated as an ornamental plant for its vibrant foliage and floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha rubroserrata"
    },
    "taxonomy_art_desc": "Acalypha rubroserrata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their ancient lineage and unique morphological features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with distinctive leaf and flower characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a genus of flowering plants in the Euphorbiaceae family, known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha rubroserrata, a specific plant within the genus Acalypha characterized by its red-serrated leaves and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rubroserrata is primarily native to Mexico Central, Mexico Gulf, and Mexico Northeast. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, well-drained soils and is often seen in lowland habitats. The species is known for its vibrant red-bracted inflorescences, which make it a notable ornamental plant. Its native range includes parts of southern Texas and the Yucatán Peninsula.",
    "distribution_introduced_art_desc": "Acalypha rubroserrata was mainly introduced to ornamental horticulture due to its attractive foliage and unique flowering structure. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been reported in several countries including the United States, Australia, and parts of Southeast Asia. However, it is considered a potential invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
