{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha salicifolia",
    "plant_slug": "acalypha-salicifolia",
    "plant_name_scientific": "acalypha salicifolia",
    "intro": "Acalypha salicifolia, commonly known as the silky ironwood, is a flowering plant native to tropical regions of the Americas. It is characterized by its heart-shaped leaves that are often covered in fine, silky hairs, giving it a soft, velvety appearance. The plant produces small, greenish-white flowers arranged in clusters, which are typically borne on short pedicels. It is often found growing in moist, shaded environments such as forest understories or along stream banks. The species is valued for its ornamental qualities and is sometimes cultivated for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha salicifolia"
    },
    "taxonomy_art_desc": "Acalypha salicifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Malpighiales, a large group of flowering plants known for their diverse morphology and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes many plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha salicifolia, a specific type of Acalypha known for its lance-shaped leaves and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha salicifolia is primarily native to Ecuador and Peru. It is commonly found in the Andean regions of these countries. This plant typically grows in moist, shaded areas such as forests and shrublands. It is well adapted to the tropical and subtropical climates of its native range. Its distribution is limited to specific ecological niches within Ecuador and Peru.",
    "distribution_introduced_art_desc": "Acalypha salicifolia was mainly introduced to ornamental horticulture due to its attractive, fern-like foliage and unique flowering structure. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been introduced to various parts of the world, including parts of the United States, Australia, and Southeast Asia. However, it is considered an invasive species in some areas where it can outcompete native vegetation. Proper management is necessary to prevent its spread in non-native habitats."
}
