{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha linearifolia",
    "plant_slug": "acalypha-linearifolia",
    "plant_name_scientific": "acalypha linearifolia",
    "intro": "Acalypha linearifolia, commonly known as the narrow-leaved spurge, is a herbaceous plant native to tropical and subtropical regions. It features slender, lance-shaped leaves that are often covered in fine hairs, giving it a soft, velvety texture. The plant produces small, greenish-yellow flowers arranged in clusters, which are typically borne on short, erect inflorescences. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha linearifolia is valued for its ornamental appeal and is sometimes used in horticulture for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha linearifolia"
    },
    "taxonomy_art_desc": "Acalypha linearifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations such as sticky seeds and specialized leaf structures. Its family is Euphorbiaceae, commonly known as the spurge family, which is characterized by the presence of latex and a wide variety of plant forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" often found in tropical and subtropical regions. Its species is Acalypha linearifolia, a specific plant within the genus Acalypha that is recognized for its linear leaves and is often found in moist, tropical environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha linearifolia is primarily native to Madagascar. It is commonly found in the island's dry and humid regions. This plant thrives in tropical climates with well-drained soils. It is often seen growing in open woodlands and along riverbanks. Its native distribution is largely restricted to Madagascar, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha linearifolia was mainly introduced to urban and disturbed areas due to its adaptability to various soil types and its ability to thrive in environments with moderate to high light exposure. It is commonly found along roadsides, construction sites, and in abandoned lots where human activity has altered the natural landscape. This plant has become a common weed in many regions, often outcompeting native vegetation due to its rapid growth and reproductive capabilities. Its introduction has led to ecological concerns in some areas, as it can alter local ecosystems and reduce biodiversity. Despite its invasive tendencies, Acalypha linearifolia is sometimes used in landscaping for its attractive foliage and ornamental value."
}
