{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha crenata",
    "plant_slug": "acalypha-crenata",
    "plant_name_scientific": "acalypha crenata",
    "intro": "Acalypha crenata, commonly known as the serrated glorybower, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, showy inflorescences that consist of clusters of small, pink or red flowers surrounded by bracts. The leaves are typically ovate with serrated edges, giving the plant its common name. It thrives in moist, well-drained soils and is often found in woodland or shrubland habitats. The plant is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant floral displays.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha crenata"
    },
    "taxonomy_art_desc": "Acalypha crenata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical and subtropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphologies. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupid's tears,\" characterized by their distinctive leaves and colorful bracts. Its species is Acalypha crenata, a specific type within the genus Acalypha, known for its serrated leaves and is native to certain regions in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Benin",
        "Burkina",
        "Burundi",
        "Cameroon",
        "Cape Verde",
        "Central African Republic",
        "Chad",
        "DR Congo",
        "Ethiopia",
        "Ghana",
        "Guinea",
        "Ivory Coast",
        "Kenya",
        "Liberia",
        "Malawi",
        "Mozambique",
        "Niger",
        "Nigeria",
        "Senegal",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Togo",
        "Uganda",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha crenata is primarily native to Benin, Burkina, Burundi, Cameroon, Cape Verde, Central African Republic, Chad, DR Congo, Ethiopia, Ghana, Guinea, Ivory Coast, Kenya, Liberia, Malawi, Mozambique, Niger, Nigeria, Senegal, Somalia, Sudan-South Sudan, Tanzania, Togo, Uganda, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions across these countries. The plant thrives in moist, well-drained soils and is often found in open woodlands, savannas, and along riverbanks. It is an important component of the local flora and is sometimes used for its ornamental or medicinal properties. Its wide distribution reflects its adaptability to various ecological conditions in sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Acalypha crenata was mainly introduced to ornamental horticulture due to its attractive foliage and adaptability to various growing conditions. It is commonly used in landscaping and as a houseplant because of its vibrant green leaves and compact growth habit. The plant thrives in warm climates and is often cultivated in tropical and subtropical regions. Its introduction has led to its presence in many garden settings worldwide. However, it is important to note that it may become invasive in certain environments if not managed properly."
}
