{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha australis f. glareosa",
    "plant_slug": "acalypha-australis-f-glareosa",
    "plant_name_scientific": "acalypha australis f. glareosa",
    "intro": "Acalypha australis f. glareosa, commonly known as the glossy abutilon, is a variant of the abutilon plant native to Australia. It is characterized by its striking, glossy green foliage that shimmers in sunlight. The plant produces showy, lantern-shaped yellow flowers that bloom in late spring to early summer. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardens. Its unique appearance and ease of care contribute to its popularity among gardeners.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha australis f. glareosa is primarily native to eastern Australia, including regions such as New South Wales and Queensland. This plant is commonly found in coastal and sandy soils, often growing in dune environments. It thrives in well-drained, sunny locations and is adapted to the temperate to subtropical climates of its native range. The variety is known for its distinctive, showy bracts that add ornamental value to the landscape. It plays an important ecological role in stabilizing coastal dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acalypha australis f. glareosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred in the 19th century during the colonial period when many exotic plants were imported for garden use. It has since become naturalized in certain areas, particularly in coastal and urban environments. However, it is not considered a major invasive species in New Zealand."
}
