{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha australis f. lanceolata",
    "plant_slug": "acalypha-australis-f-lanceolata",
    "plant_name_scientific": "acalypha australis f. lanceolata",
    "intro": "Acalypha australis f. lanceolata, commonly known as the narrow-leaved glorybower, is a flowering plant native to Australia. It is characterized by its lance-shaped leaves that are typically arranged oppositely along the stems. The plant produces striking, showy inflorescences with red or orange bracts that resemble flowers. It thrives in well-drained soils and is often found in coastal or sandy habitats. This ornamental plant is valued for its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha australis f. lanceolata is primarily native to eastern Australia, including New South Wales, Queensland, and the Australian Capital Territory. It is commonly found in coastal and coastal heathland environments. This plant thrives in sandy or loamy soils and is often associated with open vegetation types. It is well adapted to the temperate to subtropical climate of its native range. The species is also occasionally found in South Australia and Tasmania.",
    "distribution_introduced_art_desc": "Acalypha australis f. lanceolata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The distribution of this plant has been limited to specific regions within New Zealand, primarily in the North Island. It is commonly found in gardens and along the edges of forests where it thrives in moist, well-drained soils. Despite its ornamental value, it is considered a potential weed in some areas due to its ability to spread readily."
}
