{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gibsonii",
    "plant_slug": "acalypha-gibsonii",
    "plant_name_scientific": "acalypha gibsonii",
    "intro": "Acalypha gibsonii, commonly known as the Gibson's spurflower, is a flowering plant native to southern Africa. It belongs to the Euphorbiaceae family and is characterized by its distinctive, spiky inflorescences. The plant features palmate leaves with lobed margins, and its flowers are typically small and clustered in cyathia. It thrives in moist, well-drained soils and is often found in woodland or forested areas. Acalypha gibsonii is valued for its ornamental appeal and is cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha gibsonii"
    },
    "taxonomy_art_desc": "Acalypha gibsonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants with a wide range of morphological diversity, including some species with specialized adaptations for pollination. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive flowers and often toxic sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha gibsonii, a specific type of Acalypha native to certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gibsonii is primarily native to India. It is found in various regions across the country, particularly in the southern and eastern parts. This plant thrives in tropical and subtropical climates, often growing in open woodland or along roadsides. It is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its native range in India highlights its adaptation to the region's diverse ecosystems.",
    "distribution_introduced_art_desc": "Acalypha gibsonii was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It has since become naturalized in certain regions, particularly in the North Island, where it thrives in moist, shady environments. The plant is often found in forest margins and along stream banks, where it spreads through both seed dispersal and vegetative growth. Despite its aesthetic appeal, it has raised concerns due to its potential to invade native habitats and compete with indigenous plant species. Conservation efforts are ongoing to manage its spread and protect local biodiversity."
}
