{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha williamsii",
    "plant_slug": "acalypha-williamsii",
    "plant_name_scientific": "acalypha williamsii",
    "intro": "Acalypha williamsii, commonly known as the Williams' spurge, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, colorful bracts that often resemble flowers, though they are actually modified leaves. The plant typically grows as an annual or perennial herb, reaching heights of up to 1 meter. Its leaves are usually ovate or elliptical, with a smooth or slightly hairy surface. Acalypha williamsii thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha williamsii is primarily native to the island of Guam in the Mariana archipelago. It is commonly found in coastal areas and disturbed habitats, such as roadsides and abandoned fields. This species thrives in tropical and subtropical climates with high humidity and well-drained soils. It is often seen growing in the understory of native forests or in open areas with partial shade. Due to its adaptability, it has become an important part of the local ecosystem and is sometimes considered an invasive species in other regions.",
    "distribution_introduced_art_desc": "Acalypha williamsii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was first documented in the early 20th century and has since spread to other regions including parts of Southeast Asia and the Caribbean. The plant is often found in disturbed habitats such as roadsides, abandoned fields, and coastal areas where it can thrive in disturbed soils. Its rapid growth and ability to reproduce vegetatively have contributed to its spread beyond its original introduction sites. However, it is not considered invasive in most regions and is primarily cultivated for its aesthetic value."
}
