{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lanceolata var. glandulosa",
    "plant_slug": "acalypha-lanceolata-var-glandulosa",
    "plant_name_scientific": "acalypha lanceolata var. glandulosa",
    "intro": "Acalypha lanceolata var. glandulosa, commonly known as the sticky dock, is a flowering plant native to tropical and subtropical regions. It is characterized by its lance-shaped leaves that are covered in fine, sticky hairs, giving it a distinctive texture. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shady environments and is often found in wetlands or along stream banks. Its unique botanical features make it a notable species in ecological and horticultural contexts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lanceolata"
    },
    "taxonomy_art_desc": "Acalypha lanceolata var. glandulosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large and diverse order of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphologies and ecological roles. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupids,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha lanceolata, a specific type within the genus Acalypha, known for its lance-shaped leaves and is a variant of the glandulosa form.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "DR Congo",
        "Ethiopia",
        "Kenya",
        "Malawi",
        "Mozambique",
        "Rwanda",
        "Saudi Arabia",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda"
    ],
    "distribution_introduced": [
        "Comoros",
        "Madagascar",
        "Réunion"
    ],
    "distribution_native_art_desc": "Acalypha lanceolata var. glandulosa is primarily native to DR Congo, Ethiopia, Kenya, Malawi, Mozambique, Rwanda, Saudi Arabia, Sudan-South Sudan, Tanzania, and Uganda. This variant of Acalypha lanceolata is found across a range of tropical and subtropical regions in Africa and the Middle East. It typically grows in moist, well-drained soils in open woodlands, grasslands, and along riverbanks. The plant is known for its distinctive foliage and is sometimes used in traditional medicine. Its distribution reflects its adaptability to diverse environmental conditions across its native range.",
    "distribution_introduced_art_desc": "Acalypha lanceolata var. glandulosa was mainly introduced to Comoros, Madagascar, and Réunion. It is commonly found in coastal areas and disturbed habitats across these islands. The plant is often associated with human activities, such as agriculture and landscaping. It has become naturalized in these regions, sometimes outcompeting native vegetation. Its introduction has raised concerns about its impact on local ecosystems."
}
