{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lanceolata var. lanceolata",
    "plant_slug": "acalypha-lanceolata-var-lanceolata",
    "plant_name_scientific": "acalypha lanceolata var. lanceolata",
    "intro": "Acalypha lanceolata var. lanceolata, commonly known as the narrowleaf ironweed, is a herbaceous plant native to tropical and subtropical regions. It features striking, lance-shaped leaves that are often bright green with a reddish tint on the underside. The plant produces small, clustered flowers that are typically pink or red, which bloom in summer. It thrives in moist, well-drained soils and is often found in woodland or streamside habitats. Its ornamental value makes it a popular choice for gardeners seeking vibrant, low-maintenance foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lanceolata"
    },
    "taxonomy_art_desc": "Acalypha lanceolata var. lanceolata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and root system. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"spurge,\" characterized by their distinctive leaves and often colorful flowers. Its species is Acalypha lanceolata, a specific variety within the genus Acalypha, known for its lance-shaped leaves and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bangladesh",
        "Bismarck Archipelago",
        "Borneo",
        "Cambodia",
        "Caroline Is.",
        "Christmas I.",
        "Cocos (Keeling) Is.",
        "Cook Is.",
        "Fiji",
        "India",
        "Jawa",
        "Laccadive Is.",
        "Lesser Sunda Is.",
        "Malaya",
        "Maldives",
        "Maluku",
        "Myanmar",
        "New Guinea",
        "Northern Territory",
        "Philippines",
        "Queensland",
        "Samoa",
        "Solomon Is.",
        "South China Sea",
        "Sri Lanka",
        "Sulawesi",
        "Sumatera",
        "Taiwan",
        "Thailand",
        "Tonga",
        "Vietnam",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Niue",
        "Tokelau-Manihiki"
    ],
    "distribution_native_art_desc": "Acalypha lanceolata var. lanceolata is primarily native to Bangladesh, Bismarck Archipelago, Borneo, Cambodia, Caroline Is., Christmas I., Cocos (Keeling) Is., Cook Is., Fiji, India, Jawa, Laccadive Is., Lesser Sunda Is., Malaya, Maldives, Maluku, Myanmar, New Guinea, Northern Territory, Philippines, Queensland, Samoa, Solomon Is., South China Sea, Sri Lanka, Sulawesi, Sumatera, Taiwan, Thailand, Tonga, Vietnam, and Western Australia. This species is commonly found in tropical and subtropical regions, often growing in coastal areas or near water bodies. It thrives in humid climates and is often associated with mangrove or brackish water environments. The plant is well adapted to saline conditions and can tolerate fluctuating water levels. Its wide distribution suggests a strong ecological adaptability across diverse island and mainland habitats.",
    "distribution_introduced_art_desc": "Acalypha lanceolata var. lanceolata was mainly introduced to Niue, Tokelau-Manihiki. It is a variant of the species Acalypha lanceolata, which is known for its ornamental value and adaptability to various environmental conditions. The plant is typically found in coastal areas and disturbed sites, where it can thrive in sandy or rocky soils. Its introduction to these regions may have been for ornamental purposes or as part of ecological restoration efforts. However, its impact on local ecosystems requires further study to assess any potential invasive tendencies."
}
