{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha insulana var. insulana",
    "plant_slug": "acalypha-insulana-var-insulana",
    "plant_name_scientific": "acalypha insulana var. insulana",
    "intro": "Acalypha insulana var. insulana, commonly known as the insular acalypha, is a flowering plant native to the Pacific Islands. It is characterized by its distinctive, showy bracts that are often red or purple in color, resembling flowers. The plant typically grows as an upright shrub with smooth, dark green leaves. It thrives in moist, well-drained soils and is often found in coastal or disturbed habitats. Due to its ornamental value, it is cultivated in some tropical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha insulana"
    },
    "taxonomy_art_desc": "Acalypha insulana var. insulana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features and spore-producing reproductive systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and broad distribution. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with unique adaptations, such as the presence of latex and specialized leaf structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental gardening. Its species is Acalypha insulana, a specific type within the genus Acalypha, native to certain island regions and characterized by its distinct morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji",
        "Samoa",
        "Tonga",
        "Vanuatu"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha insulana var. insulana is primarily native to Fiji, Samoa, Tonga, and Vanuatu. This plant is commonly found in coastal areas and lowland forests within these island nations. It thrives in tropical climates with high humidity and well-drained soils. The species is often associated with disturbed habitats and can be found near human settlements. Its distribution is limited to the South Pacific region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha insulana var. insulana was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage. The plant has since become naturalized in certain areas of the island. It is commonly found in disturbed habitats such as roadsides and vacant lots. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
