{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neptunica var. pubescens",
    "plant_slug": "acalypha-neptunica-var-pubescens",
    "plant_name_scientific": "acalypha neptunica var. pubescens",
    "intro": "Acalypha neptunica var. pubescens, commonly known as the velvetleaf or sea hibiscus, is a flowering plant native to coastal regions of the Caribbean and parts of Central America. It is characterized by its striking, palmate leaves that are covered in fine, soft hairs, giving it a velvety texture. The plant produces showy, pink to red bracts that surround small, yellowish flowers, which bloom in late summer. It thrives in salty, humid environments and is often found growing near the shoreline. Due to its ornamental value, it is sometimes cultivated in coastal gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha neptunica"
    },
    "taxonomy_art_desc": "Acalypha neptunica var. pubescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations, such as specialized leaves and flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as the \"velvetleaf\" or \"cupseed\" plants, characterized by their distinctive foliage and often showy inflorescences. Its species is Acalypha neptunica, a specific type within the genus known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cameroon",
        "DR Congo",
        "Ethiopia",
        "Ghana",
        "Kenya",
        "Malawi",
        "Nigeria",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neptunica var. pubescens is primarily native to Cameroon, DR Congo, Ethiopia, Ghana, Kenya, Malawi, Nigeria, Sudan-South Sudan, Tanzania, and Uganda. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments, often growing in forest understories or along riverbanks. The species is known for its distinctive foliage and is sometimes used in traditional medicine. Its native distribution spans across much of sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Acalypha neptunica var. pubescens was mainly introduced to New Zealand. It was introduced as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain regions, particularly in the North Island. It is commonly found in coastal areas and disturbed sites where it can thrive in a variety of soil conditions. However, its spread has raised concerns due to its potential to become invasive in native ecosystems."
}
