{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha dalzellii",
    "plant_slug": "acalypha-dalzellii",
    "plant_name_scientific": "acalypha dalzellii",
    "intro": "Acalypha dalzellii, commonly known as the velvetleaf or redleaf acalypha, is a tropical shrub native to Southeast Asia. It is characterized by its striking, palmate leaves that are often covered in a fine, velvety texture. The plant produces small, clustered flowers that are typically green or reddish in color. It thrives in humid, shaded environments and is often found in forest understories. Acalypha dalzellii is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha dalzellii"
    },
    "taxonomy_art_desc": "Acalypha dalzellii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and includes both living and extinct species. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with unique adaptations and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha dalzellii, a specific type within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha dalzellii is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with forest understories or disturbed sites. It is also present in parts of India and the Andaman Islands. Acalypha dalzellii is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha dalzellii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there in the late 19th or early 20th century by horticulturalists seeking exotic plants for gardens and landscapes. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed soils and can spread rapidly through seed dispersal by wind and water. Its introduction highlights the ecological risks associated with non-native species in island environments."
}
