{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha insulana var. flavicans",
    "plant_slug": "acalypha-insulana-var-flavicans",
    "plant_name_scientific": "acalypha insulana var. flavicans",
    "intro": "Acalypha insulana var. flavicans, commonly known as the golden flame acalypha, is a flowering plant native to tropical regions of the Pacific. It is characterized by its striking, bright yellow bracts that resemble flowers, which are actually modified leaves. The plant produces small, inconspicuous greenish-white flowers clustered within the bracts. It thrives in warm, humid climates and requires well-drained soil for optimal growth. This variety is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha insulana"
    },
    "taxonomy_art_desc": "Acalypha insulana var. flavicans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupids,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha insulana, a specific type within the genus Acalypha, known for its unique characteristics and geographical distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha insulana var. flavicans is primarily native to Fiji. This plant is found in the tropical regions of the Fiji Islands. It typically grows in coastal areas and disturbed habitats. The species is adapted to the humid and warm climate of the region. It plays an important role in the local ecosystem and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha insulana var. flavicans was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred in the late 19th or early 20th century. It has since become naturalized in certain areas, particularly in disturbed habitats and along stream banks. However, it is not considered invasive and poses minimal ecological threat in the region."
}
