{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha senensis var. chariensis",
    "plant_slug": "acalypha-senensis-var-chariensis",
    "plant_name_scientific": "acalypha senensis var. chariensis",
    "intro": "Acalypha senensis var. chariensis, commonly known as the red-veined nettle, is a tropical shrub native to Southeast Asia. It is characterized by its striking, bright red veins on its heart-shaped leaves, which contrast sharply with its deep green foliage. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in humid, warm climates and is often found in lowland forests or along stream banks. Due to its ornamental value, it is cultivated in gardens and as a houseplant in many regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha senensis var. chariensis is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. It thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. The plant is known for its ornamental value due to its striking foliage and is sometimes cultivated in gardens. Its distribution is closely linked to the tropical climate and specific ecological conditions of the region.",
    "distribution_introduced_art_desc": "Acalypha senensis var. chariensis was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its striking foliage. It was first documented in the early 20th century and has since become naturalized in several regions. The plant thrives in tropical and subtropical climates, often growing in disturbed soils and coastal areas. Its rapid growth and ability to spread through vegetative propagation have led to its classification as an invasive species in some locations. Despite its aesthetic appeal, it poses a threat to native ecosystems by outcompeting local flora."
}
