{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata var. pervilleana",
    "plant_slug": "acalypha-reticulata-var-pervilleana",
    "plant_name_scientific": "acalypha reticulata var. pervilleana",
    "intro": "Acalypha reticulata var. pervilleana, commonly known as the velvetleaf or silkyleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, palmate leaves that are often covered in fine, silky hairs, giving it a soft, velvety texture. The plant produces clusters of small, greenish-white flowers that are typically borne in dense inflorescences. It thrives in moist, well-drained soils and prefers partial to full sunlight. Due to its ornamental value, it is often cultivated in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata var. pervilleana is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This variant is typically associated with lowland forests and is sometimes seen in disturbed or secondary vegetation. It thrives in humid climates with well-drained soil, making it a common understory plant in many parts of its native range. The plant is known for its striking foliage and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha reticulata var. pervilleana was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and as a decorative plant. The plant's ability to thrive in a variety of soil types and its tolerance to partial shade make it a popular choice for both indoor and outdoor settings. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in regions where it is not native."
}
