{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha longispicata",
    "plant_slug": "acalypha-longispicata",
    "plant_name_scientific": "acalypha longispicata",
    "intro": "Acalypha longispicata, commonly known as the long-spined spurflower, is a shrub native to tropical and subtropical regions of Asia and Africa. It is characterized by its distinctive, spiny bracts that surround its small, greenish-white flowers. The plant typically grows to a height of 1 to 3 meters and thrives in moist, well-drained soils. Its leaves are usually ovate to elliptic in shape, with a smooth or slightly hairy surface. Acalypha longispicata is often cultivated for its ornamental value due to its unique foliage and floral structure.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha longispicata"
    },
    "taxonomy_art_desc": "Acalypha longispicata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms. Its order is Malpighiales, a diverse group of flowering plants that includes many economically important species such as cacao and coffee. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupid's bow,\" characterized by their showy inflorescences. Its species is Acalypha longispicata, a specific plant within the genus Acalypha known for its distinctive floral structures and native habitat in certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha longispicata is primarily native to Mexico Northeast. It is commonly found in the northeastern regions of Mexico, including states such as Tamaulipas, Nuevo León, and parts of Coahuila. This plant typically grows in tropical and subtropical environments, often in areas with moist soil and partial shade. It is well adapted to the climate and ecological conditions of its native range. Acalypha longispicata is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acalypha longispicata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first recorded in the 19th century and has since become established in various regions of the country. The plant thrives in moist, shady environments and is commonly found in forested areas and along stream banks. Although it is not considered a major invasive species, it can outcompete native plants in certain habitats. Its introduction highlights the ongoing challenge of managing non-native species in ecological systems."
}
