{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ecklonii",
    "plant_slug": "acalypha-ecklonii",
    "plant_name_scientific": "acalypha ecklonii",
    "intro": "Acalypha ecklonii, commonly known as the red-hot poker, is a flowering plant native to South Africa. It is characterized by its striking, torch-like inflorescences that are typically red or orange in color. The plant features palmate leaves with five to seven lobes, giving it a distinctive appearance. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Acalypha ecklonii is often used in landscaping for its vibrant floral displays and hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha ecklonii"
    },
    "taxonomy_art_desc": "Acalypha ecklonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some toxic species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf\" plants, characterized by their showy flowers and often hairy leaves. Its species is Acalypha ecklonii, a specific plant within the genus Acalypha, known for its distinctive foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces",
        "Namibia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ecklonii is primarily native to the Cape Provinces and Namibia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy or rocky soils and is often seen in coastal and inland desert environments. It plays an important role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to these specific regions in southern Africa.",
    "distribution_introduced_art_desc": "Acalypha ecklonii was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since been reported in several regions across the country, particularly in areas with mild climates and well-drained soils. The plant's rapid growth and ability to spread through both seeds and vegetative means have raised concerns about its potential to become invasive. Despite its ornamental value, its establishment in natural ecosystems has led to monitoring efforts to assess its impact on native flora. Proper management and control measures are recommended to prevent its spread in non-target environments."
}
