{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fruticosa",
    "plant_slug": "acalypha-fruticosa",
    "plant_name_scientific": "acalypha fruticosa",
    "intro": "Acalypha fruticosa, commonly known as the red torch or red flame plant, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is a shrub or small tree that can grow up to 6 meters tall, characterized by its vibrant red bracts that surround its small, inconspicuous flowers. The plant produces clusters of yellow flowers that are surrounded by striking red, papery bracts, which are often mistaken for petals. Its leaves are opposite, ovate, and have a velvety texture, often with a reddish or purple tinge on the underside. Acalypha fruticosa is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha fruticosa"
    },
    "taxonomy_art_desc": "Acalypha fruticosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a large and diverse group of flowering plants that includes many plants with specialized structures such as stipules and unique flower arrangements. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their distinctive foliage and often colorful flowers. Its species is Acalypha fruticosa, a specific type of plant within the genus Acalypha, known for its shrub-like growth and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Burundi",
        "Djibouti",
        "Eritrea",
        "Ethiopia",
        "India",
        "Kenya",
        "Malawi",
        "Mozambique",
        "Myanmar",
        "Namibia",
        "Saudi Arabia",
        "Somalia",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Yemen",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fruticosa is primarily native to Botswana, Burundi, Djibouti, Eritrea, Ethiopia, India, Kenya, Malawi, Mozambique, Myanmar, Namibia, Saudi Arabia, Somalia, Sri Lanka, Sudan-South Sudan, Tanzania, Uganda, Yemen, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions across these countries. This plant thrives in a variety of habitats, including grasslands, shrublands, and along riverbanks. It is well adapted to arid and semi-arid environments, making it a resilient species in these regions. Its widespread distribution reflects its ability to tolerate diverse climatic conditions.",
    "distribution_introduced_art_desc": "Acalypha fruticosa was mainly introduced to control erosion and stabilize soil in degraded areas. It is commonly used in reclamation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its ornamental qualities, with its vibrant foliage making it a popular choice in landscaping. However, its invasive potential has raised concerns in some regions where it may outcompete native vegetation. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
