{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sonderi",
    "plant_slug": "acalypha-sonderi",
    "plant_name_scientific": "acalypha sonderi",
    "intro": "Acalypha sonderi, commonly known as the silver leaf tree, is a tropical shrub or small tree native to Southeast Asia. It is characterized by its striking silver-gray foliage, which results from dense pubescent (hairy) leaves. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in warm, humid climates and is often cultivated for its ornamental value. Acalypha sonderi is also used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha sonderi"
    },
    "taxonomy_art_desc": "Acalypha sonderi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large and diverse order of flowering plants that includes many species with unique morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvet plants\" due to their soft, hairy leaves. Its species is Acalypha sonderi, a specific type of velvet plant native to certain regions of Africa, characterized by its distinctive foliage and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sonderi is primarily native to the Cape Provinces. This plant is found in the coastal and mountainous regions of this area. It thrives in a variety of habitats, including rocky outcrops and sandy soils. The Cape Provinces provide the ideal climate and environmental conditions for its growth. It is an important part of the local flora and ecosystem in this region.",
    "distribution_introduced_art_desc": "Acalypha sonderi was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habit. It was first recorded in the 19th century and has since become naturalized in several regions across the country. The plant is commonly found in coastal areas and disturbed habitats, where it spreads through both seeds and vegetative propagation. Despite its aesthetic appeal, it is considered a potential environmental weed in some parts of New Zealand. Its distribution has been expanding, raising concerns about its impact on native ecosystems."
}
