{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wilkesiana f. appendiculata",
    "plant_slug": "acalypha-wilkesiana-f-appendiculata",
    "plant_name_scientific": "acalypha wilkesiana f. appendiculata",
    "intro": "Acalypha wilkesiana f. appendiculata, commonly known as the silver flame plant, is a flowering plant native to tropical regions of the Americas. It is characterized by its striking, velvety silver-green foliage with reddish veins, which gives it a distinctive appearance. The plant produces small, inconspicuous flowers that are typically greenish-yellow in color. It thrives in warm, humid environments and prefers well-drained soil. This cultivar is often used in ornamental gardening for its aesthetic appeal and ability to thrive in indoor or outdoor settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha wilkesiana f. appendiculata is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This plant thrives in warm, humid climates and is commonly found in lowland areas with rich, well-drained soils. It is often associated with coastal regions and is adapted to thrive in saline or brackish environments. The species is also native to parts of Oceania, including Papua New Guinea and the Solomon Islands. Its native distribution reflects its preference for tropical and subtropical habitats.",
    "distribution_introduced_art_desc": "Acalypha wilkesiana f. appendiculata was mainly introduced to ornamental horticulture and landscaping due to its vibrant foliage and ornamental value. It is commonly cultivated in tropical and subtropical regions for use in gardens, public spaces, and as a decorative plant. The plant's ability to thrive in a variety of soil types and its relatively low maintenance requirements contribute to its popularity. However, it has also been reported as an invasive species in some areas, where it can outcompete native vegetation. Its introduction has led to ecological concerns in certain regions, prompting management strategies to control its spread."
}
