{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis f. grandifolia",
    "plant_slug": "acalypha-communis-f-grandifolia",
    "plant_name_scientific": "acalypha communis f. grandifolia",
    "intro": "Acalypha communis f. grandifolia, commonly known as the giant variegated iron plant, is a striking ornamental shrub native to tropical regions of Africa. It features broad, heart-shaped leaves with striking variegation of white, yellow, and green, adding visual interest to gardens. The plant produces small, clustered flowers that are typically greenish-white in color, followed by distinctive, papery bracts that enhance its ornamental value. It thrives in full sun to partial shade and requires well-drained soil to prevent root rot. Due to its vibrant foliage, it is popular in landscaping for its aesthetic appeal and adaptability to various climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis f. grandifolia is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This plant thrives in tropical and subtropical regions, often found in lowland areas with high humidity. It is commonly associated with moist, shaded environments such as forest understories and along stream banks. The species is also present in parts of the Pacific Islands, including Hawaii and the Solomon Islands. Its native range extends to some regions of northern Australia as well.",
    "distribution_introduced_art_desc": "Acalypha communis f. grandifolia was mainly introduced to ornamental horticulture due to its attractive foliage and showy flowers. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species is often used in landscaping and as a houseplant because of its ability to thrive in shaded to partially sunny conditions. Its rapid growth and adaptability make it a popular choice for gardeners seeking low-maintenance plants. However, it can become invasive in some environments if not properly managed."
}
