{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gemina var. lanceolata",
    "plant_slug": "acalypha-gemina-var-lanceolata",
    "plant_name_scientific": "acalypha gemina var. lanceolata",
    "intro": "Acalypha gemina var. lanceolata, commonly known as the narrow-leaf copperleaf, is a strikingly ornamental shrub native to tropical regions. It features lance-shaped leaves that are often a vibrant green with a reddish or purple tinge on the underside. The plant produces clusters of small, inconspicuous greenish-white flowers, followed by distinctive red or orange seed capsules. It thrives in warm, humid climates and requires well-drained soil to prevent root rot. This variety is prized for its foliage rather than its flowers, making it a popular choice for ornamental gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gemina var. lanceolata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. It thrives in moist, well-drained soils and is often associated with rainforests or secondary growth habitats. The plant is known for its ornamental value and is sometimes cultivated for its attractive foliage. Its distribution is closely linked to the climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acalypha gemina var. lanceolata was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there by horticulturists and gardeners seeking to diversify local plant collections with exotic species. Despite its aesthetic appeal, the plant has shown potential to become invasive in some areas, outcompeting native vegetation. Its rapid growth and ability to spread through both seeds and vegetative means have raised concerns among conservationists. Therefore, its introduction has led to ongoing discussions about managing its impact on native ecosystems."
}
