{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha padifolia",
    "plant_slug": "acalypha-padifolia",
    "plant_name_scientific": "acalypha padifolia",
    "intro": "Acalypha padifolia, commonly known as the velvetleaf or silverleaf acalypha, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, velvety, silver-green leaves that are often covered in fine, soft hairs. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Acalypha padifolia is sometimes cultivated for its ornamental value due to its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha padifolia"
    },
    "taxonomy_art_desc": "Acalypha padifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with specialized adaptations for various ecological niches. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" often characterized by their colorful bracts. Its species is Acalypha padifolia, a specific type of plant within the Acalypha genus, known for its distinctive foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Colombia",
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha padifolia is primarily native to Bolivia, Colombia, Ecuador, and Peru. This plant is commonly found in the Andean regions of these countries. It thrives in tropical and subtropical climates, often growing in open woodlands or disturbed areas. The species is known for its ornamental value and is sometimes cultivated for its foliage. Its natural range reflects its adaptation to the diverse ecosystems of South America.",
    "distribution_introduced_art_desc": "Acalypha padifolia was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in gardens and landscapes in countries such as Australia, Hawaii, and parts of Southeast Asia. The plant thrives in warm climates with high humidity and well-drained soil. Its rapid growth and ability to spread through seeds make it a potential invasive species in some areas. However, it is often cultivated for its aesthetic value rather than for ecological impact."
}
