{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha adenostachya",
    "plant_slug": "acalypha-adenostachya",
    "plant_name_scientific": "acalypha adenostachya",
    "intro": "Acalypha adenostachya, commonly known as the velvetleaf or silverleaf acalypha, is a shrub native to tropical regions of Africa and Asia. It is characterized by its hairy, ovate leaves that are often silver or gray in color due to a dense covering of fine hairs. The plant produces small, clustered flowers that are typically green or yellowish in hue. It thrives in moist, shaded environments and is often found in forest understories. Acalypha adenostachya is valued for its ornamental appeal and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha adenostachya"
    },
    "taxonomy_art_desc": "Acalypha adenostachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various habitats. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper spurge,\" characterized by their showy bracts and hairy leaves. Its species is Acalypha adenostachya, a specific plant within the genus Acalypha, known for its distinctive floral structure and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha adenostachya is primarily native to Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid environments and is often associated with disturbed soils or open habitats. The species is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its native range reflects its adaptability to diverse ecological conditions across central and southern Mexico.",
    "distribution_introduced_art_desc": "Acalypha adenostachya was mainly introduced to new environments as an ornamental plant due to its attractive foliage and unique appearance. It has been widely cultivated in tropical and subtropical regions for its aesthetic value in gardens and landscapes. However, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its success as an introduced species. Despite its ornamental appeal, its ecological impact has raised concerns among conservationists and land managers."
}
