{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gummifera",
    "plant_slug": "acalypha-gummifera",
    "plant_name_scientific": "acalypha gummifera",
    "intro": "Acalypha gummifera, commonly known as the stickyleaf or gumtree, is a shrub or small tree native to tropical regions of Africa and Asia. It is characterized by its smooth, often sticky bark and heart-shaped leaves that are usually green with a waxy texture. The plant produces small, inconspicuous flowers followed by capsules that release tiny seeds. It thrives in moist, well-drained soils and is often found in forest understories or along riverbanks. Acalypha gummifera is valued for its ornamental appeal and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha gummifera"
    },
    "taxonomy_art_desc": "Acalypha gummifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes species with diverse growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with various types of flowers and often produces toxic sap. Its genus is Acalypha, which consists of flowering plants typically characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha gummifera, a specific type of plant known for its distinctive features and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Guatemala",
        "Honduras",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gummifera is primarily native to Belize, Guatemala, Honduras, and southeastern Mexico. This plant is commonly found in tropical and subtropical regions within these countries. It typically grows in lowland areas with well-drained soils. The species is often associated with disturbed habitats such as forest edges and cleared land. Its distribution is largely confined to the Neotropical region of Central America.",
    "distribution_introduced_art_desc": "Acalypha gummifera was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in disturbed soils and can spread rapidly along roadsides and forest edges. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
