{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gracilis var. fruticulosa",
    "plant_slug": "acalypha-gracilis-var-fruticulosa",
    "plant_name_scientific": "acalypha gracilis var. fruticulosa",
    "intro": "Acalypha gracilis var. fruticulosa, commonly known as the red-leaf hibiscus, is a flowering plant native to tropical regions of the Americas. It is characterized by its slender, branching stems and striking, velvety red or purple leaves. The plant produces small, pale yellow flowers that are often clustered in terminal inflorescences. It thrives in humid, warm climates and is often cultivated for its ornamental foliage. Due to its compact growth habit, it is suitable for container gardening and small garden spaces.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gracilis var. fruticulosa is primarily native to the southeastern United States, including parts of Florida, Georgia, and South Carolina. It thrives in moist, sandy soils and is commonly found in wetlands, swamps, and along the edges of water bodies. This variant is adapted to humid climates and is often seen in coastal areas and riverine habitats. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. Its distribution is largely restricted to the southeastern region due to its specific environmental requirements.",
    "distribution_introduced_art_desc": "Acalypha gracilis var. fruticulosa was mainly introduced to the Pacific Islands. It was brought there intentionally for ornamental purposes due to its attractive foliage. The plant has since become naturalized in several coastal areas. It is often found growing in disturbed soils and along roadsides. However, its spread is limited compared to other invasive species in the region."
}
