{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wilkesiana var. marginata",
    "plant_slug": "acalypha-wilkesiana-var-marginata",
    "plant_name_scientific": "acalypha wilkesiana var. marginata",
    "intro": "Acalypha wilkesiana var. marginata, commonly known as the Chinese lantern plant, is a flowering shrub native to Southeast Asia. It is characterized by its striking, papery bracts that resemble small lanterns, which are typically red, orange, or yellow in color. The plant has heart-shaped, glossy green leaves with a waxy texture and a slightly serrated margin. It produces small, inconspicuous yellow flowers that emerge from the base of the bracts. This species thrives in warm, humid climates and is often cultivated as an ornamental plant for its vibrant foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha wilkesiana var. marginata is primarily native to tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, warm climates and is commonly found in lowland forests and coastal areas. This variant is known for its striking red and green foliage, which makes it a popular ornamental plant. It is also native to parts of the Pacific Islands, including Hawaii and the Philippines. Due to its adaptability, it has been introduced to other tropical and subtropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha wilkesiana var. marginata was mainly introduced to ornamental horticulture and landscaping due to its vibrant, colorful foliage. It is commonly used in tropical and subtropical regions for its aesthetic appeal and ability to thrive in warm climates. The plant's unique leaf patterns and adaptability to various soil types have contributed to its popularity among gardeners and landscapers. It has been introduced to many parts of the world, including the United States, Australia, and parts of Europe. However, in some areas, it has become invasive, raising concerns about its ecological impact."
}
