{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gracilis",
    "plant_slug": "acalypha-gracilis",
    "plant_name_scientific": "acalypha gracilis",
    "intro": "Acalypha gracilis, commonly known as the slender croton, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its slender, erect stems and opposite, ovate leaves that are often reddish or variegated in color. The plant produces small, clustered flowers that are typically yellow or greenish-yellow, followed by distinctive, spiny capsules containing numerous seeds. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Due to its ornamental value, it is sometimes cultivated in gardens, though it can be invasive in certain environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha gracilis"
    },
    "taxonomy_art_desc": "Acalypha gracilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with varied leaf and flower structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha gracilis, a specific plant within the genus Acalypha, known for its slender growth and distinctive floral structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Brazil North",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Paraguay",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gracilis is primarily native to Argentina Northeast, Argentina Northwest, Brazil North, Brazil Northeast, Brazil South, Brazil Southeast, Brazil West-Central, Paraguay, and Uruguay. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, well-drained soils and is often associated with humid climates. Acalypha gracilis is typically found in open woodlands, shrublands, and along riverbanks. Its distribution reflects its adaptability to a variety of ecological conditions across South America.",
    "distribution_introduced_art_desc": "Acalypha gracilis was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and adaptability to various growing conditions. It is commonly used in gardens, as a ground cover, and in mixed plantings to add visual interest. The plant is valued for its ability to thrive in both sunny and shaded areas, making it a versatile choice for different garden settings. However, in some regions, it has been reported to spread aggressively, raising concerns about its potential as an invasive species. Proper management is recommended to prevent unintended ecological impacts."
}
