{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hederacea var. oligodonta",
    "plant_slug": "acalypha-hederacea-var-oligodonta",
    "plant_name_scientific": "acalypha hederacea var. oligodonta",
    "intro": "Acalypha hederacea var. oligodonta, commonly known as the creeping nettle or velvetleaf, is a herbaceous perennial plant native to tropical and subtropical regions. It features heart-shaped leaves with a velvety texture and prominent veins, often covered in fine hairs. The plant produces small, greenish-white flowers arranged in clusters, which are followed by distinctive, spiny seed capsules. It thrives in moist, shaded environments and is often found in disturbed soils. Its rapid growth and adaptability make it a common weed in agricultural and urban settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hederacea var. oligodonta is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This variant thrives in shaded to semi-shaded environments, often growing along forest edges or in disturbed habitats. It is also known to occur in parts of the Philippines and southern China. Its distribution is closely linked to its preference for moist, well-drained soils in warm, humid conditions.",
    "distribution_introduced_art_desc": "Acalypha hederacea var. oligodonta was mainly introduced to New Zealand. It was introduced as an ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shady environments and spreads rapidly through both seeds and vegetative reproduction. Its introduction has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
