{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hibiscifolia",
    "plant_slug": "acalypha-hibiscifolia",
    "plant_name_scientific": "acalypha hibiscifolia",
    "intro": "Acalypha hibiscifolia, commonly known as the Hibiscifolius Acalypha, is a tropical shrub native to Southeast Asia. It is characterized by its striking, palmately lobed leaves that are often bright green with a velvety texture. The plant produces showy, urn-shaped flowers in shades of red, orange, or yellow, which bloom in clusters. It thrives in moist, well-drained soil and requires partial to full sunlight. Acalypha hibiscifolia is often cultivated for its ornamental value in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha hibiscifolia"
    },
    "taxonomy_art_desc": "Acalypha hibiscifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing rhizomes. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral structures and often used in traditional medicine. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha hibiscifolia, a specific plant within the genus Acalypha, known for its hibiscus-like flowers and native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hibiscifolia is primarily native to Bolivia. It is found in the Andean region of the country, particularly in the departments of La Paz, Cochabamba, and Santa Cruz. This plant typically grows in moist, well-drained soils along riverbanks and in forested areas. It is adapted to the temperate climate of the highlands and lowlands of Bolivia. Its distribution is limited to specific ecological niches within the country.",
    "distribution_introduced_art_desc": "Acalypha hibiscifolia was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was brought there during the 19th century by early settlers and gardeners who sought to add exotic plant species to their landscapes. Despite its ornamental value, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, shady environments and spreads rapidly through both seeds and vegetative reproduction. Its introduction has led to increased management efforts to control its spread and protect native biodiversity."
}
