{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha buddleifolia",
    "plant_slug": "acalypha-buddleifolia",
    "plant_name_scientific": "acalypha buddleifolia",
    "intro": "Acalypha buddleifolia, commonly known as the flame-of-the-forest, is a deciduous shrub or small tree native to Southeast Asia. It is characterized by its striking, bright red bracts that resemble flames, which appear in clusters at the ends of its branches. The plant has simple, opposite, ovate leaves with a slightly hairy surface. It produces small, inconspicuous flowers that are followed by three-winged, elliptical fruits. Acalypha buddleifolia thrives in tropical and subtropical climates and is often cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha buddleifolia"
    },
    "taxonomy_art_desc": "Acalypha buddleifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often with a distinct morphological structure. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various ecological niches. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of morphological diversity and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha buddleifolia, a specific plant within the genus Acalypha, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha buddleifolia is primarily native to Peru. It is commonly found in the Andean regions of the country, particularly in the highlands and valleys. This plant thrives in temperate climates and is often associated with rocky or disturbed soils. It is an important species in local ecosystems and has traditional uses by indigenous communities. Its distribution is largely restricted to the western parts of Peru.",
    "distribution_introduced_art_desc": "Acalypha buddleifolia was mainly introduced to ornamental horticulture due to its striking foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and landscapes. The plant's rapid growth and ability to thrive in disturbed soils have contributed to its spread beyond cultivated areas. It is often found in urban environments, along roadsides, and in waste areas where it can become invasive. Despite its ornamental appeal, it requires careful management to prevent it from becoming a weed in natural ecosystems."
}
