{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha multispicata",
    "plant_slug": "acalypha-multispicata",
    "plant_name_scientific": "acalypha multispicata",
    "intro": "Acalypha multispicata, commonly known as the red-hot catwhiskers, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, crimson bracts that resemble cat whiskers, which are actually modified leaves rather than flowers. The plant produces small, inconspicuous yellow flowers clustered in dense inflorescences. It thrives in warm, humid climates and is often cultivated as an ornamental plant for its vibrant foliage. Acalypha multispicata is also valued in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha multispicata"
    },
    "taxonomy_art_desc": "Acalypha multispicata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral structures and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants known for their showy flowers and often used in ornamental horticulture. Its species is Acalypha multispicata, a specific type of plant within the genus Acalypha, characterized by its unique floral and vegetative features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha multispicata is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in dry, rocky soils and is commonly found in desert scrublands. It is a shrub or small tree that adapts well to the harsh environmental conditions. Its native range is limited to specific regions within Mexico Southwest, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha multispicata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It was first recorded in the 19th century and has since become naturalized in several regions across the country. The plant thrives in moist, well-drained soils and is commonly found in coastal and lowland areas. Its spread has been facilitated by its ability to reproduce both sexually and vegetatively. However, it is not considered a major invasive species in New Zealand."
}
