{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tunguraguae",
    "plant_slug": "acalypha-tunguraguae",
    "plant_name_scientific": "acalypha tunguraguae",
    "intro": "Acalypha tunguraguae, commonly known as the Tunguragua beauty, is a flowering plant native to Ecuador. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that resemble petals. The plant produces small, inconspicuous flowers clustered within the bracts, which are often the primary ornamental feature. Its leaves are typically ovate to lanceolate, with a smooth or slightly hairy surface. Acalypha tunguraguae is valued in horticulture for its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tunguraguae is primarily native to the Andean regions of Ecuador and Peru. This species is found in the cloud forests and humid montane areas of these countries. It thrives in high-altitude environments with cool and moist conditions. The plant is part of the Euphorbiaceae family and is known for its distinctive foliage. Its limited distribution makes it a rare and ecologically significant species in the region.",
    "distribution_introduced_art_desc": "Acalypha tunguraguae was mainly introduced to areas with disturbed soils and human-altered landscapes. It thrives in environments with moderate to high light exposure and can tolerate a range of soil types. This plant is often found in urban and agricultural settings where it can outcompete native vegetation. Its rapid growth and ability to spread through seeds make it an invasive species in many regions. Due to its adaptability, it has become a significant ecological concern in several parts of its introduced range."
}
