{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha magistri",
    "plant_slug": "acalypha-magistri",
    "plant_name_scientific": "acalypha magistri",
    "intro": "Acalypha magistri, commonly known as the velvetleaf or sacred plant, is a tropical shrub native to Southeast Asia. It is characterized by its heart-shaped leaves that are covered in a fine, velvety texture, giving it its common name. The plant produces small, clustered flowers that are typically green or yellow, followed by distinctive, spiky seed capsules. It thrives in moist, shady environments and is often found in forest understories. Due to its ornamental value and cultural significance, it is cultivated in some regions for horticultural purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha magistri"
    },
    "taxonomy_art_desc": "Acalypha magistri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with varied morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which consists of plants with often milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false pomegranate,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha magistri, a specific type within the genus Acalypha, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha magistri is primarily native to Madagascar. This plant is found in the diverse ecosystems of the island, including forested areas and coastal regions. It thrives in the tropical climate, which provides the necessary warmth and humidity. The species is adapted to the unique environmental conditions of Madagascar, making it a characteristic element of the local flora. Its native distribution is largely restricted to this island, highlighting its ecological significance in the region.",
    "distribution_introduced_art_desc": "Acalypha magistri was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists seeking exotic plants for gardens and landscaping. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed soils and can spread rapidly through seed dispersal by wind and water. Its introduction highlights the ecological risks associated with non-native plant species in island environments."
}
