{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica var. gracilens",
    "plant_slug": "acalypha-virginica-var-gracilens",
    "plant_name_scientific": "acalypha virginica var. gracilens",
    "intro": "Acalypha virginica var. gracilens, commonly known as slender coralplant, is a herbaceous perennial native to the southeastern United States. It features slender, upright stems with opposite, lance-shaped leaves that are often tinged with red or purple at the base. The plant produces small, clustered inflorescences of greenish-white flowers, which are surrounded by bracts that give it a coral-like appearance. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. This species is valued for its ornamental appeal and ecological benefits in native plant gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica var. gracilens is primarily native to the southeastern United States, including parts of Florida, Georgia, South Carolina, and North Carolina. This variant is commonly found in moist, disturbed habitats such as roadside ditches, wetlands, and along stream banks. It thrives in areas with rich, sandy soils and partial to full sunlight. The plant is often seen in wetter environments compared to the typical form of Acalypha virginica. It plays an important role in local ecosystems by providing food and habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acalypha virginica var. gracilens was mainly introduced to wetlands and disturbed areas such as roadsides, ditches, and along stream banks. It thrives in moist to wet soils and full sun to partial shade conditions. This plant is often found in the southeastern United States, particularly in states like Florida, Georgia, and South Carolina. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded as a result of human activity and its adaptability to various environmental conditions."
}
