{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chocoana",
    "plant_slug": "acalypha-chocoana",
    "plant_name_scientific": "acalypha chocoana",
    "intro": "Acalypha chocoana, commonly known as the Chocoan spurflower, is a flowering plant native to the tropical regions of South America, particularly in Colombia and Ecuador. It belongs to the Euphorbiaceae family, which is known for its diverse and often ornamental species. The plant is characterized by its striking, palmate leaves that are often brightly colored, and its small, clustered yellow flowers. It thrives in moist, shaded environments and is often found in humid lowland forests. Due to its unique appearance and limited distribution, it is considered a valuable species for botanical study and conservation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha chocoana"
    },
    "taxonomy_art_desc": "Acalypha chocoana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malpighiales, a large and diverse order of flowering plants that includes many tropical and subtropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic or latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha chocoana, a specific plant within the genus Acalypha, native to tropical regions and known for its ornamental value and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chocoana is primarily native to Colombia. It is found in the tropical regions of the country, particularly in the western and southwestern areas. This plant thrives in humid, shaded environments within the rainforests. It is commonly associated with the Chocó Department, known for its high biodiversity. Acalypha chocoana plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acalypha chocoana was mainly introduced to tropical and subtropical regions, particularly in the Americas and parts of Southeast Asia. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant thrives in moist, sunny environments and is often associated with human-altered landscapes. Its introduction has led to its establishment in several non-native areas, sometimes becoming invasive. The distribution of Acalypha chocoana is largely driven by its adaptability and ability to spread through wind-dispersed seeds."
}
