{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha heterodonta var. psilocarpa",
    "plant_slug": "acalypha-heterodonta-var-psilocarpa",
    "plant_name_scientific": "acalypha heterodonta var. psilocarpa",
    "intro": "Acalypha heterodonta var. psilocarpa, commonly known as the \"ghost plant,\" is a striking tropical plant native to Southeast Asia. It is characterized by its unique, often bioluminescent-like appearance, with dark purple or black leaves that shimmer under light. The plant is a member of the Euphorbiaceae family, known for its diverse and sometimes toxic species. Its foliage is often used in ornamental horticulture due to its visual appeal. However, it is important to note that while it is not psychoactive, some varieties of Acalypha have been associated with hallucinogenic properties in certain cultural contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha heterodonta var. psilocarpa is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland rainforests and secondary growth areas. This species thrives in humid environments with well-drained soil and partial to full sunlight. It is often associated with disturbed habitats and can be found near human settlements. Its native range extends to parts of Oceania, including Papua New Guinea and the Solomon Islands.",
    "distribution_introduced_art_desc": "Acalypha heterodonta var. psilocarpa was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, vacant lots, and forest edges. It thrives in tropical and subtropical climates with high humidity and moderate to full sunlight. This plant is often found in regions of Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. Its rapid growth and ability to spread through both seeds and vegetative propagation make it an aggressive colonizer. Due to its adaptability, it has become a common weed in agricultural and urban environments."
}
