{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha acuminata",
    "plant_slug": "acalypha-acuminata",
    "plant_name_scientific": "acalypha acuminata",
    "intro": "Acalypha acuminata, commonly known as the spiked ironweed, is a flowering plant native to tropical regions of Africa and Asia. It is a member of the Euphorbiaceae family and is characterized by its distinctive, spiky bracts that surround its small yellow flowers. The plant typically grows as an upright shrub, reaching heights of up to 2 meters, and features lance-shaped leaves with a waxy surface. It thrives in moist, well-drained soils and is often found in wetlands or along riverbanks. Acalypha acuminata is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha acuminata"
    },
    "taxonomy_art_desc": "Acalypha acuminata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, which is a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral structures and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha acuminata, a specific plant within the genus Acalypha known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha acuminata is primarily native to Brazil North. It is commonly found in the northern regions of Brazil, including the states of Amapá, Pará, and Amazonas. This plant thrives in tropical rainforest environments, often growing along riverbanks and in moist, shaded areas. It is an important component of the local flora and plays a role in the ecosystem's biodiversity. Its distribution is largely restricted to the humid and warm climates of northern Brazil.",
    "distribution_introduced_art_desc": "Acalypha acuminata was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and unique flowering habits. It is commonly found in gardens and landscaped areas in countries such as Hawaii, Puerto Rico, and parts of Southeast Asia. The plant thrives in warm, humid climates and is often cultivated for its aesthetic value rather than agricultural purposes. However, it has occasionally been reported as an invasive species in some regions where it can outcompete native vegetation. Its distribution is largely anthropogenic, resulting from intentional planting and accidental spread through human activities."
}
