{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fasciculata var. lyallii",
    "plant_slug": "acalypha-fasciculata-var-lyallii",
    "plant_name_scientific": "acalypha fasciculata var. lyallii",
    "intro": "Acalypha fasciculata var. lyallii, commonly known as Lyall's ironweed, is a species of flowering plant in the Euphorbiaceae family. It is native to New Zealand and is characterized by its distinctive, showy inflorescences that resemble small, clustered flowers. The plant typically grows in moist, shaded environments such as forest floors and stream banks. Its leaves are usually alternate, ovate, and have a slightly hairy texture. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fasciculata var. lyallii is primarily native to the Pacific Islands, including Hawaii, Samoa, and Tonga. It is commonly found in coastal areas and lowland forests, often growing in moist, shaded environments. This variant is particularly associated with the Hawaiian archipelago, where it thrives in humid, tropical climates. It is typically seen in rocky or sandy soils near the shoreline. The plant is an important component of the native flora in these regions, contributing to local biodiversity.",
    "distribution_introduced_art_desc": "Acalypha fasciculata var. lyallii was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century as an ornamental plant due to its attractive foliage. The plant has since become naturalized in certain regions, particularly in the North Island. It thrives in moist, shady environments and is commonly found in forest margins and along stream banks. However, it is considered a potential weed in some areas due to its rapid growth and ability to spread through vegetative reproduction."
}
