{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha arvensis var. genuina",
    "plant_slug": "acalypha-arvensis-var-genuina",
    "plant_name_scientific": "acalypha arvensis var. genuina",
    "intro": "Acalypha arvensis var. genuina, commonly known as the narrowleaf ironweed, is a herbaceous annual plant native to temperate regions of Asia and Europe. It features slender, upright stems with opposite, lance-shaped leaves that are often slightly hairy. The plant produces small, clustered greenish-white flowers in the summer, which are surrounded by bracts that give it a distinctive appearance. It thrives in disturbed soils and can be found in fields, roadsides, and waste areas. Its botanical characteristics make it an adaptable and common weed in various agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha arvensis var. genuina is primarily native to tropical and subtropical regions of Asia, including countries such as India, Sri Lanka, and parts of Southeast Asia. It is commonly found in wetlands, marshes, and along the edges of water bodies where it thrives in moist to waterlogged soils. This variant is also present in some regions of Australia, particularly in the northern and eastern parts. It is often associated with disturbed habitats and can be found in agricultural areas and along roadsides. Its distribution is closely linked to its preference for humid climates and its ability to tolerate poor soil conditions.",
    "distribution_introduced_art_desc": "Acalypha arvensis var. genuina was mainly introduced to disturbed areas such as roadsides, waste grounds, and agricultural fields. It thrives in environments with poor soil conditions and full sun exposure. This plant is known for its rapid growth and ability to colonize open spaces quickly. Its introduction has often led to it becoming a weed in cultivated areas. It is commonly found in temperate regions of Europe and parts of Asia."
}
