{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brasiliensis var. glabrata",
    "plant_slug": "acalypha-brasiliensis-var-glabrata",
    "plant_name_scientific": "acalypha brasiliensis var. glabrata",
    "intro": "Acalypha brasiliensis var. glabrata, commonly known as the smoothleaf ironweed, is a shrub native to Brazil. It is characterized by its smooth, glabrous leaves and clusters of small, pale yellow flowers. The plant typically grows in tropical and subtropical regions, often in shaded or semi-shaded environments. Its foliage is often used in ornamental horticulture due to its attractive appearance. The species is part of the Euphorbiaceae family, which is known for its diverse and often striking botanical features.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brasiliensis var. glabrata is primarily native to the Amazon Basin, specifically in northern South America. It is found in countries such as Brazil, Colombia, and Venezuela. This plant thrives in humid tropical environments and is commonly associated with lowland rainforests. It is often encountered in secondary growth areas and along riverbanks. Its distribution is closely linked to the rich biodiversity of the Amazonian region.",
    "distribution_introduced_art_desc": "Acalypha brasiliensis var. glabrata was mainly introduced to Florida, USA, as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since spread beyond its initial cultivation areas, establishing itself in wetlands and disturbed sites across the southeastern United States. The plant's rapid growth and ability to thrive in moist environments have contributed to its invasion potential in native ecosystems. It is considered a noxious weed in some regions, outcompeting native vegetation and altering habitat structure. Management efforts often focus on early detection and control to prevent further spread."
}
