{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha zeyheri var. glabrata",
    "plant_slug": "acalypha-zeyheri-var-glabrata",
    "plant_name_scientific": "acalypha zeyheri var. glabrata",
    "intro": "Acalypha zeyheri var. glabrata, commonly known as the velvetleaf or glossy abutilon, is a tropical shrub native to parts of Africa and Southeast Asia. It is characterized by its velvety, palmate leaves that are often a deep green with a soft texture. The plant produces showy, spiky inflorescences that range in color from red to yellow, attracting pollinators such as bees and birds. It thrives in warm, humid climates and prefers well-drained soil. Its ornamental value makes it a popular choice for gardens and indoor cultivation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha zeyheri var. glabrata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in grassland and savanna regions, often growing in open, sunny habitats. This variant is adapted to dry and semi-arid conditions, making it a hardy plant in these environments. It is often seen along roadsides, in disturbed soils, and in rocky areas. Its distribution is widespread across the southern parts of the African continent.",
    "distribution_introduced_art_desc": "Acalypha zeyheri var. glabrata was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been reported in several countries outside its native range, including parts of the United States and Australia. Its introduction has raised concerns about its potential invasiveness in non-native environments. Proper management is recommended to prevent its spread into natural ecosystems."
}
