{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha commersoniana var. concolor",
    "plant_slug": "acalypha-commersoniana-var-concolor",
    "plant_name_scientific": "acalypha commersoniana var. concolor",
    "intro": "Acalypha commersoniana var. concolor, commonly known as the silverleaf ironweed, is a flowering plant native to the southern United States and parts of Mexico. It is characterized by its striking silver-gray foliage, which is covered in fine, dense hairs. The plant produces small, clustered greenish-white flowers that bloom in the summer months. It thrives in full sun to partial shade and is often found in disturbed soils or along roadsides. Its ornamental value makes it a popular choice for gardeners seeking drought-tolerant and low-maintenance plants.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha commersoniana var. concolor is primarily native to the tropical regions of South America, specifically Brazil, Paraguay, and Argentina. It is commonly found in the Amazon Basin and surrounding areas where the climate is warm and humid. This plant thrives in moist, well-drained soils and is often associated with riparian habitats and secondary forests. It is also known to occur in parts of Central America, including Panama and Colombia. Its distribution is closely linked to the presence of water bodies and shaded environments.",
    "distribution_introduced_art_desc": "Acalypha commersoniana var. concolor was mainly introduced to areas with tropical and subtropical climates, where it thrives in moist, well-drained soils. It is commonly found in regions such as Southeast Asia, the Pacific Islands, and parts of Australia. This plant is often cultivated for its ornamental value due to its striking foliage and adaptability to various growing conditions. Its introduction has sometimes led to it becoming an invasive species in certain regions. Proper management is necessary to prevent its spread in non-native environments."
}
