{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha phleoides",
    "plant_slug": "acalypha-phleoides",
    "plant_name_scientific": "acalypha phleoides",
    "intro": "Acalypha phleoides, commonly known as the silverleaf ironweed, is a flowering plant native to tropical regions of Africa. It is characterized by its striking silver-gray foliage and clusters of small, pinkish-white flowers. The plant typically grows as an upright shrub, reaching heights of up to 2 meters. Its leaves are ovate with a distinctive waxy coating that reflects light, contributing to its ornamental appeal. Acalypha phleoides is often cultivated in gardens for its aesthetic value and ability to thrive in well-drained soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha phleoides"
    },
    "taxonomy_art_desc": "Acalypha phleoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral structures and often show a wide range of ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a variety of plants with milky sap and often show a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha phleoides, a specific type within the genus Acalypha, known for its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Guatemala",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "New Mexico",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha phleoides is primarily native to Arizona, Guatemala, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, New Mexico, and Texas. This species is commonly found in arid and semi-arid regions across these areas. It thrives in disturbed soils and often grows along roadsides, in dry woodlands, and in open habitats. The plant is well adapted to the warm, dry climates of its native range. Its distribution spans a wide geographic area within the southwestern United States and Central America.",
    "distribution_introduced_art_desc": "Acalypha phleoides was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste grounds, and agricultural fields. It thrives in warm, humid climates and is commonly found in tropical and subtropical regions. The plant is known for its rapid growth and ability to spread through both seeds and vegetative propagation. It has been reported in several countries in Southeast Asia, the Pacific Islands, and parts of Africa. Due to its invasive potential, it is sometimes classified as a weed in regions where it has become naturalized."
}
