{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata f. lamiana",
    "plant_slug": "acalypha-reticulata-f-lamiana",
    "plant_name_scientific": "acalypha reticulata f. lamiana",
    "intro": "Acalypha reticulata f. lamiana, commonly known as the silverleaf kochia, is a variant of the species native to Southeast Asia. It is a herbaceous annual plant characterized by its striking silver-gray foliage due to dense pubescence. The leaves are ovate to elliptic in shape and often have a reticulate venation pattern. It produces small, greenish-yellow flowers in clusters, which are followed by distinctive, inflated seed pods. This plant thrives in well-drained soils and is often cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata f. lamiana is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like roadside verges and forest edges. It is also known to occur in parts of India and Indonesia. Its distribution is closely linked to its preference for warm, humid climates and its ability to adapt to various soil types.",
    "distribution_introduced_art_desc": "Acalypha reticulata f. lamiana was mainly introduced to ornamental horticulture due to its striking foliage and unique appearance. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The plant is often used in gardens, as a houseplant, or in landscape design to add visual interest. Its introduction has been largely driven by its aesthetic value rather than ecological or agricultural significance. However, it is important to note that it may become invasive in certain environments if not managed properly."
}
