{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha filiformis var. urophylloides",
    "plant_slug": "acalypha-filiformis-var-urophylloides",
    "plant_name_scientific": "acalypha filiformis var. urophylloides",
    "intro": "Acalypha filiformis var. urophylloides, commonly known as the narrow-leaved spurflower, is a flowering plant native to parts of Southeast Asia. It is characterized by its slender, thread-like leaves that are typically arranged oppositely along the stems. The plant produces small, clustered flowers with distinctive, spiky bracts that give it its common name. It thrives in moist, shaded environments and is often found in forest understories. Its ornamental value makes it a popular choice for cultivation in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha filiformis var. urophylloides is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. This variant is commonly found in lowland forests, along riverbanks, and in moist, shaded understory habitats. It thrives in humid climates with high rainfall and is often associated with disturbed or secondary growth areas. The plant is known for its slender, thread-like leaves and is sometimes cultivated for ornamental purposes. Its distribution is closely linked to the tropical rainforests and wetlands of the region.",
    "distribution_introduced_art_desc": "Acalypha filiformis var. urophylloides was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, feathery foliage. The introduction occurred in the early 20th century, primarily in urban and suburban areas. However, it has since become naturalized and is now found in various habitats across the country. Despite its aesthetic appeal, it is considered a potential weed in some regions."
}
