{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha infesta var. stenoloba",
    "plant_slug": "acalypha-infesta-var-stenoloba",
    "plant_name_scientific": "acalypha infesta var. stenoloba",
    "intro": "Acalypha infesta var. stenoloba, commonly known as the narrow-leaved flame bush, is a shrub native to tropical regions of Africa. It is characterized by its vibrant red to orange bracts that resemble flames, which are actually modified leaves. The plant has simple, opposite, ovate leaves with a smooth or slightly hairy surface. It produces small, inconspicuous greenish-white flowers in clusters, followed by three-winged seeds. This species is often cultivated for its ornamental value and is adapted to well-drained soils and full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha infesta var. stenoloba is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This variant of Acalypha infesta is typically associated with lowland forests and secondary vegetation. It thrives in areas with high humidity and well-drained soil. The plant is known for its ornamental value and is sometimes cultivated for its unique foliage.",
    "distribution_introduced_art_desc": "Acalypha infesta var. stenoloba was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in disturbed habitats and can spread rapidly through seeds. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
