{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha subterranea",
    "plant_slug": "acalypha-subterranea",
    "plant_name_scientific": "acalypha subterranea",
    "intro": "Acalypha subterranea, commonly known as the underground euphorbia, is a unique plant species native to the tropical regions of Africa. It is characterized by its striking, often brightly colored bracts that resemble flowers, which are actually modified leaves. The plant's name reflects its unusual growth habit, as some species exhibit subterranean or partially buried stems. It thrives in warm, humid environments and requires well-drained soil to prevent root rot. Due to its ornamental value, it is sometimes cultivated as a garden plant, though it can be invasive in certain areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha subterranea"
    },
    "taxonomy_art_desc": "Acalypha subterranea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with various growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of morphological features. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha subterranea, a specific type within the genus Acalypha, known for its subterranean growth habit and unique morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha subterranea is primarily native to Mexico Central and Mexico Southwest. This species is found in the central and southern regions of Mexico, including states such as Guanajuato, Hidalgo, and Oaxaca. It typically grows in dry to semi-arid environments, often in rocky or sandy soils. The plant is adapted to the warm, temperate climate of these regions. It is commonly found in open woodlands and scrublands.",
    "distribution_introduced_art_desc": "Acalypha subterranea was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habits. It was first recorded in the 19th century and has since spread through both natural and human-assisted means. The plant thrives in moist, shaded environments and is commonly found in forested areas and along stream banks. Its rapid growth and ability to form dense mats have led to concerns about its potential invasiveness in certain ecosystems. Despite its ornamental value, management efforts are ongoing to control its spread in native habitats."
}
