{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fallax",
    "plant_slug": "acalypha-fallax",
    "plant_name_scientific": "acalypha fallax",
    "intro": "Acalypha fallax, commonly known as the red-leaf acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, velvety red or purple leaves that contrast with its green veins. The plant produces small, inconspicuous yellow flowers that are clustered in dense inflorescences. It thrives in warm, humid climates and prefers well-drained soil. Acalypha fallax is often cultivated as an ornamental plant for its vibrant foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fallax is primarily native to the Caribbean Islands, including the Greater and Lesser Antilles. It is also found in parts of Central America, such as southern Mexico, Belize, and Honduras. This plant typically grows in moist, shaded areas within tropical forests. It is commonly seen in secondary growth habitats and along stream banks. Its native range extends into some regions of South America, particularly in northern Brazil.",
    "distribution_introduced_art_desc": "Acalypha fallax was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and abandoned lands. It thrives in regions with moderate to high rainfall and well-drained soil conditions. This plant is often found in tropical and subtropical climates, particularly in parts of Southeast Asia and the Pacific Islands. Its rapid growth and ability to spread through seeds make it a common invasive species in many regions. Due to its adaptability, it can outcompete native vegetation, leading to ecological concerns in some areas."
}
