{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha porcina",
    "plant_slug": "acalypha-porcina",
    "plant_name_scientific": "acalypha porcina",
    "intro": "Acalypha porcina, commonly known as pigweed, is a flowering plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family and is characterized by its distinctive, often colorful bracts that resemble flowers. The plant typically grows as an annual or perennial herb with opposite, ovate leaves that are usually hairy. It thrives in disturbed soils and is often found in agricultural fields and along roadsides. Acalypha porcina is known for its adaptability and can spread rapidly, making it a common weed in many regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha porcina is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in open habitats like forest edges, grasslands, and disturbed sites. It is also present in parts of the Pacific Islands, including Hawaii and Papua New Guinea. Its distribution extends to some regions of northern Australia as well.",
    "distribution_introduced_art_desc": "Acalypha porcina was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and coastal dunes. It thrives in tropical and subtropical climates, making it common in regions with warm, humid conditions. The plant spreads primarily through its prolific seed production and ability to colonize disturbed sites quickly. It is often considered an invasive species in some regions due to its rapid growth and competitive nature. Its distribution has expanded in response to human activity and environmental changes."
}
