{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha crotonoides var. caudata",
    "plant_slug": "acalypha-crotonoides-var-caudata",
    "plant_name_scientific": "acalypha crotonoides var. caudata",
    "intro": "Acalypha crotonoides var. caudata, commonly known as the trailing croton, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, colorful bracts that range from red to orange, which are often mistaken for flowers. The plant has opposite, ovate leaves with serrated edges and a hairy texture. It produces small, inconspicuous yellow flowers clustered in spikes. This species is often cultivated as an ornamental plant due to its vibrant foliage and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha crotonoides var. caudata is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments and is often associated with rainforests and secondary growth areas. It is also found in some parts of northern Australia and New Guinea. Its native distribution is closely linked to the biodiversity hotspots of the Indo-Pacific region.",
    "distribution_introduced_art_desc": "Acalypha crotonoides var. caudata was mainly introduced to Hawaii, where it has become naturalized in disturbed areas such as roadsides, vacant lots, and forest edges. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. The plant spreads primarily through its seeds, which are dispersed by wind, water, and animals. It thrives in a variety of soil types and can tolerate both full sun and partial shade. Due to its aggressive growth, it poses a significant threat to native ecosystems in the region."
}
