{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha havanensis",
    "plant_slug": "acalypha-havanensis",
    "plant_name_scientific": "acalypha havanensis",
    "intro": "Acalypha havanensis, commonly known as the Havana spurflower, is a flowering plant native to the Caribbean, particularly Cuba. It is characterized by its striking, spurs-like inflorescences that are often brightly colored, attracting pollinators such as birds and insects. The plant typically grows in moist, sunny environments, often near water bodies or in disturbed soils. Its leaves are usually opposite and have a smooth or slightly hairy surface, with a variety of shapes depending on the species. The flowers are small and clustered, with both male and female flowers occurring on the same plant, making it monoecious.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha havanensis"
    },
    "taxonomy_art_desc": "Acalypha havanensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants that includes many species with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of morphological features. Its genus is Acalypha, a group of flowering plants known for their showy bracts and often used in ornamental horticulture. Its species is Acalypha havanensis, a specific type of plant native to certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha havanensis is primarily native to Cuba and southwestern Mexico. It is found in regions with tropical and subtropical climates. This plant thrives in humid environments, often in coastal areas or near rivers. It is commonly found in dry forests and shrublands. Its distribution is limited to these specific geographic areas within its native range.",
    "distribution_introduced_art_desc": "Acalypha havanensis was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and adaptability. It is commonly found in areas with warm climates, including parts of the Caribbean, Florida, and Hawaii. The plant thrives in well-drained soil and full sun, making it suitable for gardens and landscaped areas. However, it has also been reported as an invasive species in some regions where it can outcompete native vegetation. Its rapid growth and ability to spread through seeds pose challenges in certain ecosystems."
}
