{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wilkesiana f. triumphans",
    "plant_slug": "acalypha-wilkesiana-f-triumphans",
    "plant_name_scientific": "acalypha wilkesiana f. triumphans",
    "intro": "Acalypha wilkesiana f. triumphans, commonly known as the Chinese lantern plant, is a tropical shrub native to Southeast Asia. It is characterized by its striking, papery bracts that resemble small lanterns, which are typically red, orange, or yellow in color. The plant has palmate leaves with a soft, velvety texture and emits a mild, sweet fragrance. It thrives in warm, humid climates and is often cultivated as an ornamental plant for its vibrant foliage. The bracts are not true flowers but modified leaves that serve to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha wilkesiana f. triumphans is primarily native to the tropical regions of the Americas, specifically Central America and the Caribbean. It is commonly found in countries such as Mexico, Guatemala, and parts of the Caribbean islands. This plant thrives in warm, humid climates and is often associated with coastal areas and lowland forests. It is also known to grow in disturbed habitats, including abandoned fields and along roadsides. Due to its ornamental value, it has been introduced to other parts of the world, including Southeast Asia and the Pacific Islands.",
    "distribution_introduced_art_desc": "Acalypha wilkesiana f. triumphans was mainly introduced to tropical and subtropical regions for its ornamental value due to its vibrant foliage. It is commonly cultivated in gardens and as a houseplant because of its striking red and green leaves. The plant thrives in warm climates with high humidity and indirect sunlight. It is often used in landscape design to add color and texture to outdoor spaces. However, it can become invasive in some areas if not properly managed."
}
