{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ruderalis",
    "plant_slug": "acalypha-ruderalis",
    "plant_name_scientific": "acalypha ruderalis",
    "intro": "Acalypha ruderalis, commonly known as the common mallow, is a flowering plant in the family Euphorbiaceae. It is native to tropical and subtropical regions of Africa, Asia, and the Pacific. The plant is characterized by its hairy, alternate leaves and small, clustered yellow flowers. It often grows in disturbed soils and is considered a weed in agricultural areas. Acalypha ruderalis is known for its adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ruderalis is primarily native to Southeast Asia, including countries such as India, China, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in disturbed habitats like roadsides, fields, and waste areas. This species is well adapted to thrive in environments with poor soil conditions and can quickly colonize open spaces. Its native range extends across parts of Africa and the Pacific Islands as well. It is an important pioneer species in ecological succession.",
    "distribution_introduced_art_desc": "Acalypha ruderalis was mainly introduced to disturbed habitats such as roadsides, waste areas, and abandoned fields. It thrives in environments with poor soil quality and full sunlight. This plant is known for its rapid growth and ability to colonize open spaces quickly. It is considered an invasive species in some regions due to its competitive nature. Its distribution has expanded significantly in areas with human activity and land disturbance."
}
