{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reptans",
    "plant_slug": "acalypha-reptans",
    "plant_name_scientific": "acalypha reptans",
    "intro": "Acalypha reptans, commonly known as creeping touch-me-not, is a low-growing herbaceous plant native to tropical regions. It features opposite, ovate to lanceolate leaves with a smooth or slightly hairy surface. The plant produces small, yellowish-green flowers in clusters, which are often surrounded by bracts that can be brightly colored. It thrives in moist, shady environments and is often found in woodland areas. Acalypha reptans is valued for its ornamental appeal and ability to spread rapidly through stolons.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reptans is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks or in dense forests. It is also present in parts of eastern Africa and the Pacific Islands. Due to its adaptability, it has been introduced to other tropical regions worldwide.",
    "distribution_introduced_art_desc": "Acalypha reptans was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly found in tropical and subtropical regions where it is cultivated for its aesthetic value. The plant has been reported in several countries, including the United States, Australia, and parts of Southeast Asia. Its rapid growth and ability to thrive in disturbed soils have led to its naturalization in some areas. However, it is generally considered non-invasive and poses minimal risk to native ecosystems."
}
