{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gagnepainii var. calcicola",
    "plant_slug": "acalypha-gagnepainii-var-calcicola",
    "plant_name_scientific": "acalypha gagnepainii var. calcicola",
    "intro": "Acalypha gagnepainii var. calcicola, commonly known as the limestone acalypha, is a shrub native to Southeast Asia, particularly found in regions with limestone soils. It is characterized by its distinctive, palmate leaves that are often covered in fine, silky hairs. The plant produces small, greenish-white flowers clustered in dense inflorescences, which are typically borne in the axils of the leaves. It thrives in tropical and subtropical climates and is adapted to grow in calcareous (limestone) substrates. Due to its ornamental value, it is sometimes cultivated in gardens, though it is not widely commercially available.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gagnepainii var. calcicola is primarily native to southern China, particularly in the provinces of Guangxi and Guangdong. This plant thrives in rocky and limestone-rich soils, often found in mountainous regions. It is commonly associated with subtropical climates and is adapted to well-drained, calcareous substrates. The species is typically found in open forest areas or on slopes where sunlight is abundant. Its native distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acalypha gagnepainii var. calcicola was mainly introduced to areas with calcareous soils, particularly in regions where limestone or other alkaline substrates are prevalent. It thrives in environments with moderate to high sunlight exposure and well-drained soil conditions. This plant is commonly found in disturbed sites such as roadsides, construction areas, and abandoned fields. Its introduction has been associated with human activity, including land clearing and urban development. Due to its adaptability, it has become an invasive species in some regions, outcompeting native vegetation."
}
