{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chibomboa",
    "plant_slug": "acalypha-chibomboa",
    "plant_name_scientific": "acalypha chibomboa",
    "intro": "Acalypha chibomboa, commonly known as the red-veined nettle, is a species of flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family, which includes many plants with milky sap. The plant is characterized by its striking, colorful leaves with prominent veins, often displaying shades of red, yellow, and green. It produces small, inconspicuous flowers arranged in clusters, and its growth habit is typically shrub-like. Acalypha chibomboa is often cultivated for its ornamental value due to its vibrant foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha chibomboa"
    },
    "taxonomy_art_desc": "Acalypha chibomboa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes species with various adaptations to different environments. Its family is Euphorbiaceae, commonly known as the spurge family, which consists of plants often with milky sap and diverse growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their showy inflorescences and hairy leaves. Its species is Acalypha chibomboa, a specific type within the genus Acalypha, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Comoros",
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chibomboa is primarily native to Comoros, Madagascar. It is found in the tropical regions of these islands, which are part of the Indian Ocean. This plant thrives in humid, coastal environments with well-drained soils. It is commonly seen in dry forest and coastal scrub habitats. Its distribution is restricted to these specific areas within the Comoros and Madagascar archipelagos.",
    "distribution_introduced_art_desc": "Acalypha chibomboa was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in disturbed habitats. The plant spreads rapidly through seeds dispersed by wind and animals. Its introduction has led to ecological concerns in the region."
}
