{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha integrifolia var. saltuum",
    "plant_slug": "acalypha-integrifolia-var-saltuum",
    "plant_name_scientific": "acalypha integrifolia var. saltuum",
    "intro": "Acalypha integrifolia var. saltuum, commonly known as the Saltuum ironweed, is a shrub native to the coastal regions of southern Africa. It is characterized by its lance-shaped leaves that are often covered in fine hairs, giving them a velvety texture. The plant produces small, clustered flowers that range in color from white to pale pink, typically blooming during the warmer months. It thrives in sandy or rocky soils and is adapted to coastal conditions with high salinity and strong winds. Due to its ornamental value and hardiness, it is sometimes cultivated in gardens in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha integrifolia var. saltuum is primarily native to the western United States, specifically California and Oregon. It is commonly found in coastal areas and sandy soils along the Pacific coast. This variety thrives in moist, well-drained environments and is often seen in dunes and salt marshes. It is adapted to the unique conditions of the coastal ecosystems in these regions. The plant plays an important role in stabilizing sand dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acalypha integrifolia var. saltuum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and compact growth habit. However, it has since become invasive, spreading rapidly in coastal and disturbed areas. The plant's ability to thrive in a variety of soil types and its prolific seed production contribute to its invasive nature. Efforts are ongoing to control its spread and prevent further ecological impact."
}
