{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha holtzii",
    "plant_slug": "acalypha-holtzii",
    "plant_name_scientific": "acalypha holtzii",
    "intro": "Acalypha holtzii, commonly known as the red-hot catshrub, is a flowering plant native to the Caribbean and parts of Central America. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its striking red bracts that surround small, inconspicuous flowers, giving it its common name. Its leaves are typically ovate to elliptic in shape and have a smooth or slightly hairy surface. Acalypha holtzii is often cultivated for its ornamental value due to its vibrant foliage and distinctive inflorescences.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha holtzii is primarily native to tropical and subtropical regions of Central America, including countries such as Belize, Guatemala, Honduras, and El Salvador. It is also found in parts of southern Mexico and northern South America. This plant typically grows in moist, shaded environments within rainforests and along stream banks. It is commonly found in lowland and foothill areas with high humidity. Its native distribution is largely confined to the Neotropical region, where it thrives in humid, tropical climates.",
    "distribution_introduced_art_desc": "Acalypha holtzii was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was initially brought in for ornamental purposes due to its attractive foliage and unique growth habit. The plant has since become naturalized in certain areas, spreading through both seeds and vegetative reproduction. It thrives in moist, disturbed soils and is often found in wetlands, ditches, and along waterways. However, its invasive potential remains a topic of debate among ecologists due to its rapid growth and ability to outcompete native vegetation."
}
