{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha grandis var. kotoensis",
    "plant_slug": "acalypha-grandis-var-kotoensis",
    "plant_name_scientific": "acalypha grandis var. kotoensis",
    "intro": "Acalypha grandis var. kotoensis, commonly known as the Kotoensis Acalypha, is a shrub native to parts of Southeast Asia. It is characterized by its striking, colorful bracts that range from red to orange, often mistaken for flowers. The plant has opposite, ovate leaves with serrated edges and a smooth, glossy texture. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight. This ornamental plant is often cultivated for its vibrant foliage and is used in landscaping and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha grandis var. kotoensis is primarily native to the Ryukyu Islands, including Okinawa, Miyako, and Ishigaki Islands. It is found in the subtropical regions of Japan, specifically in the southern parts of the country. This plant thrives in moist, shaded environments, often growing along forest floors or in rocky crevices. It is commonly associated with coastal and lowland habitats. Due to its limited distribution, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acalypha grandis var. kotoensis was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was brought there during the late 19th and early 20th centuries by horticulturists and plant collectors seeking exotic species for gardens and landscapes. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, shaded environments and can spread rapidly through seed dispersal. Its introduction highlights the ecological risks associated with non-native plant species in island ecosystems."
}
