{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha erythrostachya",
    "plant_slug": "acalypha-erythrostachya",
    "plant_name_scientific": "acalypha erythrostachya",
    "intro": "Acalypha erythrostachya, commonly known as red-stigma acalypha, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the Euphorbiaceae family and is characterized by its striking red bracts that surround its small yellow flowers. The plant typically grows as an upright shrub, reaching heights of up to 2 meters, with opposite, ovate leaves that are often covered in fine hairs. Its flowers are clustered in dense inflorescences, and it produces small, three-lobed fruits. Acalypha erythrostachya is often cultivated for its ornamental value due to its vibrant foliage and showy floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha erythrostachya is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is commonly found in moist, lowland areas and along riverbanks. This plant thrives in humid climates and is often associated with disturbed habitats. It is also present in parts of Madagascar and the Arabian Peninsula. Its native distribution is closely linked to regions with high rainfall and warm temperatures.",
    "distribution_introduced_art_desc": "Acalypha erythrostachya was mainly introduced to ornamental horticulture and as a potential landscape plant due to its attractive foliage and growth habit. It is commonly found in tropical and subtropical regions where it is cultivated for its aesthetic value. The plant has been reported in several countries, including the United States, Australia, and parts of Southeast Asia. Its introduction has raised concerns about its potential invasiveness in certain ecosystems. Despite its ornamental appeal, it requires careful management to prevent unintended spread."
}
