{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha paniculata f. depauperata",
    "plant_slug": "acalypha-paniculata-f-depauperata",
    "plant_name_scientific": "acalypha paniculata f. depauperata",
    "intro": "Acalypha paniculata f. depauperata, commonly known as the sparse-leaved ironweed, is a variant of the ironweed genus characterized by its reduced foliage. It is native to tropical regions of Asia and is often found in disturbed or open habitats. The plant features small, clustered inflorescences that produce tiny, greenish-white flowers. Its leaves are typically narrow and less densely packed compared to the typical form of Acalypha paniculata. This cultivar is valued for its unique appearance and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha paniculata f. depauperata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This plant is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It thrives in lowland areas and is frequently associated with disturbed or secondary forests. The species is also present in parts of Australia, particularly in the northern regions. Its distribution is largely limited to areas with warm, humid climates and well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha paniculata f. depauperata was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its unique foliage and adaptability to tropical climates. It was introduced during the late 19th or early 20th century by horticulturalists seeking to diversify the local plant palette. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to thrive in disturbed soils have contributed to its spread across various islands. Efforts to control its population have been challenging due to its resilience and reproductive strategies."
}
