{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macafeeana",
    "plant_slug": "acalypha-macafeeana",
    "plant_name_scientific": "acalypha macafeeana",
    "intro": "Acalypha macafeeana, commonly known as the Macauley's spurflower, is a flowering plant native to tropical regions of the Americas. It belongs to the Euphorbiaceae family, which is known for its diverse and often ornamental species. The plant features showy, spade-shaped leaves with a distinctive reddish or purplish hue, and it produces small, clustered flowers that are typically green or yellow. It thrives in humid, warm climates and is often cultivated for its ornamental value in gardens. Acalypha macafeeana is also noted for its ability to grow in a variety of soil types, making it a versatile choice for landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macafeeana is primarily native to the Pacific Islands, particularly Hawaii. It is found in the wetter, more humid regions of the Hawaiian archipelago. This plant typically grows in coastal and lowland areas, often in disturbed or open habitats. It is commonly associated with coastal dunes and rocky shores. Due to its limited range, it is considered a rare and endemic species within Hawaii.",
    "distribution_introduced_art_desc": "Acalypha macafeeana was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain areas, particularly in disturbed habitats and along roadsides. Despite its aesthetic value, it has raised concerns due to its potential to spread aggressively. Its introduction highlights the ecological impacts of non-native species in island ecosystems."
}
