{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha spiciflora",
    "plant_slug": "acalypha-spiciflora",
    "plant_name_scientific": "acalypha spiciflora",
    "intro": "Acalypha spiciflora, commonly known as the spikeflower or red-hot poker, is a shrub native to tropical and subtropical regions. It features showy, spiky inflorescences that are typically red or orange in color, attracting pollinators such as bees and butterflies. The plant has alternate, ovate to lance-shaped leaves that are often covered in fine hairs. It thrives in well-drained soil and full sun, making it suitable for gardens and landscapes. Acalypha spiciflora is valued for its ornamental foliage and vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha spiciflora is primarily native to Madagascar. It is found in various regions across the island, including dry and wet forest areas. This plant thrives in tropical climates and is often seen in moist, shaded environments. It is commonly found in the eastern and southern parts of Madagascar. Due to its unique appearance, it is sometimes cultivated as an ornamental plant.",
    "distribution_introduced_art_desc": "Acalypha spiciflora was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage and unique flowering structure. It has been reported in several countries in the Pacific Islands, including Hawaii, Guam, and the Cook Islands. The plant thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and abandoned fields. Its rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its establishment in these areas. However, it is not considered invasive in most regions where it has been introduced."
}
