{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hotteana",
    "plant_slug": "acalypha-hotteana",
    "plant_name_scientific": "acalypha hotteana",
    "intro": "Acalypha hotteana, commonly known as the velvetleaf or hotte's spurge, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, colorful bracts that resemble flowers, which are actually modified leaves. The plant typically grows as an herbaceous annual or perennial, reaching heights of up to 2 meters. Its leaves are usually ovate to lanceolate, with a velvety texture and a variety of colors ranging from green to reddish hues. Acalypha hotteana is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hotteana is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in lowland areas with high humidity and warm climates. This plant thrives in moist, well-drained soils and is often associated with disturbed or secondary growth habitats. It is also present in parts of India and the Pacific Islands. Its native distribution reflects its adaptation to diverse but generally humid environments.",
    "distribution_introduced_art_desc": "Acalypha hotteana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The introduction occurred in the 19th century, primarily through horticultural trade. It has since become naturalized in several regions, particularly in the North Island. However, it is not considered invasive and poses minimal threat to native ecosystems."
}
