{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cordata",
    "plant_slug": "acalypha-cordata",
    "plant_name_scientific": "acalypha cordata",
    "intro": "Acalypha cordata, commonly known as the heartleaf or red-veined begonia, is a tropical plant native to Southeast Asia. It is characterized by its heart-shaped, glossy leaves that often display striking red or purple veins. The plant produces small, inconspicuous flowers that are typically green or yellow in color. It thrives in humid, shaded environments and is often cultivated as a decorative indoor plant. Acalypha cordata is valued for its ornamental foliage and is relatively easy to care for with proper watering and light conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cordata is primarily native to tropical and subtropical regions of Africa, including countries such as Nigeria, Ghana, and Uganda. It is also found in parts of Southeast Asia, including Malaysia and Indonesia. This plant thrives in moist, shaded environments, often growing in forest understories or along riverbanks. It is commonly found in humid lowland areas with rich, well-drained soil. Its native distribution includes regions with warm climates and high annual rainfall.",
    "distribution_introduced_art_desc": "Acalypha cordata was mainly introduced to Hawaii, where it has become naturalized in disturbed areas such as roadsides, streambanks, and open woodlands. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. The plant's spread has been facilitated by its prolific seed production and adaptability to various soil types. It is often found in lowland to mid-elevation habitats across the main islands. Despite its ornamental value, its invasive nature poses a threat to local ecosystems."
}
