{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha botteriana var. pubescens",
    "plant_slug": "acalypha-botteriana-var-pubescens",
    "plant_name_scientific": "acalypha botteriana var. pubescens",
    "intro": "Acalypha botteriana var. pubescens, commonly known as the velvetleaf or woolly hibiscus, is a flowering plant native to tropical regions of Central and South America. It is characterized by its striking, velvety leaves that are covered in fine, soft hairs, giving it a distinctive tactile quality. The plant produces showy, red or orange flowers that bloom in clusters, often attracting pollinators such as bees and birds. Its growth habit is typically shrub-like, with a branching structure that allows it to thrive in both full sun and partial shade. The species is valued for its ornamental appeal and is often cultivated in gardens for its aesthetic value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha botteriana var. pubescens is primarily native to parts of Central America, including countries such as Belize, Guatemala, Honduras, and El Salvador. It is also found in some regions of northern South America, particularly in Venezuela and Colombia. This plant typically grows in humid, tropical lowland areas with well-drained soil. It is commonly seen in secondary forests, along stream banks, and in disturbed habitats. Its distribution is largely confined to the Neotropical region, where it thrives in warm and moist environments.",
    "distribution_introduced_art_desc": "Acalypha botteriana var. pubescens was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this species has been limited to specific regions within New Zealand, primarily in the North Island. It is considered a non-native plant in the country and is sometimes found growing in gardens and along roadsides. Despite its introduction, it has not become invasive and remains a relatively rare species in the wild."
}
