{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fasciculata",
    "plant_slug": "acalypha-fasciculata",
    "plant_name_scientific": "acalypha fasciculata",
    "intro": "Acalypha fasciculata, commonly known as the clustered spurge, is a herbaceous plant native to tropical and subtropical regions. It features opposite, ovate leaves with a smooth or slightly hairy surface, often displaying vibrant colors such as red, yellow, or orange. The plant produces small, greenish-yellow flowers arranged in clusters, which are typically followed by distinctive, fleshy, berry-like capsules. It thrives in moist, well-drained soils and is often found in woodland or wetland habitats. Acalypha fasciculata is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fasciculata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often in lowland forests and along riverbanks. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Its distribution is largely limited to the Indo-Malayan region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha fasciculata was mainly introduced to urban and disturbed areas due to its rapid growth and adaptability. It is commonly found along roadsides, in abandoned fields, and near human settlements. This plant thrives in tropical and subtropical climates, making it a common invasive species in regions with warm, moist conditions. Its introduction has led to competition with native plants, affecting local biodiversity. Due to its aggressive spread, it is often classified as a noxious weed in many parts of the world."
}
