{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tenuicauda",
    "plant_slug": "acalypha-tenuicauda",
    "plant_name_scientific": "acalypha tenuicauda",
    "intro": "Acalypha tenuicauda, commonly known as the slender-tailed spurflower, is a herbaceous plant native to tropical regions of Africa and Asia. It features delicate, hair-like leaves that are often arranged in a whorled pattern along its stems. The plant produces small, clustered flowers that are typically green or reddish in color, which are followed by distinctive, winged bracts. It thrives in moist, shaded environments and is often found in forest understories. Due to its ornamental value, it is occasionally cultivated in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha tenuicauda"
    },
    "taxonomy_art_desc": "Acalypha tenuicauda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological adaptations. Its order is Malpighiales, a large group of flowering plants that includes species with diverse habitats and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive floral structures and often contain milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupid's whiskers,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha tenuicauda, a specific plant within the genus known for its slender, trailing stems and small, clustered flowers, typically found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tenuicauda is primarily native to Guatemala and the southeastern regions of Mexico. This plant is commonly found in tropical and subtropical areas within these regions. It thrives in humid environments, often growing in shaded or semi-shaded areas. The species is typically associated with moist soils and is often found in forest understories. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acalypha tenuicauda was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ease of cultivation. It has since become naturalized in various regions, particularly in coastal and disturbed areas. The plant spreads primarily through seeds dispersed by wind, water, and animals. Its rapid growth and adaptability have led to concerns about its potential to become invasive in certain ecosystems. Despite its ornamental value, management strategies are being developed to control its spread in sensitive habitats."
}
