{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha subvillosa",
    "plant_slug": "acalypha-subvillosa",
    "plant_name_scientific": "acalypha subvillosa",
    "intro": "Acalypha subvillosa, commonly known as velvetleaf or silky mallow, is a herbaceous plant native to tropical and subtropical regions. It is characterized by its soft, hairy leaves that give it a velvety texture, and its clusters of small, greenish-white flowers. The plant typically grows in moist, disturbed soils and is often found in wetlands or along stream banks. Its stems are often prostrate or erect, and it can spread through both seeds and rhizomes. Acalypha subvillosa is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha subvillosa is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in open habitats such as forests, shrublands, and along riverbanks. It is often seen growing in secondary successional areas and is adapted to disturbed soils. Its distribution extends to parts of Oceania and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha subvillosa was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and along stream banks. It thrives in tropical and subtropical regions where there is ample sunlight and moderate to high humidity. The plant is often found in regions with a warm climate and well-drained soil conditions. Its introduction has been documented in several countries in the Pacific Islands and parts of Southeast Asia. Due to its rapid growth and ability to spread through seeds, it can become invasive in certain ecosystems."
}
