{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha inselbergensis",
    "plant_slug": "acalypha-inselbergensis",
    "plant_name_scientific": "acalypha inselbergensis",
    "intro": "Acalypha inselbergensis, commonly known as the inselberg acalypha, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its compact growth habit and striking, often variegated foliage. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences. It is adapted to survive in nutrient-poor soils and can withstand periods of drought. Its unique appearance makes it a popular choice for xeriscaping and rock gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha inselbergensis"
    },
    "taxonomy_art_desc": "Acalypha inselbergensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes many species with specialized leaf and flower structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with latex and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha inselbergensis, a specific type of Acalypha found in certain habitats, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha inselbergensis is primarily native to Brazil Northeast. This plant is found in the northeastern region of Brazil, where it thrives in specific ecological conditions. It is typically associated with rocky or mountainous terrain, often growing on inselbergs, which are isolated rock formations. The species is adapted to the tropical and subtropical climates of this area. Its native distribution is limited to this region, making it a unique part of the local flora.",
    "distribution_introduced_art_desc": "Acalypha inselbergensis was mainly introduced to areas with rocky or limestone soils, typically in arid or semi-arid environments. It is commonly found in regions such as southern Africa, where it thrives in disturbed or degraded landscapes. The plant is often associated with inselberg habitats, which are isolated mountain masses in otherwise flat terrain. Its introduction has been linked to human activity, including land clearing and soil erosion. Due to its hardy nature, it has become an invasive species in some regions, outcompeting native vegetation."
}
