{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gemina var. brevibracteata",
    "plant_slug": "acalypha-gemina-var-brevibracteata",
    "plant_name_scientific": "acalypha gemina var. brevibracteata",
    "intro": "Acalypha gemina var. brevibracteata, commonly known as the narrow-bract euphorbia, is a shrub native to parts of Southeast Asia. It is characterized by its opposite, ovate leaves that are usually smooth and glossy. The plant produces small, clustered flowers in shades of yellow to green, which are often surrounded by modified leaves called bracts. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight. This species is often cultivated for its ornamental value and is relatively easy to grow in suitable conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gemina var. brevibracteata is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. This species is commonly found in tropical rainforests and moist lowland areas. It thrives in humid climates with high rainfall and partial to full sunlight. The plant is often seen growing along riverbanks and in secondary forests. Its native distribution is closely linked to the region's rich biodiversity and tropical ecosystems.",
    "distribution_introduced_art_desc": "Acalypha gemina var. brevibracteata was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there in the late 19th or early 20th century by horticulturists and gardeners seeking exotic plant species for landscaping. Despite its aesthetic appeal, it has since become an invasive species in some areas, outcompeting native vegetation. The plant spreads rapidly through its seeds, which are dispersed by birds and water. Its introduction has led to ecological concerns, prompting efforts to control its spread in natural habitats."
}
