{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schlechtendaliana var. genuina",
    "plant_slug": "acalypha-schlechtendaliana-var-genuina",
    "plant_name_scientific": "acalypha schlechtendaliana var. genuina",
    "intro": "Acalypha schlechtendaliana var. genuina, commonly known as the silverleaf acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its striking silver-green foliage, which is covered in fine, silky hairs. The plant produces small, clustered flowers that are typically green or reddish in color. It thrives in warm, humid climates and requires well-drained soil. This ornamental plant is often cultivated for its attractive leaves and ease of care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schlechtendaliana var. genuina is primarily native to the western Pacific, specifically the islands of the Philippines and parts of Indonesia. This species thrives in tropical and subtropical climates, often found in lowland rainforests and secondary growth areas. It is commonly associated with moist, well-drained soils and can be found in both coastal and inland regions. The plant is known for its ornamental value, with striking foliage that makes it a popular choice for horticultural use. Its native range is limited, and it is not widely distributed beyond its natural habitat.",
    "distribution_introduced_art_desc": "Acalypha schlechtendaliana var. genuina was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its striking foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. The plant has since become naturalized in some areas, spreading through both seed dispersal and vegetative reproduction. It is often found in disturbed habitats such as roadsides, streambanks, and forest edges. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
