{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha papillosa",
    "plant_slug": "acalypha-papillosa",
    "plant_name_scientific": "acalypha papillosa",
    "intro": "Acalypha papillosa, commonly known as the velvetleaf or silky hibiscus, is a flowering plant native to tropical regions of Asia and Africa. It is characterized by its soft, velvety leaves that are covered in fine, silky hairs, giving it a distinctive appearance. The plant produces showy, trumpet-shaped flowers that range in color from yellow to red, often with a contrasting throat. It thrives in moist, shady environments and is often found in forest understories or along riverbanks. Acalypha papillosa is also known for its medicinal properties and has been used in traditional medicine for various ailments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha papillosa"
    },
    "taxonomy_art_desc": "Acalypha papillosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct vascular system and complex reproductive structures. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations, such as the presence of stipules and unique leaf arrangements. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of morphological features and often produces milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha papillosa, a specific plant within the genus Acalypha, known for its distinctive papillate (bumpy) leaves and is native to tropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha papillosa is primarily native to Mexico Northeast, Mexico Northwest, and Mexico Southwest. This plant is commonly found in these regions, where it thrives in tropical and subtropical climates. It typically grows in areas with well-drained soil and ample sunlight. The species is often associated with disturbed habitats such as roadsides and open fields. Its native range is limited to these specific regions within Mexico.",
    "distribution_introduced_art_desc": "Acalypha papillosa was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by humans for its aesthetic value, such as its vibrant leaves and unique growth habit. However, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant's rapid growth and ability to spread through seeds have contributed to its establishment in non-native habitats. Despite its ornamental appeal, its ecological impact has raised concerns among conservationists."
}
