{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neomexicana",
    "plant_slug": "acalypha-neomexicana",
    "plant_name_scientific": "acalypha neomexicana",
    "intro": "Acalypha neomexicana, commonly known as the New Mexico marvel, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its striking, palmate leaves that often display a vibrant red or purple coloration, especially in the fall. The plant produces small, greenish-white flowers arranged in clusters, which are followed by distinctive, spiky seed capsules. It thrives in well-drained soils and full sun, making it a hardy choice for arid and semi-arid landscapes. Acalypha neomexicana is also valued for its ornamental appeal and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha neomexicana"
    },
    "taxonomy_art_desc": "Acalypha neomexicana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with a wide range of morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes many plants with milky sap and a variety of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha neomexicana, a specific plant native to the southwestern United States, known for its distinctive foliage and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest",
        "New Mexico",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neomexicana is primarily native to Arizona, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southwest, New Mexico, and Texas. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in desert scrub and grassland habitats. The species is well adapted to the hot and dry climate of its native range. It plays an important role in local ecosystems by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acalypha neomexicana was mainly introduced to the United States, particularly in the southwestern region. It was brought in for its ornamental value due to its attractive foliage and unique flowering structure. The plant has since become naturalized in some areas, often found in disturbed soils and along roadsides. Its introduction has raised concerns about its potential impact on native plant communities. Despite its beauty, it is considered a potential invasive species in certain regions."
}
