{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha nana",
    "plant_slug": "acalypha-nana",
    "plant_name_scientific": "acalypha nana",
    "intro": "Acalypha nana, commonly known as the dwarf curlleaf mallow, is a small, herbaceous plant native to tropical regions of Africa and Southeast Asia. It features a compact growth habit with hairy, rounded leaves that often curl at the edges. The plant produces small, showy flowers in shades of red, pink, or purple, typically arranged in clusters. It thrives in moist, well-drained soils and prefers partial to full shade. Due to its ornamental value, it is often cultivated in gardens and used in floral arrangements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha nana"
    },
    "taxonomy_art_desc": "Acalypha nana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations such as stipules and specialized flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupids,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha nana, a small, herbaceous plant native to tropical regions, known for its compact size and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha nana is primarily native to Cuba. It is found in various regions across the island, including forests and coastal areas. The plant thrives in tropical and subtropical climates, which are characteristic of Cuba's environment. It is commonly observed in wetland habitats and along riverbanks. Due to its adaptability, it plays an important role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acalypha nana was mainly introduced to Hawaii, where it has become an invasive species. It was likely brought there through human activities, such as accidental transport in soil or on plants. The plant thrives in disturbed areas and can outcompete native vegetation. Its rapid growth and ability to spread through seeds make it a significant ecological threat. Efforts are ongoing to control its spread and protect native ecosystems."
}
