{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha dupraeana var. arciana",
    "plant_slug": "acalypha-dupraeana-var-arciana",
    "plant_name_scientific": "acalypha dupraeana var. arciana",
    "intro": "Acalypha dupraeana var. arciana, commonly known as the red-veined nettle, is a strikingly ornamental plant native to tropical regions. It features heart-shaped leaves with prominent red veins that contrast vividly against its dark green foliage. The plant produces small, inconspicuous yellow flowers that are clustered in dense inflorescences. It thrives in warm, humid environments and requires well-drained soil to prevent root rot. Due to its unique appearance, it is often cultivated as a houseplant or in shaded garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha dupraeana var. arciana is primarily native to the southern regions of the United States, specifically Texas and parts of Louisiana. This plant is commonly found in disturbed areas such as roadsides, open fields, and along riverbanks. It thrives in full sun to partial shade and is adapted to a variety of soil types. The species is known for its distinctive red bracts that give it a striking appearance. It plays an important role in supporting local wildlife and is often used in native plant gardens.",
    "distribution_introduced_art_desc": "Acalypha dupraeana var. arciana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred in the early 20th century, primarily through horticultural trade. Despite its aesthetic value, it has since become naturalized in certain regions, raising concerns about its potential impact on native ecosystems. Its spread is limited but requires monitoring to prevent further ecological disruption."
}
