{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lantanifolia",
    "plant_slug": "acalypha-lantanifolia",
    "plant_name_scientific": "acalypha lantanifolia",
    "intro": "Acalypha lantanifolia, commonly known as the flame bush, is a flowering plant native to Southeast Asia. It is characterized by its striking, bright red bracts that resemble flames, which are actually modified leaves rather than flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are opposite, ovate, and have a rough texture with prominent veins. It thrives in tropical and subtropical climates and is often cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lantanifolia is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in lowland tropical forests and disturbed areas. This plant thrives in humid climates with well-drained soil. It is often seen growing along riverbanks and in secondary forests. Its native range extends into parts of India and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha lantanifolia was mainly introduced to ornamental horticulture due to its attractive foliage and unique flowering structure. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been reported in several countries, including the United States, Australia, and parts of Southeast Asia. Despite its aesthetic appeal, it has raised concerns due to its potential invasive tendencies in certain environments. Proper management is recommended to prevent its spread beyond cultivated areas."
}
