{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha weddelliana var. genuina",
    "plant_slug": "acalypha-weddelliana-var-genuina",
    "plant_name_scientific": "acalypha weddelliana var. genuina",
    "intro": "Acalypha weddelliana var. genuina, commonly known as the velvetleaf croton, is a shrub native to tropical regions of Africa and Southeast Asia. It is characterized by its striking, velvety leaves that range in color from deep green to reddish-brown. The plant produces small, inconspicuous greenish-yellow flowers arranged in clusters, followed by three-lobed, winged fruits. It thrives in humid, shady environments and is often found in moist forest understories. Due to its ornamental foliage, it is occasionally cultivated in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha weddelliana var. genuina is primarily native to the tropical regions of Southeast Asia, particularly Indonesia and the Philippines. This species thrives in humid, tropical climates and is commonly found in lowland rainforests and secondary growth areas. It is often associated with disturbed or open habitats, such as forest edges and riverbanks. The plant is known for its striking foliage and is sometimes cultivated as an ornamental species. Its distribution is limited to specific islands and regions within its native range.",
    "distribution_introduced_art_desc": "Acalypha weddelliana var. genuina was mainly introduced to New Zealand. It was first recorded in the 19th century and has since become naturalized in several regions. The plant is commonly found in coastal areas and disturbed soils. It is considered a weed in some parts of its range due to its aggressive growth habit. Its introduction is believed to have occurred through accidental seed dispersal via human activities."
}
