{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neptunica var. neptunica",
    "plant_slug": "acalypha-neptunica-var-neptunica",
    "plant_name_scientific": "acalypha neptunica var. neptunica",
    "intro": "Acalypha neptunica var. neptunica, commonly known as the Neptune's Aloe, is a tropical plant native to Southeast Asia. It is characterized by its striking, waxy, blue-green leaves that are often covered in a fine, powdery coating. The plant produces small, yellowish-green flowers arranged in clusters, which bloom in the spring. It prefers bright, indirect light and well-draining soil, making it suitable for indoor cultivation. Its unique appearance and relatively low maintenance make it a popular choice for ornamental purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha neptunica"
    },
    "taxonomy_art_desc": "Acalypha neptunica var. neptunica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with characteristic latex and a wide range of growth forms. Its genus is Acalypha, which comprises about 300 species of flowering plants known for their often showy inflorescences and variable leaf shapes. Its species is Acalypha neptunica, a specific variety within the genus known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cameroon",
        "Central African Republic",
        "DR Congo",
        "Ghana",
        "Kenya",
        "Nigeria",
        "Rwanda",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neptunica var. neptunica is primarily native to Cameroon, Central African Republic, DR Congo, Ghana, Kenya, Nigeria, Rwanda, Sudan-South Sudan, Tanzania, and Uganda. This species is commonly found in tropical and subtropical regions across these countries. It typically grows in moist, shaded environments such as forests and undergrowth. The plant is known for its ornamental value and is often cultivated for its attractive foliage. Its distribution reflects its adaptation to the humid and diverse ecosystems of sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Acalypha neptunica var. neptunica was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this plant has expanded beyond its original range, leading to its establishment in various habitats. It is now found in coastal areas and disturbed sites across the country. However, its impact on native ecosystems is still being studied."
}
