{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha arvensis",
    "plant_slug": "acalypha-arvensis",
    "plant_name_scientific": "acalypha arvensis",
    "intro": "Acalypha arvensis, commonly known as the common mallow, is a herbaceous annual plant native to tropical and subtropical regions. It features opposite, ovate to lanceolate leaves with a hairy surface and prominent veins. The plant produces small, yellowish flowers arranged in clusters, which are typically borne on bracteate inflorescences. It thrives in disturbed soils and is often found in agricultural fields and along roadsides. Its fibrous roots and rapid growth make it an invasive species in some areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha arvensis"
    },
    "taxonomy_art_desc": "Acalypha arvensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which is characterized by diverse morphological features and often contains latex-producing plants. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper spurge,\" which are typically shrubs or herbs with distinctive leaves. Its species is Acalypha arvensis, a specific type of plant within the genus Acalypha that is known for its hairy leaves and is commonly found in disturbed soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Bolivia",
        "Brazil North",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Colombia",
        "Costa Rica",
        "Ecuador",
        "French Guiana",
        "Guatemala",
        "Guyana",
        "Honduras",
        "Leeward Is.",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua",
        "Panamá",
        "Peru",
        "Southwest Caribbean",
        "Suriname",
        "Trinidad-Tobago",
        "Venezuela",
        "Windward Is."
    ],
    "distribution_introduced": [
        "Cameroon",
        "Florida",
        "Malaya",
        "Taiwan"
    ],
    "distribution_native_art_desc": "Acalypha arvensis is primarily native to Belize, Bolivia, Brazil North, Brazil South, Brazil Southeast, Brazil West-Central, Colombia, Costa Rica, Ecuador, French Guiana, Guatemala, Guyana, Honduras, Leeward Is., Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Southeast, Mexico Southwest, Nicaragua, Panamá, Peru, Southwest Caribbean, Suriname, Trinidad-Tobago, Venezuela, and Windward Is. This species is commonly found in tropical and subtropical regions, often in disturbed habitats such as roadsides, fields, and along riverbanks. It thrives in areas with warm climates and well-drained soils. The plant is known for its adaptability, allowing it to spread across a wide range of geographic locations. Its native distribution highlights its ecological significance in various ecosystems across the Americas.",
    "distribution_introduced_art_desc": "Acalypha arvensis was mainly introduced to Cameroon, Florida, Malaya, and Taiwan. It is considered an invasive species in these regions due to its rapid growth and ability to thrive in disturbed habitats. The plant spreads through seeds dispersed by wind, water, and human activities. It often competes with native vegetation, affecting local ecosystems and biodiversity. Management efforts are ongoing to control its spread and mitigate its environmental impact."
}
