{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schlechtendaliana var. mollis",
    "plant_slug": "acalypha-schlechtendaliana-var-mollis",
    "plant_name_scientific": "acalypha schlechtendaliana var. mollis",
    "intro": "Acalypha schlechtendaliana var. mollis, commonly known as silky acalypha, is a flowering plant native to tropical regions of Southeast Asia. It is characterized by its soft, fuzzy leaves that give it a distinctive, velvety appearance. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Its unique foliage makes it a popular choice for gardeners seeking texture and visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schlechtendaliana var. mollis is primarily native to the tropical regions of Southeast Asia, particularly in countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, lowland areas with rich soil and ample sunlight. This variant is commonly found in forest understories and along riverbanks where the climate remains consistently warm and moist. It is well adapted to the tropical rainforest environment, often growing in shaded or semi-shaded conditions. Due to its ornamental value, it is also cultivated in botanical gardens and as a decorative plant in certain regions.",
    "distribution_introduced_art_desc": "Acalypha schlechtendaliana var. mollis was mainly introduced to Hawaii, where it has become naturalized in disturbed areas such as roadsides, stream banks, and coastal regions. It thrives in tropical and subtropical climates, often spreading through seeds dispersed by wind, water, or animals. The plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems. Despite its invasive tendencies, it is also appreciated for its ornamental value and ability to stabilize soil in erosion-prone areas."
}
