{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica var. ovalifolia",
    "plant_slug": "acalypha-virginica-var-ovalifolia",
    "plant_name_scientific": "acalypha virginica var. ovalifolia",
    "intro": "Acalypha virginica var. ovalifolia, commonly known as the narrow-leaf ironweed, is a flowering plant native to the southeastern United States. It is a shrub that typically grows in moist, sunny habitats such as woodland edges and wetlands. The plant features lance-shaped, opposite leaves that are often covered in fine hairs. Its showy, clustered inflorescences produce small, greenish-white flowers that are surrounded by bracts. It is valued for its ornamental appeal and ecological benefits, providing food and habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica var. ovalifolia is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and Alabama. It thrives in moist, well-drained soils and is commonly found in wetlands, marshes, and along the edges of streams. This variety is particularly adapted to the humid climate and seasonal flooding typical of its native range. It is often seen in coastal areas and can tolerate salt spray in some regions. Its distribution is largely limited to the Atlantic and Gulf coastal plains.",
    "distribution_introduced_art_desc": "Acalypha virginica var. ovalifolia was mainly introduced to regions with moist, well-drained soils and partial to full sun exposure. It thrives in temperate climates and is commonly found in disturbed areas such as roadsides and vacant lots. This plant is often used in landscaping for its ornamental value due to its vibrant foliage. It has been reported in several states across the eastern United States. However, its spread is limited due to its preference for specific environmental conditions."
}
