{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha siamensis",
    "plant_slug": "acalypha-siamensis",
    "plant_name_scientific": "acalypha siamensis",
    "intro": "Acalypha siamensis, commonly known as the Siam copperleaf, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking copper-colored leaves. The plant produces small, inconspicuous flowers that are often surrounded by bracts, which are brightly colored and serve to attract pollinators. It thrives in tropical and subtropical climates, preferring moist, well-drained soil. Acalypha siamensis is often cultivated as an ornamental plant due to its vibrant foliage and ease of care.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha siamensis"
    },
    "taxonomy_art_desc": "Acalypha siamensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species with varied morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha siamensis, a specific type within the genus Acalypha native to Southeast Asia, known for its ornamental value and unique foliage characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Hainan",
        "Laos",
        "Malaya",
        "Myanmar",
        "Sumatera",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [
        "Cambodia",
        "Jawa",
        "Sulawesi"
    ],
    "distribution_native_art_desc": "Acalypha siamensis is primarily native to Hainan, Laos, Malaya, Myanmar, Sumatera, Thailand, and Vietnam. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, shaded environments such as forest understories and along riverbanks. The species is well adapted to the warm and humid climate of its native range. It is often found growing in association with other native flora in these regions.",
    "distribution_introduced_art_desc": "Acalypha siamensis was mainly introduced to Cambodia, Jawa, and Sulawesi. It is a species that has been intentionally or unintentionally brought to these regions, likely for ornamental or ecological purposes. The plant's introduction has raised concerns due to its potential to become invasive in local ecosystems. Its rapid growth and adaptability make it a significant threat to native flora. Conservation efforts are being considered to manage its spread and mitigate ecological impacts."
}
