{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha scandens var. glabra",
    "plant_slug": "acalypha-scandens-var-glabra",
    "plant_name_scientific": "acalypha scandens var. glabra",
    "intro": "Acalypha scandens var. glabra, commonly known as velvetleaf, is a shrub native to tropical and subtropical regions. It is characterized by its smooth, glabrous stems and heart-shaped leaves with a velvety texture. The plant produces small, inconspicuous greenish-white flowers arranged in clusters. It is often found in disturbed habitats such as roadsides and agricultural fields. Due to its rapid growth and invasive potential, it is considered a weed in many areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha scandens var. glabra is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks or in dense forest understories. It is also present in parts of southern China and the Indian subcontinent. Its distribution is closely associated with disturbed or secondary growth habitats.",
    "distribution_introduced_art_desc": "Acalypha scandens var. glabra was mainly introduced to ornamental horticulture due to its attractive, glossy foliage and vibrant flowers. It is commonly cultivated in tropical and subtropical regions as a decorative plant for gardens and indoor spaces. The species has been widely distributed in the United States, particularly in Florida and California, where it thrives in warm climates. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its rapid growth and ability to spread through seeds and vegetative propagation contribute to its successful establishment in new environments."
}
