{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hellwigii var. mollis",
    "plant_slug": "acalypha-hellwigii-var-mollis",
    "plant_name_scientific": "acalypha hellwigii var. mollis",
    "intro": "Acalypha hellwigii var. mollis, commonly known as silky acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its soft, velvety leaves that give it a distinctive, almost fuzzy appearance. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in humid, warm environments and is often grown as an ornamental plant due to its aesthetic appeal. Its botanical features make it a popular choice for gardeners seeking a unique and visually striking foliage plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hellwigii var. mollis is primarily native to the Caribbean islands, including Cuba, Hispaniola, Jamaica, and the Greater Antilles. This variant of Acalypha hellwigii is commonly found in coastal areas and lowland forests. It thrives in humid, tropical climates with well-drained soils. The plant is often seen growing in shaded undergrowth or along streambanks. Its native range is limited to these specific regions within the Caribbean.",
    "distribution_introduced_art_desc": "Acalypha hellwigii var. mollis was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage. It is commonly found in tropical and subtropical regions, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in full sun to partial shade and is often cultivated in gardens and landscapes for its vibrant leaf colors. Its introduction has sometimes led to its naturalization in certain regions, where it can become invasive if not managed properly. Due to its adaptability, it has been spread through horticultural trade and human activity."
}
