{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mildbraediana var. glabrescens",
    "plant_slug": "acalypha-mildbraediana-var-glabrescens",
    "plant_name_scientific": "acalypha mildbraediana var. glabrescens",
    "intro": "Acalypha mildbraediana var. glabrescens, commonly known as the smooth-leaved glorybower, is a flowering plant native to parts of Southeast Asia. It is characterized by its lance-shaped, smooth, and often bluish-green leaves. The plant produces showy, clustered inflorescences with small, yellowish-green flowers that bloom in summer. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight. This variety is valued for its ornamental appeal in gardens and as a landscape plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mildbraediana var. glabrescens is primarily native to the eastern part of Australia, specifically Queensland and New South Wales. It is commonly found in coastal and lowland areas, often in sandy or rocky soils. This plant thrives in moist environments and is often seen along riverbanks and in open woodlands. It is known for its distinctive foliage and is a popular ornamental plant in gardens. Its distribution is limited to specific regions within eastern Australia due to its particular habitat requirements.",
    "distribution_introduced_art_desc": "Acalypha mildbraediana var. glabrescens was mainly introduced to the Pacific Islands, particularly in regions such as Hawaii and Tahiti. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution is primarily limited to cultivated areas and garden settings rather than natural habitats. It has not established itself widely in the wild, remaining mostly confined to human-modified environments. This introduction highlights the role of horticultural practices in the spread of plant species."
}
