{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brasiliensis var. obtusa",
    "plant_slug": "acalypha-brasiliensis-var-obtusa",
    "plant_name_scientific": "acalypha brasiliensis var. obtusa",
    "intro": "Acalypha brasiliensis var. obtusa, commonly known as the Brazilian nettle or velvetleaf, is a shrub native to South America. It is characterized by its hairy, ovate leaves that are often tinged with red or purple at the base. The plant produces small, clustered greenish-white flowers that are typically followed by distinctive, inflated seed pods. It thrives in moist, shaded environments and is often found in tropical and subtropical regions. Due to its ornamental value and ability to spread rapidly, it is sometimes considered an invasive species in certain areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brasiliensis var. obtusa is primarily native to the tropical regions of South America, specifically Brazil. It is commonly found in the Atlantic Forest biome, which spans from the state of Bahia to the southern part of the country. This plant thrives in humid, shaded environments within the understory of dense tropical forests. It is also present in parts of Paraguay and Argentina, where similar climatic conditions exist. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha brasiliensis var. obtusa was mainly introduced to ornamental horticulture due to its striking foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and landscapes. The plant's ability to thrive in both full sun and partial shade makes it a popular choice for landscaping purposes. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
