{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha boinensis",
    "plant_slug": "acalypha-boinensis",
    "plant_name_scientific": "acalypha boinensis",
    "intro": "Acalypha boinensis, commonly known as the velvetleaf or redroot, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is a herbaceous perennial that typically grows to a height of 1 to 2 meters, featuring alternate, heart-shaped leaves with a velvety texture. The plant produces small, greenish-white flowers arranged in clusters, which are often surrounded by bracts that can display vibrant red or purple hues. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and forest edges. Acalypha boinensis is valued for its ornamental appeal and has also been used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha boinensis"
    },
    "taxonomy_art_desc": "Acalypha boinensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its varied floral structures. Its order is Malpighiales, a group of flowering plants that includes many tropical and subtropical species, often with distinctive leaf and flower morphology. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha boinensis, a specific plant within the genus Acalypha, known for its unique characteristics and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha boinensis is primarily native to Madagascar. It is found in the diverse ecosystems of this island nation, which is known for its unique and endemic plant species. The plant thrives in tropical and subtropical regions, often in moist, shaded environments. It is commonly found in forests and along stream banks. Due to its restricted range, it is considered a rare and endemic species within Madagascar.",
    "distribution_introduced_art_desc": "Acalypha boinensis was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in areas with warm climates, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in moist, well-drained soils and is often cultivated in gardens and greenhouses. Its rapid growth and ability to spread through vegetative means have led to its establishment in some natural habitats. However, it is considered a potential invasive species in certain regions where it can outcompete native vegetation."
}
