{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha grandidentata",
    "plant_slug": "acalypha-grandidentata",
    "plant_name_scientific": "acalypha grandidentata",
    "intro": "Acalypha grandidentata, commonly known as the large-toothed spurge, is a flowering plant native to the southeastern United States. It is a herbaceous perennial that typically grows in moist, shaded areas such as woodlands and stream banks. The plant features heart-shaped leaves with prominent, serrated teeth along the edges. Its small, greenish-white flowers are clustered in dense, spherical inflorescences called cyathia. Acalypha grandidentata is known for its ornamental value and is sometimes cultivated in gardens for its attractive foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha grandidentata is primarily native to the southeastern United States, including states such as Florida, Georgia, Alabama, and Mississippi. It thrives in moist, well-drained soils and is commonly found in wetlands, swamps, and along the edges of ponds and streams. This plant is also present in parts of Texas and the Caribbean islands, where it adapts to similar wetland habitats. It plays an important role in stabilizing soil and providing habitat for various wildlife species. Due to its preference for wet environments, it is often used in restoration projects in disturbed or degraded wetland areas.",
    "distribution_introduced_art_desc": "Acalypha grandidentata was mainly introduced to the southeastern United States, particularly in Florida and Georgia, as an ornamental plant due to its attractive foliage. It has since spread into other regions, including parts of the Caribbean and Central America, through both intentional cultivation and natural dispersal. The plant thrives in moist, disturbed habitats such as wetlands, ditches, and along roadsides, which has contributed to its establishment in new areas. Its rapid growth and ability to form dense stands have led to concerns about its potential invasiveness in certain ecosystems. Despite its ornamental value, land managers often monitor its spread to prevent ecological impacts."
}
