{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha plicata",
    "plant_slug": "acalypha-plicata",
    "plant_name_scientific": "acalypha plicata",
    "intro": "Acalypha plicata, commonly known as the zigzag hibiscus, is a shrub native to tropical regions of Asia and Africa. It is characterized by its distinctive, wavy, and zigzag-creased leaves that give it its common name. The plant produces showy, hibiscus-like flowers in shades of red, pink, and yellow, which bloom throughout the growing season. It thrives in moist, well-drained soils and is often found in wetlands or along riverbanks. Acalypha plicata is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha plicata"
    },
    "taxonomy_art_desc": "Acalypha plicata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, which consists of flowering plants typically found in tropical and subtropical regions, often with showy inflorescences. Its species is Acalypha plicata, a specific plant within the genus Acalypha known for its distinctive leaf patterns and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Bolivia",
        "Colombia",
        "Peru",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha plicata is primarily native to Argentina Northwest, Bolivia, Colombia, Peru, and Venezuela. This species is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments such as forests and undergrowth. The plant is known for its striking foliage and is often used in ornamental horticulture. Its native range reflects its adaptability to diverse ecological conditions across South America.",
    "distribution_introduced_art_desc": "Acalypha plicata was mainly introduced to tropical and subtropical regions as an ornamental plant due to its striking foliage. It is commonly found in countries such as Australia, Hawaii, and parts of Southeast Asia. The plant thrives in warm, humid climates and is often cultivated in gardens and landscapes. Its rapid growth and ability to spread through seeds make it an invasive species in some areas. However, it is valued for its aesthetic appeal and is sometimes used in erosion control."
}
