{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rubrinervis",
    "plant_slug": "acalypha-rubrinervis",
    "plant_name_scientific": "acalypha rubrinervis",
    "intro": "Acalypha rubrinervis, commonly known as the red-veined strobilus, is a flowering plant native to tropical and subtropical regions of Asia. It is characterized by its strikingly colorful leaves, which often display vibrant red and green veins. The plant produces small, clustered flowers that are typically green or reddish in color. It thrives in moist, well-drained soil and requires partial to full sunlight. Acalypha rubrinervis is often cultivated as an ornamental plant due to its aesthetic appeal and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha rubrinervis"
    },
    "taxonomy_art_desc": "Acalypha rubrinervis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes many species with unique adaptations, such as the ability to produce latex. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" often characterized by their showy flowers and hairy leaves. Its species is Acalypha rubrinervis, a specific type of Acalypha known for its distinctive red veins in the leaves and is native to tropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rubrinervis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. The plant thrives in moist, shaded environments, often growing along riverbanks or in dense forests. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Its native distribution includes both mainland Southeast Asia and various island archipelagos in the region.",
    "distribution_introduced_art_desc": "Acalypha rubrinervis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed habitats and can spread rapidly through seed dispersal by wind and water. Its introduction highlights the ecological risks associated with non-native ornamental species."
}
