{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha peduncularis var. psilogyne",
    "plant_slug": "acalypha-peduncularis-var-psilogyne",
    "plant_name_scientific": "acalypha peduncularis var. psilogyne",
    "intro": "Acalypha peduncularis var. psilogyne, commonly known as red-veined nettle, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, deeply lobed leaves with prominent red veins, which give it its common name. The plant produces small, greenish-yellow flowers arranged in dense clusters, typically appearing in the axils of the leaves. It thrives in moist, shaded environments and is often found in forest understories. The species is valued for its ornamental appeal and has been cultivated for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha peduncularis var. psilogyne is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This variant thrives in moist, shaded environments, often growing along riverbanks or in dense forest undergrowth. It is a shrub or small tree that plays a role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is closely tied to the climate and soil conditions of its native range.",
    "distribution_introduced_art_desc": "Acalypha peduncularis var. psilogyne was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in disturbed soils and can spread rapidly along riverbanks and forest edges. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
