{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mayottensis",
    "plant_slug": "acalypha-mayottensis",
    "plant_name_scientific": "acalypha mayottensis",
    "intro": "Acalypha mayottensis, commonly known as Mayotte croton, is a flowering plant native to the Comoros Islands. It is a shrub characterized by its smooth, often hairy stems and alternate leaves that are typically ovate to elliptic in shape. The plant produces small, yellowish-green flowers arranged in clusters, which are followed by distinctive, three-lobed bracts that give it a striking appearance. It thrives in moist, shaded environments and is often found in coastal areas and forest understories. Due to its limited distribution and habitat specificity, it is considered a rare and potentially endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha mayottensis"
    },
    "taxonomy_art_desc": "Acalypha mayottensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants typically found in tropical and subtropical regions, often with showy inflorescences. Its species is Acalypha mayottensis, a specific plant native to the island of Mayotte, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Comoros"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mayottensis is primarily native to the Comoros. This plant is found in the tropical islands of the Comoros archipelago, which is located in the Indian Ocean off the eastern coast of Africa. It thrives in the humid and warm climate typical of the region. The species is commonly found in coastal areas and lowland forests. Its native distribution is limited to these specific islands within the Comoros.",
    "distribution_introduced_art_desc": "Acalypha mayottensis was mainly introduced to the island of Mayotte as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought by humans for landscaping purposes, as it thrives in tropical and subtropical environments. The plant has since become established in local ecosystems, raising concerns about its potential impact on native flora. Its introduction has led to discussions about its role in altering local biodiversity. Despite its ornamental value, its invasive tendencies have prompted monitoring and management efforts."
}
