{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gracilens var. monococca",
    "plant_slug": "acalypha-gracilens-var-monococca",
    "plant_name_scientific": "acalypha gracilens var. monococca",
    "intro": "Acalypha gracilens var. monococca, commonly known as the narrowleaf spurge or slender acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its slender, upright stems and small, opposite leaves that are typically lance-shaped. The plant produces clusters of tiny, greenish-yellow flowers that are often surrounded by bracts, giving it a distinctive appearance. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and open woodlands. Due to its ornamental value, it is sometimes cultivated in gardens, though it can be invasive in certain areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gracilens var. monococca is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with forest understories or disturbed sites. It is also known to grow in coastal areas and along riverbanks. Its distribution includes parts of the Philippines and northern Australia, where it adapts to similar ecological conditions.",
    "distribution_introduced_art_desc": "Acalypha gracilens var. monococca was mainly introduced to control erosion and stabilize soil in coastal and disturbed areas. It is commonly used in ecological restoration projects due to its rapid growth and ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, with its vibrant foliage making it a popular choice for landscaping. However, it has the potential to become invasive in certain environments if not managed properly. Its introduction has been primarily driven by its ecological and aesthetic benefits in specific regions."
}
