{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha adamsii",
    "plant_slug": "acalypha-adamsii",
    "plant_name_scientific": "acalypha adamsii",
    "intro": "Acalypha adamsii, commonly known as the Adams' beautyberry, is a flowering plant native to the southeastern United States. It belongs to the Euphorbiaceae family and is characterized by its striking clusters of violet to purple berries. The plant typically grows as a shrub, reaching heights of up to 3 meters, with lance-shaped leaves that are often covered in fine hairs. Its flowers are small and inconspicuous, but the berries are showy and attract various birds and insects. The plant thrives in moist, well-drained soils and is often found in woodland edges and thickets.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha adamsii is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and Alabama. It is commonly found in wetland areas, marshes, and along the edges of swamps. This plant thrives in moist, sandy soils and is often associated with coastal regions. It is also known to grow in disturbed habitats such as roadsides and ditches. Acalypha adamsii is an important component of the wetland ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acalypha adamsii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and disturbed forests. It thrives in full sun to partial shade and is commonly found in regions with warm, humid climates. This plant is often spread through wind-dispersed seeds and can establish itself quickly in new environments. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded beyond its native range, leading to ecological concerns in areas where it becomes established."
}
