{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gracilis var. divaricata",
    "plant_slug": "acalypha-gracilis-var-divaricata",
    "plant_name_scientific": "acalypha gracilis var. divaricata",
    "intro": "Acalypha gracilis var. divaricata, commonly known as the slender leaf spurflower, is a flowering plant native to tropical regions of the Americas. It is characterized by its delicate, slender leaves that are often tinged with red or purple at the edges. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in humid, shady environments and is often found in forest understories. Due to its ornamental value, it is occasionally cultivated as a decorative plant in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gracilis var. divaricata is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, lowland environments and is commonly found in coastal areas and near water bodies. This variant is often associated with disturbed habitats and can be seen growing in secondary forests and along roadsides. It is well adapted to the warm, moist climate of these regions and is often used in local landscaping. Its native distribution reflects its preference for tropical and subtropical conditions.",
    "distribution_introduced_art_desc": "Acalypha gracilis var. divaricata was mainly introduced to enhance ornamental value in gardens and landscapes due to its attractive foliage and compact growth habit. It is commonly cultivated in regions with warm climates where it thrives in partial to full sunlight. This variety is often used as a ground cover or in container plantings for its vibrant green leaves and delicate flowers. Its introduction has expanded its geographic range beyond its native habitat, contributing to its popularity among horticulturists. However, it requires well-drained soil and regular watering to maintain optimal growth and appearance."
}
