{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha paupercula",
    "plant_slug": "acalypha-paupercula",
    "plant_name_scientific": "acalypha paupercula",
    "intro": "Acalypha paupercula, commonly known as the poor man's hibiscus, is a flowering plant native to tropical regions of Africa. It is a shrub or small tree that typically grows up to 3 meters in height. The plant features palmate leaves with five to seven lobes, and it produces small, yellowish-green flowers that are clustered in terminal inflorescences. It thrives in moist, well-drained soil and is often found in wetlands or along stream banks. The plant is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha paupercula"
    },
    "taxonomy_art_desc": "Acalypha paupercula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants known for their diverse morphology and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide variety of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha paupercula, a specific type of plant within the Acalypha genus, noted for its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha paupercula is primarily native to Bolivia. This species is found in the dry and semi-arid regions of the country. It thrives in areas with low rainfall and well-drained soils. The plant is commonly observed in open habitats such as grasslands and rocky outcrops. Its distribution is largely restricted to specific ecological zones within Bolivia.",
    "distribution_introduced_art_desc": "Acalypha paupercula was mainly introduced to New Zealand. It was first recorded in the 19th century and has since become naturalized in various regions of the country. The plant thrives in disturbed habitats such as roadsides, waste areas, and forest margins. It is considered a potential weed due to its ability to spread rapidly and compete with native vegetation. Despite its invasive tendencies, it is sometimes cultivated for its ornamental value."
}
