{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha glechomifolia",
    "plant_slug": "acalypha-glechomifolia",
    "plant_name_scientific": "acalypha glechomifolia",
    "intro": "Acalypha glechomifolia, commonly known as the broadleaf ironweed, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its large, heart-shaped leaves that are often covered in fine, soft hairs. The plant produces clusters of small, pale yellow flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in moist, well-drained soils and is often found in wetlands or along riverbanks. The plant is also valued for its ornamental appeal and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha glechomifolia"
    },
    "taxonomy_art_desc": "Acalypha glechomifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes species with a wide range of habitats and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha glechomifolia, a specific type within the genus Acalypha, known for its distinctive leaf shape and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba",
        "Dominican Republic",
        "Haiti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha glechomifolia is primarily native to Cuba, Dominican Republic, and Haiti. This plant is commonly found in tropical and subtropical regions within these countries. It typically grows in moist, shaded environments such as forests and disturbed areas. The species is known for its distinctive foliage and is often used in traditional medicine. Its distribution is limited to the Caribbean islands mentioned.",
    "distribution_introduced_art_desc": "Acalypha glechomifolia was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. The plant has since become naturalized in certain areas, spreading through both seed dispersal and vegetative growth. It is now considered an invasive species in some regions, outcompeting native vegetation and altering local ecosystems. Efforts to control its spread have been ongoing, but its establishment in the wild remains a challenge."
}
