{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mapirensis var. pubescens",
    "plant_slug": "acalypha-mapirensis-var-pubescens",
    "plant_name_scientific": "acalypha mapirensis var. pubescens",
    "intro": "Acalypha mapirensis var. pubescens, commonly known as the hairy mapire spurflower, is a flowering plant native to tropical regions of South America. It belongs to the Euphorbiaceae family and is characterized by its distinctive, showy inflorescences. The plant features glandular hairs on its stems and leaves, contributing to its common name. Its leaves are typically ovate to lanceolate in shape, with a smooth or slightly hairy surface. It thrives in humid, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mapirensis var. pubescens is primarily native to the humid lowland forests of Central America, specifically in parts of southern Mexico, Belize, and northern Guatemala. This plant thrives in warm, moist environments with high humidity and partial to full shade. It is commonly found in secondary growth areas and along riverbanks in these regions. The species is adapted to the tropical climate and is often part of the undergrowth vegetation. Its native range is limited to these specific geographic areas within Central America.",
    "distribution_introduced_art_desc": "Acalypha mapirensis var. pubescens was mainly introduced to tropical and subtropical regions of the Americas, particularly in countries like Mexico, Central America, and parts of South America. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant thrives in areas with high humidity and well-drained soils, making it adaptable to various environmental conditions. Its introduction has been largely due to its ornamental value and ability to colonize new areas quickly. However, it is considered a potential invasive species in some regions where it can outcompete native vegetation."
}
