{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sphenophylla",
    "plant_slug": "acalypha-sphenophylla",
    "plant_name_scientific": "acalypha sphenophylla",
    "intro": "Acalypha sphenophylla, commonly known as the narrow-leaf copperleaf, is a tropical shrub native to Southeast Asia. It is characterized by its striking, coppery-red bracts that surround its small, inconspicuous flowers. The plant has palmately lobed leaves that are typically narrow and elongated, giving it a distinctive appearance. It thrives in humid, shaded environments and is often found in forest understories. The species is valued for its ornamental qualities and is sometimes cultivated in gardens for its vibrant foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sphenophylla is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland areas with rich soil and high rainfall. This plant is commonly found in forests, along riverbanks, and in disturbed habitats. It is well adapted to the warm and moist climate of its native range. Due to its ornamental value, it has also been introduced to other tropical and subtropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha sphenophylla was mainly introduced to areas with warm, humid climates and well-drained soils, often found in tropical and subtropical regions. It is commonly cultivated as an ornamental plant due to its attractive foliage and compact growth habit. The plant thrives in full sun to partial shade and requires regular watering to maintain its health and appearance. It is particularly popular in horticultural settings such as gardens and landscapes. However, it is important to note that it may become invasive in certain environments if not properly managed."
}
