{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha filipes",
    "plant_slug": "acalypha-filipes",
    "plant_name_scientific": "acalypha filipes",
    "intro": "Acalypha filipes, commonly known as silky ironwood, is a flowering plant native to Madagascar. It is a shrub or small tree that can grow up to 5 meters in height. The plant is characterized by its dark green, glossy leaves and small, inconspicuous flowers. Its bark is thick and fibrous, which contributes to its common name. It thrives in tropical climates and is often found in dry forests and scrublands.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha filipes"
    },
    "taxonomy_art_desc": "Acalypha filipes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their relatives, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features, such as the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with often milky sap and showy flowers. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup plant,\" characterized by their hairy leaves and unique inflorescences. Its species is Acalypha filipes, a specific plant within the genus Acalypha, known for its slender stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha filipes is primarily native to Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, well-drained soils and is often seen in open woodlands and disturbed habitats. The species is known for its distinctive foliage and is sometimes used in traditional medicine. Its native range reflects its adaptability to diverse environmental conditions across central and southern Mexico.",
    "distribution_introduced_art_desc": "Acalypha filipes was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various environmental conditions. It has since become naturalized in several regions, particularly in coastal and urban areas where it thrives in disturbed soils. The plant is considered invasive in some parts of New Zealand, where it outcompetes native species and alters local ecosystems. Its rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its success in non-native environments. Management efforts are ongoing to control its spread and mitigate its impact on indigenous flora."
}
