{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pleiogyne",
    "plant_slug": "acalypha-pleiogyne",
    "plant_name_scientific": "acalypha pleiogyne",
    "intro": "Acalypha pleiogyne, commonly known as the velvetleaf or false nettle, is a flowering plant native to tropical and subtropical regions. It is characterized by its smooth, often hairy stems and heart-shaped leaves that are typically green with a metallic sheen. The plant produces small, clustered flowers that are usually green or reddish in color. It thrives in moist, shady environments and is often found in forest understories. Acalypha pleiogyne is valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pleiogyne"
    },
    "taxonomy_art_desc": "Acalypha pleiogyne belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Malpighiales, a large group of flowering plants with diverse morphological features, including some species with unique leaf and flower structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"hairy leaves,\" characterized by their distinctive leaf patterns and often showy flowers. Its species is Acalypha pleiogyne, a specific plant within the genus Acalypha, known for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Thailand"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pleiogyne is primarily native to Thailand. It is commonly found in the tropical regions of the country, particularly in lowland areas with moist, fertile soils. This plant thrives in humid climates and is often associated with secondary forests and disturbed habitats. It is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its distribution is largely confined to Thailand, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha pleiogyne was mainly introduced to ornamental horticulture due to its attractive foliage and vibrant flowers. It is commonly cultivated in tropical and subtropical regions for use in gardens and landscapes. The plant is often grown as a houseplant or in containers because of its adaptability to various growing conditions. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its rapid growth and ability to spread through seeds make it a concern in certain ecosystems."
}
