{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha triloba",
    "plant_slug": "acalypha-triloba",
    "plant_name_scientific": "acalypha triloba",
    "intro": "Acalypha triloba, commonly known as the three-lobed spurflower, is a flowering plant native to tropical and subtropical regions of the Americas. It is characterized by its distinctive, three-lobed leaves that are often covered in fine hairs. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, well-drained soils and is often found in woodland or swampy areas. Acalypha triloba is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha triloba"
    },
    "taxonomy_art_desc": "Acalypha triloba belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some modern flowering plants. Its subclass is Magnoliidae, which is a large group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a group of flowering plants known for their diverse forms and includes families such as Euphorbiaceae. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, which consists of herbaceous plants often with distinctive leaves and is part of the Euphorbiaceae family. Its species is Acalypha triloba, a specific plant within the genus Acalypha known for its unique leaf structure and is commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Costa Rica",
        "Guatemala",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha triloba is primarily native to Costa Rica, Guatemala, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments, often in forest understories or along stream banks. The species is known for its vibrant foliage and is sometimes cultivated as an ornamental plant. Its native range reflects its adaptability to humid, warm climates with high rainfall.",
    "distribution_introduced_art_desc": "Acalypha triloba was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th century by European settlers who admired its vibrant leaves. The plant has since become naturalized in various coastal and disturbed areas throughout the region. Its rapid growth and ability to thrive in diverse soil conditions have contributed to its spread. However, it is considered a potential invasive species in some areas, raising concerns about its ecological impact."
}
