{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula var. procumbens",
    "plant_slug": "acalypha-parvula-var-procumbens",
    "plant_name_scientific": "acalypha parvula var. procumbens",
    "intro": "Acalypha parvula var. procumbens, commonly known as the prostrate croton, is a low-growing shrub native to tropical regions of the Americas. It features small, ovate leaves with a distinctive reddish or purple underside, which adds visual interest to its foliage. The plant produces tiny, clustered flowers that are typically greenish-white in color. It thrives in moist, well-drained soils and is often used in landscaping for its ornamental value. Due to its compact growth habit, it is suitable for ground cover or as a filler plant in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula var. procumbens is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in lowland areas with moist, shaded habitats, often growing in the understorey of forests. This variant of Acalypha parvula is also present in parts of the Pacific Islands, including Hawaii and the Philippines. It thrives in humid climates and is often associated with disturbed or secondary growth vegetation. Its native range extends into parts of northern Australia as well.",
    "distribution_introduced_art_desc": "Acalypha parvula var. procumbens was mainly introduced to new habitats through human activity, such as horticultural trade and accidental dispersal. It thrives in disturbed soils and sunny environments, making it adaptable to various ecological niches. This plant has been reported in regions with warm climates, including parts of the southeastern United States and tropical areas. Its rapid growth and ability to spread via seeds contribute to its successful establishment in non-native areas. However, it is considered a potential invasive species in some regions due to its competitive nature."
}
