{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha nicaraguensis",
    "plant_slug": "acalypha-nicaraguensis",
    "plant_name_scientific": "acalypha nicaraguensis",
    "intro": "Acalypha nicaraguensis, commonly known as the Nicaragua flameflower, is a flowering plant native to Central America. It belongs to the Euphorbiaceae family and is characterized by its striking, bright red bracts that resemble flowers. The plant typically grows as an herbaceous shrub, reaching heights of up to 2 meters. Its leaves are alternate, ovate, and often have a rough texture. Acalypha nicaraguensis is valued for its ornamental appeal and is sometimes cultivated in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha nicaraguensis is primarily native to Central America, specifically Nicaragua, Costa Rica, and Panama. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with secondary forests and disturbed habitats. It is also found in parts of Colombia and parts of the Caribbean islands. Its native range extends into northern South America, including parts of Venezuela and Ecuador.",
    "distribution_introduced_art_desc": "Acalypha nicaraguensis was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticultural enthusiasts and plant collectors. The plant thrives in tropical and subtropical climates, making it well-suited to the environmental conditions of these regions. However, it has since become naturalized in some areas, raising concerns about its potential impact on native ecosystems. Its introduction highlights the role of human activity in the spread of plant species beyond their native ranges."
}
