{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brevibracteata",
    "plant_slug": "acalypha-brevibracteata",
    "plant_name_scientific": "acalypha brevibracteata",
    "intro": "Acalypha brevibracteata, commonly known as the narrow-bracted spurge, is a flowering plant native to tropical and subtropical regions of Africa. It is characterized by its simple, alternate leaves that are often reddish or purplish in color. The plant produces small, greenish flowers arranged in clusters, typically borne on short peduncles. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and fields. The species is valued for its ornamental appeal and has been introduced to various parts of the world as a garden plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brevibracteata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in humid environments and is often associated with disturbed habitats like roadside verges and secondary forests. It is also present in parts of Australia, where it has been introduced and naturalized. The plant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha brevibracteata was mainly introduced to new environments as an ornamental plant due to its attractive foliage and unique appearance. It has been reported in several regions outside its native habitat, including parts of the Pacific Islands and tropical areas of the Americas. The plant's rapid growth and ability to thrive in disturbed soils have contributed to its spread in these regions. However, its introduction has raised concerns about potential invasiveness and competition with native species. Despite its aesthetic appeal, careful monitoring is recommended to prevent ecological harm."
}
