{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sonderiana",
    "plant_slug": "acalypha-sonderiana",
    "plant_name_scientific": "acalypha sonderiana",
    "intro": "Acalypha sonderiana, commonly known as the velvetleaf or false hibiscus, is a shrub native to tropical and subtropical regions of Africa, Asia, and the Pacific. It is characterized by its smooth, often hairy stems and leaves that are typically ovate to lanceolate in shape. The plant produces small, inconspicuous flowers that are usually green or yellowish, followed by distinctive, spiny seed capsules. Its leaves are often used in traditional medicine for their purported anti-inflammatory and antiseptic properties. Acalypha sonderiana thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and forest edges.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha sonderiana"
    },
    "taxonomy_art_desc": "Acalypha sonderiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral structures and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper,\" characterized by their showy flowers and often hairy leaves. Its species is Acalypha sonderiana, a specific type of plant within the Acalypha genus, known for its distinctive foliage and ecological significance in its native habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Eswatini",
        "Kenya",
        "KwaZulu-Natal",
        "Mozambique"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sonderiana is primarily native to Eswatini, Kenya, KwaZulu-Natal, and Mozambique. It is commonly found in these regions within eastern and southern Africa. The plant typically grows in moist, tropical, or subtropical environments. It is often seen in open woodlands, along riverbanks, and in disturbed areas. Its native distribution reflects its adaptability to a variety of ecological conditions in these countries.",
    "distribution_introduced_art_desc": "Acalypha sonderiana was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various environmental conditions. It has since spread beyond cultivated areas, establishing itself in native ecosystems, particularly in coastal and lowland regions. The plant's rapid growth and ability to thrive in disturbed soils have contributed to its invasive potential in certain areas. It is considered a weed in some parts of New Zealand, where it competes with native vegetation. Management efforts focus on controlling its spread to protect biodiversity and ecological balance."
}
