{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha latifolia",
    "plant_slug": "acalypha-latifolia",
    "plant_name_scientific": "acalypha latifolia",
    "intro": "Acalypha latifolia, commonly known as the broadleaf spurge, is a tropical plant native to Southeast Asia. It is characterized by its broad, waxy leaves that are often variegated with shades of green, white, and pink. The plant produces small, inconspicuous flowers that are typically green or reddish in color. It is often cultivated as an ornamental plant due to its attractive foliage. However, it can be invasive in some regions and requires careful management.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha latifolia is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is also found in parts of tropical Africa, including Nigeria and Uganda. This plant thrives in humid, tropical climates and is commonly found in lowland areas with rich soils. It is often seen growing in moist forests and along riverbanks. Acalypha latifolia is known for its striking foliage and is sometimes cultivated as an ornamental plant.",
    "distribution_introduced_art_desc": "Acalypha latifolia was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and unique growth habits. It is commonly cultivated in tropical and subtropical regions for its decorative value. The plant has been introduced to various countries, including parts of the United States, Australia, and the Caribbean. It thrives in moist, well-drained soils and partial to full sunlight. However, it has also been reported as an invasive species in some areas, raising concerns about its ecological impact."
}
