{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha boehmerioides var. glandulosa",
    "plant_slug": "acalypha-boehmerioides-var-glandulosa",
    "plant_name_scientific": "acalypha boehmerioides var. glandulosa",
    "intro": "Acalypha boehmerioides var. glandulosa, commonly known as the stickyweed or glandular acalypha, is a flowering plant native to tropical and subtropical regions. It is characterized by its glandular hairs on the stems and leaves, which give it a sticky texture. The plant produces small, clustered flowers that are typically greenish or reddish in color. Its leaves are usually ovate to elliptic in shape and may have a slightly hairy surface. It thrives in moist, well-drained soils and is often found in disturbed habitats or along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha boehmerioides var. glandulosa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland areas with high humidity and well-drained soil. This plant is commonly associated with disturbed habitats, such as roadsides, open forests, and secondary growth areas. It is known for its distinctive foliage and is sometimes cultivated as an ornamental plant. Its distribution is closely linked to the monsoonal climate patterns of the region.",
    "distribution_introduced_art_desc": "Acalypha boehmerioides var. glandulosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred in the 19th century, during the period of increased botanical exploration and horticultural exchange. Despite its aesthetic value, it has since become a weed in some areas, posing a threat to native ecosystems. Its rapid growth and ability to thrive in disturbed soils have contributed to its spread across various regions of New Zealand."
}
