{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha elizabethiae",
    "plant_slug": "acalypha-elizabethiae",
    "plant_name_scientific": "acalypha elizabethiae",
    "intro": "Acalypha elizabethiae, commonly known as the Elizabeth's glorybower, is a flowering plant native to the island of Saint Helena in the South Atlantic Ocean. It is characterized by its striking, showy inflorescences that consist of clusters of red bracts surrounding small, inconspicuous flowers. The plant typically grows as a shrub, reaching heights of up to 2 meters, and thrives in well-drained, nutrient-rich soils. Its leaves are ovate to elliptical in shape, with a smooth texture and a deep green color. Due to its limited natural range and habitat threats, Acalypha elizabethiae is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha elizabethiae"
    },
    "taxonomy_art_desc": "Acalypha elizabethiae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history and includes fern allies and some modern vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral and vegetative features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide range of plants with diverse morphologies and ecological adaptations. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup-leaf,\" characterized by their unique leaf shapes and often colorful flowers. Its species is Acalypha elizabethiae, a specific type of Acalypha that is likely endemic to a particular region and may have unique ecological or morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Windward Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha elizabethiae is primarily native to the Windward Islands. This plant is found in the tropical regions of the Caribbean, specifically on the Windward Islands. It thrives in humid, coastal environments with well-drained soils. The species is commonly observed in forest understories and along riverbanks. Its native distribution is limited to these specific islands, making it a regionally significant plant.",
    "distribution_introduced_art_desc": "Acalypha elizabethiae was mainly introduced to the Hawaiian Islands. It was first discovered in the early 20th century and is believed to have been brought there by human activity. This plant is now considered an invasive species in certain areas of Hawaii due to its rapid growth and ability to outcompete native vegetation. It thrives in disturbed habitats such as roadsides and abandoned fields. Conservation efforts are ongoing to control its spread and protect native ecosystems."
}
