{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schiedeana var. genuina",
    "plant_slug": "acalypha-schiedeana-var-genuina",
    "plant_name_scientific": "acalypha schiedeana var. genuina",
    "intro": "Acalypha schiedeana var. genuina, commonly known as the red-veined nettle, is a shrub native to tropical regions of South America. It features distinctive, heart-shaped leaves with prominent red veins that contrast sharply with its dark green foliage. The plant produces small, clustered greenish-white flowers that are followed by three-lobed, red or orange berries. It thrives in moist, shaded environments and is often found in rainforests. Its unique leaf patterns make it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schiedeana var. genuina is primarily native to tropical and subtropical regions of Central America, including parts of Mexico, Guatemala, Belize, and Honduras. It thrives in moist, shaded environments such as forest understories and along stream banks. This variant is commonly found in lowland areas with high humidity and well-drained soils. It is often associated with secondary growth forests and is sometimes cultivated as an ornamental plant. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acalypha schiedeana var. genuina was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It thrives in full sun to partial shade and is commonly found in disturbed habitats such as roadsides, clearings, and abandoned fields. This plant is often used in ornamental landscaping due to its attractive foliage and unique growth habit. It has been reported in several countries in Southeast Asia and the Pacific Islands. However, it is considered an invasive species in some regions where it outcompetes native vegetation."
}
