{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha polynema",
    "plant_slug": "acalypha-polynema",
    "plant_name_scientific": "acalypha polynema",
    "intro": "Acalypha polynema, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Asia. It is characterized by its striking, palmately lobed leaves that often have red veins contrasting with their green or yellowish-green coloration. The plant produces small, clustered flowers that are typically green or reddish in color. It thrives in moist, shaded environments and is often found in forests or along stream banks. Due to its ornamental value, it is cultivated in gardens and used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha polynema is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along stream banks or in dense forest understories. It is also present in parts of Oceania, including some islands in the Pacific. Due to its adaptability, it can sometimes be found in disturbed habitats or cultivated in gardens.",
    "distribution_introduced_art_desc": "Acalypha polynema was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by humans for its aesthetic value, such as its vibrant leaves and unique growth habit. However, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed soils and can spread rapidly through both seeds and vegetative reproduction. Its introduction highlights the ecological risks associated with non-native ornamental species."
}
