{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha integrifolia subsp. panduriformis",
    "plant_slug": "acalypha-integrifolia-subsp-panduriformis",
    "plant_name_scientific": "acalypha integrifolia subsp. panduriformis",
    "intro": "Acalypha integrifolia subsp. panduriformis, commonly known as the broad-leaved spurge or panduriform acalypha, is a herbaceous perennial plant native to Southeast Asia. It is characterized by its large, heart-shaped leaves that are typically smooth and glossy. The plant produces small, greenish-yellow flowers arranged in clusters, which are borne on slender pedicels. It thrives in moist, shaded environments and is often found in forest understories. Its ornamental value is due to its striking foliage, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha integrifolia subsp. panduriformis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, fertile soils. This subspecies thrives in humid environments and is often associated with disturbed habitats like roadsides, forest edges, and riverbanks. It is also present in parts of northern Australia and has been introduced to other tropical regions. The plant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha integrifolia subsp. panduriformis was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and adaptability to various environmental conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value and ease of maintenance. The plant's ability to thrive in both full sun and partial shade makes it a popular choice for gardeners and landscapers. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has led to ecological concerns in regions where it has established itself beyond controlled environments."
}
