{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sessilis var. brevibracteata",
    "plant_slug": "acalypha-sessilis-var-brevibracteata",
    "plant_name_scientific": "acalypha sessilis var. brevibracteata",
    "intro": "Acalypha sessilis var. brevibracteata, commonly known as the narrow-bract spurge, is a herbaceous plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family, characterized by its milky sap and unique floral structures. The plant features opposite, ovate leaves with a smooth texture and short, bract-like structures at the base of its inflorescences. Its flowers are unisexual, with male and female flowers typically occurring on separate plants. It thrives in well-drained soil and partial to full sunlight, making it a versatile ornamental plant in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sessilis var. brevibracteata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant thrives in shaded to semi-shaded environments, often growing in the understory of tropical forests. It is also present in parts of New Guinea and the Indian subcontinent. The plant is known for its attractive foliage and is sometimes cultivated as an ornamental species.",
    "distribution_introduced_art_desc": "Acalypha sessilis var. brevibracteata was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and compact growth habit. It is commonly cultivated in tropical and subtropical regions for use in gardens, as a houseplant, and in public spaces. The plant's ability to thrive in a variety of soil types and its relatively low maintenance requirements contribute to its popularity among gardeners. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about its ecological impact in non-native habitats."
}
