{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha carpinifolia var. genuina",
    "plant_slug": "acalypha-carpinifolia-var-genuina",
    "plant_name_scientific": "acalypha carpinifolia var. genuina",
    "intro": "Acalypha carpinifolia var. genuina, commonly known as the woolly knotweed, is a perennial shrub native to Southeast Asia. It is characterized by its distinctive, woolly, silver-green leaves that are often covered in fine, soft hairs. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shady environments and is often found in forest understories. Its unique foliage makes it a popular choice for ornamental gardening in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha carpinifolia var. genuina is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland forests and disturbed habitats. This variant is particularly common in areas with high humidity and well-drained soils. It is also present in parts of Indonesia and Malaysia, where it grows in shaded undergrowth. The plant is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha carpinifolia var. genuina was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in disturbed sites such as roadsides, fields, and along stream banks. This plant thrives in temperate climates and is often used for erosion control due to its rapid growth. It has also been introduced as an ornamental plant for its attractive foliage and unique seed structures. However, its spread can sometimes lead to competition with native species in certain ecosystems."
}
