{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha glandulosa",
    "plant_slug": "acalypha-glandulosa",
    "plant_name_scientific": "acalypha glandulosa",
    "intro": "Acalypha glandulosa, commonly known as the sticky dock or glandular acalypha, is a flowering plant native to tropical and subtropical regions. It is characterized by its hairy, glandular leaves that often exude a sticky substance. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shady environments and is often found in wetlands or along stream banks. Acalypha glandulosa is valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha glandulosa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with disturbed habitats like roadsides, forests edges, and agricultural fields. It is also present in parts of Australia and the Pacific Islands. Its distribution is largely confined to regions with a warm, wet climate and minimal frost.",
    "distribution_introduced_art_desc": "Acalypha glandulosa was mainly introduced to the Hawaiian Islands. It was brought there by humans, likely as an ornamental plant due to its attractive foliage. The plant has since become naturalized in certain areas, particularly in disturbed habitats and along roadsides. Its introduction has raised concerns due to its potential to outcompete native species. Despite its spread, it is not currently listed as an invasive species in Hawaii."
}
