{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha × malawiensis",
    "plant_slug": "acalypha-×-malawiensis",
    "plant_name_scientific": "acalypha × malawiensis",
    "intro": "Acalypha × malawiensis, commonly known as the Malawi spurflower, is a hybrid shrub native to the tropical regions of Eastern Africa. It is characterized by its striking, colorful bracts that range from red to orange, which are often mistaken for flowers. The plant typically grows to a height of 1 to 2 meters and has opposite, ovate leaves with a smooth or slightly hairy surface. It thrives in full sun to partial shade and requires well-drained soil for optimal growth. The species is valued in horticulture for its ornamental appeal and is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha × malawiensis"
    },
    "taxonomy_art_desc": "Acalypha × malawiensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with varied morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha × malawiensis, a hybrid plant native to Malawi, known for its ornamental value and unique foliage patterns.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Malawi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha × malawiensis is primarily native to Malawi. This plant is found in the natural habitats of Malawi, including its forests and woodlands. It is commonly observed in the central and southern regions of the country. The species thrives in tropical and subtropical climates, which are characteristic of Malawi's geography. Its native distribution is closely tied to the ecological conditions present in Malawi.",
    "distribution_introduced_art_desc": "Acalypha × malawiensis was mainly introduced to ornamental horticulture due to its attractive foliage and vibrant flowers. It is commonly cultivated in gardens and as a potted plant in tropical and subtropical regions. The plant is valued for its ability to thrive in a variety of soil types and its relatively low maintenance requirements. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about its ecological impact in non-native habitats."
}
