{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha amentacea subsp. wilkesiana",
    "plant_slug": "acalypha-amentacea-subsp-wilkesiana",
    "plant_name_scientific": "acalypha amentacea subsp. wilkesiana",
    "intro": "Acalypha amentacea subsp. wilkesiana, commonly known as the silverleaf ironwood, is a shrub or small tree native to tropical regions of the Americas. It is characterized by its striking silver-gray foliage, which gives it a distinctive appearance. The plant produces catkin-like inflorescences, which are typically green to reddish in color. Its leaves are usually opposite and have a velvety texture. It thrives in well-drained soils and is often used in ornamental landscaping due to its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha amentacea subsp. wilkesiana is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in lowland rainforests and along riverbanks in these areas. This species thrives in humid, warm climates with high rainfall. It is often associated with secondary growth areas and disturbed habitats. Its native range extends to parts of Oceania, including some islands in the Pacific.",
    "distribution_introduced_art_desc": "Acalypha amentacea subsp. wilkesiana was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive, fluffy seed heads. It is commonly cultivated in gardens and as a landscape plant because of its vibrant foliage and unique appearance. This species has been introduced to parts of the United States, including Florida and Hawaii, as well as other warm climates around the world. However, it is considered invasive in some areas where it can outcompete native vegetation. Its rapid growth and ability to spread through wind-dispersed seeds contribute to its success in non-native environments."
}
