{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pedunculata",
    "plant_slug": "acalypha-pedunculata",
    "plant_name_scientific": "acalypha pedunculata",
    "intro": "Acalypha pedunculata, commonly known as the redroot croton, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, bright red roots and its clusters of small, yellowish-green flowers. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind. It thrives in moist, well-drained soils and is often found in woodland or swampy areas. Due to its ornamental value, it is sometimes cultivated in gardens, though it can be invasive in certain environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pedunculata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments like forest understories. This plant thrives in humid climates and is typically associated with lowland and mountainous areas. It is also present in parts of India and the Pacific Islands. Its distribution is closely linked to areas with high rainfall and warm temperatures.",
    "distribution_introduced_art_desc": "Acalypha pedunculata was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed soils, along roadsides, and in abandoned fields. The plant spreads through its prolific seed production and can form dense stands that outcompete native vegetation. Due to its rapid growth and adaptability, it has become an invasive species in several areas outside its native range. Its distribution is now widespread in regions with warm climates and poor soil conditions."
}
