{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha capensis f. lamiifolia",
    "plant_slug": "acalypha-capensis-f-lamiifolia",
    "plant_name_scientific": "acalypha capensis f. lamiifolia",
    "intro": "Acalypha capensis f. lamiifolia, commonly known as the velvetleaf or woollyleaf, is a shrub native to southern Africa. It is characterized by its soft, velvety leaves that are often covered in fine hairs, giving it a distinctive texture. The plant produces small, inconspicuous greenish flowers that are clustered in dense inflorescences. It thrives in moist, well-drained soils and is often found in coastal areas or near water sources. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha capensis f. lamiifolia is primarily native to southern Africa, specifically South Africa. It is commonly found in the Eastern Cape and KwaZulu-Natal provinces. This plant typically grows in moist, wooded areas and along riverbanks. It is often seen in coastal and mountainous regions with a humid climate. Its native distribution is closely associated with the natural vegetation of these areas.",
    "distribution_introduced_art_desc": "Acalypha capensis f. lamiifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in disturbed soils and sunny environments. The plant is often cultivated as an ornamental due to its attractive foliage and ability to tolerate coastal conditions. However, it has also been reported to spread aggressively, potentially outcompeting native vegetation in some areas. Its introduction has raised concerns about its impact on local ecosystems and biodiversity."
}
