{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha arciana",
    "plant_slug": "acalypha-arciana",
    "plant_name_scientific": "acalypha arciana",
    "intro": "Acalypha arciana, commonly known as the silky fanflower, is a flowering plant native to the southeastern United States. It is characterized by its striking, silver-gray foliage and clusters of small, pinkish-white flowers. The plant thrives in moist, well-drained soils and prefers partial to full sun. Its unique, fern-like leaves and showy inflorescences make it a popular choice for ornamental gardening. It is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha arciana is primarily native to the southeastern United States, including parts of Florida, Georgia, South Carolina, and Alabama. It is commonly found in wetlands, marshes, and along the edges of ponds and streams. This plant thrives in moist to wet soils and is often seen in coastal areas and river floodplains. It is also known to grow in disturbed sites such as ditches and roadsides. Acalypha arciana is an important component of the wetland ecosystems in its native range.",
    "distribution_introduced_art_desc": "Acalypha arciana was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as forests and along stream banks. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon, Washington, and California. Its spread is often associated with disturbed habitats and human activities like hiking and land development."
}
