{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica var. texana",
    "plant_slug": "acalypha-virginica-var-texana",
    "plant_name_scientific": "acalypha virginica var. texana",
    "intro": "Acalypha virginica var. texana, commonly known as the Texas ironweed, is a shrub native to the southeastern United States. It features opposite, ovate to lance-shaped leaves that are often hairy and have a rough texture. The plant produces clusters of small, greenish-white flowers that are borne in dense, spike-like inflorescences. It thrives in moist, well-drained soils and is often found in wetlands, riverbanks, and prairies. The species is known for its ornamental value and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica var. texana is primarily native to the southeastern United States, specifically Texas and parts of Louisiana. This variant of the species is commonly found in wetland areas, marshes, and along the edges of water bodies. It thrives in moist, sandy soils and is often associated with riparian habitats. The plant is known for its distinctive red bracts that appear during the summer months. It plays an important role in supporting local wildlife and maintaining the ecological balance of its native environment.",
    "distribution_introduced_art_desc": "Acalypha virginica var. texana was mainly introduced to the southern United States, particularly in Texas and Louisiana. It is commonly found in disturbed soils along roadsides, railroads, and in urban areas. This plant is known for its distinctive red bracts that attract pollinators such as bees and butterflies. It has become a common ornamental plant due to its vibrant foliage and unique appearance. However, it is also considered a potential invasive species in some regions."
}
