{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha commersoniana",
    "plant_slug": "acalypha-commersoniana",
    "plant_name_scientific": "acalypha commersoniana",
    "intro": "Acalypha commersoniana, commonly known as the silverleaf croton, is a flowering plant native to South America. It is characterized by its striking silver-green foliage and vibrant red or orange flowers. The plant belongs to the Euphorbiaceae family, which includes many species with milky sap. It typically grows in tropical and subtropical regions, often in moist, shaded environments. The leaves are alternate and have a distinctive waxy texture, contributing to its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha commersoniana is primarily native to tropical and subtropical regions of the Americas, including parts of Mexico, Central America, and the Caribbean. It is commonly found in coastal areas, riverbanks, and disturbed habitats such as roadsides and abandoned fields. The plant thrives in warm, humid climates with well-drained soil. It is often seen in lowland areas but can occasionally be found in higher elevations. Due to its adaptability, it has also been introduced to other parts of the world, including Southeast Asia and the Pacific Islands.",
    "distribution_introduced_art_desc": "Acalypha commersoniana was mainly introduced to urban and coastal areas for ornamental purposes due to its attractive foliage and adaptability. It has been reported in several tropical and subtropical regions, including parts of the Caribbean, Southeast Asia, and the Pacific Islands. The plant is often found growing in disturbed soils, along roadsides, and in abandoned lots, which contributes to its spread. Its rapid growth and ability to thrive in various conditions make it an invasive species in some areas. However, it is also cultivated in gardens and used in traditional medicine in its native range."
}
