{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha vagans var. genuina",
    "plant_slug": "acalypha-vagans-var-genuina",
    "plant_name_scientific": "acalypha vagans var. genuina",
    "intro": "Acalypha vagans var. genuina, commonly known as the velvetleaf or false nettle, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, velvety foliage and small, clustered flowers that range from green to red or purple. The plant thrives in moist, shady environments and is often found in disturbed soils. Its leaves are typically heart-shaped with a smooth or slightly serrated margin. It is valued in horticulture for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha vagans var. genuina is primarily native to Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. It thrives in moist, well-drained soils and is often associated with disturbed habitats such as roadsides and abandoned fields. The plant is known for its ornamental value due to its vibrant foliage and unique inflorescences. It plays a role in local ecosystems by providing food and shelter for various insects and small animals.",
    "distribution_introduced_art_desc": "Acalypha vagans var. genuina was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was likely brought by horticulturists and gardeners seeking to add exotic and visually appealing species to local landscapes. Despite its aesthetic value, the plant has shown potential to become invasive in some areas, outcompeting native vegetation. Its rapid growth and ability to spread through both seeds and vegetative reproduction have raised concerns among conservationists. Efforts are now underway to monitor and manage its spread to protect native ecosystems."
}
