{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha grisea",
    "plant_slug": "acalypha-grisea",
    "plant_name_scientific": "acalypha grisea",
    "intro": "Acalypha grisea, commonly known as grayleaf spurflower, is a flowering plant native to tropical regions of Africa and the Indian subcontinent. It is characterized by its grayish-green, velvety leaves that are often covered in fine hairs. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha grisea is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha grisea"
    },
    "taxonomy_art_desc": "Acalypha grisea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical and temperate species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with unique floral morphology and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupids,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha grisea, a specific plant within the genus Acalypha, known for its grayish appearance and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha grisea is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in rocky soils and is often seen in scrublands and desert habitats. It is well adapted to the harsh climate of the region. Its distribution is limited to specific areas within the southwestern part of Mexico.",
    "distribution_introduced_art_desc": "Acalypha grisea was mainly introduced to areas with disturbed soils and moist environments, often as a result of human activity. It is commonly found in urban and suburban settings where it thrives in compacted or nutrient-poor soils. The plant spreads through its prolific seed production and can establish itself quickly in new locations. It is considered an invasive species in some regions due to its competitive nature and ability to outgrow native vegetation. Its distribution is largely influenced by climate conditions and the availability of suitable habitats."
}
