{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cincta",
    "plant_slug": "acalypha-cincta",
    "plant_name_scientific": "acalypha cincta",
    "intro": "Acalypha cincta, commonly known as the silverleaf acalypha, is a species of flowering plant in the family Euphorbiaceae. It is native to tropical regions of Africa and is characterized by its striking silver-gray foliage. The plant produces small, inconspicuous greenish flowers that are clustered in dense, spike-like inflorescences. Its leaves are ovate to lanceolate in shape and often have a velvety texture. Acalypha cincta is often cultivated as an ornamental plant for its attractive foliage and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cincta"
    },
    "taxonomy_art_desc": "Acalypha cincta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and evolutionary relationships. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false holly,\" characterized by their showy flowers and often hairy leaves. Its species is Acalypha cincta, a specific plant within the genus Acalypha, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cincta is primarily native to Mexico Central, Mexico Northeast, Mexico Northwest, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, well-drained soils and is often found in forest understories or along stream banks. The species is known for its attractive foliage and is sometimes cultivated as an ornamental plant. Its native range reflects its adaptation to the diverse ecosystems of central and northern Mexico.",
    "distribution_introduced_art_desc": "Acalypha cincta was mainly introduced to ornamental horticulture and as a ground cover in landscaping due to its attractive foliage and compact growth habit. It is commonly found in tropical and subtropical regions where it thrives in moist, well-drained soils. The plant is often used in public gardens and residential landscapes for its aesthetic value and ease of maintenance. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns in regions where it has established itself beyond controlled environments."
}
