{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha leptostachya",
    "plant_slug": "acalypha-leptostachya",
    "plant_name_scientific": "acalypha leptostachya",
    "intro": "Acalypha leptostachya, commonly known as the narrow-stemmed beautyleaf, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, colorful foliage that ranges from red to orange and yellow, often with contrasting leaf veins. The plant produces small, inconspicuous greenish-white flowers arranged in spikes, which are typically clustered at the tips of the stems. It thrives in warm, humid environments and is often cultivated as an ornamental plant for its vibrant leaves. Acalypha leptostachya is also valued in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha leptostachya is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with secondary forests and disturbed habitats. It is also present in parts of the Indian subcontinent, including India and Bangladesh. Due to its adaptability, it can be found in a variety of ecological settings within its native range.",
    "distribution_introduced_art_desc": "Acalypha leptostachya was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habit. It was first recorded in the 19th century and has since spread throughout various regions of the country. The plant is commonly found in disturbed areas, such as roadsides and forest margins, where it can establish itself readily. Although not currently classified as invasive, it has the potential to spread further if not monitored. Its distribution is primarily limited by climate and human activity rather than natural barriers."
}
