{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mollis",
    "plant_slug": "acalypha-mollis",
    "plant_name_scientific": "acalypha mollis",
    "intro": "Acalypha mollis, commonly known as velvetleaf or woollyleaf, is a shrub native to tropical and subtropical regions. It is characterized by its soft, fuzzy leaves that give it a velvety texture. The plant produces small, inconspicuous flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and is often found in disturbed habitats. Acalypha mollis is valued for its ornamental appeal and is sometimes used in landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mollis is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with rainforests or secondary growth habitats. It is also present in parts of northern Australia and some Pacific islands. Acalypha mollis is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha mollis was mainly introduced to areas with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in coastal regions and disturbed soils, making it a pioneer species in many ecosystems. This plant is often used in landscaping due to its attractive foliage and ability to tolerate various soil conditions. It has been introduced to several tropical and subtropical regions outside its native range. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
