{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha arvensis var. belangeri",
    "plant_slug": "acalypha-arvensis-var-belangeri",
    "plant_name_scientific": "acalypha arvensis var. belangeri",
    "intro": "Acalypha arvensis var. belangeri, commonly known as the velvetleaf or belanger's acalypha, is a flowering plant native to tropical and subtropical regions. It is characterized by its heart-shaped leaves that are often covered in a dense, velvety pubescence. The plant produces small, clustered greenish-white flowers that are typically inconspicuous. It thrives in moist, shady environments and is often found in disturbed soils. Its rapid growth and ability to spread make it both a common weed and a potential ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha arvensis var. belangeri is primarily native to the Caribbean islands, including Cuba, Hispaniola, and Puerto Rico. This variant of Acalypha arvensis is commonly found in tropical and subtropical regions within these areas. It thrives in moist, disturbed habitats such as roadside edges, open woods, and near water sources. The plant is often seen in coastal and inland areas where the climate is warm and humid. Its native range is largely confined to the Greater Antilles and parts of the Lesser Antilles.",
    "distribution_introduced_art_desc": "Acalypha arvensis var. belangeri was mainly introduced to North America, particularly in the southeastern United States. It was initially brought in as an ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid spread is attributed to its ability to thrive in disturbed soils and its prolific seed production. Despite its ornamental appeal, it poses a significant threat to biodiversity in the regions where it has established itself."
}
