{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gemina var. exserta",
    "plant_slug": "acalypha-gemina-var-exserta",
    "plant_name_scientific": "acalypha gemina var. exserta",
    "intro": "Acalypha gemina var. exserta, commonly known as the red-veined nettle, is a flowering plant native to Southeast Asia. It is characterized by its striking, velvety leaves with prominent red veins that contrast sharply with the deep green foliage. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in humid, tropical environments and is often found in shaded or semi-shaded areas. Its ornamental value makes it a popular choice for indoor and outdoor gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gemina var. exserta is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like roadside verges and forest edges. It is also present in parts of Papua New Guinea and northern Australia. Its native distribution reflects its adaptability to warm, humid climates with ample sunlight.",
    "distribution_introduced_art_desc": "Acalypha gemina var. exserta was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for use in gardens and landscaping. The plant's ability to thrive in partial shade to full sun makes it versatile for different garden settings. Its introduction has led to its presence in several non-native regions, sometimes becoming invasive. However, it is generally considered a low-maintenance plant that adds visual interest to green spaces."
}
