{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha malabarica",
    "plant_slug": "acalypha-malabarica",
    "plant_name_scientific": "acalypha malabarica",
    "intro": "Acalypha malabarica, commonly known as Malabar spurflower, is a flowering plant native to the tropical regions of India and Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, spade-shaped leaves and showy, clustered inflorescences. The plant typically grows as an herb or shrub, reaching heights of up to 1.5 meters. Its flowers are usually yellow or orange, with prominent red bracts that attract pollinators. Acalypha malabarica is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha malabarica"
    },
    "taxonomy_art_desc": "Acalypha malabarica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Malpighiales, a large group of flowering plants that includes species with various growth forms and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha malabarica, a specific plant native to certain regions of India, known for its ornamental value and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India",
        "Laccadive Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha malabarica is primarily native to India, Laccadive Is. This plant is commonly found in the tropical and subtropical regions of the Indian subcontinent. It thrives in moist, well-drained soils and is often seen growing in coastal areas and wetlands. The species is also known to occur on the Laccadive Islands, which are part of the Indian Ocean. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acalypha malabarica was mainly introduced to the coastal regions of southern India, particularly in the states of Kerala and Tamil Nadu. It thrives in moist, well-drained soils and is commonly found in disturbed habitats such as roadsides and abandoned fields. The plant is often cultivated for its ornamental value due to its attractive foliage and showy flowers. It has also been reported in some parts of Southeast Asia, likely due to horticultural trade. However, its introduction has raised concerns about its potential to become invasive in local ecosystems."
}
