{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pubiflora",
    "plant_slug": "acalypha-pubiflora",
    "plant_name_scientific": "acalypha pubiflora",
    "intro": "Acalypha pubiflora, commonly known as the velvetleaf or silky iron plant, is a shrub native to tropical regions of the Americas. It is characterized by its hairy, ovate leaves that are often tinged with red or purple, giving it a distinctive appearance. The plant produces small, clustered greenish-white flowers that are not particularly showy but are followed by spherical, woody fruits. It thrives in moist, shaded environments and is often found in forests or along streambanks. Due to its ornamental value and adaptability, it is sometimes cultivated in gardens in warm climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pubiflora"
    },
    "taxonomy_art_desc": "Acalypha pubiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and often possessing rhizomes. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with unique floral structures and often produces latex. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and hairy leaves. Its species is Acalypha pubiflora, a specific type of plant within the genus Acalypha, known for its distinctive pubescent leaves and clusters of small flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Madagascar",
        "Malawi",
        "Mozambique",
        "Northern Provinces",
        "Northern Territory",
        "Queensland",
        "Western Australia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pubiflora is primarily native to Botswana, Madagascar, Malawi, Mozambique, Northern Provinces, Northern Territory, Queensland, Western Australia, and Zimbabwe. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in a variety of habitats, including grasslands, woodlands, and coastal areas. The species is well adapted to the climatic conditions of its native range. Its distribution spans across multiple countries in Africa and Australia.",
    "distribution_introduced_art_desc": "Acalypha pubiflora was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage. It thrives in full sun to partial shade and is commonly found in tropical and subtropical regions. The plant is known for its vibrant red bracts that resemble flowers, making it popular in landscaping. However, it can become invasive in some regions if not managed properly. Its distribution has been expanding due to its adaptability and aesthetic appeal."
}
