{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha elliptica",
    "plant_slug": "acalypha-elliptica",
    "plant_name_scientific": "acalypha elliptica",
    "intro": "Acalypha elliptica, commonly known as the velvetleaf or red-rooted ironplant, is a tropical shrub native to Southeast Asia. It is characterized by its smooth, waxy leaves that are often a striking red or purple on the underside. The plant produces small, inconspicuous greenish-white flowers that are clustered in dense inflorescences. Its roots are thick and fleshy, which helps it store water in arid conditions. Acalypha elliptica is often used in ornamental gardening for its attractive foliage and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha elliptica"
    },
    "taxonomy_art_desc": "Acalypha elliptica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by diverse floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and subtropical species with varied morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants, many of which have milky sap and are often used in traditional medicine. Its genus is Acalypha, a group of flowering plants commonly known as the \"velvetleaf\" or \"cupseed\" plants, which are often found in tropical and subtropical regions. Its species is Acalypha elliptica, a specific plant within the Acalypha genus known for its elliptical leaves and is commonly found in various habitats in its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Jamaica"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha elliptica is primarily native to Jamaica. It is commonly found in the island's tropical and subtropical regions. This plant thrives in moist, well-drained soils and is often seen in shaded or semi-shaded areas. It is an important component of the local flora and is sometimes used in traditional medicine. Its distribution is largely restricted to Jamaica, where it plays a role in the ecological balance of its habitat.",
    "distribution_introduced_art_desc": "Acalypha elliptica was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage. It is commonly found in gardens and landscapes in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in moist, well-drained soils and partial to full sun exposure. Its rapid growth and ability to spread through both seeds and rhizomes have led to its establishment in some natural areas. However, it is considered a potential weed in certain regions where it can outcompete native vegetation."
}
