{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrostachya",
    "plant_slug": "acalypha-macrostachya",
    "plant_name_scientific": "acalypha macrostachya",
    "intro": "Acalypha macrostachya, commonly known as the velvetleaf or redroot, is a flowering plant native to tropical regions of the Americas. It is characterized by its large, heart-shaped leaves that are often covered in fine, soft hairs, giving it a velvety texture. The plant produces clusters of small, greenish-white flowers that are borne on long, branching inflorescences. It is a member of the Euphorbiaceae family, which includes many species with milky sap. Acalypha macrostachya is often found in disturbed habitats such as roadsides and agricultural fields due to its adaptability and rapid growth.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha macrostachya"
    },
    "taxonomy_art_desc": "Acalypha macrostachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations such as specialized leaves and flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupid's wand,\" characterized by their showy inflorescences. Its species is Acalypha macrostachya, a specific plant within the genus Acalypha known for its distinctive floral structures and is native to certain regions in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Bolivia",
        "Brazil North",
        "Brazil Southeast",
        "Brazil West-Central",
        "Colombia",
        "Costa Rica",
        "Ecuador",
        "El Salvador",
        "Guatemala",
        "Guyana",
        "Honduras",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest",
        "Panamá",
        "Peru",
        "Suriname",
        "Venezuela",
        "Venezuelan Antilles",
        "Windward Is."
    ],
    "distribution_introduced": [
        "Trinidad-Tobago"
    ],
    "distribution_native_art_desc": "Acalypha macrostachya is primarily native to Belize, Bolivia, Brazil North, Brazil Southeast, Brazil West-Central, Colombia, Costa Rica, Ecuador, El Salvador, Guatemala, Guyana, Honduras, Mexico Gulf, Mexico Northeast, Mexico Southeast, Mexico Southwest, Panamá, Peru, Suriname, Venezuela, Venezuelan Antilles, and Windward Is. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in a variety of habitats, including forests, savannas, and wetlands. The species is known for its adaptability to different environmental conditions. Its native range spans a significant portion of Central and South America, as well as parts of the Caribbean.",
    "distribution_introduced_art_desc": "Acalypha macrostachya was mainly introduced to Trinidad and Tobago. It is a flowering plant native to Southeast Asia and belongs to the Euphorbiaceae family. The introduction of this species to Trinidad and Tobago is likely due to ornamental horticulture or accidental spread through human activity. It has adapted well to the local climate and has become naturalized in certain areas. However, its ecological impact remains under study."
}
