{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sessilifolia",
    "plant_slug": "acalypha-sessilifolia",
    "plant_name_scientific": "acalypha sessilifolia",
    "intro": "Acalypha sessilifolia, commonly known as the sessile-leaf spurge, is a flowering plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family, which is characterized by its unique floral structures and milky sap. The plant features small, inconspicuous flowers that are often clustered in dense inflorescences. Its leaves are typically sessile, meaning they lack a petiole, and are arranged oppositely along the stem. Acalypha sessilifolia is often cultivated for its ornamental value due to its vibrant foliage and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha sessilifolia"
    },
    "taxonomy_art_desc": "Acalypha sessilifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphologies. Its order is Malpighiales, a large group of flowering plants that includes species with various growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of morphological features and some toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha sessilifolia, a specific type within the genus Acalypha that is distinguished by its sessile leaves and is native to certain regions in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sessilifolia is primarily native to Mexico Southwest. It is commonly found in the arid and semi-arid regions of this area. This plant thrives in rocky soils and open habitats. It is often seen in desert scrub and limestone hills. Its distribution is limited to specific ecological zones within the southwestern part of Mexico.",
    "distribution_introduced_art_desc": "Acalypha sessilifolia was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. The plant has since become naturalized in certain regions, particularly in coastal and disturbed areas. It is considered a potential weed in some parts of the country. Its distribution is limited but expanding, mainly in the North Island."
}
