{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica f. purpurea",
    "plant_slug": "acalypha-virginica-f-purpurea",
    "plant_name_scientific": "acalypha virginica f. purpurea",
    "intro": "Acalypha virginica f. purpurea, commonly known as purple-leaf ironweed, is a strikingly colorful shrub native to the southeastern United States. It is characterized by its vibrant purple foliage, which contrasts beautifully with its green stems and yellow flowers. The plant features palmate leaves that are often tinged with red or purple hues, especially during the growing season. Its inflorescences consist of clusters of small, yellow to orange flowers that bloom in late summer. This ornamental plant is well-suited for garden use due to its eye-catching appearance and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica f. purpurea is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and North Carolina. This flowering plant thrives in wetland environments, particularly in marshes, swamps, and along the edges of ponds and streams. It is commonly found in coastal areas and can tolerate brackish water conditions. The plant is often associated with disturbed sites and is known for its striking purple-bracted inflorescences. Its native range extends into parts of the Caribbean, including the Bahamas and the Florida Keys.",
    "distribution_introduced_art_desc": "Acalypha virginica f. purpurea was mainly introduced to the eastern United States as an ornamental plant due to its attractive foliage and vibrant purple stems. It is commonly found in gardens and landscaped areas, particularly in regions with mild climates. This plant thrives in moist, well-drained soils and is often used in mixed borders or as a ground cover. Its introduction has led to its naturalization in some areas, where it can become invasive in certain ecosystems. Despite its ornamental value, it requires careful management to prevent it from spreading beyond cultivated areas."
}
