{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha micrantha",
    "plant_slug": "acalypha-micrantha",
    "plant_name_scientific": "acalypha micrantha",
    "intro": "Acalypha micrantha, commonly known as the small-flowered glory flower, is a flowering plant native to tropical and subtropical regions of Africa and Asia. It is a shrub or small tree that typically grows to a height of 1 to 3 meters. The plant is characterized by its palmate leaves, which are often brightly colored and have a velvety texture. Its small, clustered flowers are usually yellow or red, and they bloom in summer. Acalypha micrantha is often cultivated for its ornamental value and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha micrantha is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with rainforests or secondary growth habitats. It is also present in parts of New Guinea and the Indian subcontinent. Acalypha micrantha is typically found in open or semi-open areas, such as forest edges, clearings, and along riverbanks.",
    "distribution_introduced_art_desc": "Acalypha micrantha was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in countries such as Australia, Hawaii, and parts of Southeast Asia. The plant thrives in warm, humid climates and is often cultivated in gardens and landscapes. Its rapid growth and ability to spread through seeds and vegetative propagation contribute to its invasive potential in some areas. However, it is also valued for its ecological benefits, including providing habitat for small insects and birds."
}
