{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ovalifolia",
    "plant_slug": "acalypha-ovalifolia",
    "plant_name_scientific": "acalypha ovalifolia",
    "intro": "Acalypha ovalifolia, commonly known as the oval-leaf spurflower, is a tropical shrub native to Southeast Asia. It is characterized by its opposite, ovate leaves that are often pubescent and have a distinctive reddish or purple hue. The plant produces clusters of small, greenish-white flowers that are followed by spiny, three-lobed蒴果 (capsules). It thrives in moist, shaded environments and is often found in forest understories. Due to its ornamental value, it is cultivated in some horticultural settings for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ovalifolia is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in open forests, secondary growth, and disturbed sites where it can receive ample sunlight. It is often seen growing along forest edges and in shrublands. Due to its adaptability, it has also been introduced to other parts of the world, including the Caribbean and parts of Africa.",
    "distribution_introduced_art_desc": "Acalypha ovalifolia was mainly introduced to areas with disturbed soils and wetlands, often as an ornamental plant due to its attractive foliage. It is commonly found in tropical and subtropical regions, including parts of the United States, Australia, and Southeast Asia. The plant thrives in moist environments and can quickly establish itself in riparian zones and along waterways. Its spread is facilitated by its ability to produce numerous seeds that are dispersed by water and wind. However, it is considered a potential invasive species in some regions, outcompeting native vegetation."
}
