{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha peduncularis var. glandulifolia",
    "plant_slug": "acalypha-peduncularis-var-glandulifolia",
    "plant_name_scientific": "acalypha peduncularis var. glandulifolia",
    "intro": "Acalypha peduncularis var. glandulifolia, commonly known as the glandular acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, palmate leaves with a reddish or purple underside, which are often covered in fine, glandular hairs. The plant produces small, clustered greenish-white flowers that are typically borne on short pedicels. It thrives in moist, shady environments and is often found in forest understories. Due to its ornamental value, it is cultivated in some horticultural settings for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha peduncularis var. glandulifolia is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, warm climates and is commonly found in lowland areas with rich soil. This variant is often associated with coastal and mangrove ecosystems, where it plays a role in stabilizing soil and providing habitat for local wildlife. It is also present in parts of India and Sri Lanka, where it grows in moist, shaded environments. Due to its adaptability, it has been introduced to other tropical regions as an ornamental plant.",
    "distribution_introduced_art_desc": "Acalypha peduncularis var. glandulifolia was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage. It is commonly found in areas with warm climates, such as parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in well-drained soil and full sun, making it suitable for gardens and landscaped areas. However, it has been reported to become invasive in some regions, outcompeting native vegetation. Its rapid growth and adaptability have led to its cultivation in various horticultural settings worldwide."
}
