{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tenuifolia",
    "plant_slug": "acalypha-tenuifolia",
    "plant_name_scientific": "acalypha tenuifolia",
    "intro": "Acalypha tenuifolia, commonly known as velvetleaf, is a herbaceous plant native to tropical and subtropical regions. It features heart-shaped, velvety leaves that are often covered in fine, soft hairs. The plant produces small, clustered flowers that are typically green or reddish in color. It thrives in moist, shady environments and is often found in wetlands or along stream banks. Due to its rapid growth, it can become invasive in certain areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha tenuifolia"
    },
    "taxonomy_art_desc": "Acalypha tenuifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malpighiales, a large order of flowering plants that includes many species with diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often used in horticulture. Its species is Acalypha tenuifolia, a specific type of plant within the genus Acalypha, known for its slender leaves and is native to tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tenuifolia is primarily native to Venezuela. It is commonly found in the tropical regions of the country, particularly in the northern and central areas. This plant thrives in moist, shaded environments such as forests and undergrowth. It is often seen growing along riverbanks and in humid lowland areas. Its distribution is largely restricted to the specific ecological conditions found in Venezuela.",
    "distribution_introduced_art_desc": "Acalypha tenuifolia was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly found in tropical and subtropical regions where it is cultivated for its aesthetic value. The plant thrives in well-drained soils and full sun to partial shade, making it suitable for a range of garden environments. Its rapid growth and ability to spread through seeds and rhizomes have led to its establishment in some natural areas. However, it is not considered invasive in most regions where it is grown."
}
