{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha benguelensis",
    "plant_slug": "acalypha-benguelensis",
    "plant_name_scientific": "acalypha benguelensis",
    "intro": "Acalypha benguelensis, commonly known as the Benguela copperleaf, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its striking copper-colored leaves. The plant typically grows as an upright shrub with branched stems and opposite leaf arrangement. Its small, inconspicuous flowers are clustered in cyathia, a feature typical of the Euphorbiaceae family. Acalypha benguelensis is often cultivated for its ornamental value due to its vibrant foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha benguelensis"
    },
    "taxonomy_art_desc": "Acalypha benguelensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species, often with distinctive leaf and flower morphology. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf,\" characterized by their showy flowers and often hairy leaves. Its species is Acalypha benguelensis, a specific plant within the genus Acalypha, native to certain regions of Africa and known for its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha benguelensis is primarily native to Angola. It is found in the central and northern regions of the country. This plant typically grows in moist, tropical environments. It is commonly seen in forested areas and along riverbanks. Its distribution is limited to specific ecological zones within Angola.",
    "distribution_introduced_art_desc": "Acalypha benguelensis was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage. It is commonly found in areas with warm climates and well-drained soils. The plant has been reported in parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. Its introduction has sometimes led to it becoming invasive in local ecosystems. Proper management is necessary to prevent its spread and minimize ecological impacts."
}
