{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha yucatanensis",
    "plant_slug": "acalypha-yucatanensis",
    "plant_name_scientific": "acalypha yucatanensis",
    "intro": "Acalypha yucatanensis, commonly known as the Yucatan beautyberry, is a flowering plant native to the Yucatan Peninsula in Mexico. It is a shrub that typically grows up to 2 meters tall, featuring opposite, ovate leaves with a glossy green surface. The plant produces small, clustered inflorescences that are usually pink to red in color, attracting pollinators such as bees and butterflies. Its fruit is a small, round berry that turns from green to dark purple as it matures. The species is valued for its ornamental qualities and is often cultivated in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha yucatanensis is primarily native to the Yucatán Peninsula, parts of the Mexican states of Quintana Roo and Campeche, and northern Belize. It thrives in tropical and subtropical regions with well-drained soils and a warm, humid climate. This plant is commonly found in coastal areas, mangrove swamps, and disturbed sites such as roadsides and abandoned fields. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its adaptability, it is also sometimes cultivated as an ornamental plant in gardens.",
    "distribution_introduced_art_desc": "Acalypha yucatanensis was mainly introduced to the southern United States, particularly in Florida and Texas, as an ornamental plant due to its attractive foliage and unique appearance. It has been cultivated in gardens and landscapes for its vibrant leaves and ability to thrive in warm, humid climates. Despite its ornamental value, it has shown potential to become invasive in certain regions, outcompeting native vegetation. The plant prefers well-drained soil and full sun, making it adaptable to a variety of garden settings. However, its spread has raised concerns among conservationists due to its rapid growth and ability to establish itself in natural areas."
}
