{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha diminuta",
    "plant_slug": "acalypha-diminuta",
    "plant_name_scientific": "acalypha diminuta",
    "intro": "Acalypha diminuta, commonly known as the dwarf croton, is a small, herbaceous plant native to tropical and subtropical regions. It is characterized by its compact growth habit and striking, colorful foliage that often displays shades of red, orange, and yellow. The leaves are typically ovate or heart-shaped and have a velvety texture. It produces small, inconspicuous green flowers that are followed by three-lobed seed capsules. This plant is often cultivated as an ornamental due to its vibrant leaves and ability to thrive in partial shade to full sun.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha diminuta"
    },
    "taxonomy_art_desc": "Acalypha diminuta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and includes species with jointed stems and whorled leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Malpighiales, a diverse order of flowering plants that includes many species with distinctive floral and leaf morphology. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their often hairy foliage and showy inflorescences. Its species is Acalypha diminuta, a specific plant within the genus Acalypha that is known for its small size and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha diminuta is primarily native to Madagascar. It is found in the diverse ecosystems of this island nation, which is known for its unique and endemic plant species. The plant typically grows in moist, shaded areas within forests or along stream banks. It is adapted to the specific climate and soil conditions of Madagascar. Due to its restricted range, it is considered a rare and vulnerable species in its native habitat.",
    "distribution_introduced_art_desc": "Acalypha diminuta was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activities, such as accidental transport on vehicles or cargo. The plant thrives in disturbed areas and can outcompete native vegetation. Its rapid growth and ability to spread through seeds make it a significant threat to local ecosystems. Conservation efforts are ongoing to control its spread and protect native plant communities."
}
