{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rotundifolia",
    "plant_slug": "acalypha-rotundifolia",
    "plant_name_scientific": "acalypha rotundifolia",
    "intro": "Acalypha rotundifolia, commonly known as round-leaf beggarlice, is a flowering plant native to tropical and subtropical regions. It is characterized by its rounded, lobed leaves and vibrant, showy bracts that resemble flowers. The plant typically grows as an annual herb, often reaching heights of up to 1 meter. It thrives in moist, well-drained soils and is often found in disturbed areas such as roadsides and fields. The species is known for its rapid growth and ability to spread through seeds dispersed by wind and animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rotundifolia is primarily native to tropical and subtropical regions of Asia, including countries such as India, Sri Lanka, and parts of Southeast Asia. It is also found in the Pacific Islands, including Hawaii and the Philippines. This plant thrives in moist, shady environments and is commonly found in forest understories. It is often associated with disturbed habitats and can be invasive in some areas outside its native range. Its distribution is closely linked to humid climates with high rainfall.",
    "distribution_introduced_art_desc": "Acalypha rotundifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since become naturalized in several regions, often thriving in disturbed habitats such as roadsides and riverbanks. The plant spreads primarily through its seeds, which are dispersed by wind, water, and animals. Its rapid growth and ability to form dense stands have led to concerns about its potential to outcompete native vegetation. Despite its invasive tendencies, it remains popular in horticulture for its aesthetic value."
}
