{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tracheliifolia",
    "plant_slug": "acalypha-tracheliifolia",
    "plant_name_scientific": "acalypha tracheliifolia",
    "intro": "Acalypha tracheliifolia, commonly known as the red-hot poker or fireplant, is a shrub native to tropical regions of Africa and Southeast Asia. It is characterized by its striking red bracts that surround small, inconspicuous flowers, giving it a fiery appearance. The plant has palmate leaves that are often hairy and can vary in size depending on the environment. It thrives in well-drained soil and requires full sun to partial shade for optimal growth. Acalypha tracheliifolia is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tracheliifolia is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in moist, well-drained soils and is often seen in forest understories or along stream banks. It is also native to parts of India and Indonesia, where it grows in similar environmental conditions. Due to its adaptability, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha tracheliifolia was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant has been introduced to several countries outside its native range, including parts of the United States, Australia, and Southeast Asia. Its rapid growth and ability to thrive in disturbed soils have led to its establishment in some natural areas. However, it is generally not considered invasive in most regions where it is cultivated."
}
