{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha vulneraria",
    "plant_slug": "acalypha-vulneraria",
    "plant_name_scientific": "acalypha vulneraria",
    "intro": "Acalypha vulneraria, commonly known as the woundwort or velvetleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its distinctive, often hairy leaves and showy, yellowish-green bracts that resemble flowers. The plant belongs to the Euphorbiaceae family, which includes many species with milky sap. Its leaves are typically alternate and have a velvety texture, while its stems are often reddish or purple in color. Acalypha vulneraria is often found in disturbed soils and can thrive in a variety of environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha vulneraria"
    },
    "taxonomy_art_desc": "Acalypha vulneraria belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often having whorled leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphologies and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper spurge,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha vulneraria, a specific type within the genus known for its medicinal properties and distinctive leaf and flower structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha vulneraria is primarily native to Madagascar. It is found throughout various regions of the island, including both coastal and inland areas. This plant thrives in tropical and subtropical climates, often growing in shaded or semi-shaded environments. It is commonly found in forests, shrublands, and along riverbanks. Due to its unique appearance and ecological significance, it plays an important role in the biodiversity of Madagascar.",
    "distribution_introduced_art_desc": "Acalypha vulneraria was mainly introduced to New Zealand. It was first recorded in the 19th century and has since spread across various regions of the country. The plant is commonly found in coastal areas, disturbed soils, and along roadsides. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Efforts are being made to control its spread to protect local ecosystems."
}
