{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha domingensis",
    "plant_slug": "acalypha-domingensis",
    "plant_name_scientific": "acalypha domingensis",
    "intro": "Acalypha domingensis, commonly known as the Mexican flame flower, is a tropical shrub native to Central America and the Caribbean. It is characterized by its striking, showy red bracts that resemble flowers, which are actually modified leaves. The plant produces small, inconspicuous yellow flowers that are clustered in dense inflorescences. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Acalypha domingensis is often cultivated as an ornamental plant due to its vibrant foliage and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha domingensis is primarily native to Central America, the Caribbean, and northern South America. It is found in countries such as Mexico, Guatemala, Belize, Honduras, and parts of Colombia and Ecuador. This plant typically grows in tropical and subtropical regions, often in moist, shaded environments like forests or along stream banks. It is commonly found in lowland areas but can also occur at higher elevations. The species is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha domingensis was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in gardens and landscaped areas where it is valued for its vibrant leaf colors. The plant has been reported in several countries, including parts of the United States, Australia, and Southeast Asia. Its rapid growth and ability to thrive in disturbed soils have contributed to its spread in some areas. However, it is not considered invasive in most regions where it is cultivated."
}
