{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reptans var. pygmaea",
    "plant_slug": "acalypha-reptans-var-pygmaea",
    "plant_name_scientific": "acalypha reptans var. pygmaea",
    "intro": "Acalypha reptans var. pygmaea, commonly known as the dwarf creeping spurflower, is a compact, low-growing shrub native to tropical regions of Southeast Asia. It features small, ovate leaves with a distinctive reddish or bronze hue on the underside, which becomes more pronounced in cooler temperatures. The plant produces tiny, greenish-white flowers that are clustered in spikes, often mistaken for leaves due to their appearance. It thrives in moist, shaded environments and is often used in horticulture for its ornamental foliage. Due to its slow growth and dense habit, it is well-suited for ground cover in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reptans var. pygmaea is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. This plant is commonly found in lowland and coastal areas, often growing in moist, shaded environments. It thrives in tropical and subtropical climates, typically in forest understories or near water bodies. The variety is known for its small, delicate leaves and is often used in horticulture for its ornamental value. It plays a role in local ecosystems by providing habitat and food for various insects and small animals.",
    "distribution_introduced_art_desc": "Acalypha reptans var. pygmaea was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and compact growth habit. It was first recorded in the late 19th century and has since become naturalized in various regions of the country. The plant thrives in moist, shady environments and is commonly found in forest margins and along stream banks. Its spread has raised concerns due to its potential to outcompete native vegetation. Despite its aesthetic appeal, it is classified as a potential environmental weed in some areas."
}
