{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha deltoidea",
    "plant_slug": "acalypha-deltoidea",
    "plant_name_scientific": "acalypha deltoidea",
    "intro": "Acalypha deltoidea, commonly known as the deltoid ironleaf, is a shrub native to tropical regions of Africa and Asia. It is characterized by its deltoid-shaped leaves, which are typically green with a distinctive reddish or purplish underside. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences. It thrives in moist, well-drained soils and is often found in forest understories or along streambanks. Acalypha deltoidea is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha deltoidea"
    },
    "taxonomy_art_desc": "Acalypha deltoidea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations such as stipules and specialized leaf structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of growth forms and some toxic compounds. Its genus is Acalypha, which consists of flowering plants commonly known as \"velvetleaf\" or \"spurge,\" often characterized by their distinctive leaves and colorful flowers. Its species is Acalypha deltoidea, a specific type of plant within the genus Acalypha, known for its deltoid-shaped leaves and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "DR Congo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha deltoidea is primarily native to DR Congo. It is commonly found in the tropical rainforests of the country. This plant thrives in humid and shaded environments. It is often seen growing along riverbanks and in dense undergrowth. Its native distribution is largely restricted to the central and western regions of DR Congo.",
    "distribution_introduced_art_desc": "Acalypha deltoidea was mainly introduced to ornamental horticulture due to its attractive foliage and unique leaf shapes. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been reported in several countries, including the United States, Australia, and parts of Southeast Asia. Its introduction has sometimes led to concerns about its potential to become invasive in certain environments. Proper management is recommended to prevent unintended spread."
}
