{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha benguelensis var. adenogyne",
    "plant_slug": "acalypha-benguelensis-var-adenogyne",
    "plant_name_scientific": "acalypha benguelensis var. adenogyne",
    "intro": "Acalypha benguelensis var. adenogyne, commonly known as the velvetleaf or red-rooted ironweed, is a shrub native to parts of Africa. It is characterized by its striking, colorful bracts that range from red to purple, which are often mistaken for flowers. The plant has palmate leaves with five to seven lobes, and its stems are often covered in a soft, velvety texture. It thrives in moist, well-drained soils and is often found in woodland or streamside habitats. The plant is also noted for its medicinal properties in traditional African medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha benguelensis var. adenogyne is primarily native to Central and Southern Africa, including countries such as Angola, Namibia, and South Africa. It is commonly found in arid and semi-arid regions, growing in rocky soils and along riverbanks. This plant is adapted to dry climates and can thrive in areas with low rainfall. It is often seen in open woodlands and savannas, where it contributes to local biodiversity. Its native distribution reflects its ability to survive in harsh environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha benguelensis var. adenogyne was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along streambanks. This plant is often considered an invasive species in some regions due to its rapid growth and ability to spread vegetatively. It has been reported in several countries in Africa, including Angola and the Democratic Republic of the Congo. Its introduction may have ecological impacts on native plant communities and soil stability."
}
