{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha glabrata f. pilosior",
    "plant_slug": "acalypha-glabrata-f-pilosior",
    "plant_name_scientific": "acalypha glabrata f. pilosior",
    "intro": "Acalypha glabrata f. pilosior, commonly known as the silky hibiscus, is a variant of the acalypha plant characterized by its soft, hairy foliage. It belongs to the Euphorbiaceae family and is native to tropical regions of Africa. The plant features palmate leaves with a velvety texture, giving it a distinctive appearance. It produces small, inconspicuous flowers that are often surrounded by bracts. This ornamental plant is valued for its aesthetic appeal and is often cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha glabrata"
    },
    "taxonomy_art_desc": "Acalypha glabrata f. pilosior belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants that includes many tropical species and is known for its diverse floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha glabrata, a specific type within the genus Acalypha, distinguished by its smooth (glabrous) leaves and is a variant form known as f. pilosior, which has a slightly hairy appearance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Cape Provinces",
        "KwaZulu-Natal",
        "Mozambique",
        "Northern Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha glabrata f. pilosior is primarily native to Botswana, Cape Provinces, KwaZulu-Natal, Mozambique, and Northern Provinces. This plant is commonly found in these regions, thriving in tropical and subtropical climates. It typically grows in open woodland, grasslands, and along riverbanks. The species is well adapted to the local environmental conditions of these areas. Its native distribution reflects its natural habitat preferences across southern Africa.",
    "distribution_introduced_art_desc": "Acalypha glabrata f. pilosior was mainly introduced to areas with warm, humid climates and well-drained soils. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along stream banks. This plant thrives in full sun to partial shade and is often used in ornamental gardening due to its attractive foliage. It has been reported in several regions of the southeastern United States and parts of Australia. Its rapid growth and ability to spread through both seeds and rhizomes make it a potential invasive species in some areas."
}
