{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha paniculata var. depauperata",
    "plant_slug": "acalypha-paniculata-var-depauperata",
    "plant_name_scientific": "acalypha paniculata var. depauperata",
    "intro": "Acalypha paniculata var. depauperata, commonly known as the poorleaf ironweed, is a shrub native to Southeast Asia. It is characterized by its slender, often sparsely foliated stems and small, ovate leaves with a rough, hairy texture. The plant produces panicle-like inflorescences that bear tiny, greenish-white flowers. It thrives in moist, shaded environments and is often found in forest understories. Due to its unique morphology and limited distribution, it is of interest to botanists and horticulturists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha paniculata var. depauperata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. This variant is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It thrives in lowland areas and is frequently associated with disturbed habitats like roadsides and forest edges. The plant is also present in parts of India and Indonesia, where it adapts well to varying soil conditions. Its native distribution highlights its ecological significance in these regions' flora.",
    "distribution_introduced_art_desc": "Acalypha paniculata var. depauperata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain regions, particularly in the North Island. It thrives in moist, shady environments and is commonly found in forest margins and along stream banks. However, its spread has raised concerns due to its potential to outcompete native vegetation."
}
