{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha villicaulis var. minor",
    "plant_slug": "acalypha-villicaulis-var-minor",
    "plant_name_scientific": "acalypha villicaulis var. minor",
    "intro": "Acalypha villicaulis var. minor, commonly known as the silky hibiscus or velvetleaf, is a tropical shrub native to Southeast Asia. It features opposite, ovate leaves with a soft, velvety texture on the upper surface. The plant produces small, inconspicuous greenish-white flowers that are clustered in terminal inflorescences. Its rapid growth and ability to thrive in moist, shady conditions make it a common ornamental and invasive species in some regions. The plant's botanical characteristics include fibrous roots and a woody stem with a rough, bark-like surface.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha villicaulis var. minor is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks or in dense undergrowth. It is a member of the Euphorbiaceae family and is known for its attractive, often hairy foliage. Due to its ornamental value, it is sometimes cultivated in gardens in regions with a suitable climate.",
    "distribution_introduced_art_desc": "Acalypha villicaulis var. minor was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native species and altering local ecosystems. The plant thrives in moist, shaded environments and spreads rapidly through vegetative means. Its introduction highlights the ecological risks associated with non-native ornamental plants."
}
