{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha nematorhachis",
    "plant_slug": "acalypha-nematorhachis",
    "plant_name_scientific": "acalypha nematorhachis",
    "intro": "Acalypha nematorhachis, commonly known as the narrow-ribbed spurge, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family, which is known for its diverse and often ornamental species. The plant features slender, ribbed stems and small, clustered leaves that are typically green with a slight waxy coating. Its flowers are unisexual, with male and female flowers occurring on separate plants, a characteristic known as dioecy. Acalypha nematorhachis is often cultivated for its ornamental value and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha nematorhachis is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with forest understories or disturbed sites. It is also present in parts of the Philippines and Papua New Guinea. Its distribution is largely confined to the Indo-Malayan region.",
    "distribution_introduced_art_desc": "Acalypha nematorhachis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It was first recorded in the 1950s and has since spread throughout the country, particularly in regions with a temperate climate. The plant is considered a potential weed because of its rapid growth and ability to colonize disturbed areas. It is commonly found in gardens, along roadsides, and in forest margins. Despite its ornamental value, its invasive potential has raised concerns among land managers and conservationists."
}
