{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pruinosa",
    "plant_slug": "acalypha-pruinosa",
    "plant_name_scientific": "acalypha pruinosa",
    "intro": "Acalypha pruinosa, commonly known as the velvetleaf or silverleaf plant, is a tropical shrub native to Southeast Asia. It is characterized by its velvety, silver-green leaves that are covered in a fine, waxy coating. The plant produces small, pale green or yellow flowers that are clustered in spikes, typically appearing in the summer months. Its leaves are often used in traditional medicine for their purported anti-inflammatory properties. Acalypha pruinosa thrives in moist, shaded environments and is sometimes cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pruinosa"
    },
    "taxonomy_art_desc": "Acalypha pruinosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their distinctive morphology and ancient lineage. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Malpighiales, a large and varied group of flowering plants that includes many species with unique adaptations, such as the presence of stipules and specialized leaf structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide range of plants with diverse growth forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha pruinosa, a specific plant within the genus Acalypha that is known for its hairy leaves and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Jamaica"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pruinosa is primarily native to Jamaica. It is commonly found in the island's moist lowland areas and coastal regions. This plant thrives in tropical and subtropical climates, often growing in shaded or semi-shaded environments. It is known for its attractive foliage and is sometimes cultivated for ornamental purposes. Its native range is limited largely to the Caribbean, with Jamaica being its primary habitat.",
    "distribution_introduced_art_desc": "Acalypha pruinosa was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in gardens and landscapes for its aesthetic value. The plant is particularly popular in tropical and subtropical regions where it thrives in warm, humid climates. It is often used as a decorative plant in both indoor and outdoor settings. However, it has also been reported as an invasive species in some areas, raising concerns about its ecological impact."
}
