{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha philippinensis",
    "plant_slug": "acalypha-philippinensis",
    "plant_name_scientific": "acalypha philippinensis",
    "intro": "Acalypha philippinensis, commonly known as the Philippine copperleaf, is a shrub native to the Philippines. It belongs to the Euphorbiaceae family and is characterized by its striking copper-colored leaves. The plant typically grows in tropical and subtropical regions, often in moist, shaded environments. Its leaves are usually opposite and have a velvety texture, while its flowers are small and inconspicuous. Acalypha philippinensis is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha philippinensis is primarily native to the Philippines. It is found in various regions across the archipelago, including Luzon, Mindanao, and Samar. This plant thrives in humid, tropical environments and is commonly found in lowland forests and secondary growth areas. It is also present in parts of Borneo and Sumatra, extending its native range into neighboring Southeast Asian countries. The species is well adapted to the warm and moist climate of these regions.",
    "distribution_introduced_art_desc": "Acalypha philippinensis was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and public spaces. The plant has been reported in several countries outside its native range, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. Its rapid growth and ability to thrive in disturbed soils have contributed to its spread in some areas. However, it is generally not considered invasive and is often used as a decorative plant rather than an ecological threat."
}
