{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha acapulcensis",
    "plant_slug": "acalypha-acapulcensis",
    "plant_name_scientific": "acalypha acapulcensis",
    "intro": "Acalypha acapulcensis, commonly known as the Mexican copperleaf, is a flowering plant native to Mexico. It belongs to the Euphorbiaceae family and is characterized by its striking copper-colored leaves. The plant produces small, inconspicuous yellow flowers surrounded by bracts that give it a vibrant appearance. It thrives in warm, humid climates and is often found in tropical and subtropical regions. Due to its ornamental value, it is cultivated as a decorative plant in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha acapulcensis"
    },
    "taxonomy_art_desc": "Acalypha acapulcensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha acapulcensis, a specific plant within the Acalypha genus found in certain regions, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha acapulcensis is primarily native to Mexico Southwest. It is found in the mountainous regions of this area, particularly in the states of Oaxaca and Puebla. This plant thrives in humid, shaded environments within the cloud forests. It is commonly found at elevations ranging from 1,500 to 2,500 meters above sea level. Its native distribution is limited to these specific regions in southern Mexico.",
    "distribution_introduced_art_desc": "Acalypha acapulcensis was mainly introduced to tropical and subtropical regions where it thrives in moist, shaded environments. It is commonly found in areas with high humidity and well-drained soil, making it suitable for cultivation in gardens and as an ornamental plant. This species has been introduced to parts of Southeast Asia, the Pacific Islands, and the Caribbean due to its aesthetic appeal and adaptability. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems. Despite its beauty, careful management is necessary to prevent it from outcompeting native plant species."
}
