{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha carthagenensis",
    "plant_slug": "acalypha-carthagenensis",
    "plant_name_scientific": "acalypha carthagenensis",
    "intro": "Acalypha carthagenensis, commonly known as the Carthage spurge, is a flowering plant native to the Caribbean and parts of Central America. It is characterized by its striking, palmate leaves that are often brightly colored, ranging from green to reddish hues. The plant produces small, yellow flowers arranged in clusters, which are followed by distinctive, inflated seed pods. It thrives in moist, tropical environments and is often found in wetlands or near water bodies. Due to its ornamental value, it is sometimes cultivated in gardens, though it can become invasive in certain regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha carthagenensis"
    },
    "taxonomy_art_desc": "Acalypha carthagenensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large order of flowering plants that includes species with diverse morphologies and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive flowers and often toxic sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupids,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha carthagenensis, a specific type within the genus Acalypha, native to certain regions and distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha carthagenensis is primarily native to Colombia. It is found in the tropical regions of the country, particularly in the Andean foothills and coastal areas. This plant thrives in humid, warm climates with well-drained soil. It is commonly found in secondary forests and disturbed habitats. Its distribution is limited to specific ecological zones within Colombia.",
    "distribution_introduced_art_desc": "Acalypha carthagenensis was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various environmental conditions. It is commonly used in tropical and subtropical regions for its vibrant leaf colors and ease of cultivation. The plant has been reported in several countries, including parts of the United States, Australia, and Southeast Asia. Its introduction has sometimes led to concerns about its potential invasiveness in certain ecosystems. Despite its ornamental value, careful management is recommended to prevent unintended spread."
}
