{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha polymorpha",
    "plant_slug": "acalypha-polymorpha",
    "plant_name_scientific": "acalypha polymorpha",
    "intro": "Acalypha polymorpha, commonly known as the Chinese lantern plant, is a flowering plant native to Southeast Asia. It is characterized by its distinctive, papery bracts that resemble small lanterns, which are often brightly colored in red, orange, or yellow. The plant produces small, inconspicuous flowers inside the bracts, which are typically clustered in dense inflorescences. It thrives in warm, humid climates and is often cultivated as an ornamental plant for its vibrant foliage. Acalypha polymorpha is also used in traditional medicine in some regions for its purported health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha polymorpha"
    },
    "taxonomy_art_desc": "Acalypha polymorpha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical and temperate species, often with distinctive leaf and flower structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha polymorpha, a specific type within the genus known for its variable growth forms and adaptability to different environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Burundi",
        "Congo",
        "DR Congo",
        "Kenya",
        "Malawi",
        "Mozambique",
        "Rwanda",
        "Tanzania",
        "Uganda",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha polymorpha is primarily native to Angola, Burundi, Congo, DR Congo, Kenya, Malawi, Mozambique, Rwanda, Tanzania, Uganda, Zambia, and Zimbabwe. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments, often growing in forest understories or along riverbanks. Acalypha polymorpha is known for its attractive foliage and is sometimes cultivated for ornamental purposes. Its native range spans much of sub-Saharan Africa, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha polymorpha was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habits. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, disturbed soils and can spread rapidly through seed dispersal. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
