{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha acmophylla",
    "plant_slug": "acalypha-acmophylla",
    "plant_name_scientific": "acalypha acmophylla",
    "intro": "Acalypha acmophylla, commonly known as the narrow-leaf false hibiscus, is a species of flowering plant in the family Euphorbiaceae. It is native to tropical regions of Africa, particularly found in countries like Kenya and Tanzania. The plant is characterized by its narrow, lance-shaped leaves and produces small, inconspicuous flowers clustered in inflorescences. It thrives in moist, shaded environments and is often found in forest understories. The plant is also known for its ornamental value and is sometimes cultivated for its foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha acmophylla"
    },
    "taxonomy_art_desc": "Acalypha acmophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with varied leaf and flower types, often found in tropical regions. Its family is Euphorbiaceae, commonly known as the spurge family, characterized by their often milky sap and diverse growth forms. Its genus is Acalypha, a group of flowering plants typically with showy inflorescences and often used in ornamental horticulture. Its species is Acalypha acmophylla, a specific plant within the genus Acalypha, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha acmophylla is primarily native to China North-Central, China South-Central, and China Southeast. This plant is commonly found in regions with moist, tropical or subtropical climates. It thrives in areas with rich, well-drained soil and partial to full sunlight. Acalypha acmophylla is often seen in forest understories and along riverbanks. Its distribution is closely linked to the diverse ecosystems of these regions in southern and central China.",
    "distribution_introduced_art_desc": "Acalypha acmophylla was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. The plant has since spread beyond cultivation and is now found in various habitats across the country. It is considered a potential environmental weed due to its ability to thrive in disturbed areas. Its distribution is primarily limited to the North Island, though it has been reported in some regions of the South Island as well."
}
