{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha heterodonta var. psiloclada",
    "plant_slug": "acalypha-heterodonta-var-psiloclada",
    "plant_name_scientific": "acalypha heterodonta var. psiloclada",
    "intro": "Acalypha heterodonta var. psiloclada, commonly known as the \"Cape rose\" or \"Pride of Madeira,\" is a flowering plant native to South Africa. It is characterized by its showy, pink to red bract-based inflorescences that resemble flowers, though they are actually modified leaves. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are ovate to lanceolate, with a smooth texture and a slightly waxy appearance. It thrives in full sun to partial shade and is often cultivated for its ornamental value in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha heterodonta var. psiloclada is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This plant is commonly found in lowland rainforests and secondary growth areas. It thrives in humid, shaded environments with well-drained soil. The species is also known to occur in parts of northern Australia. Its distribution is largely restricted to these specific ecological zones within the region.",
    "distribution_introduced_art_desc": "Acalypha heterodonta var. psiloclada was mainly introduced to the United States, particularly in the southern states. It is commonly found in disturbed areas such as roadsides, fields, and vacant lots. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It thrives in a variety of soil types and can tolerate both full sun and partial shade. Its introduction has raised concerns among ecologists due to its potential impact on local ecosystems."
}
