{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha swallowensis",
    "plant_slug": "acalypha-swallowensis",
    "plant_name_scientific": "acalypha swallowensis",
    "intro": "Acalypha swallowensis, commonly known as the Swallow's nest or Swallow's nest plant, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its unique, clustered inflorescences that resemble a bird's nest, hence its common name. The plant typically grows as an annual or perennial herb with opposite, ovate to lanceolate leaves. Its flowers are small and inconspicuous, often surrounded by colorful bracts that serve to attract pollinators. Acalypha swallowensis is often cultivated for its ornamental value and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha swallowensis"
    },
    "taxonomy_art_desc": "Acalypha swallowensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological adaptations. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cuprum,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha swallowensis, a specific type within the genus Acalypha, named after the botanist or place associated with its discovery, and is known for its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Santa Cruz Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha swallowensis is primarily native to the Santa Cruz Islands. This plant is found in the tropical regions of this island group in the Pacific Ocean. It thrives in moist, shaded environments within the native forests of the Santa Cruz Is. The species is part of the Euphorbiaceae family and is adapted to the unique ecological conditions of the islands. Due to its restricted range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Acalypha swallowensis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plant species. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments and can spread rapidly through seed dispersal. Its introduction highlights the ecological risks associated with non-native species in island ecosystems."
}
