{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha argentii",
    "plant_slug": "acalypha-argentii",
    "plant_name_scientific": "acalypha argentii",
    "intro": "Acalypha argentii, commonly known as silverleaf ironweed, is a flowering plant native to tropical regions of Africa. It is characterized by its striking silver-gray foliage, which gives it its common name. The plant produces small, clustered flowers that range in color from white to pink, typically blooming in the summer months. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Acalypha argentii is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha argentii"
    },
    "taxonomy_art_desc": "Acalypha argentii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, which encompasses a diverse group of flowering plants with a wide range of morphological features. Its order is Malpighiales, a large order of flowering plants that includes many economically important species such as Euphorbiaceae. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"silverleaf,\" characterized by their hairy leaves and showy inflorescences. Its species is Acalypha argentii, a specific plant within the genus Acalypha, known for its silver-gray foliage and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Sulawesi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha argentii is primarily native to Sulawesi. This plant is found in the tropical regions of the island, particularly in lowland and hill forest areas. It thrives in humid, warm climates with well-drained soils. The species is commonly observed in the eastern part of Sulawesi, including the islands of Buton and Kepulauan Selayar. It plays a role in the local ecosystem and is sometimes cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Acalypha argentii was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive silver foliage. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed areas and can form dense stands that reduce biodiversity. Efforts are ongoing to control its spread and mitigate its impact on native habitats."
}
