{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wilkesiana f. illustris",
    "plant_slug": "acalypha-wilkesiana-f-illustris",
    "plant_name_scientific": "acalypha wilkesiana f. illustris",
    "intro": "Acalypha wilkesiana f. illustris, commonly known as the velvetleaf or red-leaf hibiscus, is a cultivar of the Acalypha genus native to tropical regions. It is characterized by its striking, velvety foliage that ranges from deep red to bronze in color. The plant typically grows as an upright shrub, reaching heights of up to 3 meters. Its leaves are opposite and have a unique, textured surface that gives it a distinctive appearance. It produces small, inconspicuous flowers that are often overshadowed by its ornamental leaves.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha wilkesiana f. illustris is primarily native to tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This ornamental plant thrives in warm, humid climates and is commonly found in coastal areas and lowland forests. It is also native to parts of the Pacific Islands, including Hawaii and parts of the Caribbean. The species is often cultivated for its vibrant, colorful foliage and is used in landscaping and horticulture. Its native distribution reflects its adaptation to tropical and subtropical environments.",
    "distribution_introduced_art_desc": "Acalypha wilkesiana f. illustris was mainly introduced to ornamental horticulture due to its striking, colorful foliage. It is commonly cultivated in tropical and subtropical regions for its aesthetic appeal. The plant is often used in landscaping and as a houseplant because of its vibrant leaf patterns. Its introduction has led to its presence in many regions outside its native habitat. However, in some areas, it has been classified as an invasive species due to its rapid growth and ability to spread."
}
