{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha matsudae",
    "plant_slug": "acalypha-matsudae",
    "plant_name_scientific": "acalypha matsudae",
    "intro": "Acalypha matsudae, commonly known as the Japanese copperleaf, is a flowering plant native to Japan and parts of Southeast Asia. It belongs to the Euphorbiaceae family, which includes many species with distinctive floral structures. The plant is characterized by its striking, copper-colored leaves that turn reddish in autumn, making it a popular ornamental species. It produces small, clustered inflorescences that are often surrounded by modified leaves called bracts. Acalypha matsudae thrives in moist, well-drained soils and is often found in forested areas or along stream banks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha matsudae"
    },
    "taxonomy_art_desc": "Acalypha matsudae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a distinctive morphology and includes horsetails and ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants known for their varied forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences. Its species is Acalypha matsudae, a specific plant within the genus Acalypha, native to certain regions of Asia and distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha matsudae is primarily native to Taiwan. It is found in the wild across various regions of the island, particularly in forested areas and undergrowth. This plant thrives in humid, subtropical climates typical of Taiwan's diverse ecosystems. It is often associated with moist soils and partial shade, growing in both mountainous and lowland habitats. Due to its limited distribution, it is considered a rare and endemic species within Taiwan.",
    "distribution_introduced_art_desc": "Acalypha matsudae was mainly introduced to Hawaii. It was first discovered in the wild in 1995 and has since spread across several islands. The plant thrives in disturbed habitats such as roadsides and abandoned fields. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Efforts are ongoing to control its spread and protect local ecosystems."
}
