{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha flexuosa",
    "plant_slug": "acalypha-flexuosa",
    "plant_name_scientific": "acalypha flexuosa",
    "intro": "Acalypha flexuosa, commonly known as the zigzag hibiscus, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its distinctive, wavy, and often zigzag-shaped leaves that give it its common name. The plant produces showy, hibiscus-like flowers in shades of yellow, orange, or red, which bloom throughout the growing season. Its leaves are often used in traditional medicine for their purported anti-inflammatory and antiseptic properties. Acalypha flexuosa thrives in moist, well-drained soil and is often found in woodland or coastal areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha flexuosa is primarily native to Southeast Asia, including countries such as Thailand, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant thrives in humid climates and is typically associated with forest understories or wetlands. It is also present in parts of eastern India and the Pacific Islands. Its distribution is largely confined to these geographic areas, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha flexuosa was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners seeking exotic plants for landscaping. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native species and altering local ecosystems. The plant thrives in moist, shady environments and can spread rapidly through vegetative propagation. Its introduction highlights the ecological risks associated with non-native ornamental plants."
}
