{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hernandiifolia",
    "plant_slug": "acalypha-hernandiifolia",
    "plant_name_scientific": "acalypha hernandiifolia",
    "intro": "Acalypha hernandiifolia, commonly known as the velvetleaf or false hibiscus, is a tropical plant native to Central and South America. It is characterized by its palmate leaves, which are often covered in a fine, velvety texture. The plant produces showy, red or purple bracts that resemble flowers, though they are actually modified leaves. It thrives in moist, shaded environments and is often found in tropical forests. Acalypha hernandiifolia is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hernandiifolia is primarily native to tropical regions of Africa, Southeast Asia, and the Pacific Islands. It is commonly found in countries such as Madagascar, Indonesia, and the Philippines. This plant thrives in humid, warm climates and is often associated with lowland rainforests. It is known for its striking foliage and is sometimes cultivated as an ornamental plant. Its natural range extends across parts of the Indian Ocean and the western Pacific.",
    "distribution_introduced_art_desc": "Acalypha hernandiifolia was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in gardens and landscaped areas in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with high humidity and well-drained soil. Its rapid growth and ability to spread through seeds and vegetative propagation have led to its establishment in some native ecosystems. However, it is considered a potential invasive species in certain areas where it can outcompete native vegetation."
}
