{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha setosa",
    "plant_slug": "acalypha-setosa",
    "plant_name_scientific": "acalypha setosa",
    "intro": "Acalypha setosa, commonly known as the hairy ironweed, is a herbaceous plant native to tropical regions of Africa and Asia. It is characterized by its soft, hairy leaves that are often covered in fine, white pubescence. The plant produces small, clustered flowers that are typically greenish or reddish in color. It thrives in moist, shaded environments and is often found in woodland areas or along stream banks. Acalypha setosa is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha setosa"
    },
    "taxonomy_art_desc": "Acalypha setosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupids,\" characterized by their hairy leaves and showy inflorescences. Its species is Acalypha setosa, a specific plant within the genus Acalypha known for its finely hairy leaves and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bahamas",
        "Belize",
        "Colombia",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "Ecuador",
        "Guatemala",
        "Haiti",
        "Honduras",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua",
        "Puerto Rico",
        "Venezuela"
    ],
    "distribution_introduced": [
        "Alabama",
        "Florida",
        "Georgia",
        "Louisiana",
        "Mississippi",
        "South Carolina"
    ],
    "distribution_native_art_desc": "Acalypha setosa is primarily native to the Bahamas, Belize, Colombia, Costa Rica, Cuba, Dominican Republic, Ecuador, Guatemala, Haiti, Honduras, Mexico Central, Mexico Gulf, Mexico Southeast, Mexico Southwest, Nicaragua, Puerto Rico, and Venezuela. It is commonly found in tropical and subtropical regions across these countries. The plant typically grows in open areas, disturbed soils, and along roadsides. It is often seen in lowland and coastal habitats. Its distribution spans a wide range of Central and South American countries as well as the Caribbean islands.",
    "distribution_introduced_art_desc": "Acalypha setosa was mainly introduced to Alabama, Florida, Georgia, Louisiana, Mississippi, and South Carolina. It is commonly found in wetlands, marshes, and along the edges of water bodies in these regions. The plant thrives in moist to wet soil conditions, making it well-suited for the humid climate of the southeastern United States. It is often seen growing in disturbed areas such as ditches, roadsides, and floodplains. Due to its adaptability, it has become an invasive species in many of these states."
}
