{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha beckii",
    "plant_slug": "acalypha-beckii",
    "plant_name_scientific": "acalypha beckii",
    "intro": "Acalypha beckii, commonly known as the red-leaved acalypha, is a shrub native to tropical regions of Africa. It is characterized by its striking, velvety red leaves that are often adorned with distinctive white veins. The plant produces small, greenish-white flowers arranged in clusters, which are followed by spherical, woody fruits. It thrives in moist, well-drained soils and is often found in forest understories or along streambanks. Due to its ornamental value, it is cultivated in gardens and botanical collections for its vibrant foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha beckii"
    },
    "taxonomy_art_desc": "Acalypha beckii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic or milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha beckii, a specific type within the genus Acalypha, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha beckii is primarily native to Bolivia. It is found in the Andean regions of the country, particularly in the departments of La Paz and Potosí. This plant thrives in high-altitude environments, often growing in rocky soils and open grasslands. It is an important component of the local flora in these regions. Its distribution is limited to specific ecological niches within Bolivia.",
    "distribution_introduced_art_desc": "Acalypha beckii was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage. It is commonly found in coastal areas and disturbed soils where it can thrive in full sun to partial shade. The plant is often used in landscaping and as a ground cover because of its rapid growth and ability to tolerate various soil types. However, it has also been identified as an invasive species in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns in regions where it has established itself outside of controlled environments."
}
