{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis var. pallida",
    "plant_slug": "acalypha-communis-var-pallida",
    "plant_name_scientific": "acalypha communis var. pallida",
    "intro": "Acalypha communis var. pallida, commonly known as whiteleaf copperleaf, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, pale green to white leaves that contrast with its bright red or orange bracts. The plant produces small, inconspicuous flowers that are typically clustered in dense inflorescences. It thrives in warm, humid climates and is often cultivated as an ornamental plant for its attractive foliage. The species is also valued in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis var. pallida is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This variant thrives in moist, shaded environments, often growing along riverbanks and in dense forest undergrowth. It is also known to occur in parts of southern China and the Indian subcontinent. Its distribution is closely associated with wetlands and disturbed soils in these regions.",
    "distribution_introduced_art_desc": "Acalypha communis var. pallida was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its ornamental value. The plant is often used in garden designs and as a decorative plant in both residential and commercial settings. Its introduction has led to its establishment in some non-native areas, where it can become invasive. Proper management is recommended to prevent its spread beyond cultivated areas."
}
