{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha skutchii",
    "plant_slug": "acalypha-skutchii",
    "plant_name_scientific": "acalypha skutchii",
    "intro": "Acalypha skutchii, commonly known as the Skutch's spurflower, is a flowering plant native to Central America. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its showy, spurge-like flowers that are typically red or orange in color. It thrives in tropical and subtropical climates, often growing in shaded or semi-shaded environments. Acalypha skutchii is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha skutchii"
    },
    "taxonomy_art_desc": "Acalypha skutchii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations such as tendrils and specialized leaf structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha skutchii, a specific plant within the genus Acalypha, native to certain regions and distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Honduras",
        "Mexico Gulf",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha skutchii is primarily native to Guatemala, Honduras, Mexico Gulf, Mexico Southeast, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid environments, often growing in lowland forests and along riverbanks. The species is known for its ornamental value and is sometimes cultivated for its vibrant foliage. Its native range reflects its adaptation to the diverse ecosystems of Central America.",
    "distribution_introduced_art_desc": "Acalypha skutchii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first documented in the early 20th century and has since been found in various locations across the region. Despite its aesthetic appeal, it has shown potential to spread beyond cultivated areas, raising concerns about its ecological impact. The plant thrives in moist, shaded environments and can establish itself in native vegetation. Its introduction has led to discussions about its management to prevent it from becoming invasive."
}
