{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gracilens var. delzii",
    "plant_slug": "acalypha-gracilens-var-delzii",
    "plant_name_scientific": "acalypha gracilens var. delzii",
    "intro": "Acalypha gracilens var. delzii, commonly known as silverleaf acalypha, is a strikingly ornamental shrub native to tropical regions of Africa. It is characterized by its finely textured, silvery-gray foliage that gives it a distinctive, almost metallic appearance. The plant produces small, inconspicuous greenish-white flowers that are clustered in dense, spike-like inflorescences. It thrives in warm, humid climates and prefers well-drained soil with partial to full sunlight. Due to its unique foliage, it is often cultivated as a decorative plant in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gracilens var. delzii is primarily native to the island of Madagascar. This plant is found in the eastern part of the island, particularly in the northeastern regions. It thrives in moist, tropical environments and is commonly found in forest understories. The species is adapted to the humid climate and is often associated with secondary growth areas. It is a significant component of the local flora and is valued for its ornamental characteristics.",
    "distribution_introduced_art_desc": "Acalypha gracilens var. delzii was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was brought there during the 19th century by European settlers who admired its vibrant leaf colors and unique growth habit. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native species and altering local ecosystems. The plant thrives in disturbed habitats and can spread rapidly through seed dispersal by wind and water. Its introduction highlights the ecological risks associated with non-native ornamental plants."
}
