{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha omissa",
    "plant_slug": "acalypha-omissa",
    "plant_name_scientific": "acalypha omissa",
    "intro": "Acalypha omissa, commonly known as the velvetleaf or false nettle, is a flowering plant native to tropical and subtropical regions of the Americas. It is a shrub or small tree that can grow up to 5 meters tall, characterized by its opposite, ovate leaves with a velvety texture. The plant produces small, greenish-white flowers arranged in clusters, which are followed by three-winged fruits known as schizocarps. Acalypha omissa thrives in moist, well-drained soils and is often found in disturbed areas such as roadsides and forest edges. It is valued for its ornamental appeal and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha omissa is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is also found in parts of tropical regions in Africa, such as Kenya and Tanzania. This plant thrives in humid, tropical climates and is commonly found in lowland forests and wetlands. It is often associated with disturbed habitats and can be seen growing along riverbanks and in open areas. Its native distribution reflects its adaptability to warm, moist environments across these regions.",
    "distribution_introduced_art_desc": "Acalypha omissa was mainly introduced to New Zealand. It was first recorded in the 19th century and has since become naturalized in various regions. The plant is commonly found in coastal areas and disturbed soils. It is considered an invasive species in some parts of its introduced range. Its rapid growth and ability to thrive in diverse conditions contribute to its spread."
}
