{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha apicalis",
    "plant_slug": "acalypha-apicalis",
    "plant_name_scientific": "acalypha apicalis",
    "intro": "Acalypha apicalis, commonly known as the red-hot poker or candle bush, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its striking, red bract clusters that resemble torches. The plant produces small, inconspicuous flowers surrounded by these showy, modified leaves. It thrives in well-drained soil and full sun, making it a popular ornamental plant in gardens. Its unique appearance and relatively low maintenance requirements make it a favored choice for tropical and subtropical landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha apicalis is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often seen in forest understories or near water bodies. It is also present in parts of northern Australia and the Pacific Islands. Due to its adaptability, it can sometimes be found in cultivated gardens as well.",
    "distribution_introduced_art_desc": "Acalypha apicalis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first recorded in the early 20th century and has since spread to other tropical and subtropical regions. The plant thrives in moist, well-drained soils and is often found in disturbed areas such as roadsides and forest edges. It has become naturalized in several locations, raising concerns about its potential invasive behavior. Despite its ornamental value, its ecological impact remains a topic of ongoing study."
}
