{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha haplostyla",
    "plant_slug": "acalypha-haplostyla",
    "plant_name_scientific": "acalypha haplostyla",
    "intro": "Acalypha haplostyla, commonly known as the narrow-leaf chaffflower, is a flowering plant native to tropical and subtropical regions of Asia. It belongs to the Euphorbiaceae family, which is characterized by its diverse morphology and often milky sap. The plant typically features narrow, lance-shaped leaves and produces small, clustered flowers that are often surrounded by specialized bracts. It thrives in moist, well-drained soils and is often found in forest understories or along stream banks. Due to its ornamental value, it is occasionally cultivated in gardens, though it can be invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha haplostyla is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in lowland and hill forest areas, often growing in moist, shaded environments. This species is also present in parts of India and Sri Lanka, where it thrives in tropical and subtropical climates. It prefers well-drained soils and is often associated with secondary forests and disturbed habitats. The plant is valued for its ornamental qualities and is sometimes cultivated in gardens in its native range.",
    "distribution_introduced_art_desc": "Acalypha haplostyla was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, spreading rapidly in natural ecosystems. The plant thrives in moist, disturbed areas and can outcompete native species. Its introduction has led to concerns about biodiversity loss in local habitats."
}
