{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha amentacea",
    "plant_slug": "acalypha-amentacea",
    "plant_name_scientific": "acalypha amentacea",
    "intro": "Acalypha amentacea, commonly known as the silverleaf acalypha, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its soft, silvery-gray foliage that gives it a distinctive appearance. The plant produces small, inconspicuous green flowers that are clustered in dense, catkin-like inflorescences. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Acalypha amentacea is valued for its ornamental appeal and is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha amentacea"
    },
    "taxonomy_art_desc": "Acalypha amentacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malpighiales, a diverse group of flowering plants that includes many species with unique adaptations, such as sticky seeds and specialized leaves. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their distinctive leaf shapes and often showy inflorescences. Its species is Acalypha amentacea, a specific plant within the genus Acalypha, known for its unique growth habits and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo",
        "Caroline Is.",
        "Maluku",
        "New Guinea",
        "Philippines",
        "Sulawesi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha amentacea is primarily native to Borneo, Caroline Is., Maluku, New Guinea, Philippines, Sulawesi. This species is commonly found in tropical and subtropical regions across these areas. It thrives in moist, shaded environments such as forests and undergrowth. The plant is known for its distinctive inflorescence and is often part of the local flora in these regions. Its distribution reflects its adaptation to the diverse ecosystems of the Indo-Pacific area.",
    "distribution_introduced_art_desc": "Acalypha amentacea was mainly introduced to New Zealand as an ornamental plant due to its attractive, pendulous inflorescences. It was first recorded in the 19th century and has since become naturalized in various regions across the country. The plant thrives in moist, well-drained soils and is commonly found in coastal and lowland areas. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to its classification as an environmental weed in some regions. Despite its ornamental value, it poses a threat to native ecosystems by outcompeting indigenous flora."
}
