{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chaquensis",
    "plant_slug": "acalypha-chaquensis",
    "plant_name_scientific": "acalypha chaquensis",
    "intro": "Acalypha chaquensis, commonly known as the Chaquense spurflower, is a flowering plant native to South America, particularly found in countries like Bolivia and Peru. It belongs to the Euphorbiaceae family, which is known for its diverse and often ornamental species. The plant features striking, colorful bracts that resemble flowers, which are actually modified leaves used to attract pollinators. Its foliage is typically glossy and variegated, adding visual interest to gardens. Acalypha chaquensis thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha chaquensis"
    },
    "taxonomy_art_desc": "Acalypha chaquensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with unique floral structures and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy flowers and often hairy leaves. Its species is Acalypha chaquensis, a specific plant within the Acalypha genus native to South America, known for its distinctive appearance and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Paraguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chaquensis is primarily native to Argentina Northeast and Paraguay. It is commonly found in the subtropical and tropical regions of these areas. This plant typically grows in moist, wooded habitats and along riverbanks. It is part of the Euphorbiaceae family and is known for its distinctive foliage. Its native distribution is limited to specific regions within Argentina and Paraguay.",
    "distribution_introduced_art_desc": "Acalypha chaquensis was mainly introduced to South America, particularly in regions with tropical and subtropical climates. It is commonly found in countries such as Peru, Bolivia, and parts of Brazil. This plant thrives in moist, well-drained soils and is often cultivated for its ornamental value. It has been introduced to various areas for horticultural purposes, including as a decorative shrub. However, its spread is limited due to its specific environmental requirements."
}
