{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha subviscida var. lovelandii",
    "plant_slug": "acalypha-subviscida-var-lovelandii",
    "plant_name_scientific": "acalypha subviscida var. lovelandii",
    "intro": "Acalypha subviscida var. lovelandii, commonly known as the Love's acalypha, is a perennial shrub native to the southeastern United States. It features striking, palmate leaves with a velvety texture and a deep red or maroon coloration. The plant produces small, greenish-white flowers that are clustered in dense, spherical inflorescences. It thrives in moist, well-drained soils and prefers partial to full sunlight. This ornamental plant is valued for its unique foliage and is often used in landscape design for its visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha subviscida var. lovelandii is primarily native to the southeastern United States, specifically Texas, Oklahoma, and Louisiana. It is commonly found in dry to mesic woodlands, prairies, and along roadsides. This plant thrives in well-drained soils and is often associated with disturbed or open habitats. It is known for its distinctive foliage and is sometimes used in ornamental horticulture. Due to its limited range, it is considered a rare and locally uncommon species in its native habitat.",
    "distribution_introduced_art_desc": "Acalypha subviscida var. lovelandii was mainly introduced to the southeastern United States, particularly in states like Florida and Georgia. It was originally from tropical and subtropical regions of Central and South America. The plant was introduced as an ornamental due to its attractive foliage and growth habit. It has since become naturalized in some areas, often found in disturbed soils and along roadsides. However, it is not considered invasive in most regions where it is present."
}
