{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha insulana var. subvillosa",
    "plant_slug": "acalypha-insulana-var-subvillosa",
    "plant_name_scientific": "acalypha insulana var. subvillosa",
    "intro": "Acalypha insulana var. subvillosa, commonly known as the silky hibiscus, is a species native to tropical regions of the Pacific. It is characterized by its hairy, velvety leaves that give it a soft, textured appearance. The plant produces showy, colorful bracts that resemble flowers, often in shades of red, pink, or orange. It thrives in warm, humid climates and is often cultivated for its ornamental value. Its botanical features make it a popular choice for gardens and landscapes in suitable environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha insulana var. subvillosa is primarily native to the western Pacific islands, including parts of Papua New Guinea, the Solomon Islands, and the Bismarck Archipelago. This plant typically grows in moist, shaded forest understories and is commonly found in lowland and montane areas. It thrives in humid tropical climates and is often associated with secondary growth and disturbed habitats. The species is known for its distinctive foliage and is sometimes cultivated for its ornamental value. Due to its restricted distribution, it is considered a regionally important plant in its native range.",
    "distribution_introduced_art_desc": "Acalypha insulana var. subvillosa was mainly introduced to Hawaii. It was first recorded in the 1950s and has since become naturalized in various coastal areas. This plant is commonly found in disturbed soils and along roadsides. It is considered an invasive species due to its rapid growth and ability to spread easily. Its introduction has raised concerns among local conservationists."
}
