{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha amithii",
    "plant_slug": "acalypha-amithii",
    "plant_name_scientific": "acalypha amithii",
    "intro": "Acalypha amithii, commonly known as the red-flowered iron plant, is a striking ornamental shrub native to tropical regions of Asia. It is characterized by its vibrant, rust-colored flowers that bloom in dense clusters, often surrounded by striking red bracts. The plant features palmate leaves with lobed margins, giving it a distinctive, tropical appearance. It thrives in full sun to partial shade and requires well-drained soil for optimal growth. Acalypha amithii is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha amithii"
    },
    "taxonomy_art_desc": "Acalypha amithii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose and magnolia families. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with unique adaptations, such as carnivorous plants. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide variety of growth forms and some toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha amithii, a specific plant within the Acalypha genus, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha amithii is primarily native to Mexico Southwest. This species is found in the arid and semi-arid regions of the southwestern part of Mexico. It typically grows in rocky soils and dry habitats. The plant is adapted to the harsh environmental conditions of this region. It is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acalypha amithii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and forest edges. It thrives in tropical and subtropical regions with high humidity and moderate to high rainfall. The plant is commonly found in Southeast Asia, including countries like Thailand, Vietnam, and the Philippines. It spreads through its prolific seed production and ability to colonize new areas quickly. Due to its adaptability, it has become an invasive species in some regions, outcompeting native vegetation."
}
