{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cordovensis var. rotundata",
    "plant_slug": "acalypha-cordovensis-var-rotundata",
    "plant_name_scientific": "acalypha cordovensis var. rotundata",
    "intro": "Acalypha cordovensis var. rotundata, commonly known as the round-leaf copperleaf, is a tropical shrub native to Central America and parts of the Caribbean. It is characterized by its glossy, ovate leaves that are typically a deep green with reddish veins. The plant produces small, clustered flowers that are usually greenish-white in color, followed by distinctive, inflated seed pods. It thrives in moist, well-drained soils and is often found in coastal areas and disturbed habitats. Due to its ornamental value, it is occasionally cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cordovensis var. rotundata is primarily native to the tropical regions of Central America, including parts of Mexico, Guatemala, and Belize. This plant thrives in humid, warm climates and is commonly found in lowland tropical forests. It is often associated with secondary growth areas and disturbed habitats due to its adaptability. The species is also present in some Caribbean islands, where it grows in similar environmental conditions. Its native range is characterized by high rainfall and well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha cordovensis var. rotundata was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage. It is commonly found in gardens and landscaped areas in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with well-drained soil and partial to full sunlight. Its introduction has sometimes led to it becoming an invasive species in certain environments. Proper management is recommended to prevent its spread beyond cultivated areas."
}
