{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha depressa",
    "plant_slug": "acalypha-depressa",
    "plant_name_scientific": "acalypha depressa",
    "intro": "Acalypha depressa, commonly known as the prostrate spurge, is a low-growing shrub native to tropical and subtropical regions. It features small, opposite leaves that are often covered in fine hairs, giving them a velvety texture. The plant produces clusters of small, greenish-yellow flowers that are typically followed by capsule fruits containing numerous seeds. It thrives in well-drained soils and is often found in disturbed areas or along roadsides. Due to its ornamental value and adaptability, it is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha depressa is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in humid climates and is often associated with disturbed habitats like roadsides and abandoned fields. It is also present in parts of the Pacific Islands, including the Philippines and the Solomon Islands. Due to its adaptability, it can sometimes be found in cultivated areas near its native range.",
    "distribution_introduced_art_desc": "Acalypha depressa was mainly introduced to New Zealand. It was first recorded in the 19th century and has since spread throughout various regions of the country. The plant is commonly found in coastal areas and disturbed sites, often growing in sandy or gravelly soils. It is considered a weed in some parts of New Zealand due to its rapid growth and ability to colonize new areas. Its introduction has raised concerns about its impact on native ecosystems."
}
