{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lepidopagensis",
    "plant_slug": "acalypha-lepidopagensis",
    "plant_name_scientific": "acalypha lepidopagensis",
    "intro": "Acalypha lepidopagensis, commonly known as the white-veined hibiscus, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its striking, palmate leaves with white veins. The plant produces small, yellowish flowers that are often clustered in inflorescences. It thrives in humid, well-drained soils and is often found in forest understories. Due to its ornamental value, it is sometimes cultivated in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lepidopagensis"
    },
    "taxonomy_art_desc": "Acalypha lepidopagensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse flower structures and reproductive strategies. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral and leaf morphology. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often produces milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupseed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha lepidopagensis, a specific type within the genus Acalypha, distinguished by its unique morphological features and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lepidopagensis is primarily native to Madagascar. This species is found in the diverse ecosystems of the island, including forests and grasslands. It is adapted to the unique environmental conditions of Madagascar, which are distinct from other regions. The plant plays a role in the local flora and may contribute to the ecological balance of its habitat. Its native distribution highlights the biodiversity of Madagascar's plant life.",
    "distribution_introduced_art_desc": "Acalypha lepidopagensis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, disturbed soils and can spread rapidly through seeds. Conservation efforts are underway to control its spread and protect local ecosystems."
}
