{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha aliena",
    "plant_slug": "acalypha-aliena",
    "plant_name_scientific": "acalypha aliena",
    "intro": "Acalypha aliena, commonly known as the red leaf hibiscus, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, velvety red leaves and showy, trumpet-shaped flowers that range in color from white to pink. The plant belongs to the Euphorbiaceae family and is often cultivated for its ornamental value in gardens and landscapes. It thrives in warm, humid climates and requires well-drained soil to prevent root rot. Acalypha aliena is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha aliena"
    },
    "taxonomy_art_desc": "Acalypha aliena belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malpighiales, a large group of flowering plants with a wide range of morphological diversity, including some species with unique leaf and flower structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes many plants with milky sap and a wide variety of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha aliena, a specific plant within the genus Acalypha, distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha aliena is primarily native to Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, and Nicaragua. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, well-drained soils and often grows in shaded to partially sunny environments. The species is known for its ornamental value and is sometimes cultivated for its attractive foliage. Its native range reflects its adaptation to the diverse ecosystems of Central America.",
    "distribution_introduced_art_desc": "Acalypha aliena was mainly introduced to new environments through human activities such as horticulture and landscaping. It is commonly found in disturbed soils and urban areas where it thrives in moist, nutrient-rich conditions. The plant has spread beyond its native range, becoming an invasive species in several regions. Its rapid growth and ability to outcompete native vegetation pose a threat to local ecosystems. Efforts are being made to control its spread through mechanical removal and herbicide application."
}
