{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha villosa f. paniculata",
    "plant_slug": "acalypha-villosa-f-paniculata",
    "plant_name_scientific": "acalypha villosa f. paniculata",
    "intro": "Acalypha villosa f. paniculata, commonly known as the silky hibiscus, is a tropical shrub native to Southeast Asia. It is characterized by its soft, hairy foliage and showy, clustered inflorescences that resemble panicles. The plant produces small, five-petaled flowers in shades of pink, red, or white, which bloom throughout the growing season. Its leaves are ovate to lanceolate in shape and covered in fine, white pubescence. This ornamental plant is often cultivated for its attractive foliage and colorful blooms in garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha villosa f. paniculata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments within forests or along stream banks. This plant thrives in humid climates and is typically associated with lowland and hill forest areas. It is sometimes cultivated as an ornamental plant due to its attractive foliage. Its natural range extends into parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha villosa f. paniculata was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique growth habits. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and as a decorative plant. The plant thrives in warm climates with high humidity and well-drained soil, making it suitable for tropical and subtropical environments. It is often used in mixed plantings and as a ground cover in shaded or semi-shaded areas. Despite its ornamental appeal, it has the potential to become invasive in certain ecosystems if not managed properly."
}
