{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pauciflora f. umbrosa",
    "plant_slug": "acalypha-pauciflora-f-umbrosa",
    "plant_name_scientific": "acalypha pauciflora f. umbrosa",
    "intro": "Acalypha pauciflora f. umbrosa, commonly known as the shade-loving acalypha, is a variant of the acalypha plant characterized by its unique foliage and growth habits. It is native to tropical regions and thrives in low-light conditions, making it suitable for indoor cultivation. The plant features heart-shaped leaves with a velvety texture and often displays a striking coloration, ranging from deep green to variegated patterns. It produces small, inconspicuous flowers that are typically green or yellow, which are not the primary ornamental feature. This foliage plant is valued for its aesthetic appeal and ability to adapt to shaded environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pauciflora f. umbrosa is primarily native to Southeast Asia, particularly Malaysia and Indonesia. This variant thrives in shaded, humid environments within tropical rainforests. It is commonly found in lowland and hill forest areas where the canopy provides ample shade. The plant is adapted to grow in moist, well-drained soils. Its native distribution is largely restricted to specific regions within the Malay Archipelago.",
    "distribution_introduced_art_desc": "Acalypha pauciflora f. umbrosa was mainly introduced to shaded, moist environments within forest understories. It thrives in areas with partial to full shade and moderate to high humidity. This distribution is likely due to its adaptation to low-light conditions and preference for well-drained, nutrient-rich soils. It is commonly found in tropical and subtropical regions with a warm climate. Its introduction to these habitats has contributed to its presence in both natural and cultivated landscapes."
}
