{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrostachya f. tristis",
    "plant_slug": "acalypha-macrostachya-f-tristis",
    "plant_name_scientific": "acalypha macrostachya f. tristis",
    "intro": "Acalypha macrostachya f. tristis, commonly known as the velvetleaf or silky ironweed, is a striking ornamental plant native to tropical regions of the Americas. It is characterized by its soft, velvety foliage that ranges from green to reddish hues, giving it a unique visual appeal. The plant produces clusters of small, pale yellow flowers that bloom in late summer, adding a subtle ornamental value. It thrives in moist, well-drained soils and prefers full sun to partial shade. Due to its attractive appearance and adaptability, it is often cultivated in gardens and landscapes for its aesthetic and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrostachya f. tristis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with forest understories or along riverbanks. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Its native range extends into northern Australia, where it grows in similar environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha macrostachya f. tristis was mainly introduced to new habitats in tropical and subtropical regions, often as an ornamental plant due to its attractive foliage. It has been reported in several countries including parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. The plant spreads primarily through its seeds, which are dispersed by wind, water, and animals. Its rapid growth and adaptability have led to its establishment in both natural and disturbed environments. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
