{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis subsp. tracheliifolia",
    "plant_slug": "acalypha-communis-subsp-tracheliifolia",
    "plant_name_scientific": "acalypha communis subsp. tracheliifolia",
    "intro": "Acalypha communis subsp. tracheliifolia, commonly known as the red-hot poker or fire plant, is a species native to tropical regions of Africa. It is characterized by its striking, upright spikes of bright red bracts that resemble poker chips, which are actually modified leaves. The plant produces small, inconspicuous flowers that are clustered at the base of the bracts. It thrives in full sun and well-drained soil, making it a popular ornamental plant in gardens. Its foliage is often variegated with shades of green and red, adding visual interest to landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha communis"
    },
    "taxonomy_art_desc": "Acalypha communis subsp. tracheliifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their showy flowers and often hairy leaves. Its species is Acalypha communis, a widespread species within the genus known for its variability in leaf shape and color, often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Brazil South",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis subsp. tracheliifolia is primarily native to Argentina Northeast, Brazil South, and Uruguay. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in moist, well-drained soils and is often found in forest understories or along riverbanks. The species is known for its ornamental value and is sometimes cultivated for its attractive foliage. It plays an important ecological role in the local habitats where it is native.",
    "distribution_introduced_art_desc": "Acalypha communis subsp. tracheliifolia was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant is often used in gardens, as a ground cover, or in containers because of its rapid growth and ability to thrive in partial shade. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
