{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha elegantula",
    "plant_slug": "acalypha-elegantula",
    "plant_name_scientific": "acalypha elegantula",
    "intro": "Acalypha elegantula, commonly known as the velvetleaf or silverleaf acalypha, is a flowering plant native to tropical and subtropical regions. It is characterized by its velvety, silver-green leaves that are often covered in fine hairs. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha elegantula is valued for its ornamental appeal and is used in landscaping and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha elegantula is primarily native to the Caribbean islands, including the Greater and Lesser Antilles. It is commonly found in the tropical regions of countries such as Cuba, Jamaica, and Hispaniola. This plant thrives in humid, warm climates and is often associated with coastal and lowland areas. It is typically found in disturbed habitats, such as roadsides and open woodlands. Its distribution is largely limited to the western Atlantic region, where it has adapted to the local environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha elegantula was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and compact growth habit. It was first recorded in the 19th century and has since become established in various regions of the country. The plant is commonly found in coastal and urban areas, where it thrives in disturbed soils and sunny conditions. Despite its aesthetic appeal, it has raised concerns due to its potential to become invasive in certain environments. Its distribution continues to expand, prompting ongoing monitoring by conservation agencies."
}
