{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha eremorum",
    "plant_slug": "acalypha-eremorum",
    "plant_name_scientific": "acalypha eremorum",
    "intro": "Acalypha eremorum, commonly known as the desert mallow, is a flowering plant native to arid and semi-arid regions of Africa. It is characterized by its hairy, glandular leaves and showy, pink to purple bract-like flowers that bloom in clusters. The plant thrives in well-drained soils and is drought-tolerant, making it well-suited for xerophytic environments. Its structure includes a short, woody stem with opposite branching, and it produces small, capsule-like fruits. The botanical features of Acalypha eremorum make it an important plant in ecological studies of desert flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha eremorum"
    },
    "taxonomy_art_desc": "Acalypha eremorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical and subtropical species, often with unique leaf and flower structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupids' bow,\" characterized by their showy bracts and often hairy leaves. Its species is Acalypha eremorum, a specific plant within the genus Acalypha, known for its distinctive appearance and adaptation to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha eremorum is primarily native to New South Wales and Queensland in Australia. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy soils and is often seen in open woodlands and grasslands. The species is well adapted to the dry climate of its native habitat. It plays an important role in the local ecosystem by providing food and shelter for various wildlife.",
    "distribution_introduced_art_desc": "Acalypha eremorum was mainly introduced to areas with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soil conditions. It has been established in several regions of Australia, particularly in the Northern Territory and Western Australia. The plant is often found in disturbed habitats such as roadsides, open woodlands, and rocky outcrops. Its rapid growth and seed dispersal make it a potential invasive species in some environments. However, it is also valued for its ornamental qualities and is sometimes cultivated in gardens."
}
