{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha arcuata",
    "plant_slug": "acalypha-arcuata",
    "plant_name_scientific": "acalypha arcuata",
    "intro": "Acalypha arcuata, commonly known as the curlleaf spurge, is a flowering plant native to tropical and subtropical regions of the Americas. It is a herbaceous perennial that typically grows to a height of 1 to 2 meters, featuring alternate, ovate to elliptic leaves with a waxy texture. The plant produces small, inconspicuous greenish-yellow flowers arranged in clusters, which are followed by distinctive, inflated, bladder-like seed capsules. Its leaves often curl at the edges, giving the plant its common name, and it is sometimes cultivated as an ornamental due to its unique foliage. Acalypha arcuata is adapted to well-drained soils and thrives in full sun to partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha arcuata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in shaded to semi-shaded environments, often growing in forest understories or along stream banks. It is also known to occur in parts of southern China and the Indian subcontinent. The plant is valued for its ornamental leaves and is sometimes cultivated for horticultural purposes.",
    "distribution_introduced_art_desc": "Acalypha arcuata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since spread beyond cultivated areas and is now found in disturbed sites, riverbanks, and forest margins throughout the country. The plant's rapid growth and ability to thrive in different soil types have contributed to its establishment in natural ecosystems. Although it is not considered a major invasive species, it has the potential to outcompete native vegetation in certain environments. Management efforts are ongoing to control its spread and mitigate its impact on local biodiversity."
}
