{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pubiflora subsp. australica",
    "plant_slug": "acalypha-pubiflora-subsp-australica",
    "plant_name_scientific": "acalypha pubiflora subsp. australica",
    "intro": "Acalypha pubiflora subsp. australica, commonly known as the Australian or silky ironwood, is a shrub native to Australia. It is characterized by its smooth, often greyish bark and lance-shaped leaves with a distinctive silvery underside. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in well-drained soils and is often found in coastal and sandy environments. Acalypha pubiflora subsp. australica is valued for its ornamental appeal and resilience to coastal conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pubiflora"
    },
    "taxonomy_art_desc": "Acalypha pubiflora subsp. australica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall in their spores. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha pubiflora, a plant characterized by its pubescent leaves and distinctive floral structures, with the subspecies australica representing a variant adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pubiflora subsp. australica is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions within these states. It typically grows in sandy or gravelly soils along creek lines and in open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important role in local ecosystems by providing habitat and food for native fauna.",
    "distribution_introduced_art_desc": "Acalypha pubiflora subsp. australica was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. This species has since become naturalized in certain areas, particularly in the northern parts of the country. It thrives in moist, shaded environments and is often found in disturbed soils. However, its spread is limited compared to other invasive species in the region."
}
