{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica f. intermedia",
    "plant_slug": "acalypha-virginica-f-intermedia",
    "plant_name_scientific": "acalypha virginica f. intermedia",
    "intro": "Acalypha virginica f. intermedia, commonly known as the woolly cup plant, is a perennial herb native to the eastern United States. It is characterized by its soft, hairy leaves and clusters of small, pinkish-white flowers that bloom in late summer. The plant typically grows in moist to wet soils in woodland or swampy areas. Its unique foliage and flowering structure make it a distinctive addition to native plant gardens. It is also valued for its role in supporting local pollinators and wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica f. intermedia is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and North Carolina. It is commonly found in wetlands, marshes, and along the edges of water bodies. This plant thrives in moist to wet soil conditions and is often associated with riparian habitats. It is also occasionally found in disturbed areas and along roadsides. Its native range extends into parts of the Caribbean, including the Bahamas and Cuba.",
    "distribution_introduced_art_desc": "Acalypha virginica f. intermedia was mainly introduced to the northeastern United States as an ornamental plant due to its attractive foliage and unique growth habit. It was commonly cultivated in gardens and landscapes for its vibrant red bracts and compact size. Despite its ornamental value, it has since become naturalized in some areas, raising concerns about its potential to invade native habitats. The plant's ability to thrive in a variety of soil types and its rapid growth rate contribute to its spread. However, its distribution remains limited compared to other invasive species in the region."
}
