{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hederacea",
    "plant_slug": "acalypha-hederacea",
    "plant_name_scientific": "acalypha hederacea",
    "intro": "Acalypha hederacea, commonly known as creeping nettle or ivyleaf abutilion, is a flowering plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family and is characterized by its heart-shaped leaves and clusters of small, greenish flowers. The plant has a trailing growth habit, making it suitable for ground cover or hanging baskets. Its leaves are covered in fine hairs, and it produces a milky sap that can cause skin irritation. Acalypha hederacea is often cultivated for its ornamental value and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hederacea is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments and is often seen in forest understories or along stream banks. It is also present in parts of northern Australia and the Pacific Islands. Its distribution is closely linked to warm, humid climates with well-drained to moderately wet soils.",
    "distribution_introduced_art_desc": "Acalypha hederacea was mainly introduced to new habitats through human activities such as landscaping and gardening. It is commonly found in disturbed areas like roadsides, abandoned fields, and urban environments. The plant spreads primarily through its prolific seed production and ability to thrive in a variety of soil types. Its rapid growth and adaptability have led to its establishment in regions outside its native range. However, it is not considered invasive in most areas where it has been introduced."
}
