{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ruiziana",
    "plant_slug": "acalypha-ruiziana",
    "plant_name_scientific": "acalypha ruiziana",
    "intro": "Acalypha ruiziana, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Central and South America. It belongs to the Euphorbiaceae family and is characterized by its striking red veins on its heart-shaped leaves. The plant produces small, greenish flowers that are clustered in inflorescences called cyathia. It thrives in moist, shaded environments and is often found in humid forests. Acalypha ruiziana is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha ruiziana"
    },
    "taxonomy_art_desc": "Acalypha ruiziana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cottontree,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha ruiziana, a specific type of plant within the genus Acalypha, known for its unique morphological traits and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ruiziana is primarily native to Ecuador and Peru. It is found in the tropical regions of these countries, particularly in areas with moist and humid climates. This plant typically grows in lowland forests and disturbed habitats. It is known for its distinctive foliage and is often found in the understory of tropical rainforests. Its distribution is limited to specific ecological zones within these South American nations.",
    "distribution_introduced_art_desc": "Acalypha ruiziana was mainly introduced to the Pacific Islands, particularly in regions such as Hawaii, Guam, and the Mariana Islands. It was brought there as an ornamental plant due to its attractive foliage and unique growth habit. However, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed soils and can spread rapidly through vegetative propagation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
