{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fulva",
    "plant_slug": "acalypha-fulva",
    "plant_name_scientific": "acalypha fulva",
    "intro": "Acalypha fulva, commonly known as the red-hot poker, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its striking red bracts that surround its small yellow flowers, creating a vivid visual display. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are opposite, ovate, and often have a velvety texture with a reddish tinge. Acalypha fulva thrives in warm, humid climates and is often cultivated for its ornamental value in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha fulva"
    },
    "taxonomy_art_desc": "Acalypha fulva belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a variety of floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphologies and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their hairy foliage and showy inflorescences. Its species is Acalypha fulva, a specific type within the genus known for its distinctive red stems and yellow flowers, often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fulva is primarily native to Peru. It is commonly found in the Andean regions of the country, particularly in areas with moist, tropical climates. This plant thrives in humid environments and is often seen growing in forest understories or along riverbanks. It is known for its striking red bracts that attract pollinators. Its native distribution is largely confined to the western part of Peru, where it plays an important ecological role.",
    "distribution_introduced_art_desc": "Acalypha fulva was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant thrives in disturbed habitats such as roadsides, riverbanks, and waste areas. Its rapid growth and ability to form dense stands make it a concern for native ecosystems. Management efforts are ongoing to control its spread and minimize its impact on local biodiversity."
}
