{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha microcephala",
    "plant_slug": "acalypha-microcephala",
    "plant_name_scientific": "acalypha microcephala",
    "intro": "Acalypha microcephala, commonly known as velvetleaf or redleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, velvety leaves that range in color from deep red to green, often with a distinctive purple underside. The plant produces small, clustered flowers that are typically green or yellow, which bloom in the spring and summer months. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and abandoned fields. Acalypha microcephala is valued for its ornamental appeal and is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha microcephala"
    },
    "taxonomy_art_desc": "Acalypha microcephala belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false nettle,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha microcephala, a specific type of plant within the genus Acalypha, known for its small, rounded heads of flowers and is native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Gulf",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha microcephala is primarily native to the Mexico Gulf and Mexico Southwest regions. This plant is commonly found in tropical and subtropical areas within these regions. It thrives in moist, well-drained soils and is often associated with wetlands and riverbanks. The species is known for its small, clustered leaves and vibrant flowers. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acalypha microcephala was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, colorful foliage. It was initially brought for its aesthetic value, but it has since become an invasive species in some areas. The plant thrives in disturbed habitats and can outcompete native vegetation, leading to ecological concerns. Its spread has been documented in coastal areas and disturbed soils across the region. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
