{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrosperma",
    "plant_slug": "acalypha-macrosperma",
    "plant_name_scientific": "acalypha macrosperma",
    "intro": "Acalypha macrosperma, commonly known as the giant spurflower, is a striking shrub native to tropical and subtropical regions of the Americas. It is characterized by its large, showy flowers that often feature distinctive red or orange bracts, which are modified leaves that serve to attract pollinators. The plant has palmate leaves with lobed margins, giving it a unique and ornamental appearance. It thrives in well-drained soil and full sun, making it suitable for garden cultivation in warm climates. Its botanical features make it a popular choice for both ornamental landscaping and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrosperma is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in shaded to semi-shaded environments, often growing in forest understories or along stream banks. It is also present in parts of southern China and northern Australia. Its natural habitat includes wetlands, swamps, and other waterlogged areas where it can flourish.",
    "distribution_introduced_art_desc": "Acalypha macrosperma was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habits. However, it has since become naturalized and is now considered a potential weed in certain areas. The plant thrives in moist, well-drained soils and can spread through both seeds and vegetative reproduction. Its introduction has raised concerns about its impact on native ecosystems."
}
