{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chamaedrifolia var. genuina",
    "plant_slug": "acalypha-chamaedrifolia-var-genuina",
    "plant_name_scientific": "acalypha chamaedrifolia var. genuina",
    "intro": "Acalypha chamaedrifolia var. genuina, commonly known as the creeping croton, is a low-growing shrub native to parts of Southeast Asia. It features dense, mat-forming foliage with ovate to lanceolate leaves that are often dark green and slightly pubescent. The plant produces small, inconspicuous greenish-white flowers arranged in clusters, which are followed by three-lobed, persistent bracts that give it a distinctive appearance. It thrives in moist, shaded environments and is often found in forest understories. Its ornamental value comes from its dense growth habit and attractive foliage, making it a popular choice for ground cover in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chamaedrifolia var. genuina is primarily native to the eastern and southern regions of South America, specifically Brazil, Paraguay, and Argentina. It is commonly found in tropical and subtropical areas, often growing in shaded or semi-shaded environments. This plant thrives in moist, well-drained soils and is often associated with forest understories. It is known for its striking foliage and is sometimes cultivated as an ornamental plant. Its native range includes parts of the Amazon Basin and surrounding lowland areas.",
    "distribution_introduced_art_desc": "Acalypha chamaedrifolia var. genuina was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It thrives in tropical and subtropical climates, making it suitable for regions with warm temperatures year-round. This plant is often used in ornamental landscaping due to its attractive foliage and adaptability. It has been introduced to several Pacific island nations, including Hawaii and Guam, where it has become naturalized. However, its spread is limited by its preference for specific environmental conditions."
}
