{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha crassicaulis",
    "plant_slug": "acalypha-crassicaulis",
    "plant_name_scientific": "acalypha crassicaulis",
    "intro": "Acalypha crassicaulis, commonly known as the broad-stemmed spurflower, is a flowering plant native to tropical and subtropical regions of Asia. It is characterized by its sturdy, woody stems and showy, spade-shaped leaves that are often covered in fine hairs. The plant produces small, clustered flowers with prominent bracts that can range in color from red to purple, attracting various pollinators. It thrives in moist, well-drained soils and is often found in forest understories or along stream banks. Acalypha crassicaulis is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha crassicaulis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in shaded to semi-shaded environments, often growing along forest edges or in disturbed habitats. It is also known to occur in parts of the Pacific Islands, such as the Philippines and Papua New Guinea. Its native distribution reflects its adaptability to humid, warm climates with high rainfall.",
    "distribution_introduced_art_desc": "Acalypha crassicaulis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ease of cultivation. It was first recorded in the 19th century and has since become naturalized in several regions across the country. The plant thrives in moist, sunny environments and is commonly found along riverbanks and in coastal areas. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to concerns about its potential invasiveness. Despite its ornamental value, management efforts are being considered to prevent its spread into native ecosystems."
}
