{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lagopus",
    "plant_slug": "acalypha-lagopus",
    "plant_name_scientific": "acalypha lagopus",
    "intro": "Acalypha lagopus, commonly known as the silverleaf acalypha, is a flowering plant native to tropical and subtropical regions. It is characterized by its distinctive silver-gray foliage, which gives it its common name. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha lagopus is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive leaves.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lagopus"
    },
    "taxonomy_art_desc": "Acalypha lagopus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their spore-based reproduction and often possessing a vascular system. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malpighiales, a group of flowering plants that includes many species with diverse ecological adaptations and often features specialized structures like pseudostems. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha lagopus, a specific type of plant within the genus Acalypha, known for its distinctive appearance and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lagopus is primarily native to Mexico Southwest. It is commonly found in regions with tropical and subtropical climates. This plant thrives in areas with well-drained soil and adequate sunlight. It is often associated with disturbed habitats such as roadsides and open fields. Its distribution is limited to specific ecological niches within the southwestern part of Mexico.",
    "distribution_introduced_art_desc": "Acalypha lagopus was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by horticulturists or through accidental introduction via shipping routes. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments and can spread rapidly through its prolific seed production. Its introduction has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
