{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cardiophylla var. ponapensis",
    "plant_slug": "acalypha-cardiophylla-var-ponapensis",
    "plant_name_scientific": "acalypha cardiophylla var. ponapensis",
    "intro": "Acalypha cardiophylla var. ponapensis, commonly known as the Ponapé beautyleaf, is a tropical shrub native to the Caroline Islands. It is characterized by its striking, heart-shaped leaves that are often variegated with white and pink markings. The plant produces small, inconspicuous green flowers that are followed by red, fleshy fruits. It thrives in humid, shaded environments and is often cultivated for its ornamental value. Due to its limited distribution, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cardiophylla"
    },
    "taxonomy_art_desc": "Acalypha cardiophylla var. ponapensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often possessing true leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of forms and often produces milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their showy bracts and often hairy leaves. Its species is Acalypha cardiophylla, a specific type within the genus Acalypha, distinguished by its heart-shaped leaves and is a variant known as var. ponapensis.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Caroline Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cardiophylla var. ponapensis is primarily native to the Caroline Islands. This variant of the plant is found specifically on the island of Pohnpei, which is part of the Caroline Islands in the Pacific Ocean. It grows in coastal areas and lowland forests, adapting to the tropical climate of the region. The plant is known for its distinctive heart-shaped leaves and is an important part of the local flora. Its distribution is limited to this specific geographic area, making it a unique species within the region.",
    "distribution_introduced_art_desc": "Acalypha cardiophylla var. ponapensis was mainly introduced to the Northern Mariana Islands. It was brought there as an ornamental plant due to its unique foliage. The distribution of this species is limited to specific islands within the region. It has not been found outside of these islands, indicating a restricted range. This introduction has raised concerns about its potential impact on local ecosystems."
}
