{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha integrifolia var. colorata",
    "plant_slug": "acalypha-integrifolia-var-colorata",
    "plant_name_scientific": "acalypha integrifolia var. colorata",
    "intro": "Acalypha integrifolia var. colorata, commonly known as the red-veined nettle or velvetleaf, is a strikingly ornamental plant native to tropical regions of Asia. It is characterized by its palmate leaves with bright red veins contrasting against dark green foliage. The plant produces small, inconspicuous greenish-white flowers arranged in clusters, which are followed by spherical, reddish-brown seed capsules. It thrives in warm, humid climates and is often cultivated for its vibrant leaf coloration. Due to its rapid growth and potential invasiveness, it requires careful management in gardens and natural habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha integrifolia var. colorata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant is often associated with rainforests and secondary growth habitats. It thrives in humid climates and is sometimes cultivated for its ornamental value due to its colorful foliage. The plant is also present in parts of the Pacific Islands and northern Australia.",
    "distribution_introduced_art_desc": "Acalypha integrifolia var. colorata was mainly introduced to ornamental horticulture and landscaping due to its vibrant foliage and ornamental value. It is commonly cultivated in tropical and subtropical regions for its colorful leaves that display shades of red, purple, and green. The plant is often used in garden design to add visual interest and is favored for its ability to thrive in shaded to partially sunny conditions. It has been introduced to various parts of the world, including the United States, Australia, and parts of Southeast Asia. However, it is important to note that it may become invasive in certain environments if not managed properly."
}
