{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha liebmannii",
    "plant_slug": "acalypha-liebmannii",
    "plant_name_scientific": "acalypha liebmannii",
    "intro": "Acalypha liebmannii, commonly known as the silverleaf acalypha, is a shrub native to tropical and subtropical regions of Africa. It is characterized by its striking silver-green foliage, which gives it a unique appearance in gardens. The plant produces small, clustered flowers that are typically green or reddish in color. It thrives in well-drained soil and full sun to partial shade, making it a versatile choice for landscaping. Its ornamental value is enhanced by its ability to tolerate drought and coastal conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha liebmannii is primarily native to tropical and subtropical regions of Africa, including countries such as South Africa, Kenya, Tanzania, and Madagascar. It thrives in moist, well-drained soils and is commonly found in savannas, woodlands, and along riverbanks. This plant is often associated with humid environments and can be found in both natural and disturbed habitats. It is known for its striking foliage, which makes it a popular ornamental plant in horticulture. Its native distribution reflects its adaptation to the diverse climates of sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Acalypha liebmannii was mainly introduced to ornamental horticulture due to its attractive, colorful foliage. It is commonly cultivated in gardens and as a houseplant because of its unique leaf patterns and vibrant colors. The plant is native to tropical and subtropical regions of Africa but has been widely distributed in other parts of the world. It thrives in warm, humid climates and requires well-draining soil to prevent root rot. Despite its ornamental value, it can become invasive in some areas if not properly managed."
}
