{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha villicaulis",
    "plant_slug": "acalypha-villicaulis",
    "plant_name_scientific": "acalypha villicaulis",
    "intro": "Acalypha villicaulis, commonly known as the silky hibiscus, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its soft, silky hairs covering its stems and leaves, giving it a distinctive appearance. The plant produces showy, trumpet-shaped flowers in shades of red, orange, and yellow, which bloom in clusters. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Acalypha villicaulis is also valued for its use in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha villicaulis is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant thrives in lowland areas and is typically associated with forest understories or disturbed sites. It is also present in parts of Indonesia and the Indian subcontinent. Its distribution is largely limited to regions with warm, humid climates and well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha villicaulis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ease of cultivation. It was first recorded in the 19th century and has since become naturalized in various regions across the country. The plant thrives in moist, shady environments and is commonly found in forest margins and along stream banks. Its rapid growth and ability to spread through seeds have led to its classification as a potential weed in some areas. Despite its ornamental value, it is important to monitor its spread to prevent ecological disruption."
}
