{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula",
    "plant_slug": "acalypha-parvula",
    "plant_name_scientific": "acalypha parvula",
    "intro": "Acalypha parvula, commonly known as the small-leaved spurflower, is a flowering plant native to tropical and subtropical regions of Africa, Asia, and the Pacific. It is a herbaceous annual or perennial species that typically grows to a height of 30–100 cm. The plant features small, opposite leaves that are usually ovate or elliptic in shape, with a smooth or slightly hairy surface. Its showy, spurge-like flowers are usually yellow or orange and appear in clusters, attracting various pollinators. Acalypha parvula is often cultivated as an ornamental plant due to its compact growth habit and colorful blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha parvula"
    },
    "taxonomy_art_desc": "Acalypha parvula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large order of flowering plants that includes many tropical and subtropical species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse growth forms and sometimes toxic properties. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy leaves. Its species is Acalypha parvula, a specific type within the genus Acalypha, known for its small size and unique morphological features adapted to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula is primarily native to the Galápagos Islands. This plant is found in the unique ecosystems of the Galápagos, where it has adapted to the specific environmental conditions. It thrives in the volcanic soils and coastal areas of the archipelago. Due to its restricted range, it is considered a rare and endemic species. Conservation efforts are crucial to protect its habitat and ensure its survival.",
    "distribution_introduced_art_desc": "Acalypha parvula was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and abandoned lands. It thrives in tropical and subtropical climates, making it common in regions with warm temperatures and moderate rainfall. The plant spreads rapidly through its prolific seed production and ability to establish itself in nutrient-poor environments. It is often considered an invasive species in some areas due to its competitive nature and rapid growth. Its introduction has led to concerns about its impact on native plant communities and ecosystem balance."
}
