{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha villosa var. genuina",
    "plant_slug": "acalypha-villosa-var-genuina",
    "plant_name_scientific": "acalypha villosa var. genuina",
    "intro": "Acalypha villosa var. genuina, commonly known as the velvetleaf or velvetleaf maple, is a flowering plant native to Southeast Asia. It is characterized by its soft, velvety foliage, which gives it its common name. The plant produces small, greenish-white flowers arranged in clusters, which are typically borne in the axils of the leaves. Its leaves are ovate to elliptic in shape, with a prominent midrib and a hairy underside. It is often found in moist, shaded environments and is sometimes cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha villosa var. genuina is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant is often associated with disturbed habitats like roadsides, riverbanks, and open woodlands. It thrives in warm climates with high humidity and is sometimes cultivated as an ornamental plant. Its native range extends to parts of the Indian subcontinent as well.",
    "distribution_introduced_art_desc": "Acalypha villosa var. genuina was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It thrives in environments with partial to full sunlight and is often cultivated as an ornamental plant due to its attractive foliage. This species is commonly found in gardens and landscaped areas in countries like Hawaii, Puerto Rico, and parts of Southeast Asia. Its introduction has sometimes led to its naturalization in certain regions, where it can compete with native flora. Due to its adaptability, it is also used in erosion control and as a ground cover in disturbed sites."
}
