{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ciliata var. genuina",
    "plant_slug": "acalypha-ciliata-var-genuina",
    "plant_name_scientific": "acalypha ciliata var. genuina",
    "intro": "Acalypha ciliata var. genuina, commonly known as the velvetleaf or silkyleaf, is a shrub native to tropical and subtropical regions. It features heart-shaped leaves with soft, velvety textures on the upper surface and smooth, glossy undersides. The plant produces small, inconspicuous greenish-white flowers that are often clustered in spikes. It thrives in moist, well-drained soils and is often found in woodland or coastal areas. Its ornamental value comes from its attractive foliage rather than its flowers.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ciliata var. genuina is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with rainforests or secondary growth habitats. It is also present in parts of the Philippines and has been introduced to other tropical regions. Its native range extends across the Indo-Malayan region, where it is a common undergrowth species.",
    "distribution_introduced_art_desc": "Acalypha ciliata var. genuina was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred in the 19th century during the period of European colonization. It has since become naturalized in certain regions, particularly in the North Island. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
