{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha corchorifolia",
    "plant_slug": "acalypha-corchorifolia",
    "plant_name_scientific": "acalypha corchorifolia",
    "intro": "Acalypha corchorifolia, commonly known as silkyleaf ironwood, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its lance-shaped leaves that are covered in fine, silky hairs, giving it a distinctive appearance. The plant produces small, yellowish-green flowers arranged in clusters, which are typically followed by capsule fruits containing numerous seeds. It thrives in well-drained soils and is often found in coastal areas or dry woodlands. Due to its ornamental value and hardy nature, it is occasionally cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha corchorifolia is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with secondary forests and disturbed habitats. It is also known to occur in parts of the Pacific Islands, including Hawaii and the Philippines. Acalypha corchorifolia is a versatile species that can adapt to a variety of environmental conditions within its native range.",
    "distribution_introduced_art_desc": "Acalypha corchorifolia was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in restoration projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its ornamental qualities, with its vibrant foliage making it a popular choice in landscaping. However, it has been known to spread aggressively, sometimes becoming invasive in certain regions. Despite its benefits, its introduction requires careful management to prevent ecological imbalances."
}
