{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tricholoba",
    "plant_slug": "acalypha-tricholoba",
    "plant_name_scientific": "acalypha tricholoba",
    "intro": "Acalypha tricholoba, commonly known as the velvetleaf or redroot, is a flowering plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family and is characterized by its striking, often colorful bracts that resemble flowers. The plant has palmate leaves with a soft, velvety texture, and it produces small, inconspicuous yellow flowers clustered in complex inflorescences. Acalypha tricholoba is often found in disturbed soils and can thrive in a variety of light conditions. It is sometimes cultivated as an ornamental plant due to its attractive foliage and unique floral structures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha tricholoba"
    },
    "taxonomy_art_desc": "Acalypha tricholoba belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse habitats and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with unique structures like cyathia and a wide variety of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha tricholoba, a specific plant within the genus Acalypha, distinguished by its hairy leaves and unique floral structures, commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tricholoba is primarily native to Guatemala and the southeastern part of Mexico. It is commonly found in tropical and subtropical regions within these areas. This plant typically grows in moist, shaded environments such as forests and shrublands. It is well adapted to the humid climate and rich soil conditions of its native range. The species plays an important role in the local ecosystems of these regions.",
    "distribution_introduced_art_desc": "Acalypha tricholoba was mainly introduced to the Pacific Islands as an ornamental plant due to its attractive foliage and adaptability to tropical climates. It has since spread beyond its initial introduction sites, becoming naturalized in several regions across the region. The plant is often found in disturbed areas, such as roadsides and abandoned lands, where it can thrive with minimal care. Its rapid growth and ability to reproduce vegetatively have contributed to its spread and establishment in new habitats. However, it is not considered highly invasive and does not pose significant ecological threats in most areas where it is found."
}
