{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica",
    "plant_slug": "acalypha-virginica",
    "plant_name_scientific": "acalypha virginica",
    "intro": "Acalypha virginica, commonly known as the smoothleaf or redroot beggarlice, is a flowering plant native to the eastern United States. It is a herbaceous perennial that typically grows in moist, shaded habitats such as woodlands and stream banks. The plant features opposite, ovate leaves with a smooth texture and a reddish hue on the underside. Its small, greenish-white flowers are clustered in dense, spike-like inflorescences. Acalypha virginica is often found in wetlands and is known for its ability to thrive in nutrient-poor soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha virginica"
    },
    "taxonomy_art_desc": "Acalypha virginica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral and vegetative features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphological features and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"Indian spinach,\" characterized by their showy flowers and often hairy leaves. Its species is Acalypha virginica, a specific type of plant native to North America, known for its ornamental value and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Alabama",
        "Arkansas",
        "Connecticut",
        "Delaware",
        "District of Columbia",
        "Georgia",
        "Illinois",
        "Indiana",
        "Iowa",
        "Kansas",
        "Kentucky",
        "Louisiana",
        "Maryland",
        "Massachusetts",
        "Michigan",
        "Mississippi",
        "Missouri",
        "Nebraska",
        "New Hampshire",
        "New Jersey",
        "New York",
        "North Carolina",
        "Ohio",
        "Oklahoma",
        "Pennsylvania",
        "Rhode I.",
        "South Carolina",
        "Tennessee",
        "Texas",
        "Virginia",
        "West Virginia"
    ],
    "distribution_introduced": [
        "Italy",
        "Madeira"
    ],
    "distribution_native_art_desc": "Acalypha virginica is primarily native to Alabama, Arkansas, Connecticut, Delaware, District of Columbia, Georgia, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maryland, Massachusetts, Michigan, Mississippi, Missouri, Nebraska, New Hampshire, New Jersey, New York, North Carolina, Ohio, Oklahoma, Pennsylvania, Rhode Island, South Carolina, Tennessee, Texas, Virginia, and West Virginia. It is commonly found in moist to wet habitats such as swamps, marshes, and along stream banks. This species thrives in the southeastern and midwestern United States. It is often found growing in dense thickets and along the edges of wetlands. Its native range spans a wide geographic area across the eastern United States.",
    "distribution_introduced_art_desc": "Acalypha virginica was mainly introduced to Italy and Madeira. It is a flowering plant native to the southeastern United States. The introduction to these regions likely occurred through horticultural or ornamental purposes. It has adapted well to the local climates in both areas. This distribution highlights its potential as an invasive species in non-native habitats."
}
