{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha shirensis",
    "plant_slug": "acalypha-shirensis",
    "plant_name_scientific": "acalypha shirensis",
    "intro": "Acalypha shirensis, commonly known as the Shirensis spurflower, is a flowering plant native to the tropical regions of Africa. It belongs to the Euphorbiaceae family, which is known for its diverse and often unique botanical features. The plant is characterized by its striking, spiky inflorescence and alternate, ovate leaves with a smooth or slightly hairy surface. It typically grows in moist, shaded environments such as forest understories. Acalypha shirensis is valued for its ornamental appeal and plays a role in local ecosystems by providing habitat and food for various insects and small animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha shirensis is primarily native to the island of Shire, which is part of the Comoros archipelago in the Indian Ocean. This plant is found in the tropical and subtropical regions of the area, particularly in moist, forested habitats. It thrives in humid climates with well-drained soils, often growing in the understory of dense vegetation. The species is adapted to the unique ecological conditions of the Comoros, where it plays a role in local biodiversity. Due to its restricted range, it is considered a rare and endemic plant in the region.",
    "distribution_introduced_art_desc": "Acalypha shirensis was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activity. It thrives in environments with moderate to high sunlight and well-drained soil conditions. This plant is commonly found in disturbed areas such as roadsides, abandoned fields, and along riverbanks. Its rapid growth and ability to colonize new areas make it an invasive species in many regions. It is often spread through seeds carried by wind, water, or animals."
}
