{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha erubescens",
    "plant_slug": "acalypha-erubescens",
    "plant_name_scientific": "acalypha erubescens",
    "intro": "Acalypha erubescens, commonly known as red-hot poker, is a striking ornamental plant native to tropical regions of Africa. It is characterized by its tall, spike-like inflorescences that bear bright red bracts, which are modified leaves that serve as colorful attractants for pollinators. The plant produces small, inconspicuous white flowers within the bract clusters, which are often overlooked due to the showy display of the bracts. It thrives in full sun and well-drained soil, making it a popular choice for gardens and landscapes. Acalypha erubescens is relatively drought-tolerant once established, though it requires regular watering during its growing season.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha erubescens is primarily native to Mexico Northeast. This plant is commonly found in the northeastern regions of Mexico, including states such as Tamaulipas and Nuevo León. It thrives in tropical and subtropical climates, often growing in disturbed soils and along riverbanks. The species is known for its vibrant red bracts, which make it a popular ornamental plant. Its native range is limited to this specific geographic area within Mexico.",
    "distribution_introduced_art_desc": "Acalypha erubescens was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its vibrant red foliage and unique appearance. It was brought there in the late 19th or early 20th century by horticulturalists and gardeners who sought to add exotic plant species to local landscapes. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in tropical and subtropical climates, often spreading through seeds dispersed by birds and water. Its introduction highlights the dual role of ornamental plants in both beautifying environments and posing ecological risks."
}
