{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha aristata",
    "plant_slug": "acalypha-aristata",
    "plant_name_scientific": "acalypha aristata",
    "intro": "Acalypha aristata, commonly known as the arrowleaf spurflower, is a flowering plant native to the tropical regions of Africa, particularly South Africa. It belongs to the Euphorbiaceae family, which is known for its diverse and often ornamental species. The plant is characterized by its distinctive arrow-shaped leaves, which are typically bright green and have a smooth texture. It produces small, inconspicuous flowers that are clustered in inflorescences, often surrounded by colorful bracts. Acalypha aristata is often cultivated for its attractive foliage and is used in ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha aristata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with forest understories or along riverbanks. It is also present in parts of Indonesia and the Philippines. Acalypha aristata is known for its ornamental value and is sometimes cultivated in gardens in tropical climates.",
    "distribution_introduced_art_desc": "Acalypha aristata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first brought to the country in the late 19th century by European settlers who admired its aesthetic value. Despite its ornamental appeal, it has since become naturalized in several regions, particularly in coastal and disturbed areas. Its spread has raised concerns among ecologists due to its potential to outcompete native species in certain environments. However, it remains primarily a garden plant with limited impact on native ecosystems compared to other invasive species."
}
