{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula var. genuina",
    "plant_slug": "acalypha-parvula-var-genuina",
    "plant_name_scientific": "acalypha parvula var. genuina",
    "intro": "Acalypha parvula var. genuina, commonly known as the smallleaf spurge or narrowleaf spurge, is a herbaceous plant native to the southeastern United States. It features small, ovate leaves that are typically arranged oppositely along the stem. The plant produces clusters of tiny, greenish-yellow flowers that are borne in dense, terminal inflorescences. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Its rapid growth and ability to spread vegetatively make it an aggressive weed in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula var. genuina is primarily native to the Caribbean islands, including Puerto Rico, the Virgin Islands, and parts of the Lesser Antilles. This plant is commonly found in coastal areas and disturbed sites, such as roadsides and abandoned fields. It thrives in sandy or loamy soils and is often associated with tropical and subtropical climates. The species is known for its small, colorful bracts that attract pollinators like bees and butterflies. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acalypha parvula var. genuina was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners seeking exotic plants for cultivation. The introduction has led to its establishment in natural areas, where it can compete with native species. Despite its ornamental value, it is considered a potential invasive species in some regions. Its distribution is now limited to specific areas where it has been planted or has spread naturally."
}
