{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha piperoides",
    "plant_slug": "acalypha-piperoides",
    "plant_name_scientific": "acalypha piperoides",
    "intro": "Acalypha piperoides, commonly known as the pepperleaf or piperweed, is a flowering plant native to tropical regions of the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its opposite, ovate leaves with a rough texture. The plant produces small, greenish-yellow flowers arranged in clusters, followed by three-lobed seed capsules. Its leaves are often used in traditional medicine and as a spice due to their pungent aroma. The plant thrives in moist, well-drained soils and is often found in humid, tropical climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha piperoides is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments within forests or along stream banks. This plant is also native to parts of Oceania, including New Guinea and some Pacific islands. It thrives in humid climates and is often associated with disturbed or secondary vegetation. Its native range extends into northern Australia as well.",
    "distribution_introduced_art_desc": "Acalypha piperoides was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed soils, along roadsides, and in degraded habitats due to its rapid growth and adaptability. The plant has become naturalized in several countries, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. Its introduction has led to both ecological benefits and concerns due to its invasive potential in some areas. However, it is also valued for its aesthetic appeal and ability to stabilize soil in degraded landscapes."
}
