{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha madreporica",
    "plant_slug": "acalypha-madreporica",
    "plant_name_scientific": "acalypha madreporica",
    "intro": "Acalypha madreporica, commonly known as the velvetleaf or mother-of-pearl plant, is a species of flowering plant in the Euphorbiaceae family. It is native to tropical regions of Africa and is characterized by its distinctive, velvety foliage. The plant produces small, clustered flowers that are often surrounded by modified leaves called bracts. It thrives in moist, shaded environments and is often found in woodland areas. Acalypha madreporica is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha madreporica is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland forests and wetlands. This plant thrives in humid environments with well-drained soil and abundant sunlight. It is often associated with disturbed habitats and can be found near riverbanks and in secondary growth areas. Its native distribution is closely linked to the biodiversity hotspots of the region.",
    "distribution_introduced_art_desc": "Acalypha madreporica was mainly introduced to the coastal regions of Southeast Asia, particularly in countries like Indonesia and the Philippines. It was likely introduced through human activities such as trade or accidental transport of plant materials. The plant thrives in moist, shaded environments and has become established in disturbed habitats along shorelines. Its rapid growth and ability to spread via seeds have led to its proliferation in these areas. However, its impact on native ecosystems is still being studied."
}
