{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis var. obscura",
    "plant_slug": "acalypha-communis-var-obscura",
    "plant_name_scientific": "acalypha communis var. obscura",
    "intro": "Acalypha communis var. obscura, commonly known as the dark-leaved spurge, is a herbaceous plant native to tropical and subtropical regions. It features dark green, ovate leaves with a velvety texture and prominent veins. The plant produces small, greenish-white flowers arranged in clusters, which are often overlooked due to their modest appearance. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded areas. Its foliage is valued in ornamental horticulture for its striking coloration and texture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis var. obscura is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variety thrives in humid climates and is often associated with secondary forests and disturbed habitats. It is also present in parts of the Pacific Islands, including Hawaii and New Guinea. Its natural range extends into northern Australia, where it grows in similar environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha communis var. obscura was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique appearance. It is commonly cultivated in tropical and subtropical regions for its ornamental value. The plant has been introduced to various countries, including parts of the United States, Australia, and Southeast Asia. Its introduction has sometimes led to concerns about its potential invasiveness in non-native environments. Proper management is recommended to prevent its spread beyond cultivated areas."
}
