{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha glandulosa var. brevistachya",
    "plant_slug": "acalypha-glandulosa-var-brevistachya",
    "plant_name_scientific": "acalypha glandulosa var. brevistachya",
    "intro": "Acalypha glandulosa var. brevistachya, commonly known as the narrow-stemmed glorybower, is a flowering plant native to tropical regions of Africa. It is characterized by its slender, branching stems and showy, clustered inflorescences that range from red to orange in color. The leaves are typically ovate to elliptical, with a smooth or slightly hairy surface, and the plant produces small, inconspicuous flowers that develop into capsule fruits. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha glandulosa var. brevistachya is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. This variant is commonly found in lowland rainforests and secondary growth areas. It thrives in humid, shaded environments with well-drained soil. The plant is often seen growing along riverbanks and in moist forest undergrowth. Its native distribution reflects its adaptation to the warm, humid climates of these regions.",
    "distribution_introduced_art_desc": "Acalypha glandulosa var. brevistachya was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The variety is favored for its compact size and ability to thrive in shaded to partially sunny conditions. It has been reported in several countries outside its native range, including parts of Southeast Asia and the Pacific Islands. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
