{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lyonsii",
    "plant_slug": "acalypha-lyonsii",
    "plant_name_scientific": "acalypha lyonsii",
    "intro": "Acalypha lyonsii, commonly known as Lyon's spurge, is a flowering plant native to the southeastern United States. It is a herbaceous perennial that typically grows in moist, shaded environments such as woodlands and stream banks. The plant features opposite, ovate leaves with a rough, hairy texture, and it produces small, greenish-yellow flowers in clusters. Its botanical characteristics include a woody stem that becomes more pronounced with age, and it is often found in wetland habitats. Lyon's spurge is notable for its ecological role in supporting local insect populations and its adaptability to humid climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lyonsii"
    },
    "taxonomy_art_desc": "Acalypha lyonsii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, often featuring a distinct life cycle with a gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological adaptations and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha lyonsii, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lyonsii is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in wetlands, swamps, and along waterways. It is commonly associated with riparian habitats and is often found in areas with high moisture levels. Its native distribution is largely confined to the northeastern parts of Queensland.",
    "distribution_introduced_art_desc": "Acalypha lyonsii was mainly introduced to Hawaii. It was brought there by early European settlers and has since become naturalized in certain areas. The plant thrives in disturbed soils and is commonly found in coastal and lowland habitats. It is considered an invasive species in some parts of the Hawaiian Islands. Due to its rapid growth and ability to spread, it poses a threat to native vegetation."
}
