{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha repanda var. repanda",
    "plant_slug": "acalypha-repanda-var-repanda",
    "plant_name_scientific": "acalypha repanda var. repanda",
    "intro": "Acalypha repanda var. repanda, commonly known as the velvetleaf or redleaf plant, is a species of flowering plant in the family Euphorbiaceae. It is native to tropical and subtropical regions of Asia, including India, China, and Southeast Asia. The plant is characterized by its striking, velvety leaves that are often red or purple on the underside, giving it a distinctive appearance. It produces small, clustered flowers that are typically greenish-yellow, and it thrives in humid, warm climates with well-drained soil. Acalypha repanda var. repanda is often cultivated as an ornamental plant due to its aesthetic appeal and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha repanda"
    },
    "taxonomy_art_desc": "Acalypha repanda var. repanda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, which is a large group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants that includes many species with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of morphological features. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy foliage. Its species is Acalypha repanda, a specific plant within the genus Acalypha that is characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji",
        "Samoa",
        "Tonga",
        "Vanuatu"
    ],
    "distribution_introduced": [
        "Society Is."
    ],
    "distribution_native_art_desc": "Acalypha repanda var. repanda is primarily native to Fiji, Samoa, Tonga, and Vanuatu. This plant is commonly found in coastal areas and lowland forests within these island nations. It thrives in tropical climates with high humidity and well-drained soils. The species is often seen growing along riverbanks and in shaded undergrowth. Its natural distribution reflects its adaptation to the unique ecological conditions of the Pacific Islands.",
    "distribution_introduced_art_desc": "Acalypha repanda var. repanda was mainly introduced to Society Is. It is believed to have been brought there intentionally for ornamental purposes due to its attractive foliage and unique growth habit. The plant has since become established in the local environment, thriving in the tropical climate. It is commonly found in gardens and along coastal areas where it can receive ample sunlight. However, its introduction has raised concerns about its potential impact on native plant species."
}
