{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pilosa",
    "plant_slug": "acalypha-pilosa",
    "plant_name_scientific": "acalypha pilosa",
    "intro": "Acalypha pilosa, commonly known as the hairy ironweed, is a flowering plant native to tropical regions of the Americas. It is characterized by its soft, hairy leaves that give it a distinctive, fuzzy appearance. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shady environments and is often found in woodland areas. Acalypha pilosa is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pilosa"
    },
    "taxonomy_art_desc": "Acalypha pilosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive leaf and flower morphology. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their hairy foliage and showy inflorescences. Its species is Acalypha pilosa, a specific type of plant within the genus Acalypha, known for its soft, hairy leaves and clusters of small flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest",
        "Panamá"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pilosa is primarily native to Mexico Southwest and Panama. It is commonly found in tropical and subtropical regions within these areas. The plant thrives in moist, shaded environments, often near streams or in forest understories. It is known for its hairy, branched stems and small, clustered leaves. Its native distribution is limited to specific regions in Central America.",
    "distribution_introduced_art_desc": "Acalypha pilosa was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since become naturalized in certain regions, particularly in coastal and urban areas where it thrives in disturbed soils. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its establishment in non-native habitats. While it is not considered a major invasive species, it can outcompete native vegetation in some environments. Its distribution in New Zealand is primarily limited to the North Island and parts of the South Island."
}
