{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brasiliensis f. microphylla",
    "plant_slug": "acalypha-brasiliensis-f-microphylla",
    "plant_name_scientific": "acalypha brasiliensis f. microphylla",
    "intro": "Acalypha brasiliensis f. microphylla, commonly known as the small-leaved flame tree, is a tropical shrub or small tree native to South America. It is characterized by its striking, brightly colored bracts that resemble flowers, which are actually modified leaves. The plant has palmate leaves with a velvety texture and a deep green color. It thrives in warm, humid climates and is often cultivated for its ornamental value. The species is also noted for its ability to tolerate a range of soil types and its resilience to urban environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brasiliensis f. microphylla is primarily native to South America, particularly Brazil. It is found in the tropical regions of the country, including the Amazon rainforest. This plant thrives in moist, shaded environments and is commonly found in forest understories. It is also present in parts of Central America and the Caribbean. Its distribution is closely linked to humid lowland forests and riparian zones.",
    "distribution_introduced_art_desc": "Acalypha brasiliensis f. microphylla was mainly introduced to ornamental horticulture due to its attractive foliage and compact growth habit. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The introduction has led to its establishment in some non-native areas, where it may compete with native flora. Its spread is often associated with human activities such as landscaping and garden planting. However, its impact on local ecosystems remains relatively limited compared to other invasive species."
}
