{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tenuipes",
    "plant_slug": "acalypha-tenuipes",
    "plant_name_scientific": "acalypha tenuipes",
    "intro": "Acalypha tenuipes, commonly known as the slender-leaved glory flower, is a flowering plant native to Southeast Asia. It is characterized by its delicate, narrow leaves and clusters of small, showy flowers that range in color from white to pink. The plant typically grows as an herbaceous annual or perennial, depending on the climate. Its flowers are often visited by pollinators such as bees and butterflies, contributing to its ecological significance. Acalypha tenuipes is valued in horticulture for its ornamental appeal and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tenuipes is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland environments, often found in rainforests and along riverbanks. This plant is commonly associated with disturbed soils and can be found in secondary growth areas. It is also present in parts of the Pacific Islands, such as Guam and Hawaii, where it has been introduced. Its distribution is closely linked to its ability to adapt to varied soil conditions and high humidity levels.",
    "distribution_introduced_art_desc": "Acalypha tenuipes was mainly introduced to the Pacific Islands as an ornamental plant due to its attractive foliage and compact growth habit. It has been reported in several regions including Hawaii, Guam, and parts of French Polynesia. The plant thrives in tropical and subtropical climates, often growing in disturbed soils and along roadsides. Its introduction has raised concerns due to its potential to become invasive in native ecosystems. Despite its aesthetic appeal, careful management is recommended to prevent its spread into natural habitats."
}
