{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha caroliniana",
    "plant_slug": "acalypha-caroliniana",
    "plant_name_scientific": "acalypha caroliniana",
    "intro": "Acalypha caroliniana, commonly known as Carolina beauty, is a flowering plant native to the southeastern United States. It is a shrub or small tree that typically grows to a height of 3 to 10 feet. The plant features palmate leaves with five to seven lobes, giving it a distinctive appearance. It produces small, greenish-yellow flowers that are clustered in spike-like inflorescences. The plant is often cultivated for its ornamental value and is adapted to a variety of soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha caroliniana is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and North Carolina. It is commonly found in wetlands, swampy areas, and along the edges of ponds and streams. This plant thrives in moist to wet soil conditions and is often part of the vegetation in freshwater habitats. It is also occasionally found in parts of Texas and along the Gulf Coast. Acalypha caroliniana is an important component of the wetland ecosystems it inhabits.",
    "distribution_introduced_art_desc": "Acalypha caroliniana was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was originally native to tropical and subtropical regions of the Americas. The plant was introduced as an ornamental due to its attractive foliage and unique growth habit. It has since naturalized in some areas, becoming part of the local flora. However, it is not considered invasive and is often used in landscaping and restoration projects."
}
