{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wilkesiana",
    "plant_slug": "acalypha-wilkesiana",
    "plant_name_scientific": "acalypha wilkesiana",
    "intro": "Acalypha wilkesiana, commonly known as the \"Chinese lantern\" plant, is a tropical shrub native to Southeast Asia. It is characterized by its striking, papery bracts that resemble small lanterns, which are actually modified leaves rather than flowers. The plant produces small, inconspicuous flowers that are clustered within the colorful bracts. It thrives in warm, humid climates and is often grown as an ornamental plant for its vibrant foliage. Acalypha wilkesiana is relatively easy to care for, making it a popular choice for gardens and indoor spaces.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha wilkesiana"
    },
    "taxonomy_art_desc": "Acalypha wilkesiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Malpighiales, a large group of flowering plants that includes species with diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes many plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"pincushion plants,\" characterized by their colorful bracts and showy flowers. Its species is Acalypha wilkesiana, a tropical shrub known for its striking foliage and is often cultivated as an ornamental plant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bismarck Archipelago",
        "Fiji",
        "Solomon Is.",
        "Tuvalu",
        "Vanuatu"
    ],
    "distribution_introduced": [
        "Bangladesh",
        "Bolivia",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Caroline Is.",
        "China South-Central",
        "China Southeast",
        "Comoros",
        "Cook Is.",
        "Cuba",
        "Dominican Republic",
        "DR Congo",
        "Ecuador",
        "Florida",
        "Gilbert Is.",
        "Guinea",
        "Gulf of Guinea Is.",
        "Hainan",
        "Haiti",
        "Hawaii",
        "India",
        "Jamaica",
        "Leeward Is.",
        "Line Is.",
        "Madagascar",
        "Marianas",
        "Marquesas",
        "Marshall Is.",
        "Mexico Central",
        "Nauru",
        "Nicobar Is.",
        "Niue",
        "Norfolk Is.",
        "Paraguay",
        "Puerto Rico",
        "Rwanda",
        "Society Is.",
        "Thailand",
        "Tonga",
        "Trinidad-Tobago",
        "Tuamotu",
        "Tubuai Is.",
        "Venezuelan Antilles"
    ],
    "distribution_native_art_desc": "Acalypha wilkesiana is primarily native to the Bismarck Archipelago, Fiji, Solomon Is., Tuvalu, and Vanuatu. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in coastal and lowland environments, often growing near water sources. The species is known for its vibrant foliage and is often used in ornamental gardening. Its native distribution reflects its adaptation to the warm, humid climates of the Pacific Islands.",
    "distribution_introduced_art_desc": "Acalypha wilkesiana was mainly introduced to tropical and subtropical regions across Asia, Africa, the Americas, and the Pacific Islands. It has been established in countries such as Bangladesh, Brazil, China, Cuba, India, Jamaica, Madagascar, Mexico, and the Philippines. The plant thrives in warm climates and is often found in urban and coastal areas. Its introduction is likely due to ornamental use, as it is valued for its colorful foliage. It has become naturalized in many of these regions, sometimes posing ecological challenges."
}
