{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha siamensis var. denticulata",
    "plant_slug": "acalypha-siamensis-var-denticulata",
    "plant_name_scientific": "acalypha siamensis var. denticulata",
    "intro": "Acalypha siamensis var. denticulata, commonly known as the Siam hibiscus or toothed leaf acalypha, is a tropical shrub native to Southeast Asia. It features striking, palmately lobed leaves with serrated edges, giving it a distinctive appearance. The plant produces clusters of small, showy flowers in shades of red, pink, and white, which bloom throughout the warm season. It thrives in moist, well-drained soil and partial to full sunlight, making it a popular choice for ornamental gardening. Its unique foliage and vibrant blooms make it a valuable addition to tropical and subtropical landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha siamensis var. denticulata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Cambodia, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant of Acalypha siamensis thrives in humid climates and is often associated with secondary forests and disturbed habitats. It is also known to grow in coastal areas and near riverbanks. The plant is valued for its ornamental qualities and is sometimes cultivated for its colorful foliage.",
    "distribution_introduced_art_desc": "Acalypha siamensis var. denticulata was mainly introduced to ornamental horticulture due to its attractive foliage and unique appearance. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been reported in several countries, including the United States, Australia, and parts of Southeast Asia. Its introduction has raised concerns about potential invasiveness in non-native environments. Proper management is recommended to prevent its spread beyond controlled settings."
}
