{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sessilis var. exserta",
    "plant_slug": "acalypha-sessilis-var-exserta",
    "plant_name_scientific": "acalypha sessilis var. exserta",
    "intro": "Acalypha sessilis var. exserta, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Asia. It is characterized by its striking, velvety leaves with prominent red veins that contrast with its dark green foliage. The plant produces small, clustered greenish-white flowers that are typically borne in dense inflorescences. It thrives in moist, shaded environments and is often found in forests or along stream banks. Due to its ornamental value, it is cultivated as a decorative plant in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sessilis var. exserta is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This variant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also present in parts of northern Australia and the Pacific Islands. The plant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha sessilis var. exserta was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and coastal dunes. It thrives in full sun and is commonly found in tropical and subtropical regions. This plant is often spread through wind-dispersed seeds and can establish itself rapidly in new environments. Its adaptability makes it a potential invasive species in certain regions. It is important to monitor its spread to prevent ecological disruption."
}
