{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chordantha",
    "plant_slug": "acalypha-chordantha",
    "plant_name_scientific": "acalypha chordantha",
    "intro": "Acalypha chordantha, commonly known as the golden glory or velvetleaf, is a flowering plant native to Southeast Asia. It is characterized by its vibrant yellow bracts that surround small, inconspicuous flowers. The plant has opposite, ovate leaves with a smooth texture and a slightly waxy appearance. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Acalypha chordantha is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha chordantha"
    },
    "taxonomy_art_desc": "Acalypha chordantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized leaves and flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with latex and often showy flowers. Its genus is Acalypha, a group of flowering plants known for their showy, often colorful bracts and diverse growth forms. Its species is Acalypha chordantha, a specific plant within the genus Acalypha that is characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Costa Rica",
        "Honduras",
        "Nicaragua"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chordantha is primarily native to Costa Rica, Honduras, and Nicaragua. It is commonly found in tropical and subtropical regions within these countries. The plant thrives in moist, shaded environments, often growing in the understory of forests. It is known for its attractive foliage and is sometimes cultivated as an ornamental plant. Its native distribution is limited to these specific Central American nations.",
    "distribution_introduced_art_desc": "Acalypha chordantha was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through accidental transport via shipping or gardening activities. The plant thrives in disturbed areas and can outcompete native vegetation. Its rapid growth and ability to spread through seeds make it a significant ecological threat. Efforts are being made to control its spread and prevent further invasion of native habitats."
}
