{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha dregei",
    "plant_slug": "acalypha-dregei",
    "plant_name_scientific": "acalypha dregei",
    "intro": "Acalypha dregei, commonly known as the velvetleaf or red leaf plant, is a shrub native to tropical and subtropical regions of Africa. It is characterized by its striking, velvety foliage that ranges in color from deep red to green, depending on the season and light conditions. The plant produces small, inconspicuous flowers that are typically green or yellow, followed by three-lobed, papery bracts that give it its ornamental appeal. It thrives in well-drained soil and requires moderate to high levels of sunlight. Acalypha dregei is often cultivated for its aesthetic value in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha dregei"
    },
    "taxonomy_art_desc": "Acalypha dregei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a group of flowering plants that includes many species with diverse habitats and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"kangkong,\" characterized by their distinctive leaves and often colorful bracts. Its species is Acalypha dregei, a specific type of plant within the Acalypha genus, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha dregei is primarily native to the Cape Provinces of South Africa. This species is commonly found in the region's coastal areas and sandy soils. It thrives in the warm, temperate climate of the Cape Province. The plant is often seen in open woodlands and along the edges of fynbos vegetation. Its native distribution is closely tied to the unique ecological conditions of this area.",
    "distribution_introduced_art_desc": "Acalypha dregei was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage. It has been reported in parts of the southern United States, including Florida and Texas, where it thrives in tropical and subtropical conditions. The plant is considered invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its success in new environments. Proper management is necessary to prevent its spread and minimize ecological impact."
}
