{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tenera",
    "plant_slug": "acalypha-tenera",
    "plant_name_scientific": "acalypha tenera",
    "intro": "Acalypha tenera, commonly known as velvetleaf or silky ironweed, is a herbaceous plant native to tropical and subtropical regions. It is characterized by its soft, fuzzy leaves that give it a velvety texture. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, well-drained soils and is often found in disturbed areas. Acalypha tenera is valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tenera is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical rainforests and coastal areas where the climate is warm and humid. This plant thrives in shaded to semi-shaded environments and is often seen growing along riverbanks and in moist undergrowth. It is also present in parts of tropical Africa and the Pacific Islands. Due to its adaptability, it has been introduced to other regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acalypha tenera was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It was first brought to the country in the early 20th century by horticulturalists who sought to diversify the local plant palette. Despite its aesthetic appeal, the plant has since become invasive in some regions, outcompeting native species and altering local ecosystems. Its rapid growth and ability to spread through both seeds and vegetative reproduction have made it a challenge for land managers. Efforts are ongoing to control its spread while balancing its ornamental value."
}
