{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata var. cloiselana",
    "plant_slug": "acalypha-reticulata-var-cloiselana",
    "plant_name_scientific": "acalypha reticulata var. cloiselana",
    "intro": "Acalypha reticulata var. cloiselana, commonly known as the velvetleaf or cloisel's acalypha, is a striking ornamental plant native to tropical regions. It is characterized by its dense, velvety foliage that ranges from deep green to reddish hues, providing a rich visual texture. The plant features showy, clustered inflorescences that bloom in shades of red, orange, or yellow, adding vibrant color to its surroundings. Its leaves are often covered in fine, soft hairs, contributing to its tactile appeal. It thrives in warm, humid climates and is often cultivated for its aesthetic value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata var. cloiselana is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also present in parts of Indonesia and the Philippines. Its distribution is closely linked to the tropical climates of these regions.",
    "distribution_introduced_art_desc": "Acalypha reticulata var. cloiselana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this plant has been limited to specific regions within New Zealand, primarily in the North Island. It is not considered invasive and is often cultivated in gardens and botanical settings. Its introduction has contributed to the diversity of ornamental plants available in the region."
}
