{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha circinata",
    "plant_slug": "acalypha-circinata",
    "plant_name_scientific": "acalypha circinata",
    "intro": "Acalypha circinata, commonly known as the curly leaf acalypha, is a shrub native to tropical regions of Africa and Southeast Asia. It is characterized by its distinctive, spirally curled leaves that give it a unique appearance. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences. Its leaves are often used in traditional medicine for their purported healing properties. Acalypha circinata is also valued as an ornamental plant due to its attractive foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha circinata is primarily native to tropical and subtropical regions of Africa, including countries such as Kenya, Tanzania, and Uganda. It is commonly found in moist lowland areas, often near rivers and in swampy habitats. This plant thrives in humid environments and is often associated with wetlands and forest understories. It is also present in parts of Southeast Asia, particularly in countries like Malaysia and Indonesia. Its native range extends across parts of the Indian subcontinent, including India and Sri Lanka.",
    "distribution_introduced_art_desc": "Acalypha circinata was mainly introduced to urban and disturbed areas due to its ability to thrive in poor soil conditions. It is commonly found along roadsides, construction sites, and abandoned lots where human activity has altered the landscape. This plant spreads rapidly through its prolific seed production and can outcompete native vegetation in these environments. Its introduction has led to concerns about its invasive potential in some regions. However, it is also valued for its ornamental qualities and is sometimes cultivated in gardens."
}
