{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fissa",
    "plant_slug": "acalypha-fissa",
    "plant_name_scientific": "acalypha fissa",
    "intro": "Acalypha fissa, commonly known as the narrow-leaf false mallow, is a flowering plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family, which is known for its diverse and often ornamental species. The plant features palmate leaves with a distinctive, narrow leaflet arrangement, and its flowers are typically small and clustered. It produces a unique type of fruit called a cyathium, which is characteristic of the Euphorbiaceae family. Acalypha fissa is often cultivated for its ornamental value and is adaptable to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fissa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often seen in secondary forests, along stream banks, and in disturbed habitats. It is also present in parts of the Pacific Islands, including Hawaii and the Mariana Islands. Due to its adaptability, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha fissa was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant thrives in disturbed environments, such as roadsides and urban areas, where it can outcompete native vegetation. Its rapid growth and ability to produce large numbers of seeds contribute to its invasive potential. Management efforts are ongoing to control its spread and minimize its impact on local ecosystems."
}
