{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha capillipes",
    "plant_slug": "acalypha-capillipes",
    "plant_name_scientific": "acalypha capillipes",
    "intro": "Acalypha capillipes, commonly known as the slender-leaf erythranthe, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its slender, hair-covered stems and small, clustered flowers. Its leaves are typically elongated and have a soft, velvety texture. It is often grown as an ornamental plant due to its attractive foliage and compact growth habit.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha capillipes"
    },
    "taxonomy_art_desc": "Acalypha capillipes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"arrowroot,\" characterized by their hairy foliage and showy inflorescences. Its species is Acalypha capillipes, a specific plant within the genus Acalypha, distinguished by its fine-hairy stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland",
        "Sulawesi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha capillipes is primarily native to Queensland and Sulawesi. It is found in the tropical regions of these areas. The plant thrives in humid and warm climates. It is commonly observed in wetlands and coastal areas. Its native distribution highlights its adaptation to specific environmental conditions in these regions.",
    "distribution_introduced_art_desc": "Acalypha capillipes was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in gardens and green spaces in countries such as Australia, Hawaii, and parts of Southeast Asia. The plant thrives in warm, humid climates and is often cultivated for its vibrant leaf colors and ease of care. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its rapid growth and adaptability have led to increased management efforts in certain regions."
}
