{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cordifolia var. polyadenia",
    "plant_slug": "acalypha-cordifolia-var-polyadenia",
    "plant_name_scientific": "acalypha cordifolia var. polyadenia",
    "intro": "Acalypha cordifolia var. polyadenia, commonly known as the velvetleaf or heartleaf acalypha, is a flowering plant native to tropical regions of Asia. It is characterized by its heart-shaped leaves that are often covered in fine, soft hairs, giving it a velvety texture. The plant produces small, clustered flowers that are typically greenish-yellow in color. It thrives in moist, shady environments and is often found in forest understories. Its ornamental value makes it a popular choice for landscaping in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cordifolia var. polyadenia is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland forests and along stream banks. This variant is commonly associated with moist, shaded environments and is part of the Euphorbiaceae family. It is known for its attractive foliage and is sometimes cultivated as an ornamental plant. The species exhibits variability in leaf shape and color, which contributes to its adaptability in different habitats.",
    "distribution_introduced_art_desc": "Acalypha cordifolia var. polyadenia was mainly introduced to Hawaii, where it has become an invasive species. It was originally from Southeast Asia and was likely introduced through horticultural trade. The plant thrives in disturbed habitats and can outcompete native vegetation. It is commonly found in coastal areas and along roadsides. Due to its rapid growth and ability to spread, it poses a threat to local ecosystems."
}
