{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cunninghamii",
    "plant_slug": "acalypha-cunninghamii",
    "plant_name_scientific": "acalypha cunninghamii",
    "intro": "Acalypha cunninghamii, commonly known as the silverleaf ironweed, is a flowering plant native to Australia. It is characterized by its silver-gray foliage and clusters of small, pinkish-white flowers. The plant typically grows in coastal areas and is adapted to sandy soils. It belongs to the Euphorbiaceae family, which includes many species with milky sap. Acalypha cunninghamii is often used in horticulture for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cunninghamii is primarily native to eastern Australia, including Queensland, New South Wales, and Victoria. It thrives in coastal and lowland areas, often found in sandy soils near the coast or in open woodlands. This plant is commonly associated with the Great Barrier Reef region and is known for its distinctive red bracts that attract birds and insects. It plays an important ecological role in its native habitat by providing food and shelter. Due to its limited distribution, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acalypha cunninghamii was mainly introduced to New Zealand. It was brought there during the 19th century as an ornamental plant due to its attractive foliage. The plant has since spread beyond cultivated areas and is now found in various habitats, including coastal regions and disturbed soils. It is considered a potential weed in some parts of its introduced range. Despite its ornamental value, its invasive potential has raised concerns among land managers."
}
