{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lechleri",
    "plant_slug": "acalypha-lechleri",
    "plant_name_scientific": "acalypha lechleri",
    "intro": "Acalypha lechleri, commonly known as the \"sangre de drago\" or dragon's blood tree, is a tropical plant native to Central and South America. It is characterized by its thick, fleshy leaves and distinctive red sap, which has been used for centuries in traditional medicine. The plant belongs to the Euphorbiaceae family and is known for its ability to thrive in humid, tropical climates. Its unique appearance and medicinal properties make it a subject of both botanical and cultural interest. The sap, which is rich in compounds like tannins and resin, is often harvested for its healing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lechleri is primarily native to the Amazon Basin, specifically in regions of South America. It is found in countries such as Peru, Ecuador, Colombia, and Brazil. This plant thrives in tropical rainforests and is commonly found in humid, shaded environments. It is often associated with the understory vegetation in these ecosystems. Due to its unique properties, it has been traditionally used by indigenous communities for medicinal purposes.",
    "distribution_introduced_art_desc": "Acalypha lechleri was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners seeking exotic plant species. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments and spreads rapidly through its prolific seed production. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
