{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mexicana",
    "plant_slug": "acalypha-mexicana",
    "plant_name_scientific": "acalypha mexicana",
    "intro": "Acalypha mexicana, commonly known as Mexican beautyberry, is a shrub native to Mexico and parts of Central America. It belongs to the Euphorbiaceae family and is characterized by its striking, violet-bracted flowers that appear in clusters. The plant produces small, round berries that are typically bright purple or red when ripe. Its leaves are ovate to elliptic, with a smooth or slightly toothed margin. Acalypha mexicana is often cultivated for its ornamental value due to its vibrant foliage and unique floral structures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha mexicana"
    },
    "taxonomy_art_desc": "Acalypha mexicana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a large and diverse group of flowering plants that includes species with various growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper spurge,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha mexicana, a specific plant within the genus Acalypha native to Mexico, known for its distinctive foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Costa Rica",
        "Guatemala",
        "Honduras",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mexicana is primarily native to Arizona, Costa Rica, Guatemala, Honduras, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Southeast, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in a variety of habitats, including forests, shrublands, and disturbed soils. The species is well adapted to the warm and humid climates of its native range. Its distribution reflects its ability to grow in diverse environmental conditions within Central America and the southwestern United States.",
    "distribution_introduced_art_desc": "Acalypha mexicana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by humans for its aesthetic value, and it has since become naturalized in certain areas. The plant's rapid growth and ability to thrive in disturbed habitats have contributed to its spread. However, it is not considered a major invasive species in the region. Its introduction has raised concerns about its potential impact on native ecosystems."
}
