{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha spicata",
    "plant_slug": "acalypha-spicata",
    "plant_name_scientific": "acalypha spicata",
    "intro": "Acalypha spicata, commonly known as the spikeleaf spurflower, is a herbaceous plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family and is characterized by its distinctive, spike-like inflorescence. The plant typically features alternate, lance-shaped leaves with a smooth or slightly hairy surface. Its small, inconspicuous flowers are clustered in dense, spikelike structures, often surrounded by colorful bracts. Acalypha spicata is often cultivated for its ornamental value and can thrive in a variety of soil types with adequate sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha spicata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with secondary forests and disturbed habitats. It is also present in parts of the Pacific Islands, including Papua New Guinea and the Philippines. Acalypha spicata is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha spicata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in a variety of conditions. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant is particularly invasive in disturbed habitats such as roadsides, riverbanks, and forest edges. Its rapid growth and prolific seed production contribute to its spread and ecological impact. Management efforts are ongoing to control its spread and prevent further invasion of native ecosystems."
}
