{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha purpusii",
    "plant_slug": "acalypha-purpusii",
    "plant_name_scientific": "acalypha purpusii",
    "intro": "Acalypha purpusii, commonly known as the velvetleaf or flameleaf maple, is a flowering plant native to tropical regions of Southeast Asia. It is characterized by its striking, palmate leaves that are often covered in a fine, velvety texture. The plant produces small, greenish-white flowers that are clustered in dense inflorescences. It thrives in warm, humid climates and is often cultivated as an ornamental plant due to its attractive foliage. Acalypha purpusii is also used in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha purpusii"
    },
    "taxonomy_art_desc": "Acalypha purpusii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their relatives, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Malpighiales, a diverse group of flowering plants that includes many species with unique adaptations such as carnivorous plants and plants with specialized leaves. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide variety of growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha purpusii, a specific type of plant within the genus Acalypha, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha purpusii is primarily native to Mexico Southeast and Mexico Southwest. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in humid environments with well-drained soil. The species is often associated with coastal and lowland habitats. Its native range is limited to specific regions within southern and western Mexico.",
    "distribution_introduced_art_desc": "Acalypha purpusii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there in the late 19th or early 20th century by horticulturists and gardeners who sought to diversify local plant collections. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native species and altering local ecosystems. Its rapid growth and ability to thrive in disturbed soils have contributed to its spread beyond cultivated gardens. Conservationists now monitor its distribution to mitigate its impact on native flora and habitats."
}
