{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schreiteri",
    "plant_slug": "acalypha-schreiteri",
    "plant_name_scientific": "acalypha schreiteri",
    "intro": "Acalypha schreiteri, commonly known as the Schreiter's spurflower, is a species of flowering plant in the Euphorbiaceae family. It is native to the tropical regions of Central and South America, where it thrives in humid, shaded environments. The plant is characterized by its distinctive, showy bracts that resemble flowers, which are often brightly colored to attract pollinators. Its leaves are typically heart-shaped and have a smooth or slightly serrated edge. Acalypha schreiteri is valued in horticulture for its ornamental appeal and is often cultivated in shaded gardens or as part of tropical landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha schreiteri"
    },
    "taxonomy_art_desc": "Acalypha schreiteri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical species and is known for its varied leaf and flower structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive flowers and often toxic sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha schreiteri, a specific type of plant within the Acalypha genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schreiteri is primarily native to the northwest region of Argentina. This species is found in the arid and semi-arid areas of this region. It thrives in dry, rocky habitats and is adapted to the harsh environmental conditions. The plant is part of the Euphorbiaceae family and is known for its unique foliage. Its native distribution is limited to specific areas within the northwest of Argentina.",
    "distribution_introduced_art_desc": "Acalypha schreiteri was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely introduced through horticultural trade or by individuals seeking to cultivate unique plant species. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant's rapid growth and ability to spread via seeds and vegetative propagation contribute to its invasive potential. Efforts to control its spread have been challenging due to its adaptability to various environmental conditions."
}
