{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha dimorpha",
    "plant_slug": "acalypha-dimorpha",
    "plant_name_scientific": "acalypha dimorpha",
    "intro": "Acalypha dimorpha, commonly known as the velvetleaf or redroot, is a shrub native to tropical regions of Africa and Asia. It is characterized by its opposite, ovate to lanceolate leaves that are often hairy and have a distinctive reddish or purple coloration on the underside. The plant produces small, greenish flowers arranged in clusters, which are followed by three-lobed, fleshy berries. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and gardens. Acalypha dimorpha is valued for its ornamental appeal and has been introduced to various parts of the world as a decorative plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha dimorpha"
    },
    "taxonomy_art_desc": "Acalypha dimorpha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes species with diverse growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha dimorpha, a specific plant within the genus Acalypha, distinguished by its unique morphological traits and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha dimorpha is primarily native to Brazil Southeast. This plant is found in the southeastern region of Brazil, particularly in areas with tropical and subtropical climates. It thrives in moist, well-drained soils and is commonly found in forested areas and along riverbanks. The species is part of the Euphorbiaceae family and is known for its ornamental value. Its native distribution is limited to this specific geographic region within Brazil.",
    "distribution_introduced_art_desc": "Acalypha dimorpha was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by humans for its aesthetic value, such as its colorful leaves and unique growth form. However, it has since become invasive in some areas, outcompeting native species and altering local ecosystems. Its spread has been facilitated by its ability to thrive in disturbed habitats and reproduce rapidly. Despite its ornamental appeal, its ecological impact has raised concerns among conservationists."
}
