{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha caucana",
    "plant_slug": "acalypha-caucana",
    "plant_name_scientific": "acalypha caucana",
    "intro": "Acalypha caucana, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of South America. It belongs to the Euphorbiaceae family and is characterized by its striking, velvety leaves with deep red veins. The plant produces small, inconspicuous green flowers arranged in clusters, which are often surrounded by modified leaves called bracts. It thrives in moist, shaded environments and is often found in forest understories. Acalypha caucana is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha caucana is primarily native to tropical and subtropical regions of South America, particularly Brazil, Peru, and Colombia. It thrives in humid lowland areas and is commonly found in rainforests and secondary growth habitats. This plant is also present in parts of Central America, including Panama and Costa Rica. It prefers well-drained soils and is often found near rivers or in disturbed vegetation. Acalypha caucana is an important component of the flora in these regions, contributing to the biodiversity of the ecosystems it inhabits.",
    "distribution_introduced_art_desc": "Acalypha caucana was mainly introduced to the Pacific Islands, particularly in regions such as Hawaii, Guam, and the Mariana Islands. It was likely brought there as an ornamental plant due to its attractive foliage and growth habit. The plant has since become naturalized in these areas, often thriving in disturbed habitats and along coastal regions. Its introduction has raised concerns due to its potential to spread rapidly and compete with native vegetation. Despite its ornamental value, efforts are being made to monitor and manage its spread to protect local ecosystems."
}
