{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha monostachya",
    "plant_slug": "acalypha-monostachya",
    "plant_name_scientific": "acalypha monostachya",
    "intro": "Acalypha monostachya, commonly known as the silky filbert or silky salsify, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its soft, silky foliage and clusters of small, pale yellow flowers. The plant produces elongated, tubular fruits that contain numerous seeds. It thrives in moist, well-drained soils and is often found in wetlands or near water bodies. Due to its ornamental value, it is cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha monostachya"
    },
    "taxonomy_art_desc": "Acalypha monostachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha monostachya, a specific type within the genus Acalypha, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha monostachya is primarily native to Mexico Central, Mexico Northeast, Mexico Southeast, Mexico Southwest, and Texas. This plant is commonly found in tropical and subtropical regions within these areas. It typically grows in moist, open habitats such as forests, grasslands, and disturbed sites. The species is known for its distinctive foliage and is often used in ornamental horticulture. Its native range spans across various parts of southern and central Mexico into the southern United States.",
    "distribution_introduced_art_desc": "Acalypha monostachya was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ease of cultivation. It has since become naturalized in certain regions, particularly in the North Island, where it thrives in disturbed soils and urban environments. The plant spreads primarily through seed dispersal by wind and water, contributing to its rapid establishment in new areas. Its introduction has raised concerns due to its potential to outcompete native species in invaded habitats. Despite its aesthetic appeal, management efforts are ongoing to control its spread and minimize ecological impacts."
}
