{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha bipartita",
    "plant_slug": "acalypha-bipartita",
    "plant_name_scientific": "acalypha bipartita",
    "intro": "Acalypha bipartita, commonly known as the two-parted glory flower, is a shrub native to tropical regions of Africa and Southeast Asia. It is characterized by its striking, showy bracts that resemble petals, often in shades of red, yellow, or orange. The plant has opposite, heart-shaped leaves that are smooth and glossy, contributing to its ornamental appeal. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Acalypha bipartita is often cultivated for its vibrant floral display and is used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha bipartita"
    },
    "taxonomy_art_desc": "Acalypha bipartita belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with varied morphologies and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some with toxic properties. Its genus is Acalypha, which consists of flowering plants commonly known as \"velvetleaf\" or \"cupid's whiskers,\" often characterized by their ornamental leaves. Its species is Acalypha bipartita, a specific type within the genus Acalypha, distinguished by its unique leaf morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Burundi",
        "DR Congo",
        "Ethiopia",
        "Kenya",
        "Rwanda",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha bipartita is primarily native to Burundi, DR Congo, Ethiopia, Kenya, Rwanda, Sudan-South Sudan, Tanzania, Uganda. This species is commonly found in tropical and subtropical regions across these countries. It typically grows in moist, lowland areas such as forests, shrublands, and riverine habitats. The plant is well adapted to the diverse climatic conditions of its native range. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acalypha bipartita was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely introduced during the 19th or early 20th century by horticulturists and gardeners who sought to add exotic plants to local landscapes. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed soils and can spread rapidly through seed dispersal by wind, water, and animals. Its introduction highlights the ecological risks associated with non-native plant species in island environments."
}
