{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha deppeana",
    "plant_slug": "acalypha-deppeana",
    "plant_name_scientific": "acalypha deppeana",
    "intro": "Acalypha deppeana, commonly known as the redleaf or red-leaf plant, is a flowering plant native to tropical regions of South America. It is characterized by its striking, colorful bracts that range from red to orange, which are often mistaken for flowers. The plant has palmate leaves with a velvety texture and a distinctive reddish or purplish hue. It thrives in warm, humid environments and is often cultivated as an ornamental plant. Acalypha deppeana is part of the Euphorbiaceae family, known for its diverse and often showy floral structures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha deppeana is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in lowland areas, often near rivers and in moist, shaded environments. This species thrives in humid climates with well-drained soil, making it a characteristic plant of tropical rainforests. It is also occasionally found in parts of the Pacific Islands. Acalypha deppeana is known for its ornamental value and is sometimes cultivated in gardens in warm climates.",
    "distribution_introduced_art_desc": "Acalypha deppeana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there in the late 19th or early 20th century by horticulturists and gardeners seeking exotic plant species for cultivation. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, shaded environments and is commonly found in disturbed habitats such as forest edges and stream banks. Its rapid growth and ability to spread through seeds and vegetative reproduction have made it a significant ecological concern in Hawaii."
}
