{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha zambesica var. brevistyla",
    "plant_slug": "acalypha-zambesica-var-brevistyla",
    "plant_name_scientific": "acalypha zambesica var. brevistyla",
    "intro": "Acalypha zambesica var. brevistyla, commonly known as the Zambesi velvetleaf, is a shrub native to southern Africa. It is characterized by its hairy, ovate leaves that are often tinged with red or purple, giving it a distinctive appearance. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shady environments and is often found in forest understories. Its ornamental value makes it a popular choice for garden cultivation in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha zambesica var. brevistyla is primarily native to southern Africa, specifically occurring in countries such as South Africa, Namibia, and Botswana. It is commonly found in grassland and savanna habitats, often growing along riverbanks and in open woodlands. This plant thrives in regions with a temperate to subtropical climate, characterized by distinct wet and dry seasons. It is well adapted to sandy or loamy soils and can tolerate moderate levels of drought. Due to its ornamental value, it is sometimes cultivated in gardens in regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acalypha zambesica var. brevistyla was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for use in gardens and landscaping. The plant thrives in moist, well-drained soils and requires partial to full sunlight. It has been reported as an invasive species in some areas where it outcompetes native vegetation. Its rapid growth and ability to spread through vegetative means make it a concern for ecological balance in non-native habitats."
}
