{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha depressinervia",
    "plant_slug": "acalypha-depressinervia",
    "plant_name_scientific": "acalypha depressinervia",
    "intro": "Acalypha depressinervia, commonly known as the narrow-veined spurge, is a flowering plant native to tropical and subtropical regions of Asia. It is characterized by its lance-shaped leaves with prominently visible veins and small, inconspicuous flowers arranged in clusters. The plant typically grows as an herbaceous shrub or perennial, often reaching heights of up to 1 meter. Its leaves are usually glossy and dark green, with a slightly hairy texture. It thrives in moist, well-drained soils and is often found in forest understories or along stream banks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha depressinervia"
    },
    "taxonomy_art_desc": "Acalypha depressinervia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with a wide range of morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha depressinervia, a specific type within the genus Acalypha, distinguished by its unique leaf venation and growth habits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces",
        "Eswatini",
        "Free State",
        "KwaZulu-Natal",
        "Northern Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha depressinervia is primarily native to the Cape Provinces, Eswatini, Free State, KwaZulu-Natal, and Northern Provinces. This plant is commonly found in these regions across southern Africa. It thrives in a variety of habitats, including grasslands and disturbed soils. The species is well adapted to the local climate and soil conditions. It plays an important ecological role in its native range.",
    "distribution_introduced_art_desc": "Acalypha depressinervia was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed soils, along roadsides, and in abandoned fields. The plant spreads through its prolific seed production and can form dense stands that outcompete native vegetation. Due to its rapid growth and adaptability, it has become invasive in several areas outside its native range. However, it is sometimes used in ecological restoration projects for its ability to stabilize soil."
}
