{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pippenii",
    "plant_slug": "acalypha-pippenii",
    "plant_name_scientific": "acalypha pippenii",
    "intro": "Acalypha pippenii, commonly known as the silver flame plant, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, silver-green foliage with a waxy texture. The plant produces small, inconspicuous yellow flowers that are clustered in umbels, often surrounded by bracts that give it a fiery appearance. It thrives in bright, indirect light and well-draining soil, making it a popular choice for indoor gardening. Due to its unique appearance and relatively low maintenance, it is often cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pippenii"
    },
    "taxonomy_art_desc": "Acalypha pippenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha pippenii, a specific type within the genus Acalypha that is characterized by its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pippenii is primarily native to Mexico Southwest. This species is found in the arid and semi-arid regions of the area. It thrives in rocky soils and open habitats. The plant is adapted to the harsh environmental conditions of its native range. It is commonly found in desert scrub and coastal dunes.",
    "distribution_introduced_art_desc": "Acalypha pippenii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was first brought there in the early 20th century by horticulturists seeking to add unique and exotic plants to local landscapes. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid spread has led to increased management efforts to control its population. However, it remains a popular plant in gardens and public spaces due to its vibrant color and ease of cultivation."
}
