{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha oblancifolia",
    "plant_slug": "acalypha-oblancifolia",
    "plant_name_scientific": "acalypha oblancifolia",
    "intro": "Acalypha oblancifolia, commonly known as the broadleaf ironwood, is a shrub or small tree native to tropical regions of Africa. It features large, heart-shaped leaves that are often hairy on the underside, giving it a distinctive appearance. The plant produces small, greenish flowers arranged in clusters, followed by spherical, spiky seed capsules. It is adapted to dry and semi-arid environments, making it drought-tolerant. The leaves are sometimes used in traditional medicine for their purported healing properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha oblancifolia"
    },
    "taxonomy_art_desc": "Acalypha oblancifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which consists of vascular plants with a wide range of growth forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide variety of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false holly,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha oblancifolia, a specific type of Acalypha known for its distinctive leaf shape and is native to certain regions in South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha oblancifolia is primarily native to Guatemala and the southeastern regions of Mexico. It is commonly found in tropical and subtropical areas within these regions. The plant thrives in moist, shaded environments, often in forest understories. It is known for its striking foliage and is sometimes cultivated for ornamental purposes. Its native range is limited to specific ecological zones in Central America.",
    "distribution_introduced_art_desc": "Acalypha oblancifolia was mainly introduced to ornamental horticulture due to its attractive foliage and unique leaf shapes. It is commonly cultivated in tropical and subtropical regions for use in gardens and landscapes. The plant thrives in moist, well-drained soils and partial to full sunlight. It is often used as a ground cover or in containers due to its compact growth habit. However, it has been reported as an invasive species in some areas where it can outcompete native vegetation."
}
