{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha juruana",
    "plant_slug": "acalypha-juruana",
    "plant_name_scientific": "acalypha juruana",
    "intro": "Acalypha juruana, commonly known as the velvetleaf or Brazilian nettle, is a flowering plant native to South America. It is characterized by its smooth, slightly hairy leaves that are often a vibrant green or reddish in color. The plant produces small, inconspicuous flowers that are typically clustered in dense inflorescences. Its roots are known for their medicinal properties, used in traditional medicine to treat various ailments. Acalypha juruana thrives in tropical and subtropical climates, often found in moist, shaded environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha juruana is primarily native to the Amazon rainforest region, particularly in northern South America. It is found in countries such as Brazil, Colombia, and Venezuela. This plant thrives in humid, tropical environments with high rainfall and dense vegetation. It is commonly found in lowland areas near rivers and in swampy habitats. Its native distribution is closely linked to the biodiversity-rich ecosystems of the Amazon basin.",
    "distribution_introduced_art_desc": "Acalypha juruana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking to diversify local plant collections. Despite its ornamental value, it has since become invasive in some areas, outcompeting native species and altering local ecosystems. The plant thrives in moist, shaded environments and spreads primarily through seed dispersal by water and animals. Its introduction highlights the ecological risks associated with non-native plant species in island ecosystems."
}
