{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha spinescens",
    "plant_slug": "acalypha-spinescens",
    "plant_name_scientific": "acalypha spinescens",
    "intro": "Acalypha spinescens, commonly known as the spiny hibiscus, is a flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its distinctive spiny leaves and showy, trumpet-shaped flowers that range in color from red to yellow. The plant typically grows as an erect shrub, reaching heights of up to 2 meters. Its leaves are usually alternate, ovate, and covered with fine, stiff hairs. Acalypha spinescens is often cultivated for its ornamental value and is also used in traditional medicine for its purported therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha spinescens is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with forest understories or disturbed sites. It is also known to occur in parts of northern Australia and the Pacific Islands. Due to its adaptability, it can sometimes be found in cultivated gardens or as an ornamental plant in warmer climates.",
    "distribution_introduced_art_desc": "Acalypha spinescens was mainly introduced to tropical and subtropical regions as an ornamental plant due to its striking foliage and unique appearance. It has been widely cultivated in gardens and landscapes across Southeast Asia, the Pacific Islands, and parts of the Americas. Despite its aesthetic appeal, it has shown invasive tendencies in some areas, outcompeting native vegetation. The plant thrives in moist, well-drained soils and prefers full sun to partial shade. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to its classification as a potential weed in certain ecosystems."
}
