{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha longe-acuminata",
    "plant_slug": "acalypha-longe-acuminata",
    "plant_name_scientific": "acalypha longe-acuminata",
    "intro": "Acalypha longe-acuminata, commonly known as the long-pointed spurflower, is a herbaceous plant native to tropical and subtropical regions of Africa. It features opposite, ovate to lanceolate leaves that are often pubescent and have a distinctive reddish or purplish hue. The plant produces small, greenish-white flowers clustered in dense, terminal spikes, which are often surrounded by bracts. Its roots are fibrous and can be used in traditional medicine for their purported healing properties. The plant thrives in moist, well-drained soils and is often found in woodland or shrubland habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha longe-acuminata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often seen in forest understories or along riverbanks. It is also known to grow in disturbed habitats such as roadsides and abandoned fields. Its native range extends to parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha longe-acuminata was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for its decorative value. The plant thrives in warm, humid climates and is often used in garden settings to add visual interest. Its introduction has led to its presence in various regions outside its native range. However, it is important to monitor its spread to prevent potential ecological impacts."
}
