{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha soratensis",
    "plant_slug": "acalypha-soratensis",
    "plant_name_scientific": "acalypha soratensis",
    "intro": "Acalypha soratensis, commonly known as the flame bush, is a shrub native to parts of Africa and the Arabian Peninsula. It is characterized by its striking, colorful bracts that resemble flowers, which are actually modified leaves. The plant typically grows in dry, rocky areas and is adapted to arid environments. Its leaves are usually opposite and have a rough texture, while its small, inconspicuous true flowers are clustered in inflorescences. Acalypha soratensis is often cultivated for its ornamental value due to its vibrant foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha soratensis is primarily native to the island of Sulawesi in Indonesia. It is found in the lowland and montane forests of this region. The plant thrives in humid, tropical climates with well-drained soil. It is commonly observed in secondary growth areas and along forest edges. Due to its limited range, it is considered a rare and endemic species within its native habitat.",
    "distribution_introduced_art_desc": "Acalypha soratensis was mainly introduced to areas with disturbed soils and anthropogenic habitats, such as roadsides, waste areas, and agricultural fields. It thrives in tropical and subtropical climates, making it common in regions with high temperatures and seasonal rainfall. The plant's rapid growth and ability to spread through both seeds and vegetative propagation contribute to its success in new environments. It is often found in lowland areas with moderate to high light exposure. Due to its adaptability, it has become an invasive species in several regions outside its native range."
}
