{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha salviifolia",
    "plant_slug": "acalypha-salviifolia",
    "plant_name_scientific": "acalypha salviifolia",
    "intro": "Acalypha salviifolia, commonly known as the velvetleaf or sacred lotus, is a tropical shrub native to Southeast Asia. It is characterized by its large, heart-shaped leaves that are often covered in a fine, velvety texture. The plant produces small, clustered flowers that are typically green or yellowish in color. Its roots are known for their medicinal properties and are used in traditional herbal remedies. Acalypha salviifolia thrives in moist, shady environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha salviifolia"
    },
    "taxonomy_art_desc": "Acalypha salviifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which includes vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large order of flowering plants that includes many species with diverse growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with unique structures like cyathia and latex-producing tissues. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy foliage. Its species is Acalypha salviifolia, a specific type within the genus Acalypha characterized by its salvia-like leaves and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha salviifolia is primarily native to Madagascar. It is commonly found in the eastern part of the island, particularly in humid lowland and montane rainforests. This species thrives in shaded, moist environments and is often associated with secondary growth areas. It is an important component of the local flora and is adapted to the unique ecological conditions of Madagascar. Due to its restricted distribution, it is considered endemic to the island.",
    "distribution_introduced_art_desc": "Acalypha salviifolia was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed areas such as roadsides, abandoned fields, and along riverbanks. The plant thrives in moist, well-drained soils and can tolerate partial shade. Due to its rapid growth and ability to spread through seed dispersal, it has become naturalized in many areas outside its native range. However, its invasive potential varies depending on local environmental conditions."
}
