{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha grandis var. longe-acuminata",
    "plant_slug": "acalypha-grandis-var-longe-acuminata",
    "plant_name_scientific": "acalypha grandis var. longe-acuminata",
    "intro": "Acalypha grandis var. longe-acuminata, commonly known as the long-pointed glory flower, is a striking ornamental plant native to tropical regions of Asia. It is characterized by its vibrant, palmate leaves that display a range of colors from green to red, depending on the season and light exposure. The plant produces clusters of small, colorful bracts that resemble flowers, adding visual interest to gardens. It thrives in warm, humid climates and requires well-drained soil for optimal growth. This variety is often cultivated for its ornamental value and ability to add bold color to tropical landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha grandis var. longe-acuminata is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, lowland areas with rich, well-drained soils. This variant is commonly found in secondary forests, along riverbanks, and in disturbed habitats. It is known for its distinctive foliage and is often used in traditional medicine. Its distribution is closely linked to the natural vegetation patterns of the region.",
    "distribution_introduced_art_desc": "Acalypha grandis var. longe-acuminata was mainly introduced to the Pacific Islands for its ornamental value due to its attractive foliage and unique growth habit. It is commonly cultivated in gardens and as a houseplant because of its ability to thrive in a variety of conditions. The plant is also valued for its potential use in traditional medicine, although this has not been widely documented. It has been reported to spread rapidly in some areas, raising concerns about its invasive potential. Due to its adaptability, it has become established in several regions beyond its native range."
}
