{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rehmannii",
    "plant_slug": "acalypha-rehmannii",
    "plant_name_scientific": "acalypha rehmannii",
    "intro": "Acalypha rehmannii, commonly known as the flame bush, is a shrub native to tropical and subtropical regions of the Americas. It is characterized by its striking, often brightly colored bracts that resemble flowers, though they are actually modified leaves. The plant typically has opposite, ovate to lance-shaped leaves with a glossy surface. It produces small, inconspicuous flowers that are clustered in dense inflorescences. Acalypha rehmannii thrives in well-drained soil and full sun, making it a popular ornamental plant in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rehmannii is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with forest understories or near water bodies. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Acalypha rehmannii is known for its vibrant foliage and is sometimes cultivated as an ornamental plant.",
    "distribution_introduced_art_desc": "Acalypha rehmannii was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique appearance. It is commonly cultivated in tropical and subtropical regions for its decorative value. The plant is often used in garden designs, public spaces, and as a filler in mixed plantings. Its introduction has led to its presence in various ecosystems where it can become invasive if not managed properly. Despite its aesthetic appeal, it requires careful monitoring to prevent ecological disruption."
}
