{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis var. intermedia",
    "plant_slug": "acalypha-communis-var-intermedia",
    "plant_name_scientific": "acalypha communis var. intermedia",
    "intro": "Acalypha communis var. intermedia, commonly known as the Chinese lantern plant, is a striking ornamental species native to Southeast Asia. It is characterized by its vibrant red, orange, or yellow bracts that resemble small lanterns, which are modified leaves that enclose the tiny true flowers. The plant typically grows as an herbaceous perennial, often reaching heights of 1 to 3 feet, and thrives in full sun to partial shade. Its foliage is often green with a metallic sheen, adding visual interest to gardens. It is well-suited for container gardening and is popular in tropical and subtropical climates for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis var. intermedia is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with disturbed habitats like roadside verges and secondary forests. It is also present in parts of northern Australia and the Pacific Islands. Its distribution extends to regions with similar climatic conditions across the Indo-Pacific area.",
    "distribution_introduced_art_desc": "Acalypha communis var. intermedia was mainly introduced to ornamental horticulture and landscaping due to its striking foliage and adaptability. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant thrives in moist, well-drained soils and partial to full sunlight. It has been reported to naturalize in some areas, posing a potential risk to native ecosystems. Its introduction has led to both appreciation and concern among environmentalists."
}
