{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schlumbergeri",
    "plant_slug": "acalypha-schlumbergeri",
    "plant_name_scientific": "acalypha schlumbergeri",
    "intro": "Acalypha schlumbergeri, commonly known as the velvetleaf or Schlemburger's acalypha, is a tropical shrub native to Central and South America. It is characterized by its distinctive, velvety leaves that are typically a deep green with a soft, fuzzy texture. The plant produces small, inconspicuous flowers that are usually green or yellow, followed by spherical, red or orange fruits that contain seeds. It thrives in warm, humid climates and is often cultivated as an ornamental plant for its unique foliage. Due to its rapid growth and ability to spread, it can become invasive in certain environments if not managed properly.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha schlumbergeri"
    },
    "taxonomy_art_desc": "Acalypha schlumbergeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Malpighiales, a large and diverse group of flowering plants that includes species with various growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha schlumbergeri, a specific plant within the genus Acalypha, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Gulf",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schlumbergeri is primarily native to the Mexico Gulf and Mexico Southeast regions. This plant is commonly found in coastal areas and wetlands within these geographic locations. It thrives in humid, tropical climates with abundant sunlight and moisture. The species is well adapted to the specific environmental conditions of its native range. Its distribution is largely restricted to these areas in southern Mexico.",
    "distribution_introduced_art_desc": "Acalypha schlumbergeri was mainly introduced to regions with warm, humid climates where it can thrive in well-drained soils. It is commonly found in tropical and subtropical areas, particularly in parts of Africa, Southeast Asia, and the Pacific Islands. This plant is often cultivated as an ornamental due to its attractive foliage and compact growth habit. However, it has also been reported as an invasive species in some areas where it outcompetes native vegetation. Its rapid growth and ability to spread through seeds make it a challenge for ecological management in certain regions."
}
