{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gracilis var. pubescens",
    "plant_slug": "acalypha-gracilis-var-pubescens",
    "plant_name_scientific": "acalypha gracilis var. pubescens",
    "intro": "Acalypha gracilis var. pubescens, commonly known as the velvetleaf or silverleaf acalypha, is a flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its soft, hairy foliage that gives it a velvety texture, and its small, clustered flowers that range in color from yellow to red. The plant typically grows as an herbaceous annual or perennial, often reaching heights of up to 1 meter. It thrives in moist, well-drained soils and is often found in disturbed habitats such as gardens and roadsides. Its ornamental value makes it a popular choice for landscaping in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gracilis var. pubescens is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, lowland environments and is commonly found in forest understories and along stream banks. This variant is known for its distinctive hairy foliage and is often used in traditional medicine by local communities. It prefers well-drained soils and partial to full shade, making it a common ornamental plant in tropical gardens. Its distribution is largely restricted to these specific geographic areas due to its climatic and habitat requirements.",
    "distribution_introduced_art_desc": "Acalypha gracilis var. pubescens was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It thrives in tropical and subtropical climates, making it suitable for regions with warm, humid conditions. This plant is often cultivated as an ornamental due to its attractive foliage and unique appearance. It is commonly found in gardens and landscaping in parts of Southeast Asia and the Pacific Islands. However, it may become invasive in certain environments if not managed properly."
}
