{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha burquezii",
    "plant_slug": "acalypha-burquezii",
    "plant_name_scientific": "acalypha burquezii",
    "intro": "Acalypha burquezii, commonly known as the Burquez's ironweed, is a flowering plant native to Mexico. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that resemble flowers. The plant typically grows as an upright shrub with lance-shaped leaves that are often covered in fine hairs. It produces small, inconspicuous yellow flowers clustered in dense inflorescences. Acalypha burquezii is valued for its ornamental appeal and is often cultivated in gardens for its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha burquezii"
    },
    "taxonomy_art_desc": "Acalypha burquezii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupid's dart,\" characterized by their showy bracts and often hairy leaves. Its species is Acalypha burquezii, a specific type of plant within the Acalypha genus, native to certain regions and distinguished by its unique morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha burquezii is primarily native to Mexico Northeast and Mexico Northwest. This species is found in the northeastern and northwestern regions of Mexico. It thrives in specific habitats within these areas. The plant is adapted to the local climate and soil conditions of its native range. Its distribution is limited to these regions, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Acalypha burquezii was mainly introduced to the Hawaiian Islands. It is considered an invasive species in the region. The plant spreads rapidly through its prolific seed production. It often outcompetes native vegetation, leading to habitat degradation. Efforts are being made to control its spread and protect local ecosystems."
}
