{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha glutinosa",
    "plant_slug": "acalypha-glutinosa",
    "plant_name_scientific": "acalypha glutinosa",
    "intro": "Acalypha glutinosa, commonly known as sticky leaf or glue plant, is a flowering plant native to tropical and subtropical regions of Asia, Africa, and the Pacific. It is characterized by its distinctive, often hairy or sticky leaves that can be used in traditional medicine. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shady environments and is often found in wetlands or along stream banks. Its unique foliage and adaptability make it a notable species in ecological and horticultural contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha glutinosa is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, lowland areas. This plant thrives in humid climates and is typically associated with wetlands, riverbanks, and forest edges. It is also known to occur in parts of Australia and the Pacific Islands. Its native range extends across various parts of Oceania and Southeast Asia, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha glutinosa was mainly introduced to areas with disturbed soils and wetland environments. It is commonly found in regions with high humidity and moderate temperatures. This plant thrives in moist, nutrient-rich soils and can quickly colonize open areas. Its rapid growth and ability to spread through both seeds and vegetative propagation make it an aggressive invader. It is often found in wetlands, marshes, and along the edges of water bodies."
}
