{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virgata",
    "plant_slug": "acalypha-virgata",
    "plant_name_scientific": "acalypha virgata",
    "intro": "Acalypha virgata, commonly known as the velvetleaf or silky leaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, showy bracts that often resemble petals, giving it a decorative appearance. The plant has palmate leaves with a soft, velvety texture, and it produces small, inconspicuous flowers clustered in inflorescences. It thrives in moist, well-drained soils and is often found in wetlands or along water bodies. Acalypha virgata is also valued for its ornamental use in gardens and for its potential in phytoremediation.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha virgata"
    },
    "taxonomy_art_desc": "Acalypha virgata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large and diverse order of flowering plants that includes many tropical and subtropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive flowers and often milky sap. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy leaves. Its species is Acalypha virgata, a specific type within the genus Acalypha characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Jamaica"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virgata is primarily native to Jamaica. It is commonly found in the island's tropical and subtropical regions. This plant thrives in moist, well-drained soils and is often seen in coastal areas and lowland forests. It is an important component of Jamaica's native flora. Its distribution is largely restricted to the island, with no known presence in other regions.",
    "distribution_introduced_art_desc": "Acalypha virgata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It was initially cultivated for its aesthetic value in gardens and landscapes. However, it has since become naturalized and is now considered a weed in some areas, particularly in coastal and disturbed habitats. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its establishment in the wild. Despite its ornamental appeal, its invasive potential has raised concerns among conservationists."
}
