{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha filiformis var. goudotiana",
    "plant_slug": "acalypha-filiformis-var-goudotiana",
    "plant_name_scientific": "acalypha filiformis var. goudotiana",
    "intro": "Acalypha filiformis var. goudotiana, commonly known as the silky filaments or silky acalypha, is a tropical shrub native to Southeast Asia. It is characterized by its delicate, thread-like leaves that give it a feathery appearance. The plant produces small, inconspicuous flowers that are often overlooked, but it is the unique foliage that makes it stand out. It thrives in warm, humid climates and requires well-drained soil to prevent root rot. Its ornamental value lies primarily in its soft, silky leaves, which can be used in ornamental gardening or as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha filiformis var. goudotiana is primarily native to Madagascar. This variant of the species is found in the eastern part of the island, particularly in the rainforests and moist lowland areas. It thrives in humid, tropical climates with high rainfall. The plant is commonly seen in secondary growth and along forest edges. Its distribution is limited to specific regions within Madagascar due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Acalypha filiformis var. goudotiana was mainly introduced to tropical and subtropical regions for its ornamental value due to its unique, thread-like leaves. It is commonly found in gardens and as a houseplant in areas with warm climates. The plant thrives in bright, indirect light and requires well-draining soil to prevent root rot. It is often used in landscape design to add texture and visual interest. Despite its beauty, it can become invasive in some regions if not properly managed."
}
