{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha leonii var. perrierana",
    "plant_slug": "acalypha-leonii-var-perrierana",
    "plant_name_scientific": "acalypha leonii var. perrierana",
    "intro": "Acalypha leonii var. perrierana, commonly known as the red-veined nettle, is a strikingly ornamental shrub native to Central America. It is characterized by its vivid, red-veined leaves that contrast sharply with its dark green foliage. The plant produces small, greenish-white flowers arranged in dense clusters, which are typically borne in the axils of the leaves. It thrives in moist, well-drained soils and prefers partial to full shade, making it suitable for shaded garden settings. Due to its unique appearance, it is often cultivated as a decorative plant in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha leonii var. perrierana is primarily native to Madagascar. This variant of Acalypha leonii is found in the eastern part of the island, specifically in the northeastern region. It typically grows in humid, tropical environments, often in forested areas. The plant is adapted to the specific climatic and soil conditions of Madagascar. It is not found naturally outside of this geographic range.",
    "distribution_introduced_art_desc": "Acalypha leonii var. perrierana was mainly introduced to tropical and subtropical regions of the Americas, particularly in Central and South America. It thrives in warm, humid climates and is often found in disturbed habitats such as roadsides, abandoned fields, and forest edges. This plant is known for its striking red bracts that attract pollinators and make it a popular ornamental species. Its introduction has led to its naturalization in several areas, sometimes becoming invasive in local ecosystems. Due to its rapid growth and adaptability, it is now considered a potential weed in some regions."
}
