{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lanceolata",
    "plant_slug": "acalypha-lanceolata",
    "plant_name_scientific": "acalypha lanceolata",
    "intro": "Acalypha lanceolata, commonly known as the velvetleaf or redroot, is a flowering plant native to tropical and subtropical regions. It is characterized by its lance-shaped leaves that are often covered in a fine, silky hair, giving it a soft, velvety appearance. The plant produces small, clustered flowers that are typically greenish-white in color, with some varieties displaying red or purple hues. It thrives in moist, well-drained soils and is often found in disturbed areas or along stream banks. Acalypha lanceolata is valued for its ornamental qualities and is also used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lanceolata"
    },
    "taxonomy_art_desc": "Acalypha lanceolata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants known for their diverse habitats and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy bracts and often hairy leaves. Its species is Acalypha lanceolata, a specific plant within the genus Acalypha, known for its lance-shaped leaves and is native to certain regions of the world.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bangladesh",
        "Bismarck Archipelago",
        "Borneo",
        "Cambodia",
        "Caroline Is.",
        "Christmas I.",
        "Cocos (Keeling) Is.",
        "Cook Is.",
        "DR Congo",
        "Ethiopia",
        "Fiji",
        "India",
        "Jawa",
        "Kenya",
        "Laccadive Is.",
        "Lesser Sunda Is.",
        "Malawi",
        "Malaya",
        "Maldives",
        "Maluku",
        "Mozambique",
        "Myanmar",
        "New Guinea",
        "Northern Territory",
        "Philippines",
        "Queensland",
        "Rwanda",
        "Samoa",
        "Saudi Arabia",
        "Solomon Is.",
        "South China Sea",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Sulawesi",
        "Sumatera",
        "Taiwan",
        "Tanzania",
        "Thailand",
        "Tonga",
        "Uganda",
        "Vietnam",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Comoros",
        "Madagascar",
        "Niue",
        "Réunion",
        "Tokelau-Manihiki"
    ],
    "distribution_native_art_desc": "Acalypha lanceolata is primarily native to Bangladesh, Bismarck Archipelago, Borneo, Cambodia, Caroline Is., Christmas I., Cocos (Keeling) Is., Cook Is., DR Congo, Ethiopia, Fiji, India, Jawa, Kenya, Laccadive Is., Lesser Sunda Is., Malawi, Malaya, Maldives, Maluku, Mozambique, Myanmar, New Guinea, Northern Territory, Philippines, Queensland, Rwanda, Samoa, Saudi Arabia, Solomon Is., South China Sea, Sri Lanka, Sudan-South Sudan, Sulawesi, Sumatera, Taiwan, Tanzania, Thailand, Tonga, Uganda, Vietnam, and Western Australia. This plant is commonly found in tropical and subtropical regions, often in moist, open habitats such as coastal areas, riverbanks, and disturbed soils. It is known for its lance-shaped leaves and is often used in traditional medicine or as an ornamental plant. The species exhibits a wide geographic range, spanning across Southeast Asia, the Pacific Islands, and parts of Africa and Australia. Its adaptability to various environmental conditions contributes to its successful distribution across these regions.",
    "distribution_introduced_art_desc": "Acalypha lanceolata was mainly introduced to Comoros, Madagascar, Niue, Réunion, and Tokelau-Manihiki. It is commonly found in coastal areas and disturbed habitats across these regions. The plant has adapted well to the tropical climates of these islands. It is often used for ornamental purposes due to its attractive foliage. However, it is considered an invasive species in some of these locations."
}
