{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha caturus",
    "plant_slug": "acalypha-caturus",
    "plant_name_scientific": "acalypha caturus",
    "intro": "Acalypha caturus, commonly known as the red-rooted spurge, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family, which includes many species with milky sap. The plant is characterized by its distinctive reddish roots and clusters of small, yellowish flowers. Its leaves are typically alternate, ovate, and have a smooth or slightly hairy surface. Acalypha caturus is often found in disturbed soils and can thrive in a variety of light conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha caturus"
    },
    "taxonomy_art_desc": "Acalypha caturus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which includes ferns and their relatives, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphologies and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their colorful bracts and often used in ornamental horticulture. Its species is Acalypha caturus, a specific type of plant within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bismarck Archipelago",
        "Borneo",
        "Jawa",
        "Lesser Sunda Is.",
        "Malaya",
        "Maluku",
        "New Guinea",
        "Sulawesi",
        "Sumatera",
        "Vanuatu"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha caturus is primarily native to the Bismarck Archipelago, Borneo, Jawa, Lesser Sunda Is., Malaya, Maluku, New Guinea, Sulawesi, Sumatera, and Vanuatu. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in moist, shaded environments, often in lowland forests or along riverbanks. Acalypha caturus is a shrub or small tree that plays a role in the local ecosystems of its native range. Its distribution spans a wide variety of island territories in the Indo-Pacific region.",
    "distribution_introduced_art_desc": "Acalypha caturus was mainly introduced to new habitats through human activities such as landscaping and horticultural trade. It is commonly found in disturbed soils and along roadsides, where it thrives in sunny, open environments. The plant has shown rapid growth and spread, making it a potential invasive species in some regions. Its ability to adapt to various soil types and climate conditions contributes to its successful establishment. However, its ecological impact remains under study in many areas."
}
