{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha harmandiana",
    "plant_slug": "acalypha-harmandiana",
    "plant_name_scientific": "acalypha harmandiana",
    "intro": "Acalypha harmandiana, commonly known as the red hot poker or fireplant, is a striking tropical shrub native to Southeast Asia. It is characterized by its vivid red bracts that surround small, inconspicuous flowers, creating a dramatic visual display. The plant typically grows to a height of 1 to 3 meters and thrives in full sun with well-drained soil. Its foliage is often a deep green, and it produces small, yellowish flowers that are clustered in dense inflorescences. Acalypha harmandiana is popular in ornamental horticulture for its bold, colorful appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha harmandiana is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is found in countries such as Cuba, Hispaniola, Jamaica, and Puerto Rico. This plant typically grows in moist, tropical environments, often in coastal areas or near rivers. It is commonly associated with mangrove ecosystems and can be found in brackish water habitats. Its distribution is limited to specific islands where the climate and soil conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Acalypha harmandiana was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and vibrant flowers. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant is often used in garden designs and as a decorative element in public spaces. Its introduction has led to its establishment in some non-native areas, sometimes becoming invasive. Proper management is necessary to prevent its spread beyond controlled environments."
}
