{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cardiophylla var. cardiophylla",
    "plant_slug": "acalypha-cardiophylla-var-cardiophylla",
    "plant_name_scientific": "acalypha cardiophylla var. cardiophylla",
    "intro": "Acalypha cardiophylla var. cardiophylla, commonly known as the heart-leaf alypha, is a tropical shrub native to Southeast Asia. It is characterized by its striking, heart-shaped leaves that are often brightly colored, ranging from deep red to vibrant green. The plant produces small, inconspicuous flowers that are typically green or yellow, followed by spherical, woody fruits. It thrives in humid, warm climates and is often cultivated for its ornamental foliage. The leaves are sometimes used in traditional medicine, though its primary value lies in its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cardiophylla"
    },
    "taxonomy_art_desc": "Acalypha cardiophylla var. cardiophylla belongs to the kingdom Plantae, which includes all plants. Its phylum is Streptophyta, a group of plants that includes land plants and their closest algal relatives. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails. Its subclass is Magnoliidae, a group characterized by a wide range of flowering plants with various morphological features. Its order is Malpighiales, a group of flowering plants that includes many economically important species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and ecological roles. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy leaves. Its species is Acalypha cardiophylla, a specific plant within the genus Acalypha known for its distinctive heart-shaped leaves and is a variant of itself.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo",
        "Philippines",
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cardiophylla var. cardiophylla is primarily native to Borneo, Philippines, and Taiwan. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, shaded environments such as forests and along riverbanks. The species is known for its distinctive heart-shaped leaves and is often used in traditional medicine. Its native distribution reflects its adaptation to the humid climates of Southeast Asia.",
    "distribution_introduced_art_desc": "Acalypha cardiophylla var. cardiophylla was mainly introduced to tropical and subtropical regions around the world, particularly in areas with warm, humid climates. It is commonly found in countries such as Australia, Hawaii, and parts of Southeast Asia. This plant is often cultivated as an ornamental due to its striking foliage and adaptability to various soil types. Its introduction has led to its establishment in some regions where it can become invasive. However, it is generally considered a non-native species in most of its current habitats."
}
