{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pancheriana",
    "plant_slug": "acalypha-pancheriana",
    "plant_name_scientific": "acalypha pancheriana",
    "intro": "Acalypha pancheriana, commonly known as the velvetleaf or Indian nettle, is a flowering plant native to tropical regions of Asia. It is characterized by its striking, colorful bracts that resemble flowers, often in shades of red, orange, and yellow. The plant has palmate leaves with lobed margins, and its stems are often hairy, giving it a textured appearance. It thrives in moist, shaded environments and is often found in forest understories. Acalypha pancheriana is valued both for its ornamental beauty and its traditional uses in herbal medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pancheriana"
    },
    "taxonomy_art_desc": "Acalypha pancheriana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants that includes species with diverse growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurges, which are characterized by their often milky sap and diverse flowering structures. Its genus is Acalypha, a group of flowering plants typically with showy inflorescences and often used in ornamental horticulture. Its species is Acalypha pancheriana, a specific type within the genus Acalypha, known for its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Caledonia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pancheriana is primarily native to New Caledonia. This species is endemic to the island nation, found in specific regions within its unique biodiversity. It thrives in the tropical and subtropical climates of New Caledonia. The plant is often found in humid, forested areas with well-drained soils. Its distribution is limited to New Caledonia, making it a key component of the local flora.",
    "distribution_introduced_art_desc": "Acalypha pancheriana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and vibrant flowers. It was first recorded in the early 20th century and has since become established in several regions across the archipelago. The plant is often found in disturbed areas, such as roadsides and vacant lots, where it can thrive in a variety of soil conditions. Despite its aesthetic appeal, it has raised concerns due to its potential to spread aggressively and compete with native plant species. Its introduction highlights the ecological impacts of non-native flora in island ecosystems."
}
