{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha goyazensis",
    "plant_slug": "acalypha-goyazensis",
    "plant_name_scientific": "acalypha goyazensis",
    "intro": "Acalypha goyazensis, commonly known as the Goyazensis spurflower, is a shrub native to Brazil. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that resemble flowers. The plant typically grows in tropical and subtropical regions, thriving in humid, well-drained soils. Its leaves are usually alternate and have a rough texture, while the stems are often woody and branched. Acalypha goyazensis is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha goyazensis is primarily native to Brazil, specifically the state of Mato Grosso do Sul. It is found in the region surrounding the Chapada dos Guimaraens, a mountainous area known for its unique biodiversity. This plant thrives in tropical and subtropical climates, often growing in rocky or semi-arid environments. It is part of the Euphorbiaceae family and is adapted to the specific ecological conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in the region.",
    "distribution_introduced_art_desc": "Acalypha goyazensis was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and forest edges. The plant thrives in full sun to partial shade and is often seen in lowland areas with moderate rainfall. Its rapid growth and ability to spread through both seeds and vegetative reproduction make it an invasive species in many regions. It is also valued for its ornamental leaves, which are often used in landscaping and horticulture."
}
