{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hoffmanniana",
    "plant_slug": "acalypha-hoffmanniana",
    "plant_name_scientific": "acalypha hoffmanniana",
    "intro": "Acalypha hoffmanniana, commonly known as the Hoffmann's spurflower, is a tropical shrub native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that resemble flowers. The plant typically grows to a height of 1 to 3 meters and features palmate leaves with a velvety texture. Its small, inconspicuous flowers are clustered in dense inflorescences, and it thrives in warm, humid climates with well-drained soil. Acalypha hoffmanniana is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Sulawesi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hoffmanniana is primarily native to Sulawesi. This species is found in the tropical regions of this Indonesian island. It thrives in humid, lowland environments with rich soil. The plant is commonly seen in forest understories and along riverbanks. Its native distribution is limited to Sulawesi, where it plays a role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acalypha hoffmanniana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was likely brought there during the late 19th or early 20th century by horticulturalists and gardeners seeking exotic plants for landscaping. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, shaded environments and spreads primarily through seed dispersal by birds and water. Its introduction highlights the ecological risks associated with non-native species in island ecosystems."
}
