{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata var. ovalifolia",
    "plant_slug": "acalypha-reticulata-var-ovalifolia",
    "plant_name_scientific": "acalypha reticulata var. ovalifolia",
    "intro": "Acalypha reticulata var. ovalifolia, commonly known as the oval-leaved spurflower, is a herbaceous plant native to tropical and subtropical regions. It features striking, colorful bracts that often resemble flowers, which are actually modified leaves. The plant has palmate leaves with a reticulate venation pattern, giving it a distinctive appearance. It thrives in moist, well-drained soils and is often found in shaded to partially shaded environments. Its botanical characteristics make it a popular choice for ornamental gardening and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata var. ovalifolia is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also known to grow in coastal areas and near rivers. Its native distribution extends to parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha reticulata var. ovalifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It was first recorded in the 1950s and has since spread throughout the North Island, particularly in urban and suburban areas. The plant thrives in disturbed soils and is commonly found along roadsides, riverbanks, and in gardens. Its rapid growth and ability to form dense stands have led to concerns about its potential invasiveness. Despite its ornamental value, it is now considered a potential weed in some regions of New Zealand."
}
