{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha angustata var. glabra",
    "plant_slug": "acalypha-angustata-var-glabra",
    "plant_name_scientific": "acalypha angustata var. glabra",
    "intro": "Acalypha angustata var. glabra, commonly known as smoothleaf ironweed, is a species of flowering plant in the family Euphorbiaceae. It is native to tropical and subtropical regions of Africa, particularly in countries like Kenya and Tanzania. The plant is characterized by its narrow, smooth leaves and clusters of small, yellowish-green flowers. It typically grows in open woodland or grassland habitats. The species is valued for its ornamental appeal and has been cultivated in some parts of the world for horticultural purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha angustata var. glabra is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in shaded to semi-shaded environments, often growing in forest understories or along stream banks. It is also known to occur in parts of the Indian subcontinent, including India and Sri Lanka. The species is valued for its ornamental foliage and is sometimes cultivated in gardens in regions with a suitable climate.",
    "distribution_introduced_art_desc": "Acalypha angustata var. glabra was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in various ecosystems. The plant spreads rapidly through seeds and can establish itself in disturbed areas. Its introduction has led to management efforts to control its spread and protect local biodiversity."
}
