{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sabulicola",
    "plant_slug": "acalypha-sabulicola",
    "plant_name_scientific": "acalypha sabulicola",
    "intro": "Acalypha sabulicola, commonly known as sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing shrub characterized by its small, lance-shaped leaves and clusters of yellow flowers. The plant thrives in sandy or gravelly soils and is adapted to arid environments. It is often found in desert scrub and chaparral habitats. Its botanical features make it a hardy and resilient species suitable for xeriscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha sabulicola"
    },
    "taxonomy_art_desc": "Acalypha sabulicola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized structures such as stipules and unique leaf arrangements. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" species, often characterized by their hairy leaves and showy inflorescences. Its species is Acalypha sabulicola, a specific type of plant found in sandy soils, known for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sabulicola is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. This plant typically grows in sandy or rocky soils. It is commonly found in desert scrub and coastal dunes. Its distribution is limited to specific habitats within the southwestern part of Mexico.",
    "distribution_introduced_art_desc": "Acalypha sabulicola was mainly introduced to disturbed soils and coastal areas along the southeastern United States. It thrives in sandy or gravelly habitats, often found in dunes, roadsides, and waste areas. The plant spreads through seeds dispersed by wind, water, and animals, contributing to its rapid colonization of new sites. Its ability to tolerate salt and drought makes it a common invasive species in coastal regions. However, it is considered a non-native plant in these areas, often outcompeting native vegetation."
}
