{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha californica",
    "plant_slug": "acalypha-californica",
    "plant_name_scientific": "acalypha californica",
    "intro": "Acalypha californica, commonly known as the California copperleaf, is a flowering plant native to California. It is a shrub that typically grows to a height of about 1 to 3 meters. The plant features palmate leaves with bright yellow veins and red or orange bracts that resemble flowers. It produces small, greenish-white flowers in clusters, which are often hidden by the colorful bracts. Acalypha californica thrives in well-drained soil and full sun, making it a popular choice for drought-tolerant gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha californica"
    },
    "taxonomy_art_desc": "Acalypha californica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species, often with distinctive floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy foliage and unique inflorescences. Its species is Acalypha californica, a specific plant native to California, known for its ornamental value and specific ecological adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Mexico Northeast",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha californica is primarily native to Arizona, California, Mexico Northeast, and Mexico Northwest. This plant is commonly found in rocky soils and open habitats across these regions. It thrives in arid and semi-arid environments, often growing in coastal and inland areas. The species is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acalypha californica was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along streambanks. This species thrives in full sun and well-drained soils, making it adaptable to various environments. It is often considered a weed due to its aggressive growth habit. Despite its invasive tendencies, it plays a role in stabilizing soil and providing habitat for small insects and animals."
}
