{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula f. velutina",
    "plant_slug": "acalypha-parvula-f-velutina",
    "plant_name_scientific": "acalypha parvula f. velutina",
    "intro": "Acalypha parvula f. velutina, commonly known as velvetleaf acalypha, is a compact, ornamental shrub native to tropical regions. It features small, ovate leaves that are densely covered with fine, soft hairs, giving them a velvety texture. The plant produces clusters of tiny, greenish-white flowers that are often overlooked but contribute to its ecological value. It thrives in moist, well-drained soils and prefers partial to full sunlight. Due to its unique foliage, it is often cultivated in gardens for its aesthetic appeal and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula f. velutina is primarily native to the southeastern United States, including parts of Florida, Georgia, and South Carolina. It is commonly found in wetlands, marshes, and along the edges of ponds and streams. This plant thrives in moist to wet soil conditions and is often associated with disturbed or riparian habitats. It is a perennial herb that typically grows in dense clusters, reaching heights of up to 1 meter. Due to its adaptability, it is sometimes considered an invasive species in certain regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha parvula f. velutina was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists seeking exotic plants for gardens and landscapes. The plant thrives in tropical and subtropical climates, making it well-suited to the environmental conditions of these regions. However, its introduction has raised concerns about its potential to become invasive due to its rapid growth and ability to spread through seed dispersal. Despite its ornamental value, its ecological impact remains a topic of ongoing study and management."
}
