{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha alopecuroidea f. polycephala",
    "plant_slug": "acalypha-alopecuroidea-f-polycephala",
    "plant_name_scientific": "acalypha alopecuroidea f. polycephala",
    "intro": "Acalypha alopecuroidea f. polycephala, commonly known as the woolly horsehair plant, is a unique variant of the species Acalypha alopecuroidea. It is characterized by its dense, woolly foliage that gives it a distinctive, fluffy appearance. The plant belongs to the Euphorbiaceae family, which includes a wide range of flowering plants. Its leaves are typically covered in a fine, white pubescence, contributing to its ornamental value. This cultivar is often grown as a decorative plant for its unique texture and visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha alopecuroidea f. polycephala is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This plant is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. It thrives in moist, well-drained soils and is often associated with disturbed habitats like forest edges and agricultural fields. The species is also present in parts of New Guinea and the Indian subcontinent. Its distribution is closely linked to human activity, as it is often cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha alopecuroidea f. polycephala was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and coastal dunes. It thrives in environments with moderate to high sunlight exposure and well-drained soil. This plant is often found in regions with a warm, humid climate, particularly in the southeastern United States. Its rapid growth and ability to spread through both seeds and rhizomes make it a common invasive species in these areas. It is often considered a weed due to its competitive nature and potential to outcompete native vegetation."
}
