{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha bailloniana",
    "plant_slug": "acalypha-bailloniana",
    "plant_name_scientific": "acalypha bailloniana",
    "intro": "Acalypha bailloniana, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its striking, reddish veins on its heart-shaped leaves. The plant produces small, inconspicuous flowers clustered in dense inflorescences, which are often surrounded by bracts. It thrives in moist, shaded environments and is often found in forest understories. The species is valued for its ornamental appeal and has some traditional uses in local medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha bailloniana"
    },
    "taxonomy_art_desc": "Acalypha bailloniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup plants,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha bailloniana, a specific type within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Comoros",
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha bailloniana is primarily native to Comoros, Tanzania. It is commonly found in tropical and subtropical regions within these areas. This plant thrives in moist, well-drained soils and is often seen in forest understories. It is an important component of the local flora in these regions. Its distribution is largely restricted to the specific habitats of Comoros and Tanzania.",
    "distribution_introduced_art_desc": "Acalypha bailloniana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for cultivation. The plant has since become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. It thrives in moist, shaded environments and can be found in disturbed habitats such as roadsides and forest edges. Despite its ornamental value, it is considered a potential invasive species in certain regions of Hawaii."
}
