{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha boiviniana",
    "plant_slug": "acalypha-boiviniana",
    "plant_name_scientific": "acalypha boiviniana",
    "intro": "Acalypha boiviniana, commonly known as the red-flowered false hibiscus, is a shrub native to Madagascar. It is characterized by its striking red bracts that resemble flowers, which are actually modified leaves. The plant has opposite, ovate leaves with a smooth or slightly hairy surface. It produces small, yellowish flowers that are clustered in inflorescences. Acalypha boiviniana thrives in tropical climates and is often cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha boiviniana"
    },
    "taxonomy_art_desc": "Acalypha boiviniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large order of flowering plants that includes many species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of forms and some with toxic properties. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf,\" characterized by their showy flowers and hairy leaves. Its species is Acalypha boiviniana, a specific type of plant within the genus Acalypha, known for its unique floral structures and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha boiviniana is primarily native to Tanzania. This plant is found in the eastern and southern regions of the country. It typically grows in moist, wooded areas and along riverbanks. Acalypha boiviniana is adapted to the tropical climate of Tanzania. Its distribution is limited to specific habitats within the country.",
    "distribution_introduced_art_desc": "Acalypha boiviniana was mainly introduced to the Pacific Islands, particularly French Polynesia, as an ornamental plant due to its striking foliage. It was likely brought there during the 20th century by horticulturists and gardeners seeking exotic and visually appealing species. The plant has since become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. Its introduction has raised concerns about its potential impact on native ecosystems. Despite its aesthetic value, ongoing monitoring is necessary to assess its ecological effects."
}
