{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rhombifolia",
    "plant_slug": "acalypha-rhombifolia",
    "plant_name_scientific": "acalypha rhombifolia",
    "intro": "Acalypha rhombifolia, commonly known as the velvetleaf or silverleaf, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its distinctive, heart-shaped to rhombic leaves that are often covered in a fine, silvery or velvety pubescence. The plant produces small, clustered greenish-white flowers that are typically followed by three-lobed, red or orange seed pods. Acalypha rhombifolia is often cultivated as an ornamental plant due to its attractive foliage. It prefers well-drained soil and partial to full sunlight, making it suitable for tropical and subtropical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha rhombifolia"
    },
    "taxonomy_art_desc": "Acalypha rhombifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha rhombifolia, a specific type of plant within the genus Acalypha, distinguished by its rhomboid-shaped leaves and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rhombifolia is primarily native to Mexico Central, Mexico Gulf, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, well-drained soils and is often associated with disturbed habitats. The species is known for its distinctive rhomboid-shaped leaves and is sometimes used in traditional medicine. Its native range reflects its adaptability to diverse environmental conditions in southern Mexico.",
    "distribution_introduced_art_desc": "Acalypha rhombifolia was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first brought to these regions in the late 19th century by horticulturists and gardeners seeking to diversify local plant collections. Despite its ornamental value, it has since become an invasive species in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, tropical environments and spreads rapidly through seed dispersal by birds and water. Its introduction highlights the ecological risks associated with non-native plant species in island ecosystems."
}
