{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha bisetosa",
    "plant_slug": "acalypha-bisetosa",
    "plant_name_scientific": "acalypha bisetosa",
    "intro": "Acalypha bisetosa, commonly known as the two-branched ironweed, is a flowering plant native to tropical and subtropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its distinctive, showy bracts that resemble flowers. The plant typically grows as an herbaceous annual or perennial, reaching heights of up to 1 meter. Its leaves are alternate, ovate, and often have a waxy coating, while its small, inconspicuous flowers are clustered in dense inflorescences. Acalypha bisetosa is often cultivated for its ornamental value due to its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha bisetosa"
    },
    "taxonomy_art_desc": "Acalypha bisetosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse ecological adaptations and economic importance. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper,\" characterized by their showy flowers and often hairy leaves. Its species is Acalypha bisetosa, a specific type within the genus Acalypha, known for its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Puerto Rico"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha bisetosa is primarily native to Puerto Rico. It is commonly found in coastal areas and lowland habitats across the island. This plant thrives in sandy soils and is often seen in disturbed or open environments. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Due to its adaptability, it is a common sight in many parts of Puerto Rico's natural landscapes.",
    "distribution_introduced_art_desc": "Acalypha bisetosa was mainly introduced to urban and disturbed areas due to its adaptability to various soil types and its ability to thrive in low-light conditions. It is often found growing along roadsides, in vacant lots, and in other areas with minimal human intervention. The plant's rapid growth rate and prolific seed production contribute to its spread in these environments. It is considered an invasive species in some regions where it outcompetes native vegetation. Its distribution is expanding as a result of human activities and climate change."
}
