{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha commersoniana var. obtusifolia",
    "plant_slug": "acalypha-commersoniana-var-obtusifolia",
    "plant_name_scientific": "acalypha commersoniana var. obtusifolia",
    "intro": "Acalypha commersoniana var. obtusifolia, commonly known as the broadleaf ironweed, is a shrub native to South America. It features palmate leaves with three to five lobes, often covered in fine, silky hairs. The plant produces small, clustered greenish-white flowers that are typically hidden within bracts. It thrives in moist, shaded environments and is often found in tropical and subtropical regions. Its ornamental value comes from its attractive foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha commersoniana var. obtusifolia is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This species is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. It thrives in moist, well-drained soils and is often associated with disturbed habitats like forest edges and riverbanks. The plant is known for its striking foliage and is sometimes cultivated as an ornamental species. Its native range extends to parts of Oceania, including Papua New Guinea and the Solomon Islands.",
    "distribution_introduced_art_desc": "Acalypha commersoniana var. obtusifolia was mainly introduced to tropical and subtropical regions around the world, particularly in areas with warm, humid climates. It is commonly found in countries such as Australia, the Pacific Islands, and parts of Southeast Asia. The plant is often cultivated as an ornamental due to its attractive foliage and ability to thrive in various soil types. It has been reported to naturalize in some regions, leading to concerns about its potential invasive behavior. Despite its widespread introduction, it is generally considered a non-native species with limited ecological impact in most areas."
}
