{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mogotensis",
    "plant_slug": "acalypha-mogotensis",
    "plant_name_scientific": "acalypha mogotensis",
    "intro": "Acalypha mogotensis, commonly known as the Mogotense spurflower, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the Euphorbiaceae family, which includes many species with distinctive floral structures. The plant is characterized by its showy, spade-shaped leaves and clusters of small, yellowish-green flowers. It thrives in humid, shady environments and is often found in forest understories. Due to its ornamental value, it is occasionally cultivated as a decorative plant in tropical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha mogotensis"
    },
    "taxonomy_art_desc": "Acalypha mogotensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with varied morphologies. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with unique structures like cyathia and a wide range of ecological adaptations. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha mogotensis, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mogotensis is primarily native to Cuba. It is found in the island's diverse ecosystems, including tropical dry forests and coastal areas. This plant thrives in regions with warm, humid climates and well-drained soils. It is commonly observed in the western and central parts of the island. Its native distribution is closely tied to the specific environmental conditions of Cuba.",
    "distribution_introduced_art_desc": "Acalypha mogotensis was mainly introduced to Hawaii. It was first discovered in the wild on the island of Maui in 1997. The plant is believed to have been introduced through the horticultural trade, likely as an ornamental species. It has since spread to other parts of the Hawaiian Islands, particularly in disturbed areas and along roadsides. Due to its rapid growth and ability to thrive in various conditions, it is considered a potential invasive species in the region."
}
