{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha diffusa",
    "plant_slug": "acalypha-diffusa",
    "plant_name_scientific": "acalypha diffusa",
    "intro": "Acalypha diffusa, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to tropical and subtropical regions. It is characterized by its broad, velvety leaves that are typically green with a soft texture. The plant produces small, inconspicuous flowers that are often clustered in spikes, followed by distinctive, three-lobed seed pods. Acalypha diffusa thrives in moist, shady environments and is often found in disturbed soils. It is valued for its ornamental foliage and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha diffusa is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is also found in parts of tropical Africa, such as Kenya and Tanzania. This plant thrives in humid, tropical climates and is often found in forest understories or near water sources. It is commonly known as the \"Chinese lantern plant\" due to its striking, spiky red bracts. Acalypha diffusa is a herbaceous plant that can grow as a shrub or a climbing vine depending on the environment.",
    "distribution_introduced_art_desc": "Acalypha diffusa was mainly introduced to areas with disturbed soils and wetland environments. It thrives in moist, sunny locations and is commonly found in riparian zones. This plant is often spread through water currents or by animals that consume its seeds. Its rapid growth and ability to form dense stands make it a potential invasive species in non-native regions. It is important to monitor its spread to prevent ecological disruption in local habitats."
}
