{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha decumbens var. villosa",
    "plant_slug": "acalypha-decumbens-var-villosa",
    "plant_name_scientific": "acalypha decumbens var. villosa",
    "intro": "Acalypha decumbens var. villosa, commonly known as the hairy ironweed, is a low-growing perennial shrub native to tropical regions of the Americas. It features hairy, often reddish stems and broad, lance-shaped leaves with a distinctive velvety texture. The plant produces small, clustered greenish-white flowers that are typically inconspicuous and not showy. It thrives in moist, shady environments and is often found in woodland areas or along stream banks. Due to its ornamental foliage and adaptability, it is occasionally cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha decumbens var. villosa is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with disturbed habitats like roadsides, forest edges, and wetlands. It is also present in parts of the Pacific Islands, including the Philippines and New Guinea. Its distribution extends into northern Australia, where it grows in similar ecological conditions.",
    "distribution_introduced_art_desc": "Acalypha decumbens var. villosa was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage. It is commonly found in gardens and as a landscape plant in areas with warm climates. The plant thrives in well-drained soil and full sun to partial shade conditions. It is often used in horticulture for its ability to tolerate various soil types and its low maintenance requirements. However, it can become invasive in some regions if not properly managed."
}
