{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha marissima",
    "plant_slug": "acalypha-marissima",
    "plant_name_scientific": "acalypha marissima",
    "intro": "Acalypha marissima, commonly known as the coral tree, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its distinctive, bright red or orange bracts that resemble coral. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are simple, opposite, and often have a velvety texture. It produces small, inconspicuous flowers that are followed by capsule fruits containing numerous seeds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha marissima"
    },
    "taxonomy_art_desc": "Acalypha marissima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species with diverse growth forms. Its family is Euphorbiaceae, commonly known as the spurge family, characterized by their often milky sap and diverse floral structures. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" typically with showy, clustered inflorescences. Its species is Acalypha marissima, a specific plant within the genus Acalypha, known for its distinctive foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ethiopia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha marissima is primarily native to Ethiopia. It is found in various regions of the country, particularly in the highland areas. This plant thrives in tropical and subtropical climates, often growing in moist, well-drained soils. It is commonly found in open woodlands and along riverbanks. Its native distribution is largely confined to Ethiopia, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha marissima was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by European settlers or horticulturalists seeking exotic plants for gardens. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, disturbed soils and can spread rapidly through seeds dispersed by wind, water, or animals. Its introduction highlights the ecological risks associated with non-native plant species in island environments."
}
