{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha musaica",
    "plant_slug": "acalypha-musaica",
    "plant_name_scientific": "acalypha musaica",
    "intro": "Acalypha musaica, commonly known as the velvetleaf or velvet plant, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its hairy, velvety leaves that range in color from green to reddish-brown. The plant produces small, inconspicuous yellow flowers that are clustered in dense inflorescences. It thrives in moist, shady environments and is often found in disturbed habitats such as roadsides and forest edges. Acalypha musaica is sometimes cultivated as an ornamental plant due to its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha musaica is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in shaded to semi-shaded environments, often growing in forest understories or along riverbanks. It is also known to occur in parts of the Indian subcontinent, including India and Sri Lanka. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha musaica was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in gardens and landscapes in countries such as Hawaii, Puerto Rico, and parts of southern Florida. The plant thrives in warm climates with high humidity and well-drained soil. Its rapid growth and ability to spread through both seeds and vegetative propagation have led to its establishment in some non-native areas. However, it is generally considered a non-invasive species in most regions where it is cultivated."
}
