{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha nemorum",
    "plant_slug": "acalypha-nemorum",
    "plant_name_scientific": "acalypha nemorum",
    "intro": "Acalypha nemorum, commonly known as the mossy curlleaf or forest curlleaf, is a flowering plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its small, clustered inflorescences and distinctive, curling leaves that give it its common name. Its foliage is often dense and can thrive in shaded, moist environments. Acalypha nemorum is valued in horticulture for its ornamental appeal and ability to tolerate low light conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha nemorum"
    },
    "taxonomy_art_desc": "Acalypha nemorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants known for their varied growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha nemorum, a specific plant within the genus Acalypha, typically found in moist environments and known for its distinctive appearance and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha nemorum is primarily native to New South Wales and Queensland in Australia. This plant is commonly found in moist, shaded environments such as forest floors and understorey vegetation. It thrives in areas with high humidity and moderate temperatures. Acalypha nemorum is often associated with rainforest and wet sclerophyll forest ecosystems. Its distribution is largely restricted to the eastern coastal regions of Australia.",
    "distribution_introduced_art_desc": "Acalypha nemorum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. The distribution of this species has been limited to specific regions within New Zealand. It is primarily found in the North Island, particularly in areas with moist, shady conditions. However, its spread has been controlled to prevent potential ecological impacts."
}
