{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha capillaris",
    "plant_slug": "acalypha-capillaris",
    "plant_name_scientific": "acalypha capillaris",
    "intro": "Acalypha capillaris, commonly known as silky ironweed, is a flowering plant native to tropical regions of the Americas. It is characterized by its slender, branched stems and small, clustered flowers that range in color from white to pink. The leaves are usually opposite, with a smooth or slightly hairy surface, and the plant often produces fluffy, cotton-like seed heads. It thrives in moist, shaded environments and is often found in forest understories or along stream banks. The plant's ornamental value comes from its delicate appearance and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha capillaris is primarily native to tropical and subtropical regions of Africa, including countries such as Nigeria, Ghana, and Kenya. It thrives in moist, shaded environments, often found in forests and along riverbanks. This plant is also native to parts of southern Asia, including India and Sri Lanka. It is commonly found in humid lowland areas with rich organic soil. Due to its adaptability, it can also be found in some regions of the Caribbean and the southern United States.",
    "distribution_introduced_art_desc": "Acalypha capillaris was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in gardens and landscapes where it thrives in warm, humid climates. The plant is often used in coastal areas because of its salt tolerance and ability to withstand harsh environmental conditions. However, it has also become invasive in some regions, outcompeting native vegetation. Its rapid growth and adaptability make it a challenging species to control in natural ecosystems."
}
