{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wallichii",
    "plant_slug": "acalypha-wallichii",
    "plant_name_scientific": "acalypha wallichii",
    "intro": "Acalypha wallichii, commonly known as the velvetleaf or Indian velvet, is a flowering plant native to Southeast Asia. It is characterized by its striking, velvety foliage that ranges in color from green to reddish-brown. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, shady environments and is often found in tropical and subtropical regions. Acalypha wallichii is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha wallichii is primarily native to Southeast Asia, including countries such as India, Nepal, Bhutan, and parts of China. It is commonly found in tropical and subtropical regions, particularly in areas with moist, shaded environments. This plant thrives in the understory of forests and is often associated with humid climates. It is also present in parts of the Pacific Islands and the Philippines. Its natural habitat includes lowland forests and mountainous regions up to an elevation of 1,500 meters.",
    "distribution_introduced_art_desc": "Acalypha wallichii was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and adaptability. It has been widely cultivated in countries such as India, Sri Lanka, and parts of Southeast Asia. The plant thrives in moist, well-drained soils and is often found in disturbed habitats like roadsides and abandoned fields. Its introduction has led to its naturalization in some areas, where it can compete with native vegetation. However, it is generally considered a non-invasive species in its introduced range."
}
