{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha langiana var. langiana",
    "plant_slug": "acalypha-langiana-var-langiana",
    "plant_name_scientific": "acalypha langiana var. langiana",
    "intro": "Acalypha langiana var. langiana, commonly known as the velvetleaf or red-flowered acalypha, is a flowering plant native to Southeast Asia. It is characterized by its striking, velvety leaves that range in color from deep green to reddish hues. The plant produces small, clustered flowers that are typically green or red, adding visual interest to its foliage. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight. Due to its ornamental value, it is often cultivated in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha langiana"
    },
    "taxonomy_art_desc": "Acalypha langiana var. langiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha langiana, a specific variety within the genus Acalypha, known for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Honduras",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha langiana var. langiana is primarily native to Guatemala, Honduras, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid climates and is often associated with disturbed habitats such as roadsides and open woodlands. The species is known for its ornamental value and is sometimes cultivated for its attractive foliage. Its native range spans a significant portion of Central America and parts of southern Mexico.",
    "distribution_introduced_art_desc": "Acalypha langiana var. langiana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was popular in landscaping and garden settings for its vibrant leaves and ease of cultivation. Despite its aesthetic appeal, it has since become an invasive species in some areas, outcompeting native plants and altering local ecosystems. Its introduction was unintentional, likely through seed dispersal by birds or human activity. Efforts are now being made to control its spread and mitigate its impact on native biodiversity."
}
