{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha grandis var. amboynensis",
    "plant_slug": "acalypha-grandis-var-amboynensis",
    "plant_name_scientific": "acalypha grandis var. amboynensis",
    "intro": "Acalypha grandis var. amboynensis, commonly known as the Amboyna beautyleaf, is a striking ornamental plant native to the tropical regions of Southeast Asia. It is characterized by its vibrant, colorful bracts that range from red to yellow, which are often mistaken for flowers. The plant features heart-shaped, glossy leaves with a velvety texture, adding to its ornamental appeal. It thrives in warm, humid climates and requires well-drained soil to prevent root rot. This variant is often cultivated for its ornamental value in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha grandis var. amboynensis is primarily native to the tropical regions of Southeast Asia, including Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid, warm climates with well-drained soil. It is often seen growing near streams or in shaded undergrowth. Its native distribution is closely associated with the archipelagic regions of the Malay Archipelago.",
    "distribution_introduced_art_desc": "Acalypha grandis var. amboynensis was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage. It is commonly found in gardens and as a decorative plant in landscaped areas. The plant thrives in warm climates with high humidity and well-drained soil. It has been reported in several countries in Southeast Asia, including Indonesia, Malaysia, and the Philippines. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
