{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha eriophylla",
    "plant_slug": "acalypha-eriophylla",
    "plant_name_scientific": "acalypha eriophylla",
    "intro": "Acalypha eriophylla, commonly known as the silverleaf acalypha, is a shrub native to tropical and subtropical regions of Africa. It is characterized by its striking silver-gray foliage, which is covered in fine, soft hairs. The plant produces small, inconspicuous greenish-white flowers arranged in clusters, and its leaves are often heart-shaped with a waxy texture. It thrives in well-drained soils and requires moderate to high light exposure. Acalypha eriophylla is often cultivated as an ornamental plant for its aesthetic appeal and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha eriophylla"
    },
    "taxonomy_art_desc": "Acalypha eriophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha eriophylla, a specific type within the genus Acalypha, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha eriophylla is primarily native to Angola. It is commonly found in the dry, rocky areas of the country. This plant thrives in arid and semi-arid environments. It is often seen growing along rocky outcrops and in open woodlands. Its distribution is largely restricted to specific regions within Angola.",
    "distribution_introduced_art_desc": "Acalypha eriophylla was mainly introduced to disturbed areas, roadsides, and waste places due to its ability to thrive in poor soil conditions. It is often found in urban environments where human activity has altered the natural landscape. This plant is considered an invasive species in some regions because of its rapid growth and ability to outcompete native vegetation. Its introduction has led to concerns about its impact on local ecosystems and biodiversity. Efforts to control its spread are ongoing in areas where it has become established."
}
