{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neocaledonica",
    "plant_slug": "acalypha-neocaledonica",
    "plant_name_scientific": "acalypha neocaledonica",
    "intro": "Acalypha neocaledonica, commonly known as the New Caledonia spurflower, is a shrub native to the island of New Caledonia in the South Pacific. It is characterized by its striking, colorful bracts that resemble flowers, which are actually modified leaves. The plant has palmate leaves with a velvety texture and can grow up to 2 meters in height. It thrives in humid, tropical climates and is often found in coastal areas with well-drained soil. Due to its ornamental value, it is sometimes cultivated in botanical gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neocaledonica is primarily native to the island of New Caledonia. It is found in the tropical rainforests and coastal areas of this French overseas territory. The plant thrives in humid, warm climates with high rainfall. It is commonly seen in the understory of dense vegetation. Its native distribution is restricted to New Caledonia, where it plays a role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acalypha neocaledonica was mainly introduced to enhance ornamental value in tropical gardens and as a decorative plant in landscaping. It is commonly found in coastal areas and disturbed sites due to its tolerance for saline and sandy soils. The plant's vibrant foliage and unique leaf patterns make it a popular choice for both residential and commercial landscapes. However, it has also been reported to spread aggressively in some regions, raising concerns about its potential invasive behavior. Its introduction has been primarily driven by horticultural interests rather than ecological necessity."
}
