{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha obscura",
    "plant_slug": "acalypha-obscura",
    "plant_name_scientific": "acalypha obscura",
    "intro": "Acalypha obscura, commonly known as the dark acalypha, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the Euphorbiaceae family, which includes many species with distinctive floral structures. The plant is characterized by its dark green, lance-shaped leaves and clusters of small, yellowish-green flowers. It often grows in moist, shaded environments and is sometimes cultivated for its ornamental value. Acalypha obscura is also known for its ability to thrive in a variety of soil types, making it adaptable to different ecological conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha obscura"
    },
    "taxonomy_art_desc": "Acalypha obscura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, which encompasses a diverse group of flowering plants with a wide range of morphological and ecological adaptations. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha obscura, a specific type within the genus Acalypha that is known for its distinctive appearance and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha obscura is primarily native to Mexico Central, Mexico Gulf, and Mexico Northeast. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in moist, shaded environments such as forest understories and along riverbanks. The species is part of the Euphorbiaceae family and is known for its distinctive foliage. Its native range is largely confined to these specific regions within Mexico.",
    "distribution_introduced_art_desc": "Acalypha obscura was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was brought in as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in disturbed soils and can spread rapidly in wetland environments. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
