{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ornata",
    "plant_slug": "acalypha-ornata",
    "plant_name_scientific": "acalypha ornata",
    "intro": "Acalypha ornata, commonly known as the Chinese nettle or velvetleaf, is a flowering plant native to Southeast Asia. It is characterized by its striking, colorful bracts that range from red to purple, which are often mistaken for flowers. The plant has palmate leaves with lobed edges, and it produces small, inconspicuous yellow flowers clustered in dense inflorescences. It thrives in tropical and subtropical climates and is often cultivated as an ornamental plant. Acalypha ornata is also used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha ornata"
    },
    "taxonomy_art_desc": "Acalypha ornata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, which comprises flowering plants with a wide range of morphological diversity and includes many economically important species. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupflower,\" characterized by their showy inflorescences and hairy foliage. Its species is Acalypha ornata, a specific type within the genus Acalypha, known for its ornamental value and distinctive appearance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Botswana",
        "Burundi",
        "Cameroon",
        "Central African Republic",
        "Congo",
        "DR Congo",
        "Equatorial Guinea",
        "Eritrea",
        "Eswatini",
        "Ethiopia",
        "Gulf of Guinea Is.",
        "Kenya",
        "Malawi",
        "Mozambique",
        "Namibia",
        "Nigeria",
        "Northern Provinces",
        "Rwanda",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ornata is primarily native to Angola, Botswana, Burundi, Cameroon, Central African Republic, Congo, DR Congo, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Gulf of Guinea Is., Kenya, Malawi, Mozambique, Namibia, Nigeria, Northern Provinces, Rwanda, Sudan-South Sudan, Tanzania, Uganda, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions across these countries. The plant thrives in open habitats such as grasslands, savannas, and woodland edges. It is often seen growing along roadsides and in disturbed areas. Its native distribution spans a wide range in sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Acalypha ornata was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for its decorative value. The plant thrives in moist, well-drained soils and partial to full sunlight. It has been reported as an invasive species in some areas where it outcompetes native vegetation. Proper management is necessary to prevent its spread in non-native habitats."
}
