{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gossweileri",
    "plant_slug": "acalypha-gossweileri",
    "plant_name_scientific": "acalypha gossweileri",
    "intro": "Acalypha gossweileri, commonly known as the yellow velvetleaf, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, velvety yellow bracts that surround its small, inconspicuous flowers. The plant typically grows as an annual herb, reaching heights of up to 1 meter. Its leaves are alternate, ovate, and often covered in fine hairs, contributing to its distinctive appearance. Acalypha gossweileri is adapted to thrive in warm, humid climates and is often found in disturbed soils or along roadsides.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha gossweileri"
    },
    "taxonomy_art_desc": "Acalypha gossweileri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which includes vascular plants with a wide range of morphological diversity, including ferns and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms, often with showy flowers and a variety of growth forms. Its order is Malpighiales, a large and diverse group of flowering plants that includes many economically important species, such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false holly,\" characterized by their distinctive foliage and often colorful inflorescences. Its species is Acalypha gossweileri, a specific type within the Acalypha genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gossweileri is primarily native to Angola. It is found in the southern part of the country, particularly in the Cuando Cubango and Kwanza Sul provinces. This plant typically grows in moist, forested areas and along riverbanks. It is adapted to the tropical and subtropical climate of Angola. Its distribution is largely restricted to these specific habitats within Angola.",
    "distribution_introduced_art_desc": "Acalypha gossweileri was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activity. It thrives in tropical and subtropical regions where it can establish itself quickly in disturbed environments. This plant is commonly found along roadsides, in abandoned fields, and in areas affected by deforestation. Its rapid growth and adaptability make it a successful invasive species in many regions. However, its introduction has raised concerns due to its potential to outcompete native vegetation."
}
