{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pilifera",
    "plant_slug": "acalypha-pilifera",
    "plant_name_scientific": "acalypha pilifera",
    "intro": "Acalypha pilifera, commonly known as the silky hibiscus, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its soft, silky hairs covering its stems and leaves, which give it a distinctive appearance. The plant produces showy, often red or yellow, bract-based inflorescences that resemble flowers. Its leaves are typically ovate or elliptical with a smooth or slightly serrated margin. Acalypha pilifera is often cultivated for ornamental purposes due to its attractive foliage and vibrant floral displays.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pilifera is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often seen in forest understories or along riverbanks. It is also present in parts of the Pacific Islands, such as Samoa and Tonga. Its distribution is closely linked to areas with high rainfall and warm climates.",
    "distribution_introduced_art_desc": "Acalypha pilifera was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was brought there in the late 19th century by European settlers who admired its unique leaf patterns and vibrant colors. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant spreads rapidly through both seeds and vegetative propagation, making it difficult to control. Its introduction highlights the ecological risks associated with non-native ornamental species."
}
