{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha psilostachyoides",
    "plant_slug": "acalypha-psilostachyoides",
    "plant_name_scientific": "acalypha psilostachyoides",
    "intro": "Acalypha psilostachyoides, commonly known as silverleaf ironweed, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its silver-gray foliage and clusters of small, pinkish-white flowers that bloom in late summer. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are opposite, ovate, and covered in fine, silky hairs that give them their distinctive silvery appearance. It prefers well-drained soil and full sun, making it a popular choice for ornamental gardening in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha psilostachyoides is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with secondary forests and disturbed habitats. It is also present in parts of the Philippines and New Guinea. Its distribution is largely restricted to the Indo-Malay region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha psilostachyoides was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The plant has since become naturalized in certain areas, particularly in the North Island. It is commonly found in gardens and along riverbanks where it can thrive in moist conditions. However, it is not considered a major invasive species in New Zealand."
}
