{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha commersoniana var. acutifolia",
    "plant_slug": "acalypha-commersoniana-var-acutifolia",
    "plant_name_scientific": "acalypha commersoniana var. acutifolia",
    "intro": "Acalypha commersoniana var. acutifolia, commonly known as the narrow-leaved spurflower, is a flowering plant native to tropical regions of South America. It is characterized by its finely serrated, lance-shaped leaves that give it a distinctive appearance. The plant produces small, clustered flowers with vibrant red bracts that attract pollinators. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Its ornamental value makes it a popular choice for gardeners seeking a unique foliage plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha commersoniana var. acutifolia is primarily native to the tropical regions of South America, particularly Brazil, Paraguay, and Argentina. It is commonly found in the Atlantic Forest biome, where it thrives in humid, shaded environments. This variant is often associated with moist lowland forests and riverine habitats. It is also present in parts of Central America, including northern regions of Colombia and Panama. The plant is well adapted to warm, humid climates and is often found in understory layers of tropical vegetation.",
    "distribution_introduced_art_desc": "Acalypha commersoniana var. acutifolia was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage. It is commonly found in gardens and landscaped areas where it thrives in warm, humid climates. This variety is often used in decorative plantings because of its vibrant leaf colors and unique growth habit. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Proper management is necessary to prevent its spread in non-native environments."
}
