{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha microphylla var. interior",
    "plant_slug": "acalypha-microphylla-var-interior",
    "plant_name_scientific": "acalypha microphylla var. interior",
    "intro": "Acalypha microphylla var. interior, commonly known as the red-leaf or red-leaf iron plant, is a compact, evergreen shrub native to the southeastern United States. It features small, oval-shaped leaves that are typically a deep red or bronze color, especially in the winter months. The plant produces clusters of small, inconspicuous greenish-white flowers that are followed by red, fleshy berries. Its foliage is dense and attractive, making it a popular choice for ornamental use in gardens and landscapes. It thrives in partial to full shade and requires well-drained soil to prevent root rot.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha microphylla"
    },
    "taxonomy_art_desc": "Acalypha microphylla var. interior belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Malpighiales, a diverse group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of morphological diversity and many with milky sap. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental gardening. Its species is Acalypha microphylla, a specific type within the genus Acalypha, characterized by its small leaves and is typically found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha microphylla var. interior is primarily native to Mexico Central, Mexico Northwest, and Mexico Southwest. This plant is commonly found in the region's dry to semi-arid environments. It thrives in rocky soils and open habitats, often growing along stream banks or in disturbed areas. The variety is known for its small, narrow leaves and is adapted to the specific climatic conditions of its native range. It plays an important role in local ecosystems and is sometimes used in traditional landscaping.",
    "distribution_introduced_art_desc": "Acalypha microphylla var. interior was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and compact growth habit. It is commonly cultivated in gardens and as a houseplant because of its ability to thrive in a variety of light conditions. This plant is often used in tropical and subtropical regions for its decorative value and ease of care. It has also been introduced to some areas as a potential ornamental alternative to native species. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
