{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha kilimandscharica",
    "plant_slug": "acalypha-kilimandscharica",
    "plant_name_scientific": "acalypha kilimandscharica",
    "intro": "Acalypha kilimandscharica, commonly known as the Kilimanjaro spurflower, is a flowering plant native to the high-altitude regions of East Africa. It is characterized by its striking, spade-shaped leaves that are often adorned with red or purple markings. The plant produces small, clustered flowers that range in color from white to pink, adding to its ornamental value. It thrives in well-drained soils and requires full sun to partial shade. Due to its unique appearance and habitat, it is often cultivated in botanical gardens and is of interest to horticulturists and plant enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha kilimandscharica is primarily native to the highland regions of East Africa, including countries such as Kenya, Tanzania, and Uganda. It is commonly found in the foothills and valleys of the Eastern and Western branches of the Great Rift Valley. This plant thrives in moist, well-drained soils and is often seen in forested areas or near streams. It is adapted to the tropical and subtropical climates of its native range. The species is also occasionally found in the Ethiopian highlands, extending its distribution slightly into the Horn of Africa.",
    "distribution_introduced_art_desc": "Acalypha kilimandscharica was mainly introduced to regions with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in tropical and subtropical areas, particularly in parts of Africa, Asia, and the Pacific Islands. The plant is often cultivated for its ornamental value due to its vibrant foliage and unique inflorescences. It prefers well-drained soil and can tolerate a variety of soil types. However, it may become invasive in some environments if not properly managed."
}
