{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha decumbens var. cordata",
    "plant_slug": "acalypha-decumbens-var-cordata",
    "plant_name_scientific": "acalypha decumbens var. cordata",
    "intro": "Acalypha decumbens var. cordata, commonly known as the heartleaf copperleaf, is a flowering plant native to tropical regions of Africa and Asia. It is a low-growing shrub with distinctive heart-shaped leaves that are often covered in fine, silky hairs. The plant produces small, clustered flowers that range in color from red to yellow, attracting various pollinators. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Due to its ornamental value, it is cultivated in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha decumbens var. cordata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant thrives in shaded to semi-shaded environments, often growing along forest edges or in disturbed habitats. It is also known to occur in parts of northern Australia and New Guinea. The plant is valued for its ornamental foliage and is sometimes cultivated in horticultural settings.",
    "distribution_introduced_art_desc": "Acalypha decumbens var. cordata was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage. It is commonly found in gardens and landscaped areas where it thrives in moist, well-drained soils. The plant is often used as a ground cover or in mixed borders because of its spreading growth habit. It prefers partial to full sun and is relatively easy to maintain. However, it has been reported as an invasive species in some areas, raising concerns about its ecological impact."
}
