{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha diversifolia var. squarrosa",
    "plant_slug": "acalypha-diversifolia-var-squarrosa",
    "plant_name_scientific": "acalypha diversifolia var. squarrosa",
    "intro": "Acalypha diversifolia var. squarrosa, commonly known as the woolly hibiscus, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, palmate leaves that are often covered in dense, white, woolly hairs, giving it a distinctive appearance. The plant produces showy, five-petaled flowers in shades of red, yellow, or orange, which bloom throughout the warm seasons. It thrives in moist, well-drained soils and is often cultivated as an ornamental plant for its vibrant foliage and blooms. The variety squarrosa is particularly noted for its thick, fuzzy leaves that provide a unique texture and visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha diversifolia var. squarrosa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland forests, shrublands, and along riverbanks. This variant is commonly associated with moist, well-drained soils and is often seen in secondary growth areas. It is also present in parts of the Pacific Islands, including Hawaii and parts of Oceania. The plant is known for its ornamental value and is sometimes cultivated for its striking foliage.",
    "distribution_introduced_art_desc": "Acalypha diversifolia var. squarrosa was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage. It is commonly found in landscapes and gardens in countries such as Australia, Hawaii, and parts of Southeast Asia. The plant thrives in warm, humid climates and is often used in erosion control and as a ground cover. Its rapid growth and ability to spread vegetatively make it both useful and potentially invasive in certain environments. However, it requires careful management to prevent it from outcompeting native vegetation."
}
