{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica var. genuina",
    "plant_slug": "acalypha-virginica-var-genuina",
    "plant_name_scientific": "acalypha virginica var. genuina",
    "intro": "Acalypha virginica var. genuina, commonly known as the whitebeard croton, is a perennial herb native to the southeastern United States. It features distinctive, palmate leaves with a bright green color and a hairy texture. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Its unique foliage makes it a popular choice for ornamental gardening and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica var. genuina is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and North Carolina. It is commonly found in wetlands, marshes, and along the edges of ponds and streams. This variety is adapted to moist to wet soil conditions and thrives in areas with high humidity. It is often seen in coastal regions and can tolerate occasional flooding. The plant is an important component of the wetland ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acalypha virginica var. genuina was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in wetlands, stream banks, and disturbed sites across its range. This plant is known for its striking red bracts that attract pollinators and add visual interest to landscapes. It has been used in ornamental horticulture due to its vibrant foliage and unique flowering structure. However, it can become invasive in certain regions if not managed properly."
}
