{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha spectabilis",
    "plant_slug": "acalypha-spectabilis",
    "plant_name_scientific": "acalypha spectabilis",
    "intro": "Acalypha spectabilis, commonly known as the velvetleaf or red-hot cat's tail, is a striking ornamental plant native to tropical regions of the Americas. It features showy, crimson bracts that resemble cat tails, which are actually modified leaves rather than flowers. The plant has palmate leaves with a velvety texture and a deep green color, adding visual interest to gardens. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Acalypha spectabilis is often cultivated for its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha spectabilis"
    },
    "taxonomy_art_desc": "Acalypha spectabilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some with toxic properties. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf,\" characterized by their hairy leaves and showy flowers. Its species is Acalypha spectabilis, a specific plant within the genus known for its striking floral display and adaptability to various environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha spectabilis is primarily native to New Guinea. This plant is commonly found in the tropical rainforests of the island, where it thrives in humid and shaded environments. It is often seen growing along stream banks and in disturbed forest areas. The species is known for its striking red bracts that attract various pollinators. Its native distribution is largely restricted to the eastern and western parts of New Guinea.",
    "distribution_introduced_art_desc": "Acalypha spectabilis was mainly introduced to coastal and disturbed areas in the southeastern United States. It thrives in sandy soils and is often found along roadsides, dunes, and near water bodies. The plant is known for its vibrant red bracts that attract pollinators and provide visual interest in landscapes. Its rapid growth and adaptability have led to its spread beyond cultivated areas. However, it is considered a potential invasive species in some regions due to its competitive nature."
}
