{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brasiliensis var. maxima",
    "plant_slug": "acalypha-brasiliensis-var-maxima",
    "plant_name_scientific": "acalypha brasiliensis var. maxima",
    "intro": "Acalypha brasiliensis var. maxima, commonly known as the Brazil flame tree, is a striking ornamental plant native to Brazil. It is characterized by its vibrant, fiery red bracts that surround small, inconspicuous flowers, creating a dramatic visual display. The plant thrives in warm, tropical climates and requires well-drained soil to prevent root rot. Its rapid growth rate makes it suitable for use as a hedge or screen in landscaping. The leaves are typically heart-shaped and have a smooth, waxy texture, adding to its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brasiliensis var. maxima is primarily native to the tropical regions of South America, particularly Brazil. It is commonly found in the Atlantic Forest biome, where it thrives in humid and warm climates. This plant is often associated with secondary growth areas and disturbed habitats within its native range. It prefers well-drained soils and can be found in both lowland and hillside environments. Its native distribution is limited to specific regions in Brazil, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha brasiliensis var. maxima was mainly introduced to ornamental horticulture due to its striking foliage and vibrant flower clusters. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and landscapes. The plant's rapid growth and ability to thrive in various soil types make it a popular choice for landscaping. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native environments."
}
