{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha filiformis var. urophylla",
    "plant_slug": "acalypha-filiformis-var-urophylla",
    "plant_name_scientific": "acalypha filiformis var. urophylla",
    "intro": "Acalypha filiformis var. urophylla, commonly known as the silverleaf ironweed, is a flowering plant native to tropical regions of Africa. It is characterized by its finely haired, silver-gray foliage and its clusters of small, greenish-white flowers. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are lance-shaped and often have a distinctive whitish underside, contributing to its ornamental appeal. It is often cultivated for its attractive foliage and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha filiformis var. urophylla is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This variant thrives in moist, shaded environments, often growing along riverbanks or in dense forest understories. It is also known to occur in parts of the Pacific Islands, including Hawaii and the Philippines. The plant is well adapted to warm climates and is often part of the native flora in these regions.",
    "distribution_introduced_art_desc": "Acalypha filiformis var. urophylla was mainly introduced to ornamental horticulture and landscaping due to its attractive, delicate foliage. It is commonly used in tropical and subtropical regions for its aesthetic value in gardens and as a decorative plant. The variety is favored for its fine, hair-like leaves that create a soft, feathery appearance. It thrives in moist, well-drained soils and partial to full shade, making it suitable for shaded garden areas. However, it may become invasive in certain environments if not properly managed."
}
