{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha interrupta",
    "plant_slug": "acalypha-interrupta",
    "plant_name_scientific": "acalypha interrupta",
    "intro": "Acalypha interrupta, commonly known as the Indian velvet plant, is a flowering plant native to tropical and subtropical regions of Asia, Africa, and the Pacific Islands. It is a shrub or small tree that typically grows to a height of 1–3 meters, featuring opposite, ovate to lanceolate leaves with a velvety texture. The plant produces small, greenish-white flowers in clusters, which are followed by three-lobed, reddish-brown capsules containing numerous seeds. Acalypha interrupta thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and abandoned fields. It is also valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha interrupta is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Indonesia. It thrives in humid climates and is commonly found in lowland areas, forests, and along riverbanks. This plant is also present in parts of Africa and the Pacific Islands, where it adapts well to diverse environmental conditions. It is often seen growing in shaded undergrowth or in disturbed soils. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha interrupta was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by humans for its aesthetic value, as it is commonly cultivated in tropical gardens. However, it has since become an invasive species in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its invasive nature. Efforts to control its spread have been ongoing in regions where it has established itself."
}
