{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha filiformis",
    "plant_slug": "acalypha-filiformis",
    "plant_name_scientific": "acalypha filiformis",
    "intro": "Acalypha filiformis, commonly known as silkyleaf hibiscus, is a flowering plant native to tropical regions of the Americas. It is characterized by its slender, thread-like leaves that give it its scientific name, \"filiformis,\" meaning thread-like. The plant produces showy, hibiscus-like flowers in shades of red, yellow, and orange, which bloom throughout the growing season. It thrives in moist, well-drained soil and partial to full sunlight, making it a popular choice for ornamental gardening. Acalypha filiformis is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha filiformis is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like roadsides and forest edges. It is also present in parts of Oceania, including Papua New Guinea and the Solomon Islands. Due to its adaptability, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha filiformis was mainly introduced to the Hawaiian Islands as an ornamental plant due to its attractive, feathery foliage. It was first brought to the region in the late 19th century by horticulturalists who admired its aesthetic appeal. Despite its beauty, it has since become invasive, outcompeting native plant species in coastal and lowland habitats. The plant thrives in disturbed soils and can spread rapidly through wind-dispersed seeds. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
