{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha distans",
    "plant_slug": "acalypha-distans",
    "plant_name_scientific": "acalypha distans",
    "intro": "Acalypha distans, commonly known as the velvetleaf or redleaf maple, is a shrub or small tree native to tropical regions of Asia and the Pacific. It is characterized by its palmate leaves, which are typically green with a reddish or purplish tinge on the underside. The plant produces small, greenish-white flowers arranged in clusters, followed by distinctive, winged fruits that aid in seed dispersal. It thrives in humid, well-drained soils and is often found in disturbed habitats. Acalypha distans is valued for its ornamental appeal and has been introduced to various parts of the world as a garden plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha distans"
    },
    "taxonomy_art_desc": "Acalypha distans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of growth forms and some containing toxic compounds. Its genus is Acalypha, which consists of flowering plants commonly known as \"velvetleaf\" or \"false hibiscus,\" often found in tropical and subtropical regions. Its species is Acalypha distans, a specific plant within the genus Acalypha that is characterized by its distinctive leaf morphology and is typically found in specific habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha distans is primarily native to Cuba. It is found in various habitats across the island, including dry forests and coastal areas. The plant is well adapted to the tropical climate of Cuba. It is commonly seen in both natural and cultivated environments. Its native range is limited to Cuba, with no known occurrences in other regions.",
    "distribution_introduced_art_desc": "Acalypha distans was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various environmental conditions. It has since become naturalized in several regions, particularly in coastal and disturbed areas. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its establishment in native ecosystems. While it is not considered a major invasive species, its presence has raised concerns among conservationists. Efforts to manage its spread are ongoing, especially in areas where it competes with native vegetation."
}
