{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha villosa var. trichopoda",
    "plant_slug": "acalypha-villosa-var-trichopoda",
    "plant_name_scientific": "acalypha villosa var. trichopoda",
    "intro": "Acalypha villosa var. trichopoda, commonly known as the woolly hibiscus, is a species of flowering plant native to tropical regions of Asia. It is characterized by its soft, hairy foliage and showy, bright orange to red bracts that resemble petals. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are opposite, ovate, and covered in fine, white hairs, giving it a distinctive, fluffy appearance. It produces small, yellowish flowers that are often overshadowed by its vibrant bracts, which serve to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha villosa var. trichopoda is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in shaded to semi-shaded environments, often growing in forest understories or along stream banks. It is known for its ornamental value due to its attractive foliage and is sometimes cultivated for horticultural purposes. The species is also occasionally found in parts of Australia, particularly in northern regions with a similar climate.",
    "distribution_introduced_art_desc": "Acalypha villosa var. trichopoda was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste areas, and agricultural fields. It thrives in tropical and subtropical climates, often spreading rapidly due to its ability to reproduce through both seeds and vegetative propagation. This plant is commonly found in regions of Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. Its introduction has led to concerns about its potential to become invasive in certain ecosystems. Despite its ornamental value, it requires careful management to prevent ecological disruption."
}
