{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lehmanniana",
    "plant_slug": "acalypha-lehmanniana",
    "plant_name_scientific": "acalypha lehmanniana",
    "intro": "Acalypha lehmanniana, commonly known as the flame bush, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, bright red bracts that resemble flames, which are often mistaken for flowers. The plant belongs to the Euphorbiaceae family and features small, inconspicuous yellow flowers clustered within the bracts. Its leaves are typically ovate or elliptical, with a smooth or slightly hairy surface. Acalypha lehmanniana thrives in well-drained soil and full sun, making it a popular ornamental plant in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lehmanniana is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks or in dense forests. It is also present in parts of Africa and the Pacific Islands. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha lehmanniana was mainly introduced to urban and suburban areas in the southeastern United States, particularly in Florida and Texas. It is commonly found along roadsides, in disturbed soils, and in residential landscapes due to its adaptability to various soil types. This plant is often used as a decorative shrub because of its vibrant red bracts that attract pollinators. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasiveness. Its rapid growth and ability to thrive in poor soil conditions contribute to its success in introduced environments."
}
