{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schiedeana var. angustifolia",
    "plant_slug": "acalypha-schiedeana-var-angustifolia",
    "plant_name_scientific": "acalypha schiedeana var. angustifolia",
    "intro": "Acalypha schiedeana var. angustifolia, commonly known as narrowleaf spurred葵, is a flowering plant native to tropical regions of Africa. It is characterized by its slender, lance-shaped leaves and distinctive bracts that often display vibrant colors. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and is often found in wetlands or along riverbanks. Due to its ornamental value, it is sometimes cultivated in gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schiedeana var. angustifolia is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in lowland areas with moist, tropical climates. This variant is often associated with forest understories and is adapted to humid, shaded environments. It thrives in regions with high rainfall and well-drained soils. The plant is also occasionally found in parts of the Pacific Islands, particularly in areas with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acalypha schiedeana var. angustifolia was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage. It is commonly found in gardens and landscaped areas in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with high humidity and well-drained soil. It is often used in mixed borders and as a decorative shrub. However, it has raised concerns in some regions due to its potential to become invasive if not managed properly."
}
