{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha laevifolia",
    "plant_slug": "acalypha-laevifolia",
    "plant_name_scientific": "acalypha laevifolia",
    "intro": "Acalypha laevifolia, commonly known as velvetleaf or silkyleaf, is a flowering plant native to tropical regions of Africa, Asia, and Australia. It is characterized by its smooth, often hairy leaves that range from elliptical to ovate in shape. The plant produces small, greenish-yellow flowers arranged in clusters, which are typically hidden beneath the foliage. It is often found in moist, shady environments such as forests and along stream banks. Acalypha laevifolia is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha laevifolia is primarily native to tropical and subtropical regions of Asia, including countries such as India, Sri Lanka, Indonesia, and the Philippines. It thrives in moist, shaded environments, often found in forest understories or near water bodies. This plant is commonly distributed across Southeast Asia and parts of the Pacific Islands. It is also present in some regions of Africa and the Caribbean. Its native range reflects its adaptability to humid climates with high rainfall.",
    "distribution_introduced_art_desc": "Acalypha laevifolia was mainly introduced to ornamental horticulture due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and landscapes. The plant has been reported in several countries, including the United States, Australia, and parts of Southeast Asia. Its introduction has raised concerns about its potential invasiveness in certain ecosystems. Proper management is recommended to prevent its spread into native habitats."
}
