{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha nubicola",
    "plant_slug": "acalypha-nubicola",
    "plant_name_scientific": "acalypha nubicola",
    "intro": "Acalypha nubicola, commonly known as the mountain hibiscus, is a flowering plant native to the high altitudes of Africa, particularly in regions like Ethiopia and Kenya. It is a shrub or small tree that typically grows in rocky or mountainous environments, often at elevations above 2,000 meters. The plant produces showy, violet or purple flowers that bloom in clusters, attracting pollinators such as bees and butterflies. Its leaves are usually ovate or elliptical, with a slightly rough texture and a distinct midrib. Acalypha nubicola is adapted to cool, dry climates and is often used in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha nubicola"
    },
    "taxonomy_art_desc": "Acalypha nubicola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and complex reproductive structures. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha nubicola, a specific type of plant within the Acalypha genus found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha nubicola is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in rocky and sandy soils. It is commonly seen in desert and scrubland habitats. Its distribution is limited to specific ecological zones within the southwestern part of Mexico.",
    "distribution_introduced_art_desc": "Acalypha nubicola was mainly introduced to New Zealand. It was first recorded in the 1960s and has since spread throughout the country. The plant is commonly found in coastal areas and disturbed habitats. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
