{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata f. longa",
    "plant_slug": "acalypha-reticulata-f-longa",
    "plant_name_scientific": "acalypha reticulata f. longa",
    "intro": "Acalypha reticulata f. longa, commonly known as the long-leaved nettle or longleaf acalypha, is a variant of the nettleleaf plant native to Southeast Asia. It is characterized by its elongated, lance-shaped leaves that are often covered in fine hairs, giving them a fuzzy texture. The plant produces small, greenish-yellow flowers arranged in dense clusters, which are typically borne on slender spikes. It thrives in moist, shaded environments and is often found in tropical and subtropical regions. This cultivar is valued for its ornamental appeal and is sometimes used in horticultural settings for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata f. longa is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland areas with high humidity. This plant is commonly associated with moist forests and disturbed habitats, such as roadside verges and abandoned fields. Its distribution extends to parts of Oceania, including Papua New Guinea and some islands in the Pacific. It is well adapted to warm climates and is often used in traditional medicine and ornamental gardening.",
    "distribution_introduced_art_desc": "Acalypha reticulata f. longa was mainly introduced to enhance ornamental value in gardens and landscapes due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for its vibrant, palmate leaves that add visual interest to floral arrangements. The plant thrives in warm, humid climates and requires well-drained soil to prevent root rot. Its introduction has been associated with both aesthetic appreciation and potential ecological impacts in non-native environments. Careful management is recommended to prevent its spread beyond cultivated areas."
}
