{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha peduncularis var. genuina",
    "plant_slug": "acalypha-peduncularis-var-genuina",
    "plant_name_scientific": "acalypha peduncularis var. genuina",
    "intro": "Acalypha peduncularis var. genuina, commonly known as the red-veined nettle, is a perennial shrub native to tropical regions of Africa. It is characterized by its distinctive, palmate leaves with bright red veins contrasting against the green foliage. The plant produces small, greenish-white flowers arranged in clusters, which are often hidden among the leaves. It thrives in moist, shaded environments and is often found in forest understories. Its ornamental value makes it a popular choice for ornamental gardening in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha peduncularis var. genuina is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It thrives in humid, warm climates and is commonly found in lowland areas with rich, well-drained soil. This plant is often associated with secondary forests and disturbed habitats due to its adaptability. It is also present in parts of Indonesia and the Philippines. Its native distribution is largely confined to the Indo-Malayan region.",
    "distribution_introduced_art_desc": "Acalypha peduncularis var. genuina was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The plant has since spread beyond cultivated areas and is now found in disturbed habitats throughout the islands. It is considered a noxious weed in some regions because of its rapid growth and ability to outcompete native vegetation. Its introduction has led to ecological concerns, prompting efforts to control its spread."
}
