{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ciliata",
    "plant_slug": "acalypha-ciliata",
    "plant_name_scientific": "acalypha ciliata",
    "intro": "Acalypha ciliata, commonly known as the silky mallow, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its soft, hairy leaves that give it a velvety appearance, and it produces clusters of small, pink or red flowers. The plant is often found in moist, shaded environments such as forests or along stream banks. Its leaves are sometimes used in traditional medicine for their purported healing properties. The species is also valued as an ornamental plant due to its attractive foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ciliata is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded areas within lowland forests. This plant thrives in humid climates and is typically associated with riverine and coastal environments. It is also present in parts of northern Australia and the Pacific Islands. Acalypha ciliata is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha ciliata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive in certain areas, outcompeting native species. The plant thrives in moist, well-drained soils and can spread rapidly through seeds. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
