{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sericea var. indefessus",
    "plant_slug": "acalypha-sericea-var-indefessus",
    "plant_name_scientific": "acalypha sericea var. indefessus",
    "intro": "Acalypha sericea var. indefessus, commonly known as silky ironweed, is a flowering plant native to tropical and subtropical regions of Africa. It is characterized by its soft, silky-hairy leaves that give it a distinctive appearance. The plant produces clusters of small, pale green or yellowish flowers that are often clustered at the ends of the stems. Its growth habit is typically shrub-like, with multiple branches and a dense foliage structure. It thrives in moist, well-drained soils and is often found in woodland or disturbed habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha sericea"
    },
    "taxonomy_art_desc": "Acalypha sericea var. indefessus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Malpighiales, a group of flowering plants with a wide range of morphological diversity, including many tropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some toxic properties. Its genus is Acalypha, a genus of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their hairy leaves and unique inflorescences. Its species is Acalypha sericea, a specific type within the genus known for its silky-haired leaves and is a variant of this species with the varietal name indefessus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sericea var. indefessus is primarily native to the Galápagos. This variant of the plant is found in the unique ecosystems of the Galápagos Islands, which are known for their endemic species. It thrives in the volcanic soils and coastal environments of the archipelago. The plant is adapted to the specific climate and conditions of the Galápagos, making it an important part of the local flora. Its distribution is largely restricted to this region, highlighting its ecological significance in the area.",
    "distribution_introduced_art_desc": "Acalypha sericea var. indefessus was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste areas, and disturbed forests. It thrives in tropical and subtropical regions due to its adaptability to varying soil conditions. This plant is known for its rapid growth and ability to spread through both seeds and vegetative means. It is often considered a weed in agricultural and natural ecosystems. Its introduction has led to concerns about its potential to outcompete native plant species in invaded habitats."
}
