{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha coleispica",
    "plant_slug": "acalypha-coleispica",
    "plant_name_scientific": "acalypha coleispica",
    "intro": "Acalypha coleispica, commonly known as the silverleaf acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its striking silver-gray foliage, which gives it a distinctive appearance. The plant produces small, clustered greenish-white flowers that bloom in the summer months. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Acalypha coleispica is relatively low maintenance and can be grown in containers or in gardens with well-draining soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha coleispica"
    },
    "taxonomy_art_desc": "Acalypha coleispica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations, such as sticky leaves and specialized flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide variety of growth forms. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy leaves. Its species is Acalypha coleispica, a specific type of plant within the Acalypha genus, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Gulf"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha coleispica is primarily native to the Mexico Gulf. It is found in the coastal regions of the Gulf of Mexico, particularly in southern Texas and the northern parts of Mexico. This plant thrives in sandy soils and is commonly associated with dune ecosystems. It plays an important role in stabilizing coastal habitats and preventing erosion. Its distribution is limited to specific areas within the Gulf region due to its particular environmental requirements.",
    "distribution_introduced_art_desc": "Acalypha coleispica was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was first documented in the early 20th century and has since become naturalized in several regions. The plant thrives in moist, tropical environments and is often found in disturbed habitats such as roadsides and abandoned fields. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to concerns about its invasive potential. Despite its beauty, it is now considered a weed in some areas where it outcompetes native vegetation."
}
