{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha polymorpha var. oblongifolia",
    "plant_slug": "acalypha-polymorpha-var-oblongifolia",
    "plant_name_scientific": "acalypha polymorpha var. oblongifolia",
    "intro": "Acalypha polymorpha var. oblongifolia, commonly known as the velvetleaf or false abutilon, is a strikingly ornamental shrub native to tropical regions of Asia. It is characterized by its vibrant, papery bracts that range in color from red to orange, often mistaken for flowers. The plant features alternate, ovate to lanceolate leaves with a velvety texture, giving it a distinctive appearance. It produces small, inconspicuous greenish-white flowers that are clustered in terminal spikes. This species is often cultivated for its ornamental value in gardens and as a houseplant due to its unique foliage and ability to thrive in warm, humid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha polymorpha var. oblongifolia is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like forest edges and riverbanks. It is also present in parts of northern Australia and the Pacific Islands. Its distribution is closely linked to its adaptability to warm, humid climates and its ability to tolerate various soil conditions.",
    "distribution_introduced_art_desc": "Acalypha polymorpha var. oblongifolia was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its vibrant leaves and unique growth habits. The plant has been introduced to several countries, including parts of the United States, Australia, and Southeast Asia. Its rapid growth and ability to thrive in disturbed soils have led to its spread in some areas, raising concerns about its potential invasiveness. Despite its ornamental value, proper management is recommended to prevent unintended ecological impacts."
}
