{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha diversifolia var. leptostachya",
    "plant_slug": "acalypha-diversifolia-var-leptostachya",
    "plant_name_scientific": "acalypha diversifolia var. leptostachya",
    "intro": "Acalypha diversifolia var. leptostachya, commonly known as the narrow-stamen glory flower, is a striking ornamental plant native to tropical regions of Africa. It is characterized by its vibrant, papery bracts that display a range of colors, often in shades of red, orange, and yellow. The plant produces small, inconspicuous flowers that are clustered in dense, spike-like inflorescences. Its leaves are typically ovate to elliptical in shape, with a smooth or slightly hairy surface. It thrives in warm, humid climates and is often cultivated for its ornamental value in gardens and as a potted plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha diversifolia var. leptostachya is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often encountered in secondary forests, along stream banks, and in disturbed habitats. It is also known to grow in coastal areas and mangrove ecosystems in some parts of its range. Due to its adaptability, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha diversifolia var. leptostachya was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage and unique inflorescences. It has been cultivated in parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant is often used in landscaping and as a hedge because of its rapid growth and adaptability to various soil types. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
