{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha stenophylla",
    "plant_slug": "acalypha-stenophylla",
    "plant_name_scientific": "acalypha stenophylla",
    "intro": "Acalypha stenophylla, commonly known as the narrow-leaf copperleaf, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its striking, copper-colored leaves that often have a velvety texture. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences. It thrives in moist, shaded environments and is often found in forest understories. Acalypha stenophylla is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha stenophylla"
    },
    "taxonomy_art_desc": "Acalypha stenophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many economically important species, such as those in the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their distinctive inflorescences and often hairy foliage. Its species is Acalypha stenophylla, a specific type within the genus Acalypha, known for its narrow leaves and typically found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha stenophylla is primarily native to New Guinea. It is found in the tropical regions of this island, which is known for its rich biodiversity. The plant thrives in humid and warm climates, typically in forested areas. It is often associated with moist environments and can be found in both lowland and mountainous regions. Its native distribution is largely confined to the western and eastern parts of New Guinea.",
    "distribution_introduced_art_desc": "Acalypha stenophylla was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in various habitats. The plant spreads rapidly through seeds dispersed by wind and water. Its introduction has led to concerns about its impact on local ecosystems."
}
