{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha agrimonioides",
    "plant_slug": "acalypha-agrimonioides",
    "plant_name_scientific": "acalypha agrimonioides",
    "intro": "Acalypha agrimonioides, commonly known as the flame bush, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, brightly colored bracts that resemble flowers, though they are actually modified leaves. The plant produces small, inconspicuous true flowers surrounded by these showy bracts. It thrives in sunny, well-drained soils and is often cultivated for its ornamental value. Acalypha agrimonioides is also used in traditional medicine for its purported healing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha agrimonioides is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like roadsides and forest edges. It is also present in parts of Oceania, including Papua New Guinea and the Solomon Islands. Due to its adaptability, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha agrimonioides was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed soils, along roadsides, and in agricultural areas. The plant spreads through its prolific seed production and can form dense stands that outcompete native vegetation. Its introduction has led to its establishment in several countries, including parts of Southeast Asia and the Pacific Islands. However, it is considered a potential weed in some regions due to its invasive growth habit."
}
