{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pycnantha",
    "plant_slug": "acalypha-pycnantha",
    "plant_name_scientific": "acalypha pycnantha",
    "intro": "Acalypha pycnantha, commonly known as the velvetleaf or silverleaf acalypha, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, velvety leaves that are often covered in fine hairs, giving it a soft, fuzzy appearance. The plant produces small, clustered flowers that are typically greenish-white in color, which bloom in the summer months. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha pycnantha is valued for its ornamental appeal and is sometimes used in horticulture for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pycnantha"
    },
    "taxonomy_art_desc": "Acalypha pycnantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, often featuring jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species, often with distinctive floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha pycnantha, a specific plant within the genus Acalypha, noted for its compact growth and clusters of small flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Haiti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pycnantha is primarily native to Haiti. This species is found in the tropical regions of the country, particularly in areas with moist, well-drained soils. It typically grows in lowland forests and along stream banks. The plant is known for its distinctive red bracts that surround its small flowers. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acalypha pycnantha was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in areas with disturbed soils, such as roadsides and abandoned fields. The plant spreads through its prolific seed production and can form dense stands that outcompete native vegetation. Due to its aggressive growth, it is considered a potential invasive species in some regions. Its introduction has led to ecological concerns in parts of its range."
}
