{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis subsp. communis",
    "plant_slug": "acalypha-communis-subsp-communis",
    "plant_name_scientific": "acalypha communis subsp. communis",
    "intro": "Acalypha communis subsp. communis, commonly known as the common copperleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking copper-colored foliage, which gives it its common name. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha communis subsp. communis is valued for its ornamental appeal and is commonly cultivated in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha communis"
    },
    "taxonomy_art_desc": "Acalypha communis subsp. communis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various habitats. Its family is Euphorbiaceae, commonly known as the spurge family, which consists of plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants typically characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha communis, a specific type within the genus known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Bolivia",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Paraguay",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis subsp. communis is primarily native to Argentina Northeast, Bolivia, Brazil Northeast, Brazil South, Brazil Southeast, Brazil West-Central, Paraguay, and Uruguay. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in a variety of habitats, including forests, savannas, and disturbed soils. The subspecies is known for its adaptability to different environmental conditions. Its native range spans across much of South America, particularly in the eastern and central regions.",
    "distribution_introduced_art_desc": "Acalypha communis subsp. communis was mainly introduced to areas where its ornamental value and adaptability make it a desirable landscape plant. It is commonly found in tropical and subtropical regions, particularly in the Pacific Islands, Southeast Asia, and parts of the Americas. This species thrives in disturbed habitats such as roadsides, abandoned fields, and coastal areas. Its rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its invasive potential in some regions. However, it is also valued for its vibrant foliage and is used in horticulture and traditional medicine in various cultures."
}
