{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica var. gracilescens",
    "plant_slug": "acalypha-virginica-var-gracilescens",
    "plant_name_scientific": "acalypha virginica var. gracilescens",
    "intro": "Acalypha virginica var. gracilescens, commonly known as silky ironweed, is a flowering plant native to the southeastern United States. It is characterized by its soft, silky foliage and clusters of small, greenish-yellow flowers that appear in late summer. The plant typically grows in moist, woodland habitats and can reach heights of up to three feet. Its leaves are lance-shaped with a hairy texture, and it produces distinctive seed heads that are often mistaken for flowers. This variety is valued for its ornamental appeal and ecological benefits in native plant gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica var. gracilescens is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and Alabama. It thrives in moist, well-drained soils and is commonly found in wetlands, marshes, and along the edges of swamps. This variety is often associated with riparian habitats and is adapted to periodic flooding. It is a herbaceous plant that typically grows in dense stands, contributing to the ecological diversity of its native range. Due to its specific habitat requirements, it is not widely distributed beyond its native region.",
    "distribution_introduced_art_desc": "Acalypha virginica var. gracilescens was mainly introduced to the eastern and central United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant thrives in full sun to partial shade and is often seen in moist to mesic soils. It is known for its attractive, palmate leaves and small, inconspicuous flowers. Due to its adaptability, it has become naturalized in many regions where it was originally non-native."
}
