{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha commersoniana var. brevifolia",
    "plant_slug": "acalypha-commersoniana-var-brevifolia",
    "plant_name_scientific": "acalypha commersoniana var. brevifolia",
    "intro": "Acalypha commersoniana var. brevifolia, commonly known as the narrow-leaved spurflower, is a tropical plant native to regions of South America. It is characterized by its distinctive, spiky bracts that surround its small, inconspicuous flowers. The leaves are typically narrow and elliptical, with a smooth or slightly hairy surface. This species thrives in moist, well-drained soils and prefers partial to full sunlight. It is often cultivated for its ornamental value due to its unique foliage and vibrant flower clusters.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha commersoniana var. brevifolia is primarily native to the Caribbean islands, including Cuba, Hispaniola, Jamaica, and the Bahamas. This variant is commonly found in moist, tropical environments such as coastal areas and lowland forests. It thrives in regions with high humidity and well-drained soil. The plant is often seen growing along riverbanks and in disturbed habitats. Its native range is limited to these specific islands in the Caribbean.",
    "distribution_introduced_art_desc": "Acalypha commersoniana var. brevifolia was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and adaptability to various growing conditions. It is commonly used in tropical and subtropical regions for its vibrant leaf colors and ability to thrive in both full sun and partial shade. This variety is particularly favored for its compact growth habit, making it suitable for container gardening and indoor spaces. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
