{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha senensis var. haplostyla",
    "plant_slug": "acalypha-senensis-var-haplostyla",
    "plant_name_scientific": "acalypha senensis var. haplostyla",
    "intro": "Acalypha senensis var. haplostyla, commonly known as the silky ironwood, is a shrub native to tropical regions of Southeast Asia. It is characterized by its lance-shaped, dark green leaves that are often covered in fine hairs, giving them a silky texture. The plant produces small, greenish-white flowers arranged in clusters, which are followed by spiny, woody capsules containing seeds. It thrives in well-drained soils and is often found in coastal or disturbed habitats. Due to its hardy nature and ornamental value, it is occasionally cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha senensis var. haplostyla is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variety is often associated with forest understory habitats and can be found in both primary and secondary forests. It thrives in humid climates and is typically found at elevations ranging from sea level to approximately 1,000 meters. The plant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha senensis var. haplostyla was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The introduction occurred in the early 20th century, primarily through horticultural trade. It has since naturalized in certain regions, particularly in the North Island. However, it is not considered a major invasive species in New Zealand."
}
