{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrostachya f. macrophylla",
    "plant_slug": "acalypha-macrostachya-f-macrophylla",
    "plant_name_scientific": "acalypha macrostachya f. macrophylla",
    "intro": "Acalypha macrostachya f. macrophylla, commonly known as the broad-leafed spurflower, is a striking tropical plant characterized by its large, heart-shaped leaves and vibrant, spiky inflorescences. Native to Southeast Asia, it thrives in humid, shaded environments and is often found in tropical rainforests. The plant's foliage is notable for its glossy texture and deep green color, while its flowers range in color from red to orange, adding visual interest. It is a popular ornamental plant due to its unique appearance and ability to thrive in indoor settings with proper care. The species is also valued for its potential ecological benefits, including attracting pollinators and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrostachya f. macrophylla is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. This species thrives in tropical and subtropical regions, often found in moist lowland forests and along riverbanks. It is commonly associated with humid climates and is often seen in secondary growth areas. The plant is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Its native range extends into northern Australia, where it grows in similar ecological conditions.",
    "distribution_introduced_art_desc": "Acalypha macrostachya f. macrophylla was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The introduction occurred in the 19th century during the colonial expansion period. It has since become naturalized in certain regions, particularly in the North Island. However, it is not considered invasive and is generally managed as a non-native species."
}
