{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha betuloides",
    "plant_slug": "acalypha-betuloides",
    "plant_name_scientific": "acalypha betuloides",
    "intro": "Acalypha betuloides, commonly known as the maple-leaved ironwood, is a shrub or small tree native to tropical regions of Africa. It is characterized by its distinctive, maple-like leaves that are palmately lobed and often have a velvety texture. The plant produces small, greenish flowers arranged in clusters, followed by three-lobed, red or orange berries. It thrives in well-drained soils and is often found in coastal or inland areas with a warm, humid climate. Acalypha betuloides is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha betuloides is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in open habitats such as forests, shrublands, and disturbed sites. It is often seen growing along stream banks and in swampy areas. Its native range extends to parts of Oceania and the Indian subcontinent as well.",
    "distribution_introduced_art_desc": "Acalypha betuloides was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various environmental conditions. It has since become naturalized in certain regions, particularly in coastal and lowland areas where it thrives in moist, well-drained soils. The plant's rapid growth and ability to spread through both seeds and vegetative means have led to its establishment in native ecosystems. Despite its ornamental value, it is considered a potential weed in some areas due to its competitive nature. Management strategies are being developed to control its spread while balancing ecological and aesthetic considerations."
}
