{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha palmeri",
    "plant_slug": "acalypha-palmeri",
    "plant_name_scientific": "acalypha palmeri",
    "intro": "Acalypha palmeri, commonly known as Palmer's beautyberry, is a flowering plant native to the southeastern United States. It is characterized by its showy, clustered purple berries that appear in the fall. The plant has palmate leaves with five to seven lobes, giving it a distinctive appearance. It thrives in moist, well-drained soils and is often found in woodland edges and thickets. The species is valued for its ornamental appeal and ecological benefits to wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha palmeri"
    },
    "taxonomy_art_desc": "Acalypha palmeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide variety of growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as the \"velvetleaf\" or \"cup plants,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha palmeri, a specific type within the genus Acalypha, native to certain regions and distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha palmeri is primarily native to Mexico Northeast and Mexico Southwest. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often associated with desert scrub habitats. The species is adapted to the harsh environmental conditions of its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acalypha palmeri was mainly introduced to the United States, particularly in the southwestern regions. It has been documented in states such as Arizona, California, and New Mexico. The plant is often found in disturbed areas, including roadsides and dry open woodlands. Its introduction is likely due to human activity, including accidental transport through trade or travel. Despite its presence, it is not considered invasive and is more of a minor component in local ecosystems."
}
