{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha diversifolia var. claoneura",
    "plant_slug": "acalypha-diversifolia-var-claoneura",
    "plant_name_scientific": "acalypha diversifolia var. claoneura",
    "intro": "Acalypha diversifolia var. claoneura, commonly known as the velvetleaf or red-leaf acalypha, is a striking ornamental plant native to Southeast Asia. It is characterized by its vibrant, velvety foliage that ranges from deep red to purplish tones, especially in cooler weather. The leaves are typically ovate to elliptical in shape and often have a slightly serrated margin. This variety is prized for its ornamental value in gardens and as a houseplant due to its unique coloration and compact growth habit. It prefers bright, indirect light and well-draining soil, making it adaptable to a variety of indoor and outdoor environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha diversifolia var. claoneura is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This variant is commonly found in lowland and coastal areas, often growing in moist, shaded environments. It thrives in humid climates with high rainfall, typically in forest understories or along riverbanks. The plant is well adapted to the warm and humid conditions of its native habitat. It is often used in local landscaping and has cultural significance in some regions.",
    "distribution_introduced_art_desc": "Acalypha diversifolia var. claoneura was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred in the late 19th century, primarily through horticultural trade. Despite its aesthetic value, it has since become naturalized in certain regions of the country. However, it is not considered a significant invasive species in New Zealand."
}
