{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha callosa",
    "plant_slug": "acalypha-callosa",
    "plant_name_scientific": "acalypha callosa",
    "intro": "Acalypha callosa, commonly known as the roughleaf ironwood, is a shrub native to the southeastern United States. It is characterized by its rough, hairy leaves and clusters of small, pale green to reddish flowers. The plant produces small, round, green berries that are often covered in a whitish bloom. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Acalypha callosa is valued for its ornamental qualities and its ability to stabilize soil in wet environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha callosa is primarily native to tropical and subtropical regions of Asia, including countries such as India, Sri Lanka, and parts of Southeast Asia. It thrives in warm, humid climates and is commonly found in forest understories and along riverbanks. This plant is also present in some areas of the Pacific Islands, where it grows in moist, shaded environments. It prefers well-drained soil and is often seen in lowland and hill forest areas. Acalypha callosa is known for its attractive foliage and is sometimes cultivated as an ornamental plant.",
    "distribution_introduced_art_desc": "Acalypha callosa was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in gardens and landscapes for its vibrant leaf colors and ease of maintenance. The plant is native to Southeast Asia but has been widely distributed in tropical and subtropical regions around the world. It thrives in moist, well-drained soils and partial to full sunlight. However, it is important to note that it can become invasive in some areas if not properly managed."
}
