{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sessilis",
    "plant_slug": "acalypha-sessilis",
    "plant_name_scientific": "acalypha sessilis",
    "intro": "Acalypha sessilis, commonly known as the sessile spurge, is a flowering plant native to tropical regions of Africa and Asia. It is a shrub or small tree that typically grows up to 3 meters in height, featuring simple, opposite leaves that are usually ovate to elliptic in shape. The plant produces small, clustered flowers that are typically greenish-yellow in color, followed by distinctive, fleshy, orange-red berries. It thrives in moist, well-drained soils and is often found in forest understories or along riverbanks. Acalypha sessilis is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sessilis is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is also found in parts of Indonesia and the Philippines. This plant typically grows in tropical and subtropical regions, often in moist, shaded environments. It is commonly associated with rainforests and secondary forest areas. Its distribution is largely confined to the Indo-Malayan region.",
    "distribution_introduced_art_desc": "Acalypha sessilis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first recorded in the early 20th century and has since become naturalized in several areas. The plant thrives in moist, shaded environments and is often found in disturbed habitats such as streambanks and forest edges. Its rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its establishment in non-native regions. However, it is not considered a major invasive species in these areas."
}
