{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha glabrata f. glabrata",
    "plant_slug": "acalypha-glabrata-f-glabrata",
    "plant_name_scientific": "acalypha glabrata f. glabrata",
    "intro": "Acalypha glabrata f. glabrata, commonly known as the smoothleaf spurflower, is a flowering plant native to tropical regions of Africa. It is characterized by its smooth, glabrous leaves and distinctive, spire-like inflorescences. The plant typically grows as an herbaceous annual or perennial, often found in moist, well-drained soils. Its flowers are small and clustered, producing a showy display of colors ranging from red to yellow. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive foliage and blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha glabrata"
    },
    "taxonomy_art_desc": "Acalypha glabrata f. glabrata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many economically important species, such as those in the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which consists of plants with diverse forms and often contain toxic compounds. Its genus is Acalypha, which includes shrubs and herbs with distinctive leaves and showy flowers, often found in tropical and subtropical regions. Its species is Acalypha glabrata, a specific plant within the genus known for its smooth leaves and is a variety of the species Acalypha glabrata.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Botswana",
        "Cape Provinces",
        "Eswatini",
        "KwaZulu-Natal",
        "Mozambique",
        "Northern Provinces",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha glabrata f. glabrata is primarily native to Angola, Botswana, Cape Provinces, Eswatini, KwaZulu-Natal, Mozambique, Northern Provinces, and Zimbabwe. This plant is commonly found in these regions, particularly in areas with tropical and subtropical climates. It thrives in open woodlands, grasslands, and along riverbanks. The species is well adapted to the local environmental conditions of these countries. Its native distribution reflects its preference for warm, humid climates with well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha glabrata f. glabrata was mainly introduced to regions with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in disturbed areas such as roadsides, waste lands, and along riverbanks. This plant is known for its attractive, palmate leaves and vibrant red bracts that make it a popular ornamental species. Its rapid growth and adaptability have led to its establishment in several non-native areas. However, it is considered a potential invasive species in some regions due to its competitive nature."
}
