{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha scandens",
    "plant_slug": "acalypha-scandens",
    "plant_name_scientific": "acalypha scandens",
    "intro": "Acalypha scandens, commonly known as the silver leaf or velvetleaf, is a shrub native to tropical and subtropical regions. It is characterized by its finely textured, silver-gray leaves that are covered in a dense layer of fine hairs. The plant produces small, inconspicuous flowers that are typically green or reddish in color. It is often found in disturbed areas, such as roadsides and abandoned fields, due to its adaptability. Acalypha scandens is also known for its ability to thrive in a variety of soil types and light conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha scandens"
    },
    "taxonomy_art_desc": "Acalypha scandens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral structures and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contain milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and hairy leaves. Its species is Acalypha scandens, a specific plant within the genus Acalypha known for its climbing growth habit and distinctive foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Colombia",
        "Ecuador",
        "Guyana",
        "Peru",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha scandens is primarily native to Bolivia, Brazil North, Colombia, Ecuador, Guyana, Peru, Suriname, and Venezuela. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shady environments such as forest understories and along stream banks. Acalypha scandens is often seen climbing or trailing through vegetation. Its native distribution reflects its adaptation to the diverse ecosystems of South America.",
    "distribution_introduced_art_desc": "Acalypha scandens was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and rapid growth. It was likely brought by early settlers or through trade during the 19th and 20th centuries. The plant has since become naturalized in many areas, spreading through both seed dispersal and vegetative propagation. Its introduction has led to concerns about its potential impact on native ecosystems. Despite its aesthetic appeal, it is now considered a potential invasive species in some regions."
}
