{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha insulana",
    "plant_slug": "acalypha-insulana",
    "plant_name_scientific": "acalypha insulana",
    "intro": "Acalypha insulana, commonly known as the island false spurge, is a flowering plant native to the Pacific Islands. It is a shrub that typically grows to a height of about 1 to 2 meters. The plant features opposite, ovate leaves with a rough texture and a distinct reddish or purple hue on the underside. Its small, greenish-yellow flowers are clustered in dense inflorescences, and it produces small, round berries that are edible. Acalypha insulana is often found in coastal areas and is adapted to sandy or rocky soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha insulana"
    },
    "taxonomy_art_desc": "Acalypha insulana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a group of flowering plants known for their diverse morphology and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of growth forms and some toxic species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha insulana, a specific type of plant native to certain island regions, known for its unique characteristics and ecological role in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji",
        "Samoa",
        "Tonga",
        "Vanuatu"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha insulana is primarily native to Fiji, Samoa, Tonga, and Vanuatu. This plant is commonly found in coastal areas and lowland regions across these island nations. It thrives in tropical climates with high humidity and well-drained soils. Acalypha insulana is often seen growing in shaded undergrowth or along forest edges. Its native distribution reflects its adaptation to the unique ecological conditions of the South Pacific.",
    "distribution_introduced_art_desc": "Acalypha insulana was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activity, such as accidental transport on vehicles or cargo. The plant thrives in disturbed areas and can outcompete native vegetation. It is often found in coastal habitats and along roadsides. Due to its rapid growth and ability to spread, it poses a significant threat to local ecosystems."
}
