{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha betulina",
    "plant_slug": "acalypha-betulina",
    "plant_name_scientific": "acalypha betulina",
    "intro": "Acalypha betulina, commonly known as the silver flame or red flame plant, is a tropical shrub native to Southeast Asia. It is characterized by its striking, colorful bracts that range from red to orange and yellow, which are often mistaken for flowers. The plant has opposite, ovate leaves with a slightly hairy surface and a silver-green underside. It thrives in warm, humid climates and is often cultivated as an ornamental plant due to its vibrant foliage. Acalypha betulina is also used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha betulina is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in lowland forests and along riverbanks. This plant thrives in humid climates with well-drained soil and partial to full sunlight. It is also known to occur in parts of southern China and the Indian subcontinent. Acalypha betulina is often associated with disturbed habitats and can be found in both natural and cultivated environments.",
    "distribution_introduced_art_desc": "Acalypha betulina was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread beyond cultivated areas, establishing itself in native forests and along stream banks. The plant's rapid growth and ability to colonize disturbed sites have led to its classification as an environmental weed in some regions. Its introduction has raised concerns about its impact on local biodiversity and ecosystem balance. Efforts are ongoing to monitor and manage its spread to prevent further ecological disruption."
}
