{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha variabilis var. urticoides",
    "plant_slug": "acalypha-variabilis-var-urticoides",
    "plant_name_scientific": "acalypha variabilis var. urticoides",
    "intro": "Acalypha variabilis var. urticoides, commonly known as the stinging nettle shrub, is a tropical plant native to parts of Asia and the Pacific Islands. It is characterized by its upright growth habit and hairy, lance-shaped leaves that can cause skin irritation upon contact. The plant produces small, greenish-yellow flowers arranged in clusters, which are followed by distinctive, three-lobed bracts. It thrives in moist, shaded environments and is often found in disturbed soils. Due to its stinging hairs, it is important to handle the plant with care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha variabilis var. urticoides is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland environments and is commonly found in forests, shrublands, and along stream banks. This variant is known for its rapid growth and adaptability to various soil types, making it a common sight in both natural and disturbed habitats. It plays an important ecological role by providing food and shelter for local wildlife. However, it is not widely cultivated outside its native range due to its specific environmental requirements.",
    "distribution_introduced_art_desc": "Acalypha variabilis var. urticoides was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought by humans for its aesthetic value, such as its colorful leaves and unique growth form. However, it has since become invasive in some areas, outcompeting native plant species and altering local ecosystems. The plant thrives in disturbed habitats and can spread rapidly through both seeds and vegetative reproduction. Its introduction highlights the ecological risks associated with non-native ornamental plants."
}
