{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wilkesiana f. monstrosa",
    "plant_slug": "acalypha-wilkesiana-f-monstrosa",
    "plant_name_scientific": "acalypha wilkesiana f. monstrosa",
    "intro": "Acalypha wilkesiana f. monstrosa, commonly known as the Chinese evergreen or croton, is a tropical shrub characterized by its vibrant, colorful foliage. The plant features palmate leaves with striking variegation, often displaying shades of red, orange, and yellow. It belongs to the Euphorbiaceae family and is native to Southeast Asia. The f. monstrosa form is distinguished by its enlarged, waxy leaves and compact growth habit. It thrives in warm, humid environments and requires well-draining soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha wilkesiana f. monstrosa is primarily native to the tropical regions of the Americas, including parts of Central and South America. It is also found in the Caribbean islands and some regions of the Pacific Islands. This plant thrives in warm, humid climates and is commonly found in coastal areas and lowland forests. It is often cultivated as an ornamental plant due to its vibrant foliage. Its natural habitat includes moist soils and areas with partial to full sunlight.",
    "distribution_introduced_art_desc": "Acalypha wilkesiana f. monstrosa was mainly introduced to tropical and subtropical regions for its ornamental value due to its vibrant foliage and unique leaf shapes. It is commonly found in gardens and landscapes across the United States, particularly in Florida and California. The plant thrives in warm, humid climates and is often used as a decorative shrub or hedge. Its introduction has led to its establishment in some areas, raising concerns about its potential invasiveness. Despite its popularity, it is generally considered a non-native species with limited ecological impact in most regions."
}
