{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha asterifolia",
    "plant_slug": "acalypha-asterifolia",
    "plant_name_scientific": "acalypha asterifolia",
    "intro": "Acalypha asterifolia, commonly known as the starleaf or silverleaf acalypha, is a herbaceous plant native to tropical regions of Africa and Asia. It is characterized by its striking, star-shaped leaves that often have a silvery or white underside, giving it a distinctive appearance. The plant produces small, greenish-white flowers arranged in clusters, which are typically borne on slender stalks. It thrives in moist, well-drained soils and is often found in woodland or swampy areas. Acalypha asterifolia is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha asterifolia is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with secondary forests and disturbed habitats. It is also present in parts of southern China and northern Australia. Its distribution is closely linked to areas with a warm climate and high rainfall.",
    "distribution_introduced_art_desc": "Acalypha asterifolia was mainly introduced to ornamental horticulture due to its attractive foliage and showy flowers. It is commonly cultivated in tropical and subtropical regions for garden decoration. The plant is often found in landscapes, public parks, and as part of green spaces in urban areas. Its introduction has led to its establishment in some non-native environments, raising concerns about its potential invasiveness. Proper management is recommended to prevent its spread beyond cultivated areas."
}
