{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha indica var. bailloniana",
    "plant_slug": "acalypha-indica-var-bailloniana",
    "plant_name_scientific": "acalypha indica var. bailloniana",
    "intro": "Acalypha indica var. bailloniana, commonly known as the flame bush, is a flowering plant native to tropical and subtropical regions of Asia. It is characterized by its striking, bright red bracts that resemble flames, which are actually modified leaves rather than flowers. The plant produces small, inconspicuous yellow flowers within the bract clusters. It thrives in well-drained soil and requires full sun to partial shade. This species is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha indica var. bailloniana is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and parts of Indonesia. It is also found in the Philippines and Malaysia. This plant thrives in tropical and subtropical regions, often growing in moist, shady environments. It is commonly found in forests, along stream banks, and in disturbed areas. Its native distribution includes both mainland and island regions within the broader Indo-Malesian flora region.",
    "distribution_introduced_art_desc": "Acalypha indica var. bailloniana was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly used in tropical and subtropical regions for its aesthetic value in gardens and as a ground cover. The plant's rapid growth and ability to thrive in disturbed soils have contributed to its spread in certain areas. However, it is also considered an invasive species in some regions where it outcompetes native vegetation. Its introduction has led to ecological concerns in parts of the Pacific Islands and Southeast Asia."
}
