{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chathamensis",
    "plant_slug": "acalypha-chathamensis",
    "plant_name_scientific": "acalypha chathamensis",
    "intro": "Acalypha chathamensis, commonly known as Chatham Island hibiscus, is a flowering plant native to the Chatham Islands of New Zealand. It belongs to the Euphorbiaceae family and is characterized by its showy, hibiscus-like flowers that are typically pink or red. The plant has palmate leaves with five to seven lobes, and it produces small, capsule-like fruits. It thrives in coastal environments and is adapted to the unique ecological conditions of its habitat. Due to its limited distribution and conservation status, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chathamensis is primarily native to the Chatham Islands, a group of islands in the South Pacific Ocean. This plant is found exclusively on the Chatham Islands, specifically on the main island, Chatham Island. It is a rare and endemic species, growing in coastal and lowland habitats. Due to its limited range and habitat specificity, it is considered vulnerable to environmental changes and human disturbance. Conservation efforts are ongoing to protect this unique plant from threats such as invasive species and habitat loss.",
    "distribution_introduced_art_desc": "Acalypha chathamensis was mainly introduced to New Zealand. It was brought there by human activity, likely as an ornamental plant due to its attractive foliage. The distribution of this species is primarily limited to the Chatham Islands. It has not been widely naturalized beyond its introduction site. This plant is considered non-native and is not commonly found in other parts of New Zealand."
}
