{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hirsutissima",
    "plant_slug": "acalypha-hirsutissima",
    "plant_name_scientific": "acalypha hirsutissima",
    "intro": "Acalypha hirsutissima, commonly known as the velvetleaf or woolly hollyhock, is a flowering plant native to tropical and subtropical regions. It is characterized by its large, showy bracts that resemble petals, often in shades of red, pink, or yellow. The plant has hairy, lance-shaped leaves that are typically arranged oppositely along the stem. It produces small, inconspicuous flowers that are clustered in dense inflorescences. Acalypha hirsutissima is often cultivated for its ornamental value and is adapted to grow in well-drained soil with partial to full sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hirsutissima is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks or in dense forest undergrowth. It is also native to parts of India and the Pacific Islands, where it is sometimes cultivated for its ornamental value. Its natural range extends across much of the Indo-Malay region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha hirsutissima was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and vibrant flowers. It was first brought there in the late 19th century by horticultural enthusiasts and gardeners. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, disturbed environments and spreads through both seeds and vegetative growth. Its introduction highlights the ecological risks associated with non-native ornamental species."
}
