{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha amphigyne",
    "plant_slug": "acalypha-amphigyne",
    "plant_name_scientific": "acalypha amphigyne",
    "intro": "Acalypha amphigyne, commonly known as the red-flowered spurflower, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its striking red bracts that enclose small, inconspicuous flowers. Its leaves are usually ovate with a smooth or slightly hairy surface. Acalypha amphigyne thrives in moist, shady environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha amphigyne"
    },
    "taxonomy_art_desc": "Acalypha amphigyne belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contain toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their often hairy leaves and distinctive flower clusters. Its species is Acalypha amphigyne, a specific type of plant within the Acalypha genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil West-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha amphigyne is primarily native to Brazil West-Central. It is found in the tropical regions of this area, particularly in the central parts of the country. This plant thrives in humid and warm climates, often growing in forested areas or near water sources. Its native distribution is limited to specific regions within Brazil West-Central, where the environmental conditions are suitable for its growth. It is not found naturally outside of this geographic range.",
    "distribution_introduced_art_desc": "Acalypha amphigyne was mainly introduced to Hawaii. It was likely introduced through human activity, such as accidental transport on cargo or intentional planting for ornamental purposes. The plant has since become naturalized in certain areas of the island. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution is primarily limited to coastal and disturbed habitats."
}
