{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha boliviensis",
    "plant_slug": "acalypha-boliviensis",
    "plant_name_scientific": "acalypha boliviensis",
    "intro": "Acalypha boliviensis, commonly known as the Bolivian spurflower, is a flowering plant native to South America, particularly Bolivia and Peru. It belongs to the Euphorbiaceae family, which includes many plants with unique floral structures. The plant is characterized by its striking, spiny bracts that enclose its small, inconspicuous flowers. It typically grows in moist, shaded environments such as rainforests and mountainous regions. Acalypha boliviensis is valued for its ornamental appeal and is sometimes cultivated for its distinctive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha boliviensis"
    },
    "taxonomy_art_desc": "Acalypha boliviensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental gardening. Its species is Acalypha boliviensis, a specific type of plant native to Bolivia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha boliviensis is primarily native to Argentina Northeast, Argentina Northwest, and Bolivia. This plant is found in the Andean regions of these areas, typically in dry to semi-arid habitats. It is commonly associated with rocky soils and can often be seen growing in disturbed or open landscapes. The species is well adapted to the local climate and plays a role in the ecological balance of its native range. Its distribution reflects its preference for specific environmental conditions found in these regions.",
    "distribution_introduced_art_desc": "Acalypha boliviensis was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, disturbed habitats such as along roadsides and in forest edges. The plant has become naturalized in several areas, spreading through both seeds and vegetative growth. Its rapid growth and adaptability have led to concerns about its potential to outcompete native species. Despite its invasive tendencies, it is sometimes cultivated for its ornamental value due to its attractive foliage."
}
