{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha montevidensis",
    "plant_slug": "acalypha-montevidensis",
    "plant_name_scientific": "acalypha montevidensis",
    "intro": "Acalypha montevidensis, commonly known as the Montevideo croton, is a flowering plant native to South America, particularly Uruguay and parts of Brazil. It belongs to the Euphorbiaceae family, which is known for its diverse and often strikingly ornamental species. The plant features palmate leaves with lobed edges, and its flowers are small and clustered in inflorescences. It is often cultivated for its vibrant foliage and adaptability to various growing conditions. However, it can be invasive in certain regions, requiring careful management.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha montevidensis is primarily native to South America, specifically the countries of Uruguay and Paraguay. It is commonly found in the temperate regions of these nations, particularly in areas with moist, well-drained soils. This plant thrives in open woodlands, grasslands, and along the edges of forests. It is also occasionally found in coastal areas and riverbanks. Due to its adaptability, it plays an important role in local ecosystems and is sometimes used in horticulture.",
    "distribution_introduced_art_desc": "Acalypha montevidensis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It was first recorded in the early 20th century and has since spread throughout the country, particularly in urban and rural areas. The plant thrives in disturbed soils and can colonize roadsides, riverbanks, and other marginal habitats. Its rapid growth and ability to produce numerous seeds contribute to its invasive potential in native ecosystems. Despite its ornamental value, it is now considered a noxious weed in several regions of New Zealand."
}
