{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha accedens var. genuina",
    "plant_slug": "acalypha-accedens-var-genuina",
    "plant_name_scientific": "acalypha accedens var. genuina",
    "intro": "Acalypha accedens var. genuina, commonly known as the velvetleaf or silky ironweed, is a species of flowering plant in the Euphorbiaceae family. It is native to tropical regions of Africa and is characterized by its hairy, ovate leaves and clusters of small, inconspicuous flowers. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind. It thrives in moist, disturbed soils and is often found in open woodlands or along stream banks. Due to its rapid growth and adaptability, it can become invasive in certain environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha accedens var. genuina is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. This plant thrives in humid, tropical climates and is commonly found in lowland areas with rich, well-drained soils. It is often associated with secondary forests and disturbed habitats, where it can quickly colonize open spaces. The species is also known to occur in parts of the Pacific Islands, including Hawaii and New Guinea. Its native range extends into parts of northern Australia, where it grows in similar environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha accedens var. genuina was mainly introduced to New Zealand. It was introduced as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain areas, particularly in coastal and lowland regions. It is commonly found in gardens and along stream banks where it can thrive in moist, well-drained soils. However, its spread has raised concerns about its potential impact on native ecosystems."
}
