{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lindeniana",
    "plant_slug": "acalypha-lindeniana",
    "plant_name_scientific": "acalypha lindeniana",
    "intro": "Acalypha lindeniana, commonly known as the red-leaved acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, velvety red leaves that contrast beautifully with its green stems. The plant produces small, inconspicuous yellow flowers arranged in clusters, which are typically followed by distinctive, three-lobed seed capsules. It thrives in humid, shaded environments and is often cultivated as an ornamental plant for its vibrant foliage. Acalypha lindeniana is also valued in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lindeniana"
    },
    "taxonomy_art_desc": "Acalypha lindeniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large order of flowering plants that includes a wide variety of species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive flowers and often milky sap. Its genus is Acalypha, a group of flowering plants known for their showy bracts and often used in ornamental gardening. Its species is Acalypha lindeniana, a specific type of plant within the Acalypha genus, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lindeniana is primarily native to Mexico Central, Mexico Gulf, and Mexico Southeast. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid environments, often growing in lowland forests or along stream banks. The species is well adapted to the warm, moist climate of its native range. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acalypha lindeniana was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and unique growth habits. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and public spaces. The plant has been introduced to several countries, including parts of the United States, Australia, and Southeast Asia. Its rapid growth and ability to thrive in diverse soil conditions have contributed to its popularity among gardeners. However, it is also considered an invasive species in some areas, raising concerns about its ecological impact."
}
