{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brachystachya",
    "plant_slug": "acalypha-brachystachya",
    "plant_name_scientific": "acalypha brachystachya",
    "intro": "Acalypha brachystachya, commonly known as the narrow-stalked glorybower, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, showy bracts that resemble small flowers, often displaying vibrant red, orange, or yellow hues. The plant produces small, inconspicuous true flowers surrounded by these colorful leaf-like structures. It thrives in moist, well-drained soils and is often found in forest understories or near water bodies. Acalypha brachystachya is valued for its ornamental appeal and is cultivated in gardens for its visual interest.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha brachystachya"
    },
    "taxonomy_art_desc": "Acalypha brachystachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants with a long evolutionary history, including fern allies and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants known for their varied forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupuaçu,\" characterized by their showy bracts and often used in traditional medicine. Its species is Acalypha brachystachya, a specific plant within the genus Acalypha, distinguished by its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Assam",
        "Burundi",
        "Cambodia",
        "Cameroon",
        "China North-Central",
        "China South-Central",
        "China Southeast",
        "DR Congo",
        "East Himalaya",
        "Equatorial Guinea",
        "Ethiopia",
        "Gabon",
        "Gulf of Guinea Is.",
        "India",
        "Jawa",
        "Kenya",
        "Lesser Sunda Is.",
        "Malawi",
        "Mozambique",
        "Myanmar",
        "Nepal",
        "Pakistan",
        "Rwanda",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Sumatera",
        "Taiwan",
        "Tanzania",
        "Thailand",
        "Uganda",
        "West Himalaya",
        "Yemen"
    ],
    "distribution_introduced": [
        "Canary Is."
    ],
    "distribution_native_art_desc": "Acalypha brachystachya is primarily native to Angola, Assam, Burundi, Cambodia, Cameroon, China North-Central, China South-Central, China Southeast, DR Congo, East Himalaya, Equatorial Guinea, Ethiopia, Gabon, Gulf of Guinea Is., India, Jawa, Kenya, Lesser Sunda Is., Malawi, Mozambique, Myanmar, Nepal, Pakistan, Rwanda, Sri Lanka, Sudan-South Sudan, Sumatera, Taiwan, Tanzania, Thailand, Uganda, West Himalaya, and Yemen. This species is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It is a shrub or small tree that thrives in diverse habitats such as forests, shrublands, and riverbanks. The plant's wide distribution suggests it has adapted well to various climatic conditions across its range. Its presence in both Asia and Africa indicates a broad ecological tolerance and potential for use in horticulture or ecological restoration.",
    "distribution_introduced_art_desc": "Acalypha brachystachya was mainly introduced to the Canary Islands. It is considered an invasive species in this region due to its rapid growth and ability to outcompete native vegetation. The plant thrives in disturbed areas and along coastal zones, often forming dense stands. Its introduction is believed to have occurred through human activities, such as shipping or landscaping. Efforts are being made to control its spread to protect local ecosystems."
}
