{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha guatemalensis",
    "plant_slug": "acalypha-guatemalensis",
    "plant_name_scientific": "acalypha guatemalensis",
    "intro": "Acalypha guatemalensis, commonly known as the Guatemala hibiscus, is a flowering plant native to Central America. It belongs to the Euphorbiaceae family and is characterized by its showy, hibiscus-like flowers. The plant typically grows as an erect shrub with palmate leaves and produces bright yellow or orange flowers. It thrives in moist, well-drained soils and is often found in tropical and subtropical regions. Acalypha guatemalensis is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha guatemalensis"
    },
    "taxonomy_art_desc": "Acalypha guatemalensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral structures and often show a wide range of ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" often characterized by their showy flowers and bracts. Its species is Acalypha guatemalensis, a specific plant within the genus Acalypha native to Guatemala, known for its unique morphological features and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Honduras",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha guatemalensis is primarily native to Guatemala, Honduras, Mexico Southeast, and Mexico Southwest. This species is commonly found in tropical and subtropical regions within these countries. It thrives in humid, lowland areas with well-drained soil. The plant is often associated with disturbed habitats such as roadsides and open woodlands. Its native range reflects its adaptation to the diverse ecosystems of Central America.",
    "distribution_introduced_art_desc": "Acalypha guatemalensis was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and adaptability. It is commonly found in gardens and greenhouses in countries such as the United States, Australia, and parts of Southeast Asia. The plant thrives in warm climates with well-drained soil and partial to full sunlight. Its introduction has led to its establishment in some areas, sometimes becoming invasive. Proper management is necessary to prevent its spread in non-native environments."
}
