{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha carpinifolia var. domingensis",
    "plant_slug": "acalypha-carpinifolia-var-domingensis",
    "plant_name_scientific": "acalypha carpinifolia var. domingensis",
    "intro": "Acalypha carpinifolia var. domingensis, commonly known as the Dominican ironwood, is a shrub or small tree native to the Caribbean, particularly Dominica. It is characterized by its dark, almost black bark and dense, evergreen foliage. The plant has small, opposite leaves that are often covered in fine hairs, giving it a slightly rough texture. It produces clusters of small, greenish-white flowers followed by distinctive, papery bracts that add to its ornamental value. This species is valued for its hardiness and ability to thrive in tropical and subtropical climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha carpinifolia var. domingensis is primarily native to the tropical regions of Central America, particularly in countries such as Costa Rica and Panama. It thrives in humid, lowland environments with high rainfall and warm temperatures. This variant is commonly found in moist forests and along riverbanks where the soil remains consistently damp. It is adapted to the rich, well-drained soils of these tropical habitats. The plant is often part of the understory vegetation in these ecosystems.",
    "distribution_introduced_art_desc": "Acalypha carpinifolia var. domingensis was mainly introduced to regions with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage. It thrives in tropical and subtropical environments, making it suitable for gardens and landscaping in areas such as Southeast Asia, parts of the Caribbean, and the southeastern United States. The plant is typically propagated through cuttings or seeds, and its introduction has been facilitated by horticultural trade and human activity. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems. Its distribution highlights the dual role of introduced species as both ornamental plants and ecological threats."
}
