{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha platyphylla",
    "plant_slug": "acalypha-platyphylla",
    "plant_name_scientific": "acalypha platyphylla",
    "intro": "Acalypha platyphylla, commonly known as the broadleaf ironweed, is a flowering plant native to tropical and subtropical regions of Asia. It is characterized by its striking, palmate leaves that are often bright green with a velvety texture. The plant produces small, clustered flowers that range in color from red to purple, typically blooming in the summer months. It thrives in moist, well-drained soils and is often found in woodland or streamside habitats. Acalypha platyphylla is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and vibrant floral displays.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha platyphylla"
    },
    "taxonomy_art_desc": "Acalypha platyphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large order of flowering plants that includes species with diverse growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive floral structures and often produces milky sap. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy leaves. Its species is Acalypha platyphylla, a specific type within the genus Acalypha that is characterized by its flat, broad leaves and is typically found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha platyphylla is primarily native to Colombia, Ecuador, and Peru. This plant is commonly found in the Andean regions of these countries. It typically grows in moist, shaded areas within cloud forests. The species is well adapted to the humid and cool climate of its native habitat. It plays an important role in the local ecosystem and is often found in understory vegetation.",
    "distribution_introduced_art_desc": "Acalypha platyphylla was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habit. It was first recorded in the 19th century and has since become naturalized in various regions across the country. The plant thrives in moist, shady environments and is commonly found in forest margins and along stream banks. Its rapid growth and ability to spread through rhizomes have led to concerns about its potential to become invasive. Despite its ornamental value, management efforts are ongoing to control its spread in native ecosystems."
}
