{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fryeri",
    "plant_slug": "acalypha-fryeri",
    "plant_name_scientific": "acalypha fryeri",
    "intro": "Acalypha fryeri, commonly known as the silverleaf acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its striking silver-green foliage, which gives it a distinctive appearance. The plant produces small, inconspicuous flowers that are often clustered in dense inflorescences. It thrives in moist, well-drained soil and prefers partial to full sunlight. Acalypha fryeri is often cultivated as an ornamental plant for its attractive leaves and ease of care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fryeri is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in moist, well-drained soils and is often found near rivers, streams, or in forest understories. It is also present in parts of the Philippines and some regions of India. Acalypha fryeri is often cultivated for its ornamental value due to its attractive foliage and unique flower structures.",
    "distribution_introduced_art_desc": "Acalypha fryeri was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It has since become naturalized in certain coastal and disturbed areas, spreading through both seed dispersal and vegetative propagation. The plant thrives in moist, sunny environments and is often found in lowland areas with well-drained soils. Despite its aesthetic value, it has raised concerns due to its potential to invade native habitats. Its distribution continues to expand, prompting efforts to monitor and manage its spread."
}
