{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha filiformis var. arborea",
    "plant_slug": "acalypha-filiformis-var-arborea",
    "plant_name_scientific": "acalypha filiformis var. arborea",
    "intro": "Acalypha filiformis var. arborea, commonly known as the tree spurge, is a deciduous shrub or small tree native to Southeast Asia. It is characterized by its smooth, gray bark and opposite, ovate leaves with a waxy texture. The plant produces small, greenish-yellow flowers in clusters, followed by orange-red berries that are toxic to humans and animals. It thrives in tropical and subtropical climates, often found in lowland forests and along stream banks. Its ornamental value is limited due to its toxic properties, but it plays a role in local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha filiformis var. arborea is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in lowland tropical rainforests and secondary growth areas. This variant thrives in humid, warm climates with high rainfall. It is often associated with disturbed habitats and can be found near rivers and along forest edges. Its distribution is also extended to parts of Oceania, including some islands in the Pacific.",
    "distribution_introduced_art_desc": "Acalypha filiformis var. arborea was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth form. It is commonly cultivated in tropical and subtropical regions for use in gardens and landscapes. The plant thrives in moist, well-drained soils and partial to full sunlight. Its introduction has led to its presence in several non-native areas, sometimes becoming invasive. Careful management is recommended to prevent its spread beyond cultivated areas."
}
