{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha subsessilis var. glabra",
    "plant_slug": "acalypha-subsessilis-var-glabra",
    "plant_name_scientific": "acalypha subsessilis var. glabra",
    "intro": "Acalypha subsessilis var. glabra, commonly known as smoothleaf copperleaf, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its smooth, glabrous leaves that are often reddish or bronze in color. The plant produces small, clustered flowers that are typically green or yellowish in hue. It thrives in moist, shaded environments and is often found in rainforests or along stream banks. Its ornamental value makes it a popular choice for landscaping in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha subsessilis var. glabra is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It thrives in humid, lowland areas with rich soil and ample sunlight. This variant is commonly found in secondary forests, along stream banks, and in disturbed habitats. It is also occasionally cultivated in tropical gardens for its ornamental foliage. The plant's distribution is closely linked to the climatic conditions of the region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha subsessilis var. glabra was mainly introduced to the coastal regions of southern Africa, particularly in South Africa and Namibia. It thrives in sandy soils and is often found along dunes and near the shoreline. This plant is adapted to harsh, arid conditions and can tolerate salt spray from the ocean. It is commonly used for stabilizing dune systems and preventing erosion. However, it has also been noted to spread aggressively in some areas, raising concerns about its potential as an invasive species."
}
