{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha szechuanensis",
    "plant_slug": "acalypha-szechuanensis",
    "plant_name_scientific": "acalypha szechuanensis",
    "intro": "Acalypha szechuanensis, commonly known as the Sichuan spurflower, is a perennial shrub native to China. It belongs to the Euphorbiaceae family and is characterized by its distinctive, spiny leaves and clusters of small, yellowish-green flowers. The plant typically grows in moist, shaded environments and is often found in mountainous regions. Its foliage is often used in traditional medicine for its purported healing properties. The species is also valued in horticulture for its ornamental appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha szechuanensis is primarily native to the mountainous regions of Sichuan Province in southwestern China. It is commonly found in humid, shaded forests at elevations ranging from 1,500 to 3,000 meters. This species thrives in areas with well-drained soil and moderate temperatures. It is part of the Euphorbiaceae family and is known for its ornamental foliage. Due to its limited natural range, it is not widely distributed beyond its native habitat.",
    "distribution_introduced_art_desc": "Acalypha szechuanensis was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in tropical and subtropical climates. It thrives in regions with warm temperatures and high humidity, making it suitable for cultivation in southern parts of the United States, Southeast Asia, and parts of Australia. This plant is often used in ornamental gardening due to its attractive foliage and unique flowering structures. It can be propagated through stem cuttings or seeds, and it requires regular watering to maintain its health and vigor. However, it should be planted in areas where it does not become invasive, as it can spread rapidly under favorable conditions."
}
