{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha leonii",
    "plant_slug": "acalypha-leonii",
    "plant_name_scientific": "acalypha leonii",
    "intro": "Acalypha leonii, commonly known as the flame acalypha, is a flowering plant native to Mexico and Central America. It is characterized by its striking, red-bracted inflorescence that resembles a flame, giving it its common name. The plant has palmate leaves with five to seven lobes, often with a reddish or purple hue. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sun. Acalypha leonii is often cultivated as an ornamental plant for its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha leonii"
    },
    "taxonomy_art_desc": "Acalypha leonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and subtropical regions. Its order is Malpighiales, a diverse group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their hairy leaves and often showy inflorescences. Its species is Acalypha leonii, a specific type of plant within the genus Acalypha, known for its distinctive appearance and native habitat in certain regions of the Americas.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha leonii is primarily native to Madagascar. It is found throughout the island, particularly in moist, shaded forest environments. The plant thrives in humid climates and is commonly found in the eastern and southern regions of Madagascar. It is a shrub or small tree that plays a role in the local ecosystem. Due to its limited distribution, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Acalypha leonii was mainly introduced to areas with warm, humid climates and well-drained soils, often found in tropical and subtropical regions. It thrives in full sun to partial shade and is commonly used as an ornamental plant due to its attractive foliage. The plant is known for its rapid growth and ability to spread through both seeds and vegetative propagation. It has been introduced to several countries in the Americas, including parts of the United States, Mexico, and Central America. However, it can become invasive in some regions if not properly managed."
}
