{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha heterostachya",
    "plant_slug": "acalypha-heterostachya",
    "plant_name_scientific": "acalypha heterostachya",
    "intro": "Acalypha heterostachya, commonly known as the silky filbert or velvetleaf, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its distinctive, palmate leaves that are often covered in fine, silky hairs. The plant produces small, clustered flowers that are typically greenish-yellow in color. It is often found in disturbed habitats such as roadsides and abandoned fields. Acalypha heterostachya is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha heterostachya is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with secondary forests and disturbed sites. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Its native range extends into northern Australia, where it grows in similar ecological conditions.",
    "distribution_introduced_art_desc": "Acalypha heterostachya was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habit. It was first recorded in the 1970s and has since spread throughout various regions of the country. The plant thrives in a variety of soil types and is particularly common in disturbed areas such as roadsides and forest margins. Its rapid growth and ability to form dense stands have led to concerns about its potential invasiveness. However, it is not currently classified as a noxious weed in New Zealand."
}
