{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha costaricensis",
    "plant_slug": "acalypha-costaricensis",
    "plant_name_scientific": "acalypha costaricensis",
    "intro": "Acalypha costaricensis, commonly known as the Costa Rican beautyleaf, is a shrub native to Central America. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful foliage. The plant produces small, inconspicuous flowers that are often surrounded by modified leaves called bracts. It thrives in moist, tropical environments and is often found in shaded areas within the understory of forests. Acalypha costaricensis is valued for its ornamental appeal and is sometimes cultivated for its vibrant leaf colors.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha costaricensis"
    },
    "taxonomy_art_desc": "Acalypha costaricensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large order of flowering plants that includes many species with unique adaptations such as pseudostems and specialized leaves. Its family is Euphorbiaceae, commonly known as the spurge family, characterized by their milky sap and often showy flowers. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" with species that often have distinctive, showy bracts. Its species is Acalypha costaricensis, a specific type of plant native to Central America, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Costa Rica",
        "Guatemala",
        "Honduras",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua",
        "Panamá"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha costaricensis is primarily native to Belize, Costa Rica, Guatemala, Honduras, Mexico Northeast, Mexico Southeast, Mexico Southwest, Nicaragua, and Panamá. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in moist, well-drained soils and is often found in lowland areas. Acalypha costaricensis is typically associated with forest understories and disturbed habitats. Its native distribution reflects its adaptation to the diverse ecosystems of Central America.",
    "distribution_introduced_art_desc": "Acalypha costaricensis was mainly introduced to the United States, particularly in the southern regions, as an ornamental plant due to its attractive foliage. It has been reported in states such as Florida, Texas, and California, where it is often cultivated in gardens and landscapes. Despite its ornamental value, it has the potential to become invasive in certain environments if not managed properly. The plant's ability to thrive in disturbed soils and its rapid growth rate contribute to its spread in non-native areas. However, its distribution remains relatively limited compared to other invasive species in the region."
}
