{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha peduncularis var. glabrata",
    "plant_slug": "acalypha-peduncularis-var-glabrata",
    "plant_name_scientific": "acalypha peduncularis var. glabrata",
    "intro": "Acalypha peduncularis var. glabrata, commonly known as smoothleaf ironweed, is a flowering plant native to tropical and subtropical regions. It is characterized by its smooth, glabrous leaves and clusters of small, pinkish-white flowers. The plant typically grows as an annual or short-lived perennial, often found in disturbed soils and open habitats. Its botanical features include a robust stem with alternate leaves and a showy inflorescence that attracts pollinators. It is valued in horticulture for its ornamental appeal and ability to thrive in various environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha peduncularis var. glabrata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This variant is typically associated with lowland forests and is sometimes seen in disturbed or secondary growth areas. Its distribution extends to parts of the Pacific Islands as well. The plant is well adapted to warm, humid climates and thrives in areas with high rainfall.",
    "distribution_introduced_art_desc": "Acalypha peduncularis var. glabrata was mainly introduced to Hawaii, where it has become naturalized in disturbed habitats such as roadsides, coastal areas, and vacant lands. It is commonly found in wet to mesic environments, often growing in dense stands that can outcompete native vegetation. The plant spreads primarily through seed dispersal by wind, water, and animals, contributing to its rapid establishment in new areas. Due to its aggressive growth habit, it is considered a potential invasive species in some regions. Its introduction has raised concerns among conservationists due to its impact on local ecosystems."
}
