{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata",
    "plant_slug": "acalypha-reticulata",
    "plant_name_scientific": "acalypha reticulata",
    "intro": "Acalypha reticulata, commonly known as the nettleleaf ironplant, is a flowering plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family and is characterized by its distinctive, palmate leaves with a net-like venation pattern. The plant produces small, inconspicuous yellow flowers clustered in cyathia, which are typical of the Euphorbiaceae family. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and waste areas. Acalypha reticulata is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is also found in parts of tropical regions in Africa, particularly in countries like Kenya and Tanzania. This plant thrives in humid, tropical climates and is commonly found in lowland forests and disturbed areas. It is known for its ornamental value due to its vibrant foliage. Acalypha reticulata is often used in traditional medicine and as a decorative plant in gardens.",
    "distribution_introduced_art_desc": "Acalypha reticulata was mainly introduced to ornamental horticulture due to its attractive foliage and unique leaf patterns. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and landscapes. The plant thrives in moist, well-drained soils and partial to full sunlight. Its introduction has led to its establishment in some non-native areas, sometimes becoming invasive. Proper management is recommended to prevent its spread beyond cultivated areas."
}
