{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha annobonae",
    "plant_slug": "acalypha-annobonae",
    "plant_name_scientific": "acalypha annobonae",
    "intro": "Acalypha annobonae, commonly known as the Annobon Island spurflower, is a shrub native to the island of Annobón in the Gulf of Guinea. It is characterized by its distinctive, spiny leaves and small, clustered flowers that are typically greenish-white in color. The plant thrives in humid, tropical conditions and is often found in coastal areas and moist woodlands. Its unique morphology makes it a subject of interest for botanists and horticulturists. Due to its limited distribution and habitat specificity, it is considered a rare and potentially endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha annobonae"
    },
    "taxonomy_art_desc": "Acalypha annobonae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants known for their diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often used in ornamental horticulture. Its species is Acalypha annobonae, a specific type of Acalypha native to the island of Annobon, known for its unique morphological traits and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Gulf of Guinea Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha annobonae is primarily native to the Gulf of Guinea Islands. This plant is found in coastal areas of these islands, where it thrives in moist, tropical climates. It is commonly associated with mangrove ecosystems and saltwater environments. The species is endemic to this region, meaning it is not found naturally anywhere else in the world. Its distribution is limited to specific islands within the Gulf of Guinea, highlighting its unique ecological niche.",
    "distribution_introduced_art_desc": "Acalypha annobonae was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first documented in the early 20th century and has since spread through both intentional planting and accidental dispersal. The plant thrives in tropical and subtropical climates, often establishing itself in disturbed areas such as roadsides and coastal regions. Its rapid growth and ability to form dense stands have led to concerns about its invasive potential in some regions. Despite its ornamental value, it is now considered a noxious weed in several areas where it has outcompeted native vegetation."
}
