{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hontauyuensis",
    "plant_slug": "acalypha-hontauyuensis",
    "plant_name_scientific": "acalypha hontauyuensis",
    "intro": "Acalypha hontauyuensis, commonly known as the Huaihua Acalypha, is a flowering plant native to China. It belongs to the Euphorbiaceae family and is characterized by its distinctive foliage and unique floral structures. The plant typically features lance-shaped leaves with a smooth or slightly hairy surface. Its flowers are small and clustered in cup-like inflorescences, which are often surrounded by modified leaves called bracts. Acalypha hontauyuensis is valued for its ornamental qualities and is sometimes cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hontauyuensis is primarily native to the Andean region of South America, specifically in Peru and Bolivia. It is commonly found in the high-altitude grasslands and shrublands of the Andes, typically at elevations ranging from 3,000 to 4,500 meters. This plant thrives in cool, temperate climates with well-drained soils, often growing in rocky or mountainous terrain. It is a member of the Euphorbiaceae family and is known for its striking foliage. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acalypha hontauyuensis was mainly introduced to the Pacific Islands for its ornamental value due to its attractive foliage and unique growth habit. It has been cultivated in gardens and landscaping projects across several tropical regions. However, its introduction has raised concerns due to its potential to become invasive in certain environments. The plant's rapid growth and ability to spread through both seeds and vegetative means contribute to its ecological impact. Despite its beauty, careful management is recommended to prevent it from outcompeting native species."
}
