{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lamiana",
    "plant_slug": "acalypha-lamiana",
    "plant_name_scientific": "acalypha lamiana",
    "intro": "Acalypha lamiana, commonly known as the velvetleaf or silverleaf plant, is a species of flowering plant in the family Euphorbiaceae. It is native to tropical and subtropical regions of the Americas and is characterized by its striking, velvety foliage. The leaves are typically broad, heart-shaped, and covered in a fine, soft pubescence that gives them a silvery appearance. It produces small, inconspicuous flowers that are often clustered in inflorescences, and the plant is often cultivated as an ornamental due to its aesthetic appeal. Acalypha lamiana thrives in moist, well-drained soil and requires partial to full sunlight for optimal growth.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lamiana"
    },
    "taxonomy_art_desc": "Acalypha lamiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, often featuring jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical species and is known for its varied morphology and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha lamiana, a specific type within the genus Acalypha, distinguished by its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lamiana is primarily native to Madagascar. It is found in various regions across the island, including the eastern and southern parts. This plant thrives in tropical and subtropical climates, often growing in moist, well-drained soils. It is commonly found in forested areas and along riverbanks. Its native distribution is restricted to Madagascar, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha lamiana was mainly introduced to new environments as an ornamental plant due to its attractive foliage and adaptability. It is commonly found in tropical and subtropical regions where it thrives in moist, well-drained soils. The plant's introduction has led to its establishment in several non-native areas, sometimes becoming invasive. Its rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its success in new habitats. However, its impact on local ecosystems remains a topic of ongoing study and management."
}
