{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha billbergiana",
    "plant_slug": "acalypha-billbergiana",
    "plant_name_scientific": "acalypha billbergiana",
    "intro": "Acalypha billbergiana, commonly known as the velvetleaf or red leaf acalypha, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, colorful foliage, which can range from deep red to purple and green, making it a popular ornamental plant. The plant produces small, greenish-white flowers that are clustered in spikes, typically appearing in the summer months. It thrives in warm, humid climates and requires well-drained soil to prevent root rot. Acalypha billbergiana is often used in landscaping for its aesthetic appeal and ability to add vibrant color to gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha billbergiana is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often found in forest understories or along streambanks. It is also cultivated in some parts of the world for its ornamental value due to its attractive foliage. The species is well-adapted to warm climates and can tolerate partial shade to full sun.",
    "distribution_introduced_art_desc": "Acalypha billbergiana was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and unique growth habits. It is commonly used in tropical and subtropical regions as a decorative plant in gardens and public spaces. The plant's ability to thrive in humid climates makes it a popular choice for indoor and outdoor settings. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has led to ecological concerns in certain regions, prompting careful management to prevent its spread."
}
