{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha anisodonta var. subvillosa",
    "plant_slug": "acalypha-anisodonta-var-subvillosa",
    "plant_name_scientific": "acalypha anisodonta var. subvillosa",
    "intro": "Acalypha anisodonta var. subvillosa, commonly known as the velvetleaf or silky hibiscus, is a flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its soft, velvety leaves that are often covered in fine hairs, giving it a distinctive tactile quality. The plant produces showy, five-petaled flowers that range in color from yellow to red, typically blooming in clusters. It thrives in humid, warm climates and is often found in moist woodland or swampy areas. Due to its ornamental value, it is cultivated in gardens and as a houseplant in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha anisodonta var. subvillosa is primarily native to tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It thrives in humid, lowland areas with rich, well-drained soil. This variant is commonly found in secondary forests and along riverbanks. It is also present in parts of the Pacific Islands, such as the Philippines and New Guinea. The plant is adapted to warm climates and requires high levels of sunlight for optimal growth.",
    "distribution_introduced_art_desc": "Acalypha anisodonta var. subvillosa was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in disturbed habitats such as roadsides, gardens, and abandoned fields. This plant is known for its attractive, often colorful foliage and is sometimes cultivated as an ornamental species. However, it can become invasive in certain regions if not managed properly. Its distribution is largely influenced by human activity and environmental conditions that support its growth."
}
