{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha stellata",
    "plant_slug": "acalypha-stellata",
    "plant_name_scientific": "acalypha stellata",
    "intro": "Acalypha stellata, commonly known as the starleaf spurge, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, star-shaped leaves that give it its common name. The plant produces small, yellowish-green flowers arranged in clusters, which are often surrounded by bracts that add to its ornamental appeal. It thrives in moist, well-drained soils and is often found in woodland or shrubland habitats. Acalypha stellata is valued for its aesthetic qualities and is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha stellata"
    },
    "taxonomy_art_desc": "Acalypha stellata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants known for their varied forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy foliage and showy inflorescences. Its species is Acalypha stellata, a specific type within the genus Acalypha known for its distinctive star-shaped flowers and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha stellata is primarily native to Ecuador. It is commonly found in the tropical and subtropical regions of the country. This plant thrives in humid, warm climates with well-drained soil. It is often seen in lowland areas and near riverbanks. Its native distribution is largely restricted to Ecuador, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha stellata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and small, star-shaped flowers. Despite its aesthetic appeal, it has since become a weed in some areas, particularly in the North Island. The plant thrives in disturbed soils and can spread rapidly along roadsides and in forest margins. Its introduction has raised concerns about its impact on native ecosystems."
}
