{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha friesii",
    "plant_slug": "acalypha-friesii",
    "plant_name_scientific": "acalypha friesii",
    "intro": "Acalypha friesii, commonly known as the red hibiscus or red flame plant, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, bright red bracts that resemble flowers, which are actually modified leaves. The plant produces small, yellowish flowers that are less showy than the bracts. It thrives in warm, humid climates and requires well-drained soil to prevent root rot. Acalypha friesii is often cultivated as an ornamental plant for its vibrant foliage and unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha friesii is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in lowland areas with humid climates, often growing in secondary forests or along riverbanks. This plant thrives in well-drained soils and is often associated with disturbed habitats. It is also present in parts of the Pacific Islands, including Hawaii and the Caribbean. Due to its ornamental value, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha friesii was mainly introduced to Hawaii, where it has become an invasive species. It was likely brought there through human activities such as horticulture or accidental transport. The plant thrives in disturbed areas and can outcompete native vegetation. It is now found in various habitats across the islands, including coastal areas and dry forests. Efforts are being made to control its spread to protect local ecosystems."
}
