{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha floresensis",
    "plant_slug": "acalypha-floresensis",
    "plant_name_scientific": "acalypha floresensis",
    "intro": "Acalypha floresensis, commonly known as the Flores spurflower, is a flowering plant native to the island of Flores in Indonesia. It is a shrub that typically grows to a height of about 1 to 2 meters, featuring opposite, ovate leaves with a rough texture. The plant produces small, clustered flowers that are usually greenish-white in color, which bloom during the wet season. Its botanical characteristics make it an interesting subject for studies on tropical flora and ecological adaptation. The species is also noted for its potential ornamental value and ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha floresensis"
    },
    "taxonomy_art_desc": "Acalypha floresensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and chlorophyll-based photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their ability to reproduce via spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and diverse growth forms. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral structures and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants typically characterized by their distinctive bract structures and often used in ornamental horticulture. Its species is Acalypha floresensis, a specific type of plant native to Flores, Indonesia, known for its unique morphological features and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lesser Sunda Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha floresensis is primarily native to the Lesser Sunda Islands. This species is found in the archipelago that includes islands such as Flores, Sumba, and Lombok. It thrives in tropical and subtropical climates, typically in forested areas or near coastal regions. The plant is known for its distinctive foliage and is often found in humid, shaded environments. Its distribution is limited to specific habitats within the Lesser Sunda Is., making it a regionally significant species.",
    "distribution_introduced_art_desc": "Acalypha floresensis was mainly introduced to the Pacific Islands, particularly to regions such as Hawaii, Guam, and the Mariana Islands. It was likely introduced through human activity, including accidental transport via shipping or intentional cultivation for ornamental purposes. The plant thrives in tropical and subtropical climates, making it well-suited to the environmental conditions of these islands. It has been observed in both natural and disturbed habitats, including coastal areas and gardens. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
