{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sehnemii",
    "plant_slug": "acalypha-sehnemii",
    "plant_name_scientific": "acalypha sehnemii",
    "intro": "Acalypha sehnemii, commonly known as the silver mist plant, is a tropical shrub native to Southeast Asia. It is characterized by its soft, silvery-blue foliage that gives it a unique and ornamental appearance. The leaves are typically ovate to lanceolate in shape and covered in fine, dense hairs, contributing to its distinctive texture. It produces small, inconspicuous flowers that are usually green or yellow, followed by spherical, fuzzy seed capsules. This plant thrives in humid, well-drained soils and is often cultivated as a houseplant due to its aesthetic appeal and relatively easy care requirements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha sehnemii"
    },
    "taxonomy_art_desc": "Acalypha sehnemii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species, often with distinctive floral and leaf morphology. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often produces toxic sap. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy foliage. Its species is Acalypha sehnemii, a specific plant within the genus Acalypha, characterized by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sehnemii is primarily native to Brazil South. This species is found in the southern regions of Brazil, particularly in the state of Paraná. It thrives in tropical and subtropical environments with high humidity and warm temperatures. The plant is commonly found in moist, shaded areas such as forests and along riverbanks. Its native distribution is limited to specific habitats within this geographic region.",
    "distribution_introduced_art_desc": "Acalypha sehnemii was mainly introduced to tropical and subtropical regions as an ornamental plant due to its striking foliage. It is commonly found in horticultural settings and botanical gardens where its unique leaf patterns are appreciated. The plant thrives in warm, humid climates and requires well-draining soil to prevent root rot. It is often used in landscape design for its aesthetic value rather than for agricultural purposes. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
