{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ehretiifolia",
    "plant_slug": "acalypha-ehretiifolia",
    "plant_name_scientific": "acalypha ehretiifolia",
    "intro": "Acalypha ehretiifolia, commonly known as the \"Mexican beauty\" or \"white-veined hibiscus,\" is a flowering plant native to Central and South America. It is a shrub or small tree that typically grows up to 3 meters tall, featuring palmate leaves with five to seven lobes. The plant produces showy, five-petaled flowers in shades of yellow, orange, or red, which bloom in clusters. Its ornamental value is enhanced by the striking white veins that run through the leaves. Acalypha ehretiifolia thrives in tropical and subtropical climates and is often cultivated for its aesthetic appeal in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ehretiifolia is primarily native to tropical and subtropical regions of Africa, including countries such as Nigeria, Ghana, and Sudan. It is also found in parts of southern Asia, including India and Sri Lanka. This plant thrives in moist, shaded environments and is commonly found in forests and along riverbanks. It is often used in traditional medicine for its purported health benefits. Its distribution is largely limited to areas with warm climates and high humidity.",
    "distribution_introduced_art_desc": "Acalypha ehretiifolia was mainly introduced to enhance biodiversity and provide ornamental value in tropical and subtropical regions. It is commonly cultivated in gardens and landscapes due to its attractive foliage and adaptability to various soil types. The plant is also used in phytoremediation efforts to clean contaminated soils and water. Its introduction has been documented in several countries, including the United States, Australia, and parts of Southeast Asia. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
