{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha crassa",
    "plant_slug": "acalypha-crassa",
    "plant_name_scientific": "acalypha crassa",
    "intro": "Acalypha crassa, commonly known as the broadleaf spurge, is a herbaceous perennial plant native to tropical and subtropical regions. It is characterized by its thick, waxy leaves that are typically green with a reddish or purplish underside. The plant produces small, inconspicuous flowers that are clustered in dense inflorescences, often with bracts that are colorful and showy. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Acalypha crassa is known for its ability to tolerate waterlogged conditions, making it a common species in riparian zones.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha crassa is primarily native to tropical and subtropical regions of the Americas, including parts of Central and South America. It is commonly found in countries such as Brazil, Peru, and Colombia. This plant thrives in moist, shaded environments, often growing in forests or along stream banks. It is also present in some Caribbean islands. Its native distribution includes areas with high humidity and warm climates.",
    "distribution_introduced_art_desc": "Acalypha crassa was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habit. It was first recorded in the 19th century and has since spread throughout various regions of the country. The plant is now considered a weed in some areas, particularly in coastal and disturbed habitats. Its rapid growth and ability to thrive in diverse soil types have contributed to its invasive potential. Efforts to control its spread have been ongoing, but it remains a challenge for land managers."
}
