{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha multicaulis var. genuina",
    "plant_slug": "acalypha-multicaulis-var-genuina",
    "plant_name_scientific": "acalypha multicaulis var. genuina",
    "intro": "Acalypha multicaulis var. genuina, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to tropical and subtropical regions. It is characterized by its palmate leaves, which are often covered in fine, soft hairs that give the plant a velvety texture. The plant produces small, clustered flowers that range in color from white to pink, typically blooming in the summer months. Its growth habit is herbaceous, with a sprawling or upright form depending on the environment. It thrives in moist, well-drained soils and is often found in disturbed or cultivated areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha multicaulis var. genuina is primarily native to Southeast Asia, specifically countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This variant is typically associated with lowland forest understories and is sometimes seen near streams or in swampy areas. It is a member of the Euphorbiaceae family and is known for its attractive, palmate leaves. Due to its ornamental value, it has been introduced to other regions but remains most prevalent in its native range.",
    "distribution_introduced_art_desc": "Acalypha multicaulis var. genuina was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first documented in the early 20th century and has since become naturalized in several regions. The plant thrives in tropical and subtropical climates, often growing along roadsides and in disturbed areas. Its rapid growth and ability to spread through seeds have led to its classification as an invasive species in some areas. Conservation efforts are ongoing to manage its spread and protect native plant communities."
}
