{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hellwigii",
    "plant_slug": "acalypha-hellwigii",
    "plant_name_scientific": "acalypha hellwigii",
    "intro": "Acalypha hellwigii, commonly known as the silverleaf acalypha, is a shrub native to tropical and subtropical regions of the Americas. It features striking, silver-white to blue-green foliage that is often covered in fine, silky hairs, giving it a distinctive appearance. The plant produces small, clustered flowers that are typically green or reddish in color, followed by spherical, fuzzy seed capsules. It thrives in well-drained soil and full sun to partial shade, making it a popular choice for ornamental gardening. Acalypha hellwigii is also valued for its ability to tolerate coastal conditions and air pollution, enhancing its adaptability in various environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha hellwigii"
    },
    "taxonomy_art_desc": "Acalypha hellwigii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical species with distinctive floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with often milky sap and diverse growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper bushes,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha hellwigii, a specific plant within the genus Acalypha, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bismarck Archipelago",
        "Maluku",
        "New Guinea",
        "Sulawesi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hellwigii is primarily native to the Bismarck Archipelago, Maluku, New Guinea, and Sulawesi. This plant is found in the tropical regions of these areas, where it thrives in humid and warm climates. It is commonly associated with coastal and lowland environments in its native range. The species is part of the Euphorbiaceae family, which includes many shrubs and trees. Its distribution is largely restricted to the islands mentioned, with limited occurrence in adjacent regions.",
    "distribution_introduced_art_desc": "Acalypha hellwigii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there in the late 19th or early 20th century by horticulturists and gardeners seeking to diversify local plant collections. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed soils and can spread rapidly through seeds dispersed by wind and water. Its introduction highlights the ecological risks associated with non-native species in island environments."
}
