{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schultesii",
    "plant_slug": "acalypha-schultesii",
    "plant_name_scientific": "acalypha schultesii",
    "intro": "Acalypha schultesii, commonly known as the Schultesi's spurflower, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its striking, spiky bracts that resemble flowers. The plant typically grows as an upright shrub, reaching heights of up to 2 meters, with simple, opposite leaves that are usually ovate or elliptic in shape. Its small, inconspicuous flowers are clustered in cyathia, which are surrounded by the showy bracts. Acalypha schultesii is often cultivated for its ornamental value and is adapted to well-drained soils in full sun.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha schultesii"
    },
    "taxonomy_art_desc": "Acalypha schultesii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as those in the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some with toxic properties. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false holly,\" often characterized by their distinctive leaves and flowers. Its species is Acalypha schultesii, a specific type within the genus Acalypha, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schultesii is primarily native to Colombia. It is found in the tropical regions of the country, particularly in the Andean foothills and lowland areas. This plant thrives in humid, warm climates with well-drained soils. It is commonly found in secondary forests and along stream banks. Its distribution is limited to specific ecological niches within Colombia's diverse landscape.",
    "distribution_introduced_art_desc": "Acalypha schultesii was mainly introduced to new environments through human activities such as horticultural trade and intentional planting. It is commonly found in disturbed areas, along roadsides, and in urban settings where it can thrive in disturbed soils. This plant is known for its rapid growth and ability to colonize open spaces, making it an invasive species in some regions. Its introduction has led to concerns about its impact on native vegetation and ecosystem balance. Efforts are being made to monitor and manage its spread to prevent further ecological disruption."
}
