{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha subbullata",
    "plant_slug": "acalypha-subbullata",
    "plant_name_scientific": "acalypha subbullata",
    "intro": "Acalypha subbullata, commonly known as the woolly croton, is a flowering plant native to tropical regions of Africa. It is characterized by its distinctive, hairy, silver-green leaves that give it a soft, fuzzy appearance. The plant produces small, clustered yellow flowers that bloom in late summer to early autumn. It thrives in warm, humid environments and prefers well-drained soil. Acalypha subbullata is often cultivated as an ornamental plant for its unique foliage and ability to add visual interest to gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha subbullata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like forest edges and riverbanks. It is also present in parts of the Philippines and some islands in the Indian Ocean. Due to its adaptability, it can be found in both wild and cultivated environments across its native range.",
    "distribution_introduced_art_desc": "Acalypha subbullata was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activities such as horticulture or accidental transport. The plant thrives in disturbed areas and can outcompete native vegetation. Due to its rapid growth and adaptability, it poses a threat to local ecosystems. Efforts are ongoing to control its spread and prevent further ecological damage."
}
