{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha indica lusus abortiva",
    "plant_slug": "acalypha-indica-lusus-abortiva",
    "plant_name_scientific": "acalypha indica lusus abortiva",
    "intro": "Acalypha indica lusus abortiva, commonly known as the Indian nettle or false nettle, is a flowering plant native to Southeast Asia. It is characterized by its hairy, triangular leaves and small, greenish-white flowers that appear in clusters. The plant belongs to the Euphorbiaceae family, which includes many species with milky sap. It thrives in moist, tropical environments and is often found in disturbed soils. Its growth habit is typically herbaceous, with a sprawling or upright form depending on the conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha indica lusus abortiva is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, fertile soils. This species thrives in humid climates and is often associated with disturbed habitats such as roadsides and agricultural fields. It is also present in parts of India and the Philippines. The plant is known for its ornamental value and is sometimes cultivated for its colorful foliage.",
    "distribution_introduced_art_desc": "Acalypha indica lusus abortiva was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly used in landscaping due to its attractive foliage and ability to thrive in disturbed soils. The plant has been spread through both intentional planting and accidental dispersal by wind and water. It has established itself in several countries, including parts of Asia and the Pacific Islands. However, its invasive potential remains a concern in some areas where it may outcompete native vegetation."
}
