{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha scabrosa var. elongata",
    "plant_slug": "acalypha-scabrosa-var-elongata",
    "plant_name_scientific": "acalypha scabrosa var. elongata",
    "intro": "Acalypha scabrosa var. elongata, commonly known as the longleaf ironweed, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its upright growth habit and elongated, narrow leaves that are often covered in fine hairs. The plant produces small, clustered flowers that range in color from white to pink, typically blooming in the summer months. It thrives in full sun to partial shade and is often found in moist, well-drained soils. Due to its ornamental value, it is sometimes cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha scabrosa var. elongata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in shaded to semi-shaded environments, often growing along forest edges or in disturbed habitats. It is also known to occur in parts of the Pacific Islands, including Hawaii and parts of Oceania. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha scabrosa var. elongata was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was first documented in the early 20th century and has since become naturalized in various coastal and disturbed habitats. The plant thrives in tropical and subtropical climates, often growing along roadsides and in open areas with well-drained soil. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to its classification as an invasive species in some regions. Efforts to control its spread have been ongoing, but its establishment in native ecosystems remains a concern."
}
