{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrostachya var. macrophylla",
    "plant_slug": "acalypha-macrostachya-var-macrophylla",
    "plant_name_scientific": "acalypha macrostachya var. macrophylla",
    "intro": "Acalypha macrostachya var. macrophylla, commonly known as the giant curlleaf mallow, is a strikingly ornamental plant native to tropical regions of Africa. It is characterized by its large, heart-shaped leaves that are often curled or wavy in appearance. The plant produces showy, spiky inflorescences with vibrant red or orange bracts, which are often mistaken for flowers. It thrives in warm, humid climates and requires well-drained soil to prevent root rot. Due to its aesthetic appeal, it is often cultivated in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrostachya var. macrophylla is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland forests and disturbed areas. This variant is known for its large, heart-shaped leaves and is commonly found in moist, shaded environments. It is also occasionally cultivated as an ornamental plant due to its attractive foliage. The plant plays a role in local ecosystems by providing habitat and food for various insects and small animals.",
    "distribution_introduced_art_desc": "Acalypha macrostachya var. macrophylla was mainly introduced to areas with warm, humid climates and well-drained soils, often in tropical and subtropical regions. It thrives in full sun to partial shade and is commonly found in disturbed habitats such as roadsides, abandoned fields, and along stream banks. This plant is known for its vibrant, colorful bracts that attract pollinators and add ornamental value to landscapes. It has been introduced to several regions outside its native range, including parts of the southern United States and Southeast Asia. Due to its rapid growth and adaptability, it can become invasive in some environments if not managed properly."
}
