{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha confertiflora",
    "plant_slug": "acalypha-confertiflora",
    "plant_name_scientific": "acalypha confertiflora",
    "intro": "Acalypha confertiflora, commonly known as the clustered or clustered leaf euphorbia, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its palmate leaves, which are often brightly colored and have a distinctive veining pattern. The plant produces clusters of small, greenish-yellow flowers that are typically borne in dense inflorescences. It is a member of the Euphorbiaceae family, known for its diverse and often striking floral structures. Acalypha confertiflora is often cultivated for its ornamental value in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha confertiflora"
    },
    "taxonomy_art_desc": "Acalypha confertiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with unique floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide variety of morphologies and ecological adaptations. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha confertiflora, a specific type within the genus Acalypha that is characterized by its dense inflorescences and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha confertiflora is primarily native to Mexico Southwest. This plant is found in the arid and semi-arid regions of the area. It thrives in rocky soils and open habitats. It is commonly seen in desert environments and along dry stream beds. Its native range is limited to specific regions within Mexico's southwestern states.",
    "distribution_introduced_art_desc": "Acalypha confertiflora was mainly introduced to tropical and subtropical regions for its ornamental value due to its vibrant foliage and unique flower clusters. It is commonly found in landscapes, gardens, and as a hedging plant in areas with warm climates. The plant thrives in moist, well-drained soils and full sun to partial shade conditions. Its rapid growth rate makes it suitable for erosion control and as a living fence. However, it has also become an invasive species in some regions, outcompeting native vegetation."
}
