{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha conspicua",
    "plant_slug": "acalypha-conspicua",
    "plant_name_scientific": "acalypha conspicua",
    "intro": "Acalypha conspicua, commonly known as the flame bush, is a tropical shrub native to Southeast Asia. It is characterized by its striking, showy inflorescences that resemble flames, consisting of red, orange, and yellow bracts. The plant has palmate leaves with five to seven lobes, often with a hairy texture. It thrives in moist, well-drained soils and prefers full sun to partial shade. Acalypha conspicua is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha conspicua"
    },
    "taxonomy_art_desc": "Acalypha conspicua belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is defined by specific floral and anatomical features. Its order is Malpighiales, a large order of flowering plants that includes a wide variety of species with diverse morphologies and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"spurge,\" characterized by their distinctive leaves and showy flowers. Its species is Acalypha conspicua, a specific plant within the genus Acalypha known for its striking appearance and is native to certain regions of the world.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Gulf"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha conspicua is primarily native to the Mexico Gulf region. This plant is commonly found in coastal areas and wetlands along the Gulf Coast. It thrives in humid, tropical climates with ample sunlight. Acalypha conspicua is often seen growing in sandy soils near the shoreline. Its native range includes parts of the southern United States and northern Mexico.",
    "distribution_introduced_art_desc": "Acalypha conspicua was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and growth habit. It was brought there in the late 19th or early 20th century by horticulturists and gardeners who admired its vibrant leaf colors. However, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed habitats and can spread rapidly through seeds dispersed by wind, water, or animals. Its introduction highlights the ecological risks associated with non-native plant species in island environments."
}
