{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha spachiana var. latifolia",
    "plant_slug": "acalypha-spachiana-var-latifolia",
    "plant_name_scientific": "acalypha spachiana var. latifolia",
    "intro": "Acalypha spachiana var. latifolia, commonly known as broadleaf acalypha, is a tropical shrub native to Southeast Asia. It is characterized by its large, heart-shaped leaves that are often variegated with white or cream markings. The plant produces small, clustered flowers that are typically green or red in color. It thrives in moist, well-drained soil and prefers full sun to partial shade. This species is valued for its ornamental appeal and is often used in landscaping and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha spachiana var. latifolia is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in humid environments, often found in lowland forests, shrublands, and along riverbanks. This variant is known for its broad, heart-shaped leaves and is commonly found in moist, well-drained soils. It is also occasionally cultivated in ornamental gardens due to its attractive foliage. The plant plays an important ecological role in its native habitat by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acalypha spachiana var. latifolia was mainly introduced to areas with tropical and subtropical climates, where it thrives in warm, humid environments. It is commonly found in regions with well-drained soil and partial to full sunlight. This plant is often cultivated as an ornamental species due to its attractive foliage and unique leaf patterns. It has been introduced to various parts of the world, including Southeast Asia, the Pacific Islands, and some regions of the Americas. However, its spread is generally limited by its specific environmental requirements and lack of widespread naturalization."
}
