{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha commersoniana f. colorata",
    "plant_slug": "acalypha-commersoniana-f-colorata",
    "plant_name_scientific": "acalypha commersoniana f. colorata",
    "intro": "Acalypha commersoniana f. colorata, commonly known as the Crimson Cudweed, is a striking ornamental plant native to South America. It is characterized by its vibrant, colorful bracts that range from red to orange, which are often mistaken for flowers. The plant has alternate, heart-shaped leaves with a smooth texture and a slightly waxy appearance. It thrives in full sun to partial shade and prefers well-drained soil. Its unique foliage makes it a popular choice for garden landscapes and container planting.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha commersoniana f. colorata is primarily native to the tropical regions of South America, particularly Brazil, Peru, and Bolivia. This plant thrives in humid, lowland areas with rich, well-drained soils. It is commonly found in the understorey of tropical rainforests and along riverbanks. The species is known for its striking, colorful bracts that attract various pollinators. Its natural distribution is largely restricted to these specific ecological zones within the Amazon and Andean regions.",
    "distribution_introduced_art_desc": "Acalypha commersoniana f. colorata was mainly introduced to enhance ornamental value in gardens and landscapes due to its vibrant foliage. It is commonly found in tropical and subtropical regions where it thrives in warm, humid climates. This cultivar is often used in container gardening and as a decorative plant in public spaces. Its introduction has led to its cultivation in various parts of the world, including the Caribbean, Southeast Asia, and parts of the United States. However, it is important to monitor its spread to prevent potential ecological impacts in non-native habitats."
}
