{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ampliata",
    "plant_slug": "acalypha-ampliata",
    "plant_name_scientific": "acalypha ampliata",
    "intro": "Acalypha ampliata, commonly known as the broadleaf ironweed, is a flowering plant native to tropical and subtropical regions of Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that often resemble flowers. The plant typically grows as an herbaceous perennial, reaching heights of up to 1.5 meters. Its leaves are broad and ovate, with a smooth or slightly hairy surface, and it produces small, inconspicuous flowers clustered in cup-like structures. Acalypha ampliata is often cultivated for its ornamental value and is used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ampliata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with forest understories or disturbed habitats. It is also known to occur in parts of southern China and northern Australia. Its distribution is largely restricted to these geographic regions, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha ampliata was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant thrives in well-drained soil and full sun to partial shade, making it suitable for gardens and green spaces. Its rapid growth and ability to spread through runners have led to its use in erosion control and ground cover. However, it has also become an invasive species in some areas, posing a threat to native ecosystems."
}
