{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cuneata var. genuina",
    "plant_slug": "acalypha-cuneata-var-genuina",
    "plant_name_scientific": "acalypha cuneata var. genuina",
    "intro": "Acalypha cuneata var. genuina, commonly known as the narrow-leaf ironweed, is a species native to the southern United States. It is a herbaceous annual plant characterized by its slender, alternate leaves that are typically lance-shaped. The plant produces small, greenish-white flowers arranged in spikes, which bloom in late summer. It thrives in disturbed soils and is often found in open fields and along roadsides. Its rapid growth and ability to colonize areas make it a common weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cuneata var. genuina is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing in forest understories or near water bodies. It is also present in parts of northern Australia and New Guinea. Its distribution is closely associated with humid tropical climates and is typically found in secondary forests or disturbed habitats.",
    "distribution_introduced_art_desc": "Acalypha cuneata var. genuina was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. However, it has since become naturalized and is now considered a potential weed in certain areas. The plant thrives in moist, shady conditions and can spread rapidly in disturbed habitats. Its introduction has raised concerns about its impact on native ecosystems."
}
