{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata f. humblotiana",
    "plant_slug": "acalypha-reticulata-f-humblotiana",
    "plant_name_scientific": "acalypha reticulata f. humblotiana",
    "intro": "Acalypha reticulata f. humblotiana, commonly known as the hummingbird plant, is a tropical shrub characterized by its striking, showy bracts that resemble hummingbird wings. It belongs to the Euphorbiaceae family and is native to Southeast Asia, particularly Indonesia. The plant features palmate leaves with a velvety texture and bright red or orange bracts that surround small, inconspicuous flowers. It thrives in humid, warm climates and is often cultivated for its ornamental value in gardens and as a houseplant. Its unique appearance makes it a popular choice for adding visual interest to landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata f. humblotiana is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland areas with rich soil and adequate rainfall. This plant is commonly found in primary and secondary forests, as well as along riverbanks and in swampy habitats. It is often part of the undergrowth vegetation in these ecosystems. Its native distribution is closely linked to the biodiversity hotspots of the region.",
    "distribution_introduced_art_desc": "Acalypha reticulata f. humblotiana was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage. It is commonly cultivated in gardens and as a houseplant because of its vibrant leaf colors and unique texture. The plant thrives in warm climates with high humidity and partial to full sunlight. It is often used in landscape design to add visual interest to outdoor spaces. However, it is important to note that it may become invasive in certain environments if not managed properly."
}
