{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha jamaicensis",
    "plant_slug": "acalypha-jamaicensis",
    "plant_name_scientific": "acalypha jamaicensis",
    "intro": "Acalypha jamaicensis, commonly known as the Jamaican copperleaf, is a flowering plant native to the Caribbean. It is a shrub or small tree that typically grows in tropical and subtropical regions. The plant features palmate leaves with a distinctive reddish or copper-colored hue, which gives it its common name. It produces small, yellowish flowers arranged in spikes, and its fruits are three-winged seeds that are dispersed by wind. Acalypha jamaicensis is often used in traditional medicine and is valued for its ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha jamaicensis is primarily native to the Caribbean islands, particularly Jamaica and parts of the Greater Antilles. It is commonly found in moist, shaded areas within tropical forests. This plant thrives in humid climates with well-drained soil. It is often seen growing along stream banks and in rocky crevices. Its distribution is limited to specific regions in the Caribbean, where it plays a role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acalypha jamaicensis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there during the 19th century by horticulturists and gardeners who sought to introduce exotic species for landscaping purposes. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, shaded environments and spreads through its prolific seed production. Its introduction highlights the ecological risks associated with non-native plant species in island ecosystems."
}
