{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha claoxyloides",
    "plant_slug": "acalypha-claoxyloides",
    "plant_name_scientific": "acalypha claoxyloides",
    "intro": "Acalypha claoxyloides, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, ornamental leaves that display vivid red veins against a deep green background. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shaded environments and is often found in humid tropical forests. Acalypha claoxyloides is valued for its aesthetic appeal and is sometimes cultivated as a decorative plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha claoxyloides"
    },
    "taxonomy_art_desc": "Acalypha claoxyloides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized structures such as stipules and unique fruit types. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"arrowroot,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha claoxyloides, a specific plant within the genus Acalypha that is distinguished by its unique morphological traits and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Aldabra"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha claoxyloides is primarily native to Aldabra. It is found on the Aldabra Atoll, which is part of the Chagos Archipelago in the Indian Ocean. This plant thrives in the arid and semi-arid environments of the atoll. It is adapted to the unique ecological conditions of the region, including limited water availability and high temperatures. Its distribution is restricted to this specific geographic area, making it a rare and endemic species.",
    "distribution_introduced_art_desc": "Acalypha claoxyloides was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It is commonly found in areas with warm climates, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant has been reported to naturalize in some regions, posing potential ecological impacts on native flora. Its introduction has been associated with horticultural trade and landscape gardening practices. Despite its aesthetic appeal, its invasive potential requires careful management in certain environments."
}
