{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gillmanii",
    "plant_slug": "acalypha-gillmanii",
    "plant_name_scientific": "acalypha gillmanii",
    "intro": "Acalypha gillmanii, commonly known as Gillman's spurge, is a flowering plant native to the southwestern United States and northern Mexico. It belongs to the Euphorbiaceae family, which is characterized by its milky sap and often showy floral structures. The plant typically grows as a shrub or small tree, featuring simple, alternate leaves that are usually ovate to lanceolate in shape. Its flowers are small and clustered in cyathia, a unique structure typical of the spurge family. Acalypha gillmanii is adapted to arid environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha gillmanii"
    },
    "taxonomy_art_desc": "Acalypha gillmanii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with unique floral structures and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of growth forms and some toxic properties. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha gillmanii, a specific type of plant within the Acalypha genus, characterized by its unique morphological traits and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gillmanii is primarily native to Tanzania. It is commonly found in the eastern and central regions of the country. This plant thrives in moist, tropical climates and is often seen in forested areas. It is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its natural habitat includes riverine forests and coastal regions within Tanzania.",
    "distribution_introduced_art_desc": "Acalypha gillmanii was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in disturbed areas. The plant thrives in moist, sunny environments and spreads rapidly through seeds. Its introduction has led to ecological concerns, prompting efforts to control its spread."
}
