{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha capitata",
    "plant_slug": "acalypha-capitata",
    "plant_name_scientific": "acalypha capitata",
    "intro": "Acalypha capitata, commonly known as the \"Crownleaf\" or \"White Crown,\" is a tropical shrub native to parts of Asia and the Pacific Islands. It is characterized by its dense, rounded inflorescences that resemble a crown, hence its common name. The plant features palmate leaves with five to seven lobes, often covered in fine hairs. It produces small, inconspicuous greenish-white flowers that are clustered in terminal heads. Acalypha capitata is often cultivated for its ornamental value and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha capitata"
    },
    "taxonomy_art_desc": "Acalypha capitata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and often complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations such as specialized leaves and flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"beard-tongue,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha capitata, a specific type within the genus Acalypha known for its compact growth and distinctive flowering heads.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha capitata is primarily native to India. It is commonly found in the tropical and subtropical regions of the country. This plant thrives in moist, well-drained soils and is often seen in open areas, gardens, and along roadsides. It is known for its showy, clustered inflorescences that attract pollinators. Acalypha capitata is an important species in local ecosystems and has cultural significance in some regions of India.",
    "distribution_introduced_art_desc": "Acalypha capitata was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its showy, bright red bracts. However, it has since spread rapidly and is now considered a noxious weed. The plant thrives in disturbed areas and competes with native vegetation, threatening local ecosystems. Efforts are ongoing to control its spread and manage its impact on the environment."
}
