{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha weddelliana var. major",
    "plant_slug": "acalypha-weddelliana-var-major",
    "plant_name_scientific": "acalypha weddelliana var. major",
    "intro": "Acalypha weddelliana var. major, commonly known as the velvetleaf or red-leaf kochia, is a strikingly ornamental plant native to tropical regions of Africa. It is characterized by its lance-shaped, velvety leaves that range from deep green to reddish hues, depending on light exposure and season. The plant produces small, inconspicuous greenish flowers that are clustered in dense, spike-like inflorescences. It thrives in full sun to partial shade and requires well-drained soil, making it suitable for rock gardens or as a container plant. Due to its attractive foliage, it is often cultivated for ornamental purposes in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha weddelliana var. major is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, warm climates and is commonly found in lowland forests and along riverbanks. This variant is particularly adapted to moist environments and often grows in shaded or semi-shaded areas within its natural habitat. It is known for its striking foliage and is sometimes cultivated as an ornamental plant. The plant's distribution is closely tied to the ecological conditions of these regions, where it plays a role in local biodiversity.",
    "distribution_introduced_art_desc": "Acalypha weddelliana var. major was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was first documented in the early 20th century and has since become naturalized in several regions. The plant is commonly found in disturbed habitats such as roadsides, stream banks, and vacant lots. Its rapid growth and adaptability have led to concerns about its potential invasiveness in native ecosystems. Despite its aesthetic appeal, it is now considered a potential weed in some areas."
}
