{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvifolia",
    "plant_slug": "acalypha-parvifolia",
    "plant_name_scientific": "acalypha parvifolia",
    "intro": "Acalypha parvifolia, commonly known as the small-leaved glorybower, is a flowering plant native to tropical regions of Asia. It is characterized by its delicate, small leaves that are often covered in fine hairs. The plant produces clusters of tiny, pale yellow flowers that bloom in spring and summer. It typically grows as an herbaceous annual or a short-lived perennial. Acalypha parvifolia is often cultivated for its ornamental value in gardens and as a cut flower.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvifolia is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in moist, well-drained soils and is often seen in forest understories or near water bodies. It is also present in parts of the Pacific Islands, such as Samoa and Hawaii, where it has been introduced. Due to its adaptability, it can sometimes be found in disturbed habitats or along roadsides in its native range.",
    "distribution_introduced_art_desc": "Acalypha parvifolia was mainly introduced to ornamental horticulture due to its attractive foliage and compact growth habit. It is commonly cultivated in gardens and as a houseplant because of its ability to thrive in a variety of light conditions. The plant is native to Southeast Asia but has been widely distributed in tropical and subtropical regions around the world. Its introduction has led to its establishment in some areas outside its native range, sometimes becoming invasive. Despite its ornamental value, care must be taken to prevent its spread into natural ecosystems."
}
