{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis var. agrestis",
    "plant_slug": "acalypha-communis-var-agrestis",
    "plant_name_scientific": "acalypha communis var. agrestis",
    "intro": "Acalypha communis var. agrestis, commonly known as the roughleaf ironweed, is a perennial herb native to tropical and subtropical regions. It features palmate leaves with serrated margins and a distinctive, showy inflorescence of small, clustered flowers. The plant typically grows in moist, shaded environments such as forests and wetlands. Its botanical characteristics include fibrous roots and a woody stem that becomes more prominent with age. The species is valued for its ornamental appeal and ecological benefits in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis var. agrestis is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments like forest understories. This variant is also present in parts of the Pacific Islands, including the Philippines and New Guinea. It thrives in humid climates and is often associated with wetlands or disturbed soils. Its native range extends into some regions of eastern Africa, though it is less common there compared to its Southeast Asian stronghold.",
    "distribution_introduced_art_desc": "Acalypha communis var. agrestis was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly used in tropical and subtropical regions for its vibrant leaf colors and ability to thrive in both full sun and partial shade. This plant has been widely cultivated in gardens and as a decorative plant in urban settings. Its introduction has led to its establishment in some non-native areas, where it can sometimes become invasive. However, it is generally considered a desirable ornamental species with low maintenance requirements."
}
