{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha argomuelleri",
    "plant_slug": "acalypha-argomuelleri",
    "plant_name_scientific": "acalypha argomuelleri",
    "intro": "Acalypha argomuelleri, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Africa. It is characterized by its striking red veins on its heart-shaped leaves, which give it a distinctive appearance. The plant produces small, greenish-yellow flowers arranged in dense clusters, which are typically borne on slender stalks. It thrives in moist, shaded environments and is often found in rainforests or along stream banks. The species is valued for its ornamental qualities and is sometimes cultivated in gardens for its visual appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha argomuelleri"
    },
    "taxonomy_art_desc": "Acalypha argomuelleri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants known for their diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of growth forms and some toxic properties. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" often characterized by their showy flowers and hairy foliage. Its species is Acalypha argomuelleri, a specific type of plant within the Acalypha genus, known for its unique morphological traits and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha argomuelleri is primarily native to Ecuador and Peru. This species is found in the tropical and subtropical regions of these countries. It typically grows in areas with high humidity and well-drained soils. The plant is often found in forest understories or along riverbanks. Its native distribution is limited to these specific geographic locations.",
    "distribution_introduced_art_desc": "Acalypha argomuelleri was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in areas with warm climates and well-drained soils. The plant has been reported in several countries in the Pacific and Southeast Asia. Its introduction has sometimes led to it becoming invasive in certain ecosystems. Proper management is recommended to prevent its spread beyond cultivated areas."
}
