{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gracilens",
    "plant_slug": "acalypha-gracilens",
    "plant_name_scientific": "acalypha gracilens",
    "intro": "Acalypha gracilens, commonly known as slender copperleaf, is a flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its slender, upright stems and striking, velvety leaves that range in color from green to reddish-brown. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and prefers partial to full sunlight. Acalypha gracilens is often cultivated as an ornamental plant for its attractive foliage and ease of care.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha gracilens"
    },
    "taxonomy_art_desc": "Acalypha gracilens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex vascular systems. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with diverse morphologies and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with characteristic latex and diverse growth forms. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha gracilens, a specific type within the genus Acalypha, characterized by its slender stems and unique floral structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Alabama",
        "Arkansas",
        "Connecticut",
        "Delaware",
        "District of Columbia",
        "Florida",
        "Georgia",
        "Illinois",
        "Indiana",
        "Iowa",
        "Kentucky",
        "Louisiana",
        "Maine",
        "Maryland",
        "Massachusetts",
        "Mississippi",
        "Missouri",
        "New Hampshire",
        "New Jersey",
        "New York",
        "North Carolina",
        "Ohio",
        "Oklahoma",
        "Pennsylvania",
        "Rhode I.",
        "South Carolina",
        "Tennessee",
        "Texas",
        "Vermont",
        "Virginia",
        "West Virginia"
    ],
    "distribution_introduced": [
        "Mozambique",
        "Wisconsin"
    ],
    "distribution_native_art_desc": "Acalypha gracilens is primarily native to Alabama, Arkansas, Connecticut, Delaware, District of Columbia, Florida, Georgia, Illinois, Indiana, Iowa, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Mississippi, Missouri, New Hampshire, New Jersey, New York, North Carolina, Ohio, Oklahoma, Pennsylvania, Rhode Island, South Carolina, Tennessee, Texas, Vermont, Virginia, and West Virginia. It is commonly found in moist to wet habitats such as swamps, marshes, and along stream banks. This species is often associated with riparian zones and wetlands throughout its range. It is a herbaceous plant that can grow in both full sun and partial shade conditions. Acalypha gracilens is known for its distinctive leaves and small, clustered flowers.",
    "distribution_introduced_art_desc": "Acalypha gracilens was mainly introduced to Mozambique and Wisconsin. It is a flowering plant native to Africa but has been cultivated in these regions. The introduction of this species may be due to its ornamental value or for ecological restoration purposes. It thrives in moist, well-drained soils and prefers partial to full sun. However, its spread in these areas requires careful monitoring to prevent potential invasiveness."
}
