{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha dikuluwensis",
    "plant_slug": "acalypha-dikuluwensis",
    "plant_name_scientific": "acalypha dikuluwensis",
    "intro": "Acalypha dikuluwensis, commonly known as the KwaZulu-Natal fanflower, is a shrub native to South Africa. It is characterized by its striking, palmate leaves that are often covered in fine hairs. The plant produces small, clustered flowers that range in color from white to pink, adding to its ornamental value. It thrives in moist, well-drained soils and is often found in coastal and riverine habitats. Due to its unique appearance and habitat, it is of interest to botanists and horticulturists alike.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha dikuluwensis"
    },
    "taxonomy_art_desc": "Acalypha dikuluwensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their spore reproduction and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with a wide range of morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and hairy leaves. Its species is Acalypha dikuluwensis, a specific type of plant native to certain regions, known for its unique botanical features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Zambia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha dikuluwensis is primarily native to Zambia. It is found in the northern and central regions of the country. This plant thrives in tropical and subtropical climates. It is commonly found in open woodlands and along riverbanks. Its native distribution is limited to specific ecological zones within Zambia.",
    "distribution_introduced_art_desc": "Acalypha dikuluwensis was mainly introduced to areas with tropical and subtropical climates, where it thrives in warm, humid conditions. It is commonly found in regions with well-drained soils and partial to full sunlight. This plant is often cultivated as an ornamental species due to its attractive foliage and unique appearance. It has been introduced to several parts of the world, including the United States and Australia, for horticultural purposes. However, its spread outside its native range is limited due to specific environmental requirements."
}
