{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha obtusa",
    "plant_slug": "acalypha-obtusa",
    "plant_name_scientific": "acalypha obtusa",
    "intro": "Acalypha obtusa, commonly known as the velvetleaf or silky senna, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, velvety leaves that are often covered in fine hairs. The plant produces small, yellow flowers that are clustered in dense inflorescences. It thrives in moist, shady environments and is often found in rainforests or along stream banks. Acalypha obtusa is valued for its ornamental appeal and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha obtusa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing in forest understories or along stream banks. It is also present in parts of Australia and the Pacific Islands. Acalypha obtusa is well adapted to warm climates and is often used in ornamental horticulture due to its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha obtusa was mainly introduced to Hawaii, where it has become an invasive species. It was likely brought there through human activities, such as horticultural trade or accidental transport. The plant thrives in disturbed areas and can outcompete native vegetation. Its rapid growth and ability to spread through seeds make it a significant ecological threat. Efforts are ongoing to control its spread and protect local ecosystems."
}
