{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha guineensis",
    "plant_slug": "acalypha-guineensis",
    "plant_name_scientific": "acalypha guineensis",
    "intro": "Acalypha guineensis, commonly known as the African nettle, is a flowering plant native to tropical Africa. It is a shrub or small tree that can grow up to 4 meters in height, characterized by its opposite, ovate leaves with serrated edges. The plant produces small, greenish-white flowers arranged in clusters, which are followed by three-lobed, red or orange berries. Its leaves are often used in traditional medicine for their purported anti-inflammatory and antiseptic properties. The plant thrives in moist, well-drained soils and is often found in woodland and savanna habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha guineensis"
    },
    "taxonomy_art_desc": "Acalypha guineensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with varied leaf and flower structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contain milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha guineensis, a specific plant within the genus Acalypha native to tropical regions, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guinea",
        "Sierra Leone"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha guineensis is primarily native to Guinea and Sierra Leone. It is commonly found in the tropical rainforests and moist lowland areas of these regions. This plant thrives in humid climates with high rainfall. It is often seen growing along riverbanks and in shaded undergrowth. Its natural habitat is closely tied to the ecological conditions of West Africa.",
    "distribution_introduced_art_desc": "Acalypha guineensis was mainly introduced to new habitats through human activities such as horticulture and landscaping. It has been reported in several tropical and subtropical regions outside its native range. The plant is often cultivated for its ornamental value due to its attractive foliage. However, it can become invasive in some areas, outcompeting native vegetation. Its distribution is now expanding due to climate change and increased global trade."
}
