{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tiliifolia",
    "plant_slug": "acalypha-tiliifolia",
    "plant_name_scientific": "acalypha tiliifolia",
    "intro": "Acalypha tiliifolia, commonly known as the Indian nettle or tiliifolia spurflower, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that resemble flowers. The plant typically grows as an herbaceous perennial, often reaching heights of up to 1 meter. Its leaves are palmately lobed and covered in fine hairs, while the stems are often reddish in color. Acalypha tiliifolia is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tiliifolia is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments like forests and along riverbanks. This plant thrives in humid climates and is often associated with lowland and hillside habitats. It is also known to occur in parts of India and the Pacific Islands. Its distribution is largely confined to these geographic areas, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha tiliifolia was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various soil conditions. It is commonly found in tropical and subtropical regions where it is cultivated for its aesthetic value. The plant has been reported in several countries including the United States, Australia, and parts of Southeast Asia. Its rapid growth and ability to thrive in disturbed areas have led to its establishment in some non-native environments. However, it is generally not considered invasive and is often used as a decorative plant in gardens and public spaces."
}
