{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha centromalayca",
    "plant_slug": "acalypha-centromalayca",
    "plant_name_scientific": "acalypha centromalayca",
    "intro": "Acalypha centromalayca, commonly known as the Malayan beautyleaf, is a flowering plant native to Southeast Asia. It is characterized by its striking, colorful bracts that resemble petals, often displaying shades of red, orange, and yellow. The plant belongs to the Euphorbiaceae family, known for its diverse and often ornamental species. Its leaves are typically ovate with a smooth or slightly hairy surface, and it produces small, inconspicuous flowers in clusters. Acalypha centromalayca is often cultivated for its vibrant foliage and is used in ornamental gardening and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha centromalayca is primarily native to the Malay Peninsula, including parts of southern Thailand and peninsular Malaysia. It is commonly found in lowland rainforests and secondary growth areas. This species thrives in humid tropical climates with high rainfall. It is often seen growing along riverbanks and in disturbed soils. Its native distribution is restricted to this geographic region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha centromalayca was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly used in landscaping and as a houseplant because of its vibrant leaf colors and ease of care. This species has been cultivated in tropical and subtropical regions around the world, including parts of the United States, Australia, and Southeast Asia. Its introduction has led to its naturalization in some areas, where it can sometimes become invasive. However, it is generally considered a low-maintenance plant with minimal ecological impact in controlled environments."
}
