{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha muricata",
    "plant_slug": "acalypha-muricata",
    "plant_name_scientific": "acalypha muricata",
    "intro": "Acalypha muricata, commonly known as the roughleaf acalypha, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its hairy, rough-textured leaves and clusters of small, yellowish-green flowers. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are often used in traditional medicine for their purported healing properties. Acalypha muricata thrives in moist, well-drained soils and is often found in forest understories or along riverbanks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha muricata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant thrives in lowland forests and is sometimes seen near streams or in swampy areas. It is also present in parts of the Indian subcontinent, including India and Sri Lanka. Due to its adaptability, it can occasionally be found in cultivated areas or as an ornamental plant in some regions.",
    "distribution_introduced_art_desc": "Acalypha muricata was mainly introduced to tropical and subtropical regions as an ornamental plant due to its striking foliage. It is commonly found in gardens and landscapes in countries such as Australia, Hawaii, and parts of Southeast Asia. The plant thrives in warm climates with high humidity and well-drained soil. Its rapid growth and ability to spread through both seeds and vegetative propagation have led to its establishment in some native ecosystems. However, it is not considered invasive in most areas where it is cultivated."
}
