{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha delgadoana",
    "plant_slug": "acalypha-delgadoana",
    "plant_name_scientific": "acalypha delgadoana",
    "intro": "Acalypha delgadoana, commonly known as the Delgado's spurflower, is a flowering plant native to the tropical regions of South America. It belongs to the Euphorbiaceae family, which is known for its diverse and often ornamental species. The plant is characterized by its distinctive, spiky inflorescences that are surrounded by colorful bracts, which are often mistaken for petals. Its leaves are typically alternate, simple, and have a smooth or slightly hairy surface. Acalypha delgadoana is often cultivated for its ornamental value in gardens and greenhouses due to its striking foliage and unique floral structures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha delgadoana"
    },
    "taxonomy_art_desc": "Acalypha delgadoana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species with varied ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false nutsedge,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha delgadoana, a specific plant within the genus Acalypha, known for its unique morphological traits and native to specific geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha delgadoana is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in dry, rocky habitats. It is commonly observed in states such as Chihuahua and Durango. Its distribution is limited to specific ecological zones within the southwestern part of Mexico.",
    "distribution_introduced_art_desc": "Acalypha delgadoana was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first recorded in the early 20th century and has since become established in certain regions of the country. The plant is considered a potential weed due to its ability to spread through seeds and vegetative growth. It is commonly found in disturbed areas such as roadsides and forest margins. Despite its ornamental value, its invasive potential has raised concerns among land managers and conservationists."
}
