{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha oxyodonta",
    "plant_slug": "acalypha-oxyodonta",
    "plant_name_scientific": "acalypha oxyodonta",
    "intro": "Acalypha oxyodonta, commonly known as the velvetleaf or redroot, is a herbaceous plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its striking, palmate leaves that are often covered in a fine, velvety texture. The plant produces small, clustered flowers that range in color from white to pink, typically blooming in the summer months. Acalypha oxyodonta is often found in moist, shaded environments such as forests and wetlands. It is sometimes cultivated as an ornamental plant due to its attractive foliage and unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha oxyodonta is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in moist, shaded environments within rainforests and along riverbanks. This plant is commonly found in the coastal and inland areas of East Africa. It is also present in parts of the Middle East and southern Asia, though its primary range remains in Africa. Acalypha oxyodonta is often used in traditional medicine and as a source of fiber in its native habitats.",
    "distribution_introduced_art_desc": "Acalypha oxyodonta was mainly introduced to Hawaii, where it has become an invasive species. It was originally from Southeast Asia and was likely introduced through human activity, such as accidental transport on ships or intentional planting for ornamental purposes. The plant thrives in disturbed areas and can outcompete native vegetation, leading to ecological concerns. It is commonly found in coastal and lowland habitats, often along roadsides and in urban environments. Due to its rapid growth and ability to spread easily, it poses a significant challenge for land managers in controlling its spread."
}
