{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata var. urophylloides",
    "plant_slug": "acalypha-reticulata-var-urophylloides",
    "plant_name_scientific": "acalypha reticulata var. urophylloides",
    "intro": "Acalypha reticulata var. urophylloides, commonly known as the red-veined nettle or red-veined copperleaf, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, red-veined leaves that are often variegated with white or cream markings. The plant produces small, clustered greenish-white flowers that are typically borne in inflorescences. It thrives in moist, shaded environments and is often found in forest understories. Its ornamental value makes it a popular choice for indoor and outdoor gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata var. urophylloides is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. It thrives in humid environments and is often associated with secondary forests and disturbed habitats. The plant is known for its striking foliage and is sometimes cultivated for ornamental purposes. Its distribution is closely linked to the climatic conditions of the region, making it a characteristic species of the area's flora.",
    "distribution_introduced_art_desc": "Acalypha reticulata var. urophylloides was mainly introduced to tropical and subtropical regions for its ornamental value due to its striking foliage. It is commonly cultivated in gardens and as a houseplant because of its vibrant, variegated leaves. The plant thrives in warm, humid climates and requires well-draining soil to prevent root rot. It is often used in landscape design to add visual interest to shaded or partially sunny areas. However, it is important to note that it may become invasive in certain environments if not properly managed."
}
