{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chuniana",
    "plant_slug": "acalypha-chuniana",
    "plant_name_scientific": "acalypha chuniana",
    "intro": "Acalypha chuniana, commonly known as the Chinese copperleaf, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its striking, copper-colored leaves that change with the seasons. It produces small, inconspicuous flowers clustered in cyathia, typical of the Euphorbiaceae family. Acalypha chuniana is often cultivated for its ornamental value and is relatively easy to grow in well-drained soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha chuniana"
    },
    "taxonomy_art_desc": "Acalypha chuniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with diverse morphological features and a wide range of habitats. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as cotton and coffee. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"spurge,\" often found in tropical and subtropical regions. Its species is Acalypha chuniana, a specific type of plant within the genus Acalypha, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Hainan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chuniana is primarily native to Hainan. It is found in the tropical regions of this island province in China. The plant thrives in humid, warm climates typical of Hainan's ecosystem. It is commonly found in moist forests and along riverbanks. Its native distribution is largely restricted to this specific geographic area.",
    "distribution_introduced_art_desc": "Acalypha chuniana was mainly introduced to coastal and wetland areas where it thrives in moist, well-drained soils. It is commonly found in regions with tropical and subtropical climates, particularly in parts of Southeast Asia and the Pacific Islands. This plant is often used in ornamental horticulture due to its attractive foliage and adaptability to various environmental conditions. However, it has also been reported as an invasive species in some regions, outcompeting native vegetation. Its distribution is largely influenced by human activities such as landscaping and accidental seed dispersal."
}
