{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha huillensis",
    "plant_slug": "acalypha-huillensis",
    "plant_name_scientific": "acalypha huillensis",
    "intro": "Acalypha huillensis, commonly known as the Huillén's spurge, is a flowering plant native to the Andean regions of South America. It is part of the Euphorbiaceae family, which includes many species with milky sap. The plant typically grows in rocky or mountainous habitats, thriving at high altitudes. Its leaves are usually alternate and have a distinctive, often hairy texture. The flowers are small and inconspicuous, with the showy bracts serving as the primary ornamental feature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha huillensis"
    },
    "taxonomy_art_desc": "Acalypha huillensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and subtropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which is characterized by the presence of latex and often has unique floral structures. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" which are typically shrubs or herbs with showy flowers. Its species is Acalypha huillensis, a specific plant species within the genus Acalypha, native to certain regions and characterized by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha huillensis is primarily native to Angola. This species is found in the southern part of the country, particularly in the coastal and inland areas. It thrives in tropical and subtropical climates with well-drained soils. The plant is commonly found in disturbed habitats such as roadsides and open woodlands. It plays a role in local ecosystems and is adapted to the environmental conditions of Angola.",
    "distribution_introduced_art_desc": "Acalypha huillensis was mainly introduced to new habitats in South America, particularly in regions with tropical and subtropical climates. It has been observed in countries such as Peru, Ecuador, and Colombia, where it thrives in moist, shaded environments. This plant is often found in disturbed areas, including roadsides and forest edges, due to its adaptability. Its introduction has raised concerns about its potential impact on native ecosystems. Despite its ornamental value, further study is needed to assess its ecological effects."
}
