{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha prostrata",
    "plant_slug": "acalypha-prostrata",
    "plant_name_scientific": "acalypha prostrata",
    "intro": "Acalypha prostrata, commonly known as prostrate spindle tree, is a low-growing shrub native to Southeast Asia. It features small, ovate leaves with a distinctive reddish or purple hue on the underside. The plant produces tiny, greenish-white flowers arranged in clusters, which are followed by three-lobed, spiky seed capsules. It thrives in moist, shaded environments and is often found in tropical and subtropical regions. Its unique foliage makes it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha prostrata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is also found in parts of tropical regions in Africa, such as Kenya and Tanzania. This plant thrives in humid, tropical climates and is commonly found in lowland forests and along riverbanks. It prefers well-drained soil and partial to full sunlight. Acalypha prostrata is often used in traditional medicine and as a source of fiber in its native regions.",
    "distribution_introduced_art_desc": "Acalypha prostrata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in various conditions. It has since spread beyond cultivated areas and is now considered a potential weed in certain regions. The plant's rapid growth and adaptability have contributed to its establishment in natural habitats. It is often found in disturbed soils and along stream banks, where it can outcompete native vegetation. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
