{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha trachyloba",
    "plant_slug": "acalypha-trachyloba",
    "plant_name_scientific": "acalypha trachyloba",
    "intro": "Acalypha trachyloba, commonly known as the roughleaf ironplant, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, velvety foliage that ranges from green to reddish-purple, often with a rough or hairy texture. The plant produces small, inconspicuous flowers that are typically clustered in dense inflorescences. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha trachyloba is valued in horticulture for its ornamental leaves and ability to tolerate a variety of growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha trachyloba"
    },
    "taxonomy_art_desc": "Acalypha trachyloba belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their ancient lineage and unique morphological features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup plant,\" characterized by their hairy leaves and showy inflorescences. Its species is Acalypha trachyloba, a specific type within the genus known for its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha trachyloba is primarily native to Guatemala, Mexico Southeast, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid environments, often growing in lowland forests or along riverbanks. The species is well adapted to the warm and moist climate of its native range. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acalypha trachyloba was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed soils, along roadsides, and in agricultural areas. The plant spreads through its prolific seed production and can form dense stands. It is considered an invasive species in some regions due to its rapid growth and competitive nature. However, it also provides habitat and food for certain wildlife species."
}
