{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pauciflora",
    "plant_slug": "acalypha-pauciflora",
    "plant_name_scientific": "acalypha pauciflora",
    "intro": "Acalypha pauciflora, commonly known as the few-flowered spurflower, is a shrub native to tropical regions of Africa and Asia. It is characterized by its distinctive, spiny bracts that surround its small, inconspicuous flowers. The plant typically grows in moist, shaded environments such as forests and wetlands. Its leaves are usually ovate to elliptic in shape and have a smooth or slightly hairy surface. Acalypha pauciflora is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pauciflora is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in moist, well-drained soils and is often found in forests or near water bodies. It is also present in parts of the Indian subcontinent, including India and Sri Lanka. Acalypha pauciflora is typically a shrub or small tree, and it plays a role in the local ecosystems of its native range.",
    "distribution_introduced_art_desc": "Acalypha pauciflora was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste areas, and along riverbanks. It thrives in tropical and subtropical climates, preferring full sun to partial shade. The plant is known for its distinctive, often colorful bracts that attract pollinators like birds and insects. It has been reported in several regions of Southeast Asia, including Indonesia and the Philippines. Due to its rapid growth and ability to colonize new areas, it is considered a potential invasive species in some locations."
}
