{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha bakeriana",
    "plant_slug": "acalypha-bakeriana",
    "plant_name_scientific": "acalypha bakeriana",
    "intro": "Acalypha bakeriana, commonly known as the Baker's spurflower, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its striking, colorful bracts that resemble flowers, although they are actually modified leaves. Its small, inconspicuous true flowers are clustered in dense inflorescences, often surrounded by vibrant foliage. Acalypha bakeriana is valued for its ornamental appeal and is cultivated in gardens for its visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha bakeriana is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It thrives in humid, lowland areas with rich soil and high rainfall. This plant is commonly found in forest understories and along riverbanks. It is well adapted to the warm and moist climate of its native habitat. Due to its unique appearance and ornamental value, it is sometimes cultivated in botanical gardens and as a decorative plant.",
    "distribution_introduced_art_desc": "Acalypha bakeriana was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage. The plant has since spread beyond cultivated areas and is now found in various habitats across the islands. It is considered an invasive species in some regions because of its rapid growth and ability to outcompete native plants. Efforts are being made to control its spread to protect local ecosystems."
}
