{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha tomentosa",
    "plant_slug": "acalypha-tomentosa",
    "plant_name_scientific": "acalypha tomentosa",
    "intro": "Acalypha tomentosa, commonly known as velvetleaf or silky mallow, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, woolly foliage that gives it a distinctive appearance. The plant produces small, clustered flowers that range in color from green to red, depending on the variety. It thrives in moist, well-drained soils and is often found in woodland or shrubland habitats. Acalypha tomentosa is valued for its ornamental qualities and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha tomentosa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with forest understories or disturbed sites. It is also known to occur in parts of India and the Pacific Islands. Its native distribution reflects its adaptation to warm, humid environments with high rainfall.",
    "distribution_introduced_art_desc": "Acalypha tomentosa was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for cultivation. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, shaded environments and spreads rapidly through both seeds and vegetative growth. Its introduction highlights the ecological risks associated with non-native ornamental species."
}
