{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brasiliensis f. cordata",
    "plant_slug": "acalypha-brasiliensis-f-cordata",
    "plant_name_scientific": "acalypha brasiliensis f. cordata",
    "intro": "Acalypha brasiliensis f. cordata, commonly known as the heartleaf acalypha, is a shrub native to Brazil. It is characterized by its distinctive heart-shaped leaves, which are often variegated with white or cream markings. The plant produces small, greenish-white flowers arranged in clusters, which are followed by three-lobed, red or orange berries. It thrives in moist, well-drained soils and prefers partial to full shade. This ornamental plant is valued for its attractive foliage and is often used in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brasiliensis f. cordata is primarily native to Brazil, specifically the states of Pará, Maranhão, and Piauí in the northeastern region. This plant is commonly found in humid lowland forests and along riverbanks in these areas. It thrives in tropical climates with high rainfall and well-drained soils. The species is often associated with secondary growth and disturbed habitats. Its native distribution is limited to this specific geographic region within Brazil.",
    "distribution_introduced_art_desc": "Acalypha brasiliensis f. cordata was mainly introduced to ornamental horticulture and landscaping due to its striking foliage and adaptability to various environmental conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant is often used in gardens, public spaces, and as a decorative element in indoor settings. Its introduction has led to its naturalization in some areas, raising concerns about its potential invasive behavior. Despite its ornamental appeal, careful management is recommended to prevent unintended ecological impacts."
}
