{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha poiretii",
    "plant_slug": "acalypha-poiretii",
    "plant_name_scientific": "acalypha poiretii",
    "intro": "Acalypha poiretii, commonly known as the silky bush or silky hibiscus, is a flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its soft, silken leaves that are often covered in fine, silky hairs, giving it a distinctive appearance. The plant produces showy, trumpet-shaped flowers in shades of red, yellow, or orange, which bloom in clusters. It thrives in moist, well-drained soil and is often cultivated as an ornamental plant due to its aesthetic appeal. Acalypha poiretii is also valued for its ability to attract pollinators such as bees and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha poiretii"
    },
    "taxonomy_art_desc": "Acalypha poiretii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphologies. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy bracts. Its species is Acalypha poiretii, a specific plant within the genus Acalypha, known for its distinctive foliage and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Guatemala",
        "Honduras",
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Texas"
    ],
    "distribution_introduced": [
        "Alabama",
        "Aruba",
        "Cape Verde",
        "Dominican Republic",
        "French Guiana",
        "Ghana",
        "Guyana",
        "Haiti",
        "Leeward Is.",
        "Mauritius",
        "Netherlands Antilles",
        "Rodrigues",
        "Réunion",
        "Sierra Leone",
        "Suriname",
        "Venezuela",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Acalypha poiretii is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Brazil North, Brazil Northeast, Brazil South, Brazil Southeast, Brazil West-Central, Guatemala, Honduras, Mexico Central, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, and Texas. It is commonly found in tropical and subtropical regions across these areas. The plant thrives in moist, well-drained soils and is often found in open woodlands, savannas, and along riverbanks. It is known for its attractive foliage and is sometimes cultivated as an ornamental plant. Its distribution spans a wide geographic range in Central and South America, as well as parts of the southern United States.",
    "distribution_introduced_art_desc": "Acalypha poiretii was mainly introduced to Alabama, Aruba, Cape Verde, Dominican Republic, French Guiana, Ghana, Guyana, Haiti, Leeward Is., Mauritius, Netherlands Antilles, Rodrigues, Réunion, Sierra Leone, Suriname, Venezuela, and Windward Is. This plant is commonly found in tropical and subtropical regions, often thriving in disturbed or coastal environments. It has been reported as an invasive species in several of these locations, potentially outcompeting native vegetation. Its introduction is likely due to human activities such as trade, gardening, or accidental transport. Due to its adaptability, it has established populations in a variety of habitats across the listed regions."
}
