{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chamaedrifolia var. fissa",
    "plant_slug": "acalypha-chamaedrifolia-var-fissa",
    "plant_name_scientific": "acalypha chamaedrifolia var. fissa",
    "intro": "Acalypha chamaedrifolia var. fissa, commonly known as the narrow-leaf false nettle, is a flowering plant native to parts of Southeast Asia. It is a herbaceous perennial with slender, upright stems and opposite, lance-shaped leaves that are often covered in fine hairs. The plant produces small, greenish-white flowers arranged in clusters, which are typically borne in the axils of the leaves. It thrives in moist, shaded environments and is often found in forest understories. The leaves and stems are sometimes used in traditional medicine for their purported therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chamaedrifolia var. fissa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in lowland tropical rainforests and secondary growth areas. This variant thrives in humid, shaded environments with well-drained soil. It is often seen growing along stream banks and in forest understories. The plant is valued for its ornamental foliage and is sometimes cultivated in gardens in tropical regions.",
    "distribution_introduced_art_desc": "Acalypha chamaedrifolia var. fissa was mainly introduced to ornamental horticulture due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for use in landscaping and garden design. The plant's ability to thrive in both full sun and partial shade makes it a versatile choice for gardeners. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
