{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha leptorhachis",
    "plant_slug": "acalypha-leptorhachis",
    "plant_name_scientific": "acalypha leptorhachis",
    "intro": "Acalypha leptorhachis, commonly known as the velvetleaf or silky hibiscus, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its striking, colorful bracts that resemble petals, often displaying shades of red, orange, and yellow. The plant has palmate leaves with a velvety texture, which contribute to its ornamental appeal. It thrives in warm, humid climates and is often cultivated as a garden plant or for its medicinal properties. Acalypha leptorhachis is also valued for its ability to attract pollinators such as birds and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha leptorhachis"
    },
    "taxonomy_art_desc": "Acalypha leptorhachis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha leptorhachis, a specific type within the genus Acalypha, characterized by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba",
        "Windward Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha leptorhachis is primarily native to Cuba and the Windward Islands. This plant is commonly found in tropical and subtropical regions of these areas. It thrives in moist, well-drained soils and is often associated with coastal or lowland habitats. The species is known for its ornamental value and is sometimes cultivated for its attractive foliage. Its native range is limited to specific islands in the Caribbean, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha leptorhachis was mainly introduced to ornamental horticulture due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been spread through commercial trade and garden plantings, leading to its establishment in some non-native areas. However, it is not considered invasive in most regions where it is grown. Its distribution is primarily limited to cultivated environments rather than natural ecosystems."
}
