{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha nervulosa",
    "plant_slug": "acalypha-nervulosa",
    "plant_name_scientific": "acalypha nervulosa",
    "intro": "Acalypha nervulosa, commonly known as the silky mallow, is a flowering plant native to tropical and subtropical regions of the Americas. It is characterized by its soft, hairy leaves and showy, often pink or red bracts that surround its small flowers. The plant typically grows as an annual or perennial herb, reaching heights of up to 1 meter. Its flowers are usually clustered in inflorescences, and it thrives in moist, well-drained soils. Acalypha nervulosa is often cultivated for its ornamental value due to its attractive foliage and vibrant bracts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha nervulosa"
    },
    "taxonomy_art_desc": "Acalypha nervulosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive leaf and flower morphology. Its family is Euphorbiaceae, commonly known as the spurge family, which is characterized by the presence of milky sap and diverse growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup plants,\" often found in tropical and subtropical regions. Its species is Acalypha nervulosa, a specific type within the genus Acalypha, known for its unique leaf venation and often used in horticulture for its ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha nervulosa is primarily native to New Guinea. It is found in the diverse tropical rainforests of the island, where it thrives in humid and shaded environments. The plant is commonly observed in lowland and montane regions, often growing along stream banks and in forest understories. Its distribution is largely restricted to the eastern and western parts of New Guinea. Acalypha nervulosa plays an important ecological role in its native habitat, contributing to the biodiversity of the region.",
    "distribution_introduced_art_desc": "Acalypha nervulosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The plant has since become naturalized in several regions, particularly in the North Island. It thrives in moist, sunny environments and is commonly found along stream banks and in disturbed soils. However, it is considered a potential weed in some areas due to its rapid growth and ability to spread aggressively."
}
