{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hernandifolia",
    "plant_slug": "acalypha-hernandifolia",
    "plant_name_scientific": "acalypha hernandifolia",
    "intro": "Acalypha hernandifolia, commonly known as the Mexican flame flower, is a flowering plant native to Mexico and Central America. It is characterized by its striking, bright red bracts that resemble petals, which are actually modified leaves. The plant produces small, inconspicuous yellow flowers that are clustered in dense inflorescences. It thrives in warm, humid climates and is often cultivated for its ornamental value. Acalypha hernandifolia is also valued in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hernandifolia is primarily native to the southern United States, particularly in Florida and Texas. It is also found in parts of Central America, including Mexico and Guatemala. This plant thrives in moist, disturbed habitats such as wetlands, swamps, and along stream banks. It is commonly associated with coastal areas and is often found in sandy or muddy soils. Acalypha hernandifolia is an important component of the wetland ecosystems in its native range.",
    "distribution_introduced_art_desc": "Acalypha hernandifolia was mainly introduced to the Pacific Islands, Hawaii, and parts of the United States for ornamental purposes due to its attractive foliage. It has since become an invasive species in many of these regions, outcompeting native plants and altering local ecosystems. The plant thrives in disturbed areas, such as roadsides and coastal habitats, where it can spread rapidly. Its rapid growth and prolific seed production contribute to its invasive nature. Efforts to control its spread include manual removal, herbicides, and biological control methods."
}
