{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha scabrosa",
    "plant_slug": "acalypha-scabrosa",
    "plant_name_scientific": "acalypha scabrosa",
    "intro": "Acalypha scabrosa, commonly known as roughleaf ironwood, is a flowering plant native to the southwestern United States and northern Mexico. It is a shrub or small tree that typically grows in arid and semi-arid environments. The plant has rough, scaly bark and produces small, greenish-yellow flowers that bloom in clusters. Its leaves are alternate, ovate, and have a distinctive textured surface. Acalypha scabrosa is adapted to withstand drought and is often found in rocky soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha scabrosa"
    },
    "taxonomy_art_desc": "Acalypha scabrosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes species with a wide range of habitats and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha scabrosa, a specific type within the genus Acalypha, distinguished by its unique morphological features and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Jamaica"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha scabrosa is primarily native to Jamaica. It is commonly found in the island's moist lowland areas and along stream banks. This plant thrives in tropical and subtropical climates, often growing in shaded undergrowth. It is known for its distinctive foliage and is sometimes used in traditional medicine. Its distribution is largely restricted to Jamaica, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha scabrosa was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive foliage. However, it has since spread rapidly and is now considered a noxious weed. The plant thrives in disturbed areas and can outcompete native vegetation. Its introduction has led to ecological concerns and management efforts to control its spread."
}
