{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fasciculata var. humbertiana",
    "plant_slug": "acalypha-fasciculata-var-humbertiana",
    "plant_name_scientific": "acalypha fasciculata var. humbertiana",
    "intro": "Acalypha fasciculata var. humbertiana, commonly known as the Humbert's ironweed, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, feather-like leaves that are often bright green with a reddish or purple tinge. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Due to its ornamental value, it is sometimes cultivated in gardens, though it can be invasive in certain environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fasciculata var. humbertiana is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This plant thrives in humid, lowland areas with rich, well-drained soils. It is commonly found in secondary forests, along stream banks, and in disturbed habitats. The species is also present in parts of New Guinea and the western Pacific islands. Its distribution is largely restricted to these specific geographic regions within the Indo-Malay biodiverse hotspot.",
    "distribution_introduced_art_desc": "Acalypha fasciculata var. humbertiana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The introduction occurred in the early 20th century, primarily through horticultural trade. It has since become naturalized in certain regions, particularly in coastal and riverine areas. However, it is not considered invasive and poses minimal ecological risk in its introduced range."
}
