{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha carrascoana",
    "plant_slug": "acalypha-carrascoana",
    "plant_name_scientific": "acalypha carrascoana",
    "intro": "Acalypha carrascoana, commonly known as the red-flowered false hibiscus, is a flowering plant native to tropical regions of South America. It belongs to the Euphorbiaceae family and is characterized by its striking red bracts that surround small yellow flowers. The plant typically grows as an upright shrub, reaching heights of up to 2 meters. Its leaves are ovate to lanceolate in shape and often have a hairy texture. Acalypha carrascoana is valued for its ornamental appeal and is cultivated in gardens for its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha carrascoana"
    },
    "taxonomy_art_desc": "Acalypha carrascoana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with various growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy leaves. Its species is Acalypha carrascoana, a specific plant within the genus Acalypha, characterized by its unique morphological features and native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela",
        "Venezuelan Antilles"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha carrascoana is primarily native to Colombia, Venezuela, and the Venezuelan Antilles. This plant is found in the tropical regions of these countries. It typically grows in moist, shaded environments within forests. The species is part of the Euphorbiaceae family. Its native distribution is limited to these specific geographic areas in South America.",
    "distribution_introduced_art_desc": "Acalypha carrascoana was mainly introduced to the Pacific Islands, particularly in areas with disturbed soils and coastal environments. It is commonly found in Hawaii, where it has become an invasive species in certain regions. The plant thrives in sunny, well-drained conditions and can quickly spread through seed dispersal by wind and water. Its rapid growth and adaptability have led to its establishment in both natural and urban landscapes. However, it is considered a potential threat to native plant communities in some areas."
}
