{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrostachya var. puberula",
    "plant_slug": "acalypha-macrostachya-var-puberula",
    "plant_name_scientific": "acalypha macrostachya var. puberula",
    "intro": "Acalypha macrostachya var. puberula, commonly known as the velvetleaf or velvetleaf hibiscus, is a flowering plant native to tropical regions of the Americas. It is characterized by its large, heart-shaped leaves that are covered in fine, soft hairs, giving them a velvety texture. The plant produces showy, bract-like leaves that often resemble flowers, which can be red, yellow, or orange in color. It thrives in moist, well-drained soils and is often found in shaded to partially sunny environments. This species is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrostachya var. puberula is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. This plant thrives in humid, lowland environments and is commonly found in forest understories and along stream banks. It is also present in parts of northern Australia and the Pacific Islands. The species is often associated with disturbed or secondary growth habitats due to its adaptability. Its distribution is largely limited to areas with warm, moist climates and well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha macrostachya var. puberula was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this plant has been largely confined to cultivation and garden settings. It has not established itself in the wild, remaining primarily within human-modified environments. Its introduction has not resulted in significant ecological impacts to native ecosystems."
}
