{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mentiens",
    "plant_slug": "acalypha-mentiens",
    "plant_name_scientific": "acalypha mentiens",
    "intro": "Acalypha mentiens, commonly known as the velvetleaf or red-rooted iron plant, is a shrub native to tropical and subtropical regions. It is characterized by its palmate leaves, which are often covered in a fine, velvety texture. The plant produces small, clustered flowers that are typically green or red in color. Its roots are thick and fibrous, allowing it to thrive in moist, well-drained soils. Acalypha mentiens is often used in ornamental gardening due to its attractive foliage and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mentiens is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in wetlands, swamps, and along riverbanks, where it can access abundant water and nutrients. It is often part of the vegetation in mangrove ecosystems and coastal areas. Its native distribution is closely linked to the warm, moist climates of these regions.",
    "distribution_introduced_art_desc": "Acalypha mentiens was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage. It is commonly found in parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in moist, well-drained soils and partial to full sunlight. It has been reported to naturalize in some areas, posing a potential risk to native ecosystems. Its rapid growth and adaptability have contributed to its widespread distribution in introduced habitats."
}
