{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha paxiana",
    "plant_slug": "acalypha-paxiana",
    "plant_name_scientific": "acalypha paxiana",
    "intro": "Acalypha paxiana, commonly known as the velvetleaf or silverleaf acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, colorful bracts that resemble petals, which are often mistaken for flowers. The plant has heart-shaped leaves with a velvety texture and a distinctive silver or gray-green coloration. It thrives in warm, humid climates and is often found in moist, shaded environments. Acalypha paxiana is valued for its ornamental appeal and is commonly cultivated in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha paxiana is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, tropical climates and is commonly found in lowland areas with rich soil. This plant is often associated with disturbed habitats such as roadsides, forest edges, and agricultural fields. It plays a role in local ecosystems by providing food and shelter for various wildlife species. Due to its adaptability, it has also been introduced to other tropical regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha paxiana was mainly introduced to the Pacific Islands, particularly in regions such as Hawaii, Guam, and the Marshall Islands. It was likely introduced through human activity, possibly as an ornamental plant due to its attractive foliage. The plant has since become naturalized in these areas, often growing in disturbed soils and coastal environments. Its spread has raised concerns due to its potential to outcompete native species in certain ecosystems. Despite its invasive tendencies in some regions, it is also valued for its ecological and ornamental benefits."
}
