{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha capensis f. grandidentata",
    "plant_slug": "acalypha-capensis-f-grandidentata",
    "plant_name_scientific": "acalypha capensis f. grandidentata",
    "intro": "Acalypha capensis f. grandidentata, commonly known as the Cape spurge or white-veined spurge, is a flowering plant native to South Africa. It belongs to the Euphorbiaceae family, characterized by its unique floral structures called cyathia. The plant features striking, palmate leaves with large, lobed margins that give it a distinctive appearance. It produces small, yellowish-green flowers arranged in clusters, which are often surrounded by modified leaves called bracts. This ornamental plant is often cultivated for its attractive foliage and is adapted to thrive in well-drained soils and full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha capensis f. grandidentata is primarily native to South Africa, specifically the eastern and southern regions. It is commonly found in the coastal areas and lowland regions of the country. This plant thrives in moist, well-drained soils and is often seen in coastal vegetation and shrublands. It is a variant of Acalypha capensis, which is known for its distinctive foliage and adaptability to coastal conditions. The subspecies f. grandidentata is characterized by its larger, more prominent leaf teeth compared to the typical form.",
    "distribution_introduced_art_desc": "Acalypha capensis f. grandidentata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The introduction occurred in the late 19th century, primarily through horticultural trade. It has since become naturalized in certain regions, particularly in the North Island. However, it is not considered invasive and poses minimal ecological risk in its introduced range."
}
