{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha boehmerioides",
    "plant_slug": "acalypha-boehmerioides",
    "plant_name_scientific": "acalypha boehmerioides",
    "intro": "Acalypha boehmerioides, commonly known as the silverleaf copperleaf, is a tropical shrub native to Southeast Asia. It is characterized by its striking silver-green leaves with prominent veins, which give it a distinctive appearance. The plant produces small, inconspicuous greenish-white flowers that are followed by red, fleshy berries. It thrives in moist, well-drained soils and is often cultivated as an ornamental plant. Acalypha boehmerioides is also valued for its ability to attract birds and its use in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha boehmerioides is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often seen in forest understories or near water bodies. It is also present in parts of Oceania, including Papua New Guinea and the Solomon Islands. Due to its adaptability, it can sometimes be found in cultivated gardens in warmer climates outside its native range.",
    "distribution_introduced_art_desc": "Acalypha boehmerioides was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various environmental conditions. It is commonly found in tropical and subtropical regions where it is cultivated for its aesthetic value. The plant has been reported in several countries, including the United States, Australia, and parts of Southeast Asia. Despite its ornamental appeal, it has raised concerns due to its potential to become invasive in certain ecosystems. Its spread is often associated with human activities such as gardening and landscape design."
}
