{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ovata",
    "plant_slug": "acalypha-ovata",
    "plant_name_scientific": "acalypha ovata",
    "intro": "Acalypha ovata, commonly known as the velvetleaf or redleaf, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its striking, colorful bracts that resemble leaves, often displaying shades of red, pink, or purple. The plant has palmate leaves with lobed edges, and its small, inconspicuous flowers are borne in clusters. It thrives in moist, sunny environments and is often found in disturbed soils or along roadsides. Acalypha ovata is valued for its ornamental appeal and has been introduced to various parts of the world as a garden plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ovata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is also found in parts of the Pacific Islands, including Hawaii and the Philippines. This plant thrives in tropical and subtropical climates, often growing in coastal areas or near freshwater habitats. It is commonly seen in moist, well-drained soils and can be found in both natural and cultivated environments. Its native range extends to some regions of northern Australia as well.",
    "distribution_introduced_art_desc": "Acalypha ovata was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive foliage. However, it has since spread aggressively, outcompeting native plants and altering local ecosystems. The plant thrives in disturbed areas and can be found in forests, coastal regions, and wetlands. Efforts are ongoing to control its spread and mitigate its impact on native biodiversity."
}
