{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cupricola",
    "plant_slug": "acalypha-cupricola",
    "plant_name_scientific": "acalypha cupricola",
    "intro": "Acalypha cupricola, commonly known as copperleaf, is a flowering plant species native to tropical regions of Africa. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its striking copper-colored leaves, which give it its common name. It produces small, inconspicuous flowers that are often clustered in inflorescences. Acalypha cupricola is often cultivated as an ornamental plant due to its vibrant foliage and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cupricola"
    },
    "taxonomy_art_desc": "Acalypha cupricola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and subtropical regions. Its order is Malpighiales, a diverse group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"cupids\" or \"velvetleaf,\" characterized by their often showy inflorescences and hairy foliage. Its species is Acalypha cupricola, a specific plant within the genus Acalypha, known for its unique characteristics and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "DR Congo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cupricola is primarily native to DR Congo. It is found in the tropical rainforests of the country, particularly in the western and central regions. This plant thrives in humid, shaded environments with rich, well-drained soil. It is commonly observed in lowland and montane forest areas. Its distribution is limited to specific ecological niches within DR Congo.",
    "distribution_introduced_art_desc": "Acalypha cupricola was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. Despite its aesthetic appeal, it has since become an invasive species in certain regions of the country. The plant spreads rapidly through seeds and can outcompete native vegetation. Its introduction highlights the risks associated with non-native plants in ecological systems."
}
