{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha scabrosa var. genuina",
    "plant_slug": "acalypha-scabrosa-var-genuina",
    "plant_name_scientific": "acalypha scabrosa var. genuina",
    "intro": "Acalypha scabrosa var. genuina, commonly known as the roughleaf ironweed, is a perennial herb native to the southeastern United States. It features upright, branched stems that are hairy and often reddish in color. The plant produces clusters of small, greenish-white flowers that are surrounded by bracts, which are often more showy than the actual blooms. Its leaves are typically ovate to lance-shaped, with a rough, textured surface that gives the plant its common name. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha scabrosa var. genuina is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. It thrives in open woodlands, forest edges, and disturbed soils where it can receive adequate sunlight. The plant is well adapted to warm, moist environments and is often seen growing near streams or in secondary forests. Its native range reflects its preference for regions with high rainfall and seasonal temperature variations.",
    "distribution_introduced_art_desc": "Acalypha scabrosa var. genuina was mainly introduced to New Zealand. It was introduced as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain regions of the country. It is commonly found in coastal and disturbed areas where it can thrive in a variety of soil conditions. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
