{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha crenulata",
    "plant_slug": "acalypha-crenulata",
    "plant_name_scientific": "acalypha crenulata",
    "intro": "Acalypha crenulata, commonly known as the velvetleaf or velvetleaf ironweed, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its palmate leaves, which are often covered in a fine, soft pubescence, giving the plant a velvety texture. The plant produces small, clustered flowers that are typically greenish-white or yellowish in color. It thrives in moist, shaded environments and is often found in forests or along stream banks. Acalypha crenulata is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha crenulata is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It thrives in tropical and subtropical regions, often found in lowland forests and along riverbanks. This plant is commonly associated with moist, shaded environments and is often seen in secondary growth areas. It is also found in parts of India and Indonesia, where it grows in similar ecological conditions. Acalypha crenulata is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha crenulata was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through accidental means, such as being transported in soil or on plant material. The plant thrives in moist, disturbed areas and has spread rapidly throughout the island's lowlands. Its rapid growth and ability to outcompete native vegetation have led to concerns about its ecological impact. Efforts are ongoing to control its spread and mitigate its effects on local ecosystems."
}
