{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha calyciformis",
    "plant_slug": "acalypha-calyciformis",
    "plant_name_scientific": "acalypha calyciformis",
    "intro": "Acalypha calyciformis, commonly known as the redleaf hibiscus, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, velvety red bracts that resemble leaves, which are actually modified flowers. The plant produces showy, five-petaled flowers that bloom in clusters, often in shades of yellow or orange. It thrives in warm, humid climates and is often cultivated for its ornamental value. Acalypha calyciformis is also valued in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha calyciformis is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing in dense forests or near water sources. It is also present in parts of northern Australia and the Pacific Islands. Its native range extends to some regions of New Guinea and the Indian subcontinent.",
    "distribution_introduced_art_desc": "Acalypha calyciformis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique growth habit. It was first recorded in the early 20th century and has since spread throughout various regions of the country. The plant thrives in moist, shady environments and is commonly found in forest margins and along stream banks. Although it is not considered invasive, it has become naturalized in some areas, raising concerns about its potential impact on native ecosystems. Its distribution is primarily limited to the North Island, with occasional sightings in the South Island."
}
