{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sericea var. sericea",
    "plant_slug": "acalypha-sericea-var-sericea",
    "plant_name_scientific": "acalypha sericea var. sericea",
    "intro": "Acalypha sericea var. sericea, commonly known as velvetleaf or silky ironweed, is a herbaceous annual plant native to tropical and subtropical regions. It features palmate leaves with a soft, velvety texture due to the dense covering of fine hairs. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, disturbed soils and is often found in wetlands or along stream banks. Its rapid growth and ability to spread through seeds make it an aggressive weed in many habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha sericea"
    },
    "taxonomy_art_desc": "Acalypha sericea var. sericea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive vascular structures and often spore-producing reproductive systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants that includes species with diverse leaf and flower structures, often found in tropical and subtropical regions. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha sericea, a specific type within the genus Acalypha, known for its silky, silver-haired leaves and is native to parts of Asia and Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sericea var. sericea is primarily native to the Galápagos. This variant of the species is found in the unique ecosystems of the Galápagos Islands, which are known for their endemic flora. It thrives in the volcanic soils and coastal habitats of the archipelago. The plant is adapted to the island's climate, which includes warm temperatures and variable rainfall. Due to its restricted range, it is considered a rare and important component of the Galápagos' native vegetation.",
    "distribution_introduced_art_desc": "Acalypha sericea var. sericea was mainly introduced to the United States, particularly in the southern regions. It is commonly found in disturbed areas such as roadsides, abandoned fields, and along stream banks. This plant thrives in moist to wet soils and is often considered an invasive species in some areas. Its rapid growth and ability to spread through seeds make it a challenging weed to control. It is also known for its showy, feather-like leaves that can add ornamental value to gardens."
}
