{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha moggii",
    "plant_slug": "acalypha-moggii",
    "plant_name_scientific": "acalypha moggii",
    "intro": "Acalypha moggii, commonly known as the red-flowered copperleaf, is a shrub native to tropical regions of Africa. It is characterized by its striking, vibrant red bracts that surround its small, inconspicuous flowers. The plant has opposite, ovate leaves that are typically green with a slightly rough texture. It thrives in humid, well-drained soils and is often found in disturbed areas or near water sources. Acalypha moggii is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha moggii is primarily native to the Indian subcontinent, particularly India and Sri Lanka. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant is typically associated with forest understories and is often seen in areas with high humidity. It is also occasionally found in parts of Southeast Asia, including regions of Bangladesh and Nepal. Due to its ornamental value, it has been introduced to other parts of the world in some horticultural settings.",
    "distribution_introduced_art_desc": "Acalypha moggii was mainly introduced to areas with warm, humid climates and well-drained soils, often found in disturbed habitats such as roadsides and abandoned fields. It thrives in tropical and subtropical regions, particularly in parts of Southeast Asia, the Pacific Islands, and northern Australia. The plant is known for its rapid growth and ability to spread through both seeds and vegetative reproduction. It has been reported as an invasive species in some regions due to its competitive nature and adaptability. Its distribution is largely influenced by human activity, including landscaping and accidental seed dispersal."
}
