{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neogranatensis",
    "plant_slug": "acalypha-neogranatensis",
    "plant_name_scientific": "acalypha neogranatensis",
    "intro": "Acalypha neogranatensis, commonly known as the Neogranatense Copperleaf, is a flowering plant native to Central and South America. It belongs to the Euphorbiaceae family and is characterized by its striking copper-colored leaves. The plant produces small, inconspicuous green flowers that are clustered in cyathia, typical of the Euphorbiaceae family. It thrives in tropical and subtropical climates, often found in moist, shaded environments. Acalypha neogranatensis is valued for its ornamental foliage and is sometimes cultivated as a decorative plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neogranatensis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with secondary forests and disturbed habitats. It is also present in parts of India and Sri Lanka, where it grows in similar environmental conditions. Its native range extends into some regions of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha neogranatensis was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It thrives in environments with moderate to high light exposure and is often found in disturbed habitats such as roadsides, clearings, and abandoned fields. This plant is commonly cultivated as an ornamental due to its attractive foliage and ability to tolerate various soil conditions. It has been reported in several countries in Southeast Asia, the Pacific Islands, and parts of the Americas. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
