{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gemina var. genuina",
    "plant_slug": "acalypha-gemina-var-genuina",
    "plant_name_scientific": "acalypha gemina var. genuina",
    "intro": "Acalypha gemina var. genuina, commonly known as the velvetleaf or false holly, is a species of flowering plant in the family Euphorbiaceae. It is characterized by its striking, palmately lobed leaves that are often covered in a fine, velvety texture. The plant produces small, inconspicuous yellowish-green flowers clustered in dense, spike-like inflorescences. It is native to tropical and subtropical regions of Africa, Asia, and the Pacific Islands. Due to its ornamental value, it is sometimes cultivated as a garden plant, though it can become invasive in certain environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gemina var. genuina is primarily native to the tropical regions of Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. It thrives in humid, warm climates and is commonly found in lowland areas with rich, well-drained soils. This variant is often associated with disturbed habitats such as forest edges, abandoned fields, and along roadsides. It is also known to grow in coastal areas and mangrove forests in some regions. Due to its adaptability, it has been introduced to other tropical and subtropical regions around the world.",
    "distribution_introduced_art_desc": "Acalypha gemina var. genuina was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking to diversify local plant collections. The plant has since become naturalized in some areas, spreading beyond cultivated gardens into native ecosystems. Its introduction has raised concerns among conservationists due to its potential to outcompete native flora. Despite its aesthetic value, its invasive tendencies have led to efforts to control its spread in certain regions."
}
