{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cuspidata",
    "plant_slug": "acalypha-cuspidata",
    "plant_name_scientific": "acalypha cuspidata",
    "intro": "Acalypha cuspidata, commonly known as the spikeless copperleaf, is a flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its vibrant, copper-colored bracts that resemble leaves, giving it a striking visual appearance. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are ovate to lanceolate in shape, with a rough texture and a distinctive reddish or purple underside. Acalypha cuspidata is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cuspidata"
    },
    "taxonomy_art_desc": "Acalypha cuspidata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique leaf and flower adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide variety of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha cuspidata, a specific type of plant within the Acalypha genus, known for its distinctive leaf shape and flowering characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Aruba",
        "Colombia",
        "Cuba",
        "Dominican Republic",
        "Ecuador",
        "Haiti",
        "Honduras",
        "Jamaica",
        "Mexico Southwest",
        "Netherlands Antilles",
        "Peru",
        "Venezuela",
        "Venezuelan Antilles",
        "Windward Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cuspidata is primarily native to Aruba, Colombia, Cuba, Dominican Republic, Ecuador, Haiti, Honduras, Jamaica, Mexico Southwest, Netherlands Antilles, Peru, Venezuela, Venezuelan Antilles, and Windward Is. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in moist, well-drained soils and is often found in coastal or lowland habitats. Acalypha cuspidata is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its native range spans much of the Caribbean and northern South America.",
    "distribution_introduced_art_desc": "Acalypha cuspidata was mainly introduced to ornamental horticulture and landscaping due to its attractive, colorful foliage. It is commonly used in tropical and subtropical regions for its vibrant leaf colors and unique appearance. The plant has been cultivated in various parts of the world, including parts of Asia, the Pacific Islands, and the Americas. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impact in non-native environments."
}
