{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha laxiflora",
    "plant_slug": "acalypha-laxiflora",
    "plant_name_scientific": "acalypha laxiflora",
    "intro": "Acalypha laxiflora, commonly known as the silky mallow, is a flowering plant native to tropical regions of Asia and Africa. It is characterized by its soft, silky hairs that cover its stems and leaves, giving it a distinctive appearance. The plant produces small, clustered flowers that are typically pink or purple in color. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha laxiflora is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha laxiflora"
    },
    "taxonomy_art_desc": "Acalypha laxiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized floral and vegetative features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphologies and ecological adaptations. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha laxiflora, a specific plant within the genus Acalypha known for its distinctive foliage and ecological significance in its native habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha laxiflora is primarily native to Cuba, Mexico Central, Mexico Gulf, Mexico Northeast, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid environments, often growing in disturbed soils or along forest edges. The species is known for its attractive foliage and is sometimes cultivated for ornamental purposes. Its native range reflects its adaptation to the diverse ecosystems of these geographic regions.",
    "distribution_introduced_art_desc": "Acalypha laxiflora was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for cultivation. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in tropical and subtropical climates, often growing in disturbed soils and along coastal areas. Its rapid spread has led to increased management efforts to control its impact on natural habitats."
}
