{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha leptostachya var. genuina",
    "plant_slug": "acalypha-leptostachya-var-genuina",
    "plant_name_scientific": "acalypha leptostachya var. genuina",
    "intro": "Acalypha leptostachya var. genuina, commonly known as the velvetleaf or silkyleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, velvety leaves that range in color from green to reddish-brown. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Due to its ornamental value, it is cultivated in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha leptostachya var. genuina is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also known to grow along riverbanks and in swampy areas. Its native distribution includes parts of the Indian subcontinent as well.",
    "distribution_introduced_art_desc": "Acalypha leptostachya var. genuina was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred during the 19th century when European settlers began landscaping gardens with exotic species. Despite its aesthetic appeal, it has since become a weed in some areas, posing a threat to native ecosystems. Its rapid growth and adaptability have made it challenging to control in natural habitats."
}
