{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neptunica",
    "plant_slug": "acalypha-neptunica",
    "plant_name_scientific": "acalypha neptunica",
    "intro": "Acalypha neptunica, commonly known as the waterwheel plant, is a unique aquatic plant native to the wetlands of Southeast Asia. It is characterized by its whorled arrangement of leaves that resemble the spokes of a wheel, giving it its common name. The plant thrives in still or slow-moving freshwater environments, often found in marshes and ponds. Its leaves are typically dark green and have a waxy surface, which helps reduce water loss. Acalypha neptunica plays an important role in aquatic ecosystems by providing habitat and food for various aquatic organisms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha neptunica"
    },
    "taxonomy_art_desc": "Acalypha neptunica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their ancient lineage and unique features like jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species, often with distinctive floral and vegetative features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup plants,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha neptunica, a specific plant within the genus Acalypha, known for its unique morphological traits and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cameroon",
        "Central African Republic",
        "DR Congo",
        "Ethiopia",
        "Ghana",
        "Kenya",
        "Malawi",
        "Nigeria",
        "Rwanda",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neptunica is primarily native to Cameroon, Central African Republic, DR Congo, Ethiopia, Ghana, Kenya, Malawi, Nigeria, Rwanda, Sudan-South Sudan, Tanzania, and Uganda. This species is commonly found in tropical and subtropical regions across these countries. It thrives in moist, well-drained soils and is often found in forest understories or near water bodies. The plant is known for its striking foliage and is sometimes cultivated for ornamental purposes. Its native distribution reflects its adaptation to the diverse ecosystems of Central and East Africa.",
    "distribution_introduced_art_desc": "Acalypha neptunica was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first brought to the country in the early 20th century by horticultural enthusiasts who admired its vibrant green leaves and striking red bracts. Despite its aesthetic appeal, it has since become invasive in some regions, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, sunny environments and spreads rapidly through both seeds and vegetative propagation. Its introduction highlights the importance of monitoring non-native species to prevent ecological disruption."
}
