{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha seminuda",
    "plant_slug": "acalypha-seminuda",
    "plant_name_scientific": "acalypha seminuda",
    "intro": "Acalypha seminuda, commonly known as the silky filbert or velvetleaf, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its soft, velvety leaves that are often covered in fine hairs, giving it a distinctive texture. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences, which are often surrounded by bracts. Acalypha seminuda is a shrub or small tree that can grow up to 3 meters tall, with a spreading habit. It thrives in moist, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha seminuda is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like roadsides and forest edges. It is also known to grow in coastal areas and can be found in both natural and cultivated environments. Its native range extends to parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha seminuda was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. The plant has since become naturalized in some areas, spreading through seed dispersal by wind and water. It is now considered a weed in certain regions, competing with native vegetation. Its introduction highlights the ecological impacts of non-native species in island ecosystems."
}
