{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha callosa var. glabra",
    "plant_slug": "acalypha-callosa-var-glabra",
    "plant_name_scientific": "acalypha callosa var. glabra",
    "intro": "Acalypha callosa var. glabra, commonly known as smooth false nettle, is a herbaceous annual plant native to the southeastern United States. It features opposite, ovate to lanceolate leaves that are smooth and often covered in fine hairs. The plant produces small, greenish-white flowers arranged in dense, spike-like inflorescences. Its roots are fibrous, and it thrives in moist, disturbed soils. It is often found in wetlands, ditches, and along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha callosa var. glabra is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and Alabama. It thrives in moist, well-drained soils along stream banks, swamps, and other wetland habitats. This variety is known for its smooth, hairless leaves and is often found in disturbed or riparian areas. It is commonly associated with the coastal plain regions of the southeastern U.S. and is part of the Euphorbiaceae family. The plant plays an important ecological role in supporting local wildlife and maintaining wetland ecosystems.",
    "distribution_introduced_art_desc": "Acalypha callosa var. glabra was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist to wet habitats such as streambanks, swamps, and marshes. This plant is often associated with disturbed sites and can thrive in areas with high soil moisture. Its introduction has led to its establishment in both natural and cultivated environments. However, it is considered a non-native species in many regions where it has been introduced."
}
