{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha colorata",
    "plant_slug": "acalypha-colorata",
    "plant_name_scientific": "acalypha colorata",
    "intro": "Acalypha colorata, commonly known as the red-veined strobilanthes, is a flowering plant native to Southeast Asia. It is characterized by its striking, palmate leaves with bright red veins contrasting against its deep green foliage. The plant produces small, clustered flowers that are typically yellow or orange in color. It thrives in tropical climates and is often cultivated as an ornamental plant due to its vibrant appearance. Acalypha colorata prefers well-drained soil and partial to full sunlight for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha colorata is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with forest understories or disturbed sites. It is also present in parts of southern China and the Pacific Islands. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha colorata was mainly introduced to ornamental horticulture and landscaping due to its vibrant foliage and ornamental value. It is commonly cultivated in tropical and subtropical regions for its aesthetic appeal. The plant has been introduced to various parts of the world, including the United States, Australia, and parts of Southeast Asia. However, it is considered an invasive species in some areas where it can outcompete native vegetation. Proper management is necessary to prevent its spread in non-native environments."
}
