{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha humilis",
    "plant_slug": "acalypha-humilis",
    "plant_name_scientific": "acalypha humilis",
    "intro": "Acalypha humilis, commonly known as the velvetleaf or smallleaf spurge, is a low-growing herbaceous plant native to tropical and subtropical regions. It features opposite, ovate leaves with a soft, velvety texture, often covered in fine hairs. The plant produces small, yellowish-green flowers in clusters, which are followed by distinctive, bead-like seed capsules. It thrives in moist, well-drained soils and is often found in disturbed areas such as roadsides and wetlands. Acalypha humilis is noted for its adaptability and is sometimes considered an invasive species in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha humilis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in lowland and hill forest areas, often growing in moist, shaded environments. This plant thrives in tropical climates and is typically associated with secondary forests and disturbed habitats. It is also present in parts of India and Sri Lanka, where it is sometimes cultivated for ornamental purposes. Its distribution is closely linked to regions with high humidity and well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha humilis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in various habitats. The plant spreads rapidly through seed dispersal, often along roadsides and in disturbed areas. Its introduction has led to management efforts to control its spread and protect local ecosystems."
}
