{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha angustifolia var. glabrata",
    "plant_slug": "acalypha-angustifolia-var-glabrata",
    "plant_name_scientific": "acalypha angustifolia var. glabrata",
    "intro": "Acalypha angustifolia var. glabrata, commonly known as the smoothleaf ironweed, is a herbaceous plant characterized by its slender, lance-shaped leaves that are smooth and glabrous. It typically grows in moist, shaded environments, often found in woodlands and stream banks. The plant produces small, clustered flowers that are usually greenish-white in color, which bloom in the summer months. Its foliage is often used in ornamental gardening due to its attractive appearance and ease of cultivation. This variety is closely related to other species in the Euphorbiaceae family, sharing similar botanical traits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha angustifolia var. glabrata is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in lowland areas, often growing in moist, shaded environments such as forests and along riverbanks. This variant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. It thrives in humid climates with well-drained soil. Its natural range extends into parts of northern Australia as well.",
    "distribution_introduced_art_desc": "Acalypha angustifolia var. glabrata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, spreading rapidly in native ecosystems. The plant thrives in moist, disturbed soils and can outcompete native vegetation. Its introduction has raised concerns among conservationists due to its potential to disrupt local biodiversity."
}
