{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha nigritiana",
    "plant_slug": "acalypha-nigritiana",
    "plant_name_scientific": "acalypha nigritiana",
    "intro": "Acalypha nigritiana, commonly known as the black nightshade or blackleaf croton, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, often colorful foliage, which can range from deep green to reddish or purple hues. The plant produces small, inconspicuous flowers that are typically clustered in dense inflorescences. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Due to its ornamental value, it is cultivated in gardens and landscapes for its attractive leaves.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha nigritiana is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, Uganda, and the Democratic Republic of the Congo. It thrives in moist, shaded environments, often found in dense forests and along riverbanks. This plant is also present in parts of Madagascar and the island of Socotra. It is commonly found in lowland areas with high humidity and well-drained soils. Acalypha nigritiana is an important component of the understory vegetation in these ecosystems.",
    "distribution_introduced_art_desc": "Acalypha nigritiana was mainly introduced to ornamental horticulture due to its striking foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been introduced to several countries, including parts of the United States, Australia, and Southeast Asia. Its rapid growth and ability to thrive in disturbed soils have led to its naturalization in some areas. However, it is not considered invasive in most regions where it is cultivated."
}
