{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lignosa",
    "plant_slug": "acalypha-lignosa",
    "plant_name_scientific": "acalypha lignosa",
    "intro": "Acalypha lignosa, commonly known as the red-root or red-leaf spurges, is a shrub native to tropical regions of Africa and Asia. It is characterized by its dense, hairy foliage and clusters of small, yellow flowers that bloom in summer. The plant produces capsule fruits containing numerous tiny seeds, which are dispersed by wind. Its leaves are often used in traditional medicine for their purported anti-inflammatory properties. Acalypha lignosa is also valued in horticulture for its ornamental appeal and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lignosa"
    },
    "taxonomy_art_desc": "Acalypha lignosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide variety of forms and some with toxic properties. Its genus is Acalypha, which consists of flowering plants commonly known as \"velvetleaf\" or \"false holly,\" often found in tropical and subtropical regions. Its species is Acalypha lignosa, a specific type within the genus Acalypha, known for its woody structure and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lignosa is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in rocky soils and is often found in desert scrub habitats. It is adapted to the hot and dry climate of the region. Its native distribution is limited to specific areas within southern Mexico.",
    "distribution_introduced_art_desc": "Acalypha lignosa was mainly introduced to tropical and subtropical regions for its ornamental value and potential use in erosion control. It is commonly found in coastal areas and disturbed soils due to its adaptability to various environmental conditions. The plant thrives in full sun to partial shade and requires well-drained soil for optimal growth. It has been reported in several countries including Australia, the United States, and parts of Southeast Asia. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
