{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha heteromorpha",
    "plant_slug": "acalypha-heteromorpha",
    "plant_name_scientific": "acalypha heteromorpha",
    "intro": "Acalypha heteromorpha, commonly known as the velvetleaf or redleaf plant, is a herbaceous perennial native to tropical and subtropical regions. It features striking, colorful foliage with leaves that can range from deep red to green, often with contrasting veins. The plant produces small, inconspicuous flowers that are typically green or yellow, clustered in dense inflorescences. It thrives in moist, well-drained soils and prefers full sun to partial shade. Acalypha heteromorpha is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha heteromorpha is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in moist, shaded areas within forests. This plant thrives in humid climates and is often associated with riverine and swampy habitats. It is also present in parts of the Pacific Islands, such as the Philippines and Madagascar. Its native distribution includes a variety of lowland and montane forest environments.",
    "distribution_introduced_art_desc": "Acalypha heteromorpha was mainly introduced to urban and disturbed areas due to its rapid growth and adaptability. It thrives in environments with disturbed soil and full sun, making it common along roadsides and in vacant lots. This plant is considered an invasive species in some regions because of its ability to outcompete native vegetation. Its spread is often facilitated by its prolific seed production and ability to establish itself in degraded habitats. Despite its invasive tendencies, it is sometimes used in horticulture for its ornamental foliage."
}
