{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha muelleriana",
    "plant_slug": "acalypha-muelleriana",
    "plant_name_scientific": "acalypha muelleriana",
    "intro": "Acalypha muelleriana, commonly known as the silverleaf mallow, is a flowering plant native to Australia. It is characterized by its striking silver-gray foliage and showy, red-tipped bracts that resemble flowers. The plant belongs to the Malvaceae family and is often cultivated for its ornamental value. It thrives in well-drained soil and full sun, making it suitable for arid and coastal gardens. The leaves are covered in fine, silky hairs, contributing to its distinctive appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha muelleriana"
    },
    "taxonomy_art_desc": "Acalypha muelleriana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants that includes many species with unique floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some toxic properties. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy foliage. Its species is Acalypha muelleriana, a specific type of plant within the Acalypha genus, characterized by its unique morphology and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Costa Rica",
        "Nicaragua",
        "Panamá",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha muelleriana is primarily native to Colombia, Costa Rica, Nicaragua, Panamá, and Venezuela. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in humid, shaded environments, often in forest understories. The species is known for its ornamental value and is sometimes cultivated for its attractive foliage. Its natural range reflects its adaptation to the diverse ecosystems of Central and South America.",
    "distribution_introduced_art_desc": "Acalypha muelleriana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this species has been primarily confined to the North Island, where it has been cultivated in gardens and botanical collections. However, it has not established itself as a naturalized species in the wild. Its introduction has been limited and does not pose a significant threat to native ecosystems."
}
