{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chamaedrifolia",
    "plant_slug": "acalypha-chamaedrifolia",
    "plant_name_scientific": "acalypha chamaedrifolia",
    "intro": "Acalypha chamaedrifolia, commonly known as the creeping false nettle, is a low-growing shrub native to tropical and subtropical regions of Asia. It features small, oval-shaped leaves that are often covered in fine hairs, giving them a fuzzy appearance. The plant produces clusters of tiny, greenish-white flowers that are typically borne in dense inflorescences. Its botanical characteristics include opposite leaf arrangement and a fibrous root system. It is often found in moist, shaded environments such as forest floors or rocky crevices.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha chamaedrifolia"
    },
    "taxonomy_art_desc": "Acalypha chamaedrifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, which encompasses a diverse group of flowering plants with a wide range of morphological adaptations. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and hairy foliage. Its species is Acalypha chamaedrifolia, a specific type within the genus Acalypha, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bahamas",
        "Cayman Is.",
        "Cuba",
        "Dominican Republic",
        "Florida",
        "Haiti",
        "Jamaica",
        "Leeward Is.",
        "Puerto Rico",
        "Windward Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chamaedrifolia is primarily native to the Bahamas, Cayman Is., Cuba, Dominican Republic, Florida, Haiti, Jamaica, Leeward Is., Puerto Rico, and Windward Is. This species is commonly found in coastal and lowland areas across these regions. It thrives in sandy soils and is often associated with maritime environments. The plant is well adapted to the tropical and subtropical climates of its native range. It plays an important ecological role in stabilizing dune systems and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acalypha chamaedrifolia was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its decorative value. The plant has been reported in several countries, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. Its introduction has sometimes led to it becoming invasive in certain areas, outcompeting native vegetation. Proper management is recommended to prevent its spread in non-native environments."
}
