{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ferdinandi var. pubescens",
    "plant_slug": "acalypha-ferdinandi-var-pubescens",
    "plant_name_scientific": "acalypha ferdinandi var. pubescens",
    "intro": "Acalypha ferdinandi var. pubescens, commonly known as the velvetleaf or flameleaf hibiscus, is a shrub native to tropical regions of Africa. It is characterized by its striking, velvety leaves that range in color from deep red to bronze, often with a contrasting lighter margin. The plant produces showy, tubular flowers that are typically red or orange, attracting pollinators such as birds and bees. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Its ornamental value makes it a popular choice for gardens and landscapes in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ferdinandi var. pubescens is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with forest understories or disturbed habitats. It is known for its ornamental value due to its vibrant foliage and unique inflorescences. However, it is not widely distributed beyond its native range and is considered a less common species in the wild.",
    "distribution_introduced_art_desc": "Acalypha ferdinandi var. pubescens was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since spread beyond cultivated areas and is now found in various habitats across the country. It is considered a potential environmental weed due to its rapid growth and ability to establish in disturbed soils. Despite its ornamental value, its introduction has raised concerns about its impact on native ecosystems."
}
