{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha comonduana",
    "plant_slug": "acalypha-comonduana",
    "plant_name_scientific": "acalypha comonduana",
    "intro": "Acalypha comonduana, commonly known as the red-veined nettle, is a herbaceous plant native to South America. It belongs to the Euphorbiaceae family and is characterized by its striking, reddish veins on its heart-shaped leaves. The plant produces small, inconspicuous flowers that are clustered in a cup-like structure called a cyathium. Its leaves are often used in traditional medicine for their purported anti-inflammatory properties. Acalypha comonduana thrives in moist, shaded environments and is often found in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha comonduana"
    },
    "taxonomy_art_desc": "Acalypha comonduana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, which is a large group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants that includes species with a wide range of morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their unique leaf shapes and often vibrant flowers. Its species is Acalypha comonduana, a specific plant within the genus Acalypha, known for its distinctive foliage and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha comonduana is primarily native to Mexico Central and Mexico Northwest. This plant is found in regions that include the states of Hidalgo, San Luis Potosí, and Tamaulipas. It typically grows in dry to semi-arid environments, often in open woodlands or along rocky slopes. The species is adapted to the local climate and soil conditions of these areas. Its native distribution highlights its ecological significance in the biodiversity of northern Mexico.",
    "distribution_introduced_art_desc": "Acalypha comonduana was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since become naturalized in several regions, particularly in coastal and disturbed areas. The plant's rapid growth and ability to thrive in nutrient-poor soils have contributed to its spread beyond cultivated areas. However, it is not considered a major invasive species in New Zealand, though it is monitored for potential ecological impacts. Its distribution remains largely localized, with limited reports of widespread establishment."
}
