{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula var. parvula",
    "plant_slug": "acalypha-parvula-var-parvula",
    "plant_name_scientific": "acalypha parvula var. parvula",
    "intro": "Acalypha parvula var. parvula, commonly known as the smallleaf ironweed, is a herbaceous perennial native to the southeastern United States. It features slender, upright stems that are often tinged with red or purple, adding visual interest to its foliage. The plant produces small, inconspicuous greenish-white flowers arranged in dense, spike-like clusters. Its leaves are ovate to elliptic in shape, with finely serrated edges and a glossy surface. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha parvula"
    },
    "taxonomy_art_desc": "Acalypha parvula var. parvula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical and temperate species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"copperleaf,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha parvula, a specific type within the genus Acalypha, known for its small size and distinctive floral features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula var. parvula is primarily native to the Galápagos. This plant is found in the volcanic islands of the Galápagos archipelago. It thrives in the unique ecological conditions of this region. The species is adapted to the island's climate and soil composition. It plays an important role in the local ecosystem of the Galápagos.",
    "distribution_introduced_art_desc": "Acalypha parvula var. parvula was mainly introduced to the United States as an ornamental plant due to its attractive foliage and compact growth habit. It is commonly found in the southeastern region, particularly in Florida and along the Gulf Coast. The plant thrives in moist, well-drained soils and is often used in garden landscapes and as a ground cover. Despite its aesthetic appeal, it has shown invasive tendencies in some areas, leading to management efforts to control its spread. Its introduction has raised concerns about its impact on native plant communities and ecosystem balance."
}
