{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula f. diffusa",
    "plant_slug": "acalypha-parvula-f-diffusa",
    "plant_name_scientific": "acalypha parvula f. diffusa",
    "intro": "Acalypha parvula f. diffusa, commonly known as the velvetleaf or woolly leaf, is a flowering plant native to tropical regions of the Americas. It is characterized by its soft, velvety leaves that are often covered in fine hairs, giving it a distinctive texture. The plant produces small, greenish-yellow flowers that are clustered in spikes, typically appearing in the axils of the leaves. It thrives in warm, humid climates and is often found in disturbed soils or along stream banks. Due to its ornamental value, it is sometimes cultivated as a decorative plant in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula f. diffusa is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in lowland areas with high humidity and warm climates. This plant typically grows in disturbed habitats, such as roadsides, forest edges, and abandoned fields. It is well adapted to moist, well-drained soils and can thrive in partial to full sunlight. Its native distribution includes parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha parvula f. diffusa was mainly introduced to urban and disturbed areas due to its ability to thrive in poor soil conditions. It is commonly found along roadsides, construction sites, and abandoned lots where human activity has altered the natural landscape. This plant spreads rapidly through its prolific seed production and can form dense stands that outcompete native vegetation. Its introduction has led to concerns about its invasive potential in certain regions. However, it is also valued for its ornamental qualities and is sometimes cultivated in gardens."
}
