{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha angustifolia",
    "plant_slug": "acalypha-angustifolia",
    "plant_name_scientific": "acalypha angustifolia",
    "intro": "Acalypha angustifolia, commonly known as narrowleaf cudweed, is a herbaceous plant native to tropical and subtropical regions. It features slender, often hairy stems and alternate leaves that are typically narrow and lance-shaped. The plant produces small, clustered flowers that are usually greenish or reddish in color. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Acalypha angustifolia is known for its ability to spread through both seeds and rhizomes, making it a common weed in disturbed areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha angustifolia"
    },
    "taxonomy_art_desc": "Acalypha angustifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with varied morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often produces milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupid's bow,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha angustifolia, a specific plant within the genus Acalypha known for its narrow leaves and is native to certain regions in Asia and Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Dominican Republic",
        "Haiti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha angustifolia is primarily native to the Dominican Republic and Haiti. This plant is commonly found in tropical and subtropical regions of these countries. It thrives in moist, well-drained soils and is often seen in forest understories or along stream banks. The species is valued for its ornamental foliage and has been introduced to other parts of the world. Its native range is limited to the Caribbean islands of the Dominican Republic and Haiti.",
    "distribution_introduced_art_desc": "Acalypha angustifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since become naturalized in several regions, often found along stream banks and in disturbed areas. The plant's rapid growth and ability to spread through both seeds and rhizomes have contributed to its establishment in native ecosystems. However, its invasive potential remains a concern in some areas where it can outcompete native species. Despite its ornamental value, management efforts are sometimes required to control its spread in sensitive environments."
}
