{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha commersoniana var. discolor",
    "plant_slug": "acalypha-commersoniana-var-discolor",
    "plant_name_scientific": "acalypha commersoniana var. discolor",
    "intro": "Acalypha commersoniana var. discolor, commonly known as the variegated ironweed, is a strikingly ornamental plant native to South America. It is a herbaceous perennial that features strikingly colored leaves with variegation of white, yellow, and green. The plant produces small, greenish-white flowers arranged in dense, spike-like clusters. It thrives in full sun to partial shade and prefers well-drained soil. Its unique foliage makes it a popular choice for ornamental gardening and landscape design.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha commersoniana var. discolor is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments within forests or along riverbanks. This plant is well adapted to humid climates and thrives in areas with high rainfall and warm temperatures. It is often seen in lowland and hill forest ecosystems, where it contributes to the biodiversity of the understory vegetation. Its native range also extends to parts of the Pacific Islands, where it is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha commersoniana var. discolor was mainly introduced to ornamental horticulture due to its attractive, colorful foliage. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant is often used in landscaping and as a houseplant because of its unique leaf patterns. However, it has raised concerns in some areas due to its potential to become invasive. Its distribution has expanded beyond its native range, leading to increased monitoring in non-native environments."
}
