{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hicksii",
    "plant_slug": "acalypha-hicksii",
    "plant_name_scientific": "acalypha hicksii",
    "intro": "Acalypha hicksii, commonly known as the red-veined nettle, is a flowering plant native to the southeastern United States. It belongs to the Euphorbiaceae family, which is known for its diverse and often strikingly ornamental species. The plant is characterized by its heart-shaped leaves with distinctive red veins and clusters of small, greenish-yellow flowers. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Acalypha hicksii is valued for its aesthetic appeal and is sometimes cultivated in gardens for its ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hicksii is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetlands, marshes, and along the edges of ponds and swamps. This species thrives in moist, sandy soils and is often associated with coastal and inland wetland habitats. It is an important component of the local flora in these regions. The plant is also occasionally found in the Caribbean, particularly in the Bahamas.",
    "distribution_introduced_art_desc": "Acalypha hicksii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in full sun and well-drained soils, making it a common weed in disturbed environments. The plant is native to Central America but has been spread to other regions through human activity. Its rapid growth and ability to reproduce vegetatively contribute to its invasive potential in new locations. However, it is not considered highly invasive in all regions and is sometimes used in ornamental gardening."
}
