{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha albemarlensis",
    "plant_slug": "acalypha-albemarlensis",
    "plant_name_scientific": "acalypha albemarlensis",
    "intro": "Acalypha albemarlensis, commonly known as the white-leaved ironweed, is a flowering plant native to the tropical regions of Central America. It belongs to the Euphorbiaceae family and is characterized by its striking white to pale green leaves. The plant produces small, clustered yellowish-green flowers that are often surrounded by modified leaves called bracts. It thrives in moist, shaded environments and is often found in forest understories. Acalypha albemarlensis is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha albemarlensis is primarily native to the Caribbean, specifically the island of Hispaniola, which includes the countries of Haiti and the Dominican Republic. It is commonly found in moist, shaded understory habitats within tropical forests. This species thrives in areas with high humidity and well-drained soil. It is often associated with secondary growth and disturbed sites within its native range. Due to its limited distribution, it is considered a rare and endemic plant in the region.",
    "distribution_introduced_art_desc": "Acalypha albemarlensis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first recorded in the early 20th century and has since spread to other tropical regions. The plant thrives in moist, shaded environments and is often found in disturbed areas such as roadsides and abandoned lots. Its rapid growth and ability to reproduce through both seeds and vegetative means have contributed to its spread. However, it is considered an invasive species in some areas, outcompeting native vegetation and altering local ecosystems."
}
