{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hystrix",
    "plant_slug": "acalypha-hystrix",
    "plant_name_scientific": "acalypha hystrix",
    "intro": "Acalypha hystrix, commonly known as the spiked hollyhock, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its distinctive, spiny leaves and showy, pink to red bracts. The plant typically grows as an upright shrub, reaching heights of up to 2 meters. Its flowers are clustered in inflorescences, and it thrives in tropical and subtropical climates. Acalypha hystrix is often cultivated for its ornamental value and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hystrix is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in moist, well-drained soils and is often seen in forest understories or along stream banks. It is also present in parts of eastern India and the Andaman Islands. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha hystrix was mainly introduced to ornamental horticulture due to its striking foliage and unique appearance. It is commonly cultivated in tropical and subtropical regions for use in landscaping and garden design. The plant's ability to thrive in a variety of soil types and its relatively low maintenance requirements contribute to its popularity. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Proper management is essential to prevent its spread beyond cultivated areas."
}
