{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha amboynensis",
    "plant_slug": "acalypha-amboynensis",
    "plant_name_scientific": "acalypha amboynensis",
    "intro": "Acalypha amboynensis, commonly known as the red-veined nettle, is a flowering plant native to Southeast Asia. It is characterized by its striking, velvety leaves with deep red veins, which give it its common name. The plant produces small, greenish-yellow flowers arranged in clusters, typically blooming in the summer months. It thrives in moist, shaded environments and is often found in tropical forests. Acalypha amboynensis is valued both for its ornamental beauty and its traditional uses in local medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha amboynensis is primarily native to Indonesia, specifically the islands of Sumatra, Java, and Bali. It is also found in parts of Malaysia and the Philippines. This plant thrives in tropical and subtropical regions, often growing in moist, shaded areas within forests. It is commonly associated with lowland and hill forest ecosystems. Its natural range is limited to Southeast Asia, where it plays a role in local biodiversity.",
    "distribution_introduced_art_desc": "Acalypha amboynensis was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in gardens and landscapes in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with well-drained soil and full sun exposure. Its rapid growth and ability to spread through both seeds and vegetative means have led to its establishment in some non-native areas. However, it is generally considered a non-invasive species in most regions where it is cultivated."
}
