{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula var. flaccida",
    "plant_slug": "acalypha-parvula-var-flaccida",
    "plant_name_scientific": "acalypha parvula var. flaccida",
    "intro": "Acalypha parvula var. flaccida, commonly known as the hanging croton, is a flowering plant native to tropical regions of the Americas. It is characterized by its pendulous, hairy stems that bear clusters of small, showy flowers in shades of red, orange, and yellow. The leaves are typically ovate to lanceolate, with a smooth or slightly hairy surface. It thrives in humid, warm environments and is often cultivated as a decorative plant for its vibrant floral displays. This variety is noted for its compact growth habit and adaptability to indoor growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula var. flaccida is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing near streams or in dense vegetation. It is typically found in the understory of rainforests, where it benefits from the filtered light and nutrient-rich soil. Its native distribution is closely associated with humid tropical climates and is not commonly found outside of these regions.",
    "distribution_introduced_art_desc": "Acalypha parvula var. flaccida was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the early 20th century by horticultural enthusiasts and gardeners. The plant has since become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. It thrives in tropical and subtropical climates, often growing in disturbed habitats such as roadsides and abandoned fields. Despite its beauty, it is considered an invasive species in certain regions, outcompeting native vegetation."
}
