{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha urophylla",
    "plant_slug": "acalypha-urophylla",
    "plant_name_scientific": "acalypha urophylla",
    "intro": "Acalypha urophylla, commonly known as the red-leaf acalypha, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, velvety red leaves that are often variegated with green and yellow tones. The plant produces small, clustered flowers that are typically green or yellow in color. It is often grown as an ornamental plant due to its vibrant foliage. Acalypha urophylla prefers well-drained soil and partial to full sunlight.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha urophylla"
    },
    "taxonomy_art_desc": "Acalypha urophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, which is a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large group of flowering plants known for their diverse habitats and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, which consists of flowering plants typically characterized by showy inflorescences and often hairy foliage. Its species is Acalypha urophylla, a specific plant within the genus Acalypha known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha urophylla is primarily native to Madagascar. It is found in the eastern part of the island, particularly in humid lowland and montane rainforests. This species thrives in moist, shaded environments and is often associated with secondary growth areas. It is an important component of the local flora and is adapted to the unique ecological conditions of Madagascar. Due to its restricted range, it is considered a rare and endemic plant species.",
    "distribution_introduced_art_desc": "Acalypha urophylla was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first recorded in Hawaii in the early 20th century and has since spread to other tropical regions. The plant thrives in warm, humid climates and is often found in disturbed areas such as roadsides and abandoned fields. Its rapid growth and ability to reproduce vegetatively have contributed to its spread. However, it is considered a potential weed in some areas, raising concerns about its ecological impact."
}
