{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha zollingeri",
    "plant_slug": "acalypha-zollingeri",
    "plant_name_scientific": "acalypha zollingeri",
    "intro": "Acalypha zollingeri, commonly known as the velvetleaf or red hot catwhiskers, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, colorful bracts that resemble cat whiskers, which are often more showy than the small, inconspicuous flowers. The plant typically grows as an annual or perennial herb, reaching heights of up to 2 meters. Its leaves are usually ovate to lanceolate, with a smooth or slightly hairy surface. Acalypha zollingeri thrives in warm, humid climates and is often found in disturbed soils or along roadsides.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha zollingeri"
    },
    "taxonomy_art_desc": "Acalypha zollingeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their floral structures. Its order is Malpighiales, a large order of flowering plants that includes species with diverse morphologies, such as the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms, from shrubs to trees. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha zollingeri, a specific type within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lesser Sunda Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha zollingeri is primarily native to the Lesser Sunda Islands. This plant is found in the Indonesian archipelago, specifically in regions such as Bali, Lombok, Sumbawa, and Flores. It thrives in tropical and subtropical climates, often growing in moist, shaded environments. The species is commonly associated with secondary forests and disturbed habitats. Its distribution is limited to these specific islands, reflecting its ecological preferences and geographic isolation.",
    "distribution_introduced_art_desc": "Acalypha zollingeri was mainly introduced to the United States as an ornamental plant due to its attractive foliage and unique appearance. It has been cultivated in gardens and landscapes, particularly in regions with warm climates. However, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its spread has been documented in several southern states, raising concerns among environmentalists and land managers. Efforts are being made to control its distribution and prevent further ecological damage."
}
