{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha diversifolia var. popayanensis",
    "plant_slug": "acalypha-diversifolia-var-popayanensis",
    "plant_name_scientific": "acalypha diversifolia var. popayanensis",
    "intro": "Acalypha diversifolia var. popayanensis, commonly known as the Popayan spurflower, is a flowering plant native to South America, particularly Colombia. It is characterized by its striking, palmate leaves that are often brightly colored, ranging from green to red or purple. The plant produces small, clustered flowers that are typically green or yellow, which bloom during the wet season. It thrives in humid, tropical environments and is often found in forest understories or along stream banks. Due to its ornamental value, it is sometimes cultivated in gardens, though it can be challenging to grow outside its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha diversifolia var. popayanensis is primarily native to the Andean region of South America, specifically in parts of Colombia and Ecuador. It is commonly found in the tropical Andes, where it thrives in humid, mountainous environments. This variant is often associated with cloud forests and areas with high rainfall. It is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. However, its natural range is limited to specific elevations and microclimates within these regions.",
    "distribution_introduced_art_desc": "Acalypha diversifolia var. popayanensis was mainly introduced to regions with warm, humid climates and well-drained soils, typically found in tropical and subtropical areas. It is commonly cultivated as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. This variety is often found in gardens, greenhouses, and as part of landscape designs in regions where it can thrive year-round. Its introduction has been largely driven by its aesthetic value and ease of cultivation. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
