{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha abingdonii",
    "plant_slug": "acalypha-abingdonii",
    "plant_name_scientific": "acalypha abingdonii",
    "intro": "Acalypha abingdonii, commonly known as the Abingdon hollyhock, is a flowering plant native to the southeastern United States. It is a herbaceous perennial that typically grows to a height of 2 to 4 feet, featuring upright stems covered in soft, hairy foliage. The plant produces showy, clustered flowers in shades of red, pink, and white, which bloom in late summer to early fall. Its leaves are ovate to lance-shaped, often with a velvety texture and a slight waxy coating. Acalypha abingdonii is valued in gardens for its ornamental appeal and ability to thrive in partial to full sun.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha abingdonii"
    },
    "taxonomy_art_desc": "Acalypha abingdonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which consists of vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels. Its order is Malpighiales, a large group of flowering plants that includes a variety of families, many of which are known for their unique floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some that produce toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cottonplant,\" characterized by their showy flowers and often hairy leaves. Its species is Acalypha abingdonii, a specific type within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha abingdonii is primarily native to the Galápagos. This plant is found in the unique ecosystems of the Galápagos Islands, which are located in the eastern Pacific Ocean. It thrives in the volcanic soil and mild climate of the archipelago. The species is adapted to the specific environmental conditions of this region. Its distribution is limited to the Galápagos, making it an important part of the local flora.",
    "distribution_introduced_art_desc": "Acalypha abingdonii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there in the late 19th or early 20th century by horticulturists and gardeners seeking exotic plants for cultivation. Despite its ornamental value, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments and spreads primarily through its seeds. Its introduction has raised concerns among conservationists due to its potential ecological impact on local ecosystems."
}
