{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reptans var. glechomifolia",
    "plant_slug": "acalypha-reptans-var-glechomifolia",
    "plant_name_scientific": "acalypha reptans var. glechomifolia",
    "intro": "Acalypha reptans var. glechomifolia, commonly known as the creeping nettle or velvetleaf, is a herbaceous plant native to tropical and subtropical regions. It features heart-shaped leaves with a soft, velvety texture and a distinctive reddish or purple underside. The plant produces small, greenish flowers arranged in clusters, which are typically followed by three-lobed seed capsules. It thrives in moist, shaded environments and is often found in wetlands or along stream banks. Its rapid growth and ability to spread vegetatively make it an invasive species in some areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reptans var. glechomifolia is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland forests and along riverbanks. This variant is adapted to humid climates and thrives in moist, shaded environments. It is often seen in the undergrowth of secondary forests and disturbed habitats. Its native distribution reflects its preference for warm, humid conditions with moderate to high rainfall.",
    "distribution_introduced_art_desc": "Acalypha reptans var. glechomifolia was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought by early settlers or horticulturalists who valued its unique leaf patterns and aesthetic appeal. The plant has since become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. Despite its ornamental value, it has raised concerns due to its potential to invade native ecosystems. Its distribution is now limited to specific regions where it has established itself in the wild."
}
