{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha albicans",
    "plant_slug": "acalypha-albicans",
    "plant_name_scientific": "acalypha albicans",
    "intro": "Acalypha albicans, commonly known as the whiteleaf horsebrush, is a flowering plant native to parts of Africa and Asia. It is characterized by its soft, velvety leaves that are typically white or pale green in color. The plant produces small, clustered flowers that are usually green or yellowish in hue. It thrives in moist, shaded environments and is often found in woodland areas. Acalypha albicans is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha albicans is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like roadsides and open forests. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Due to its adaptability, it can sometimes be found in cultivated gardens or as an ornamental plant in warmer climates.",
    "distribution_introduced_art_desc": "Acalypha albicans was mainly introduced to New Zealand. It was first recorded in the 19th century and has since spread throughout the country. The plant thrives in disturbed habitats such as roadsides, riverbanks, and open forests. It is considered an invasive species due to its rapid growth and ability to outcompete native flora. Efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
