{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha compacta",
    "plant_slug": "acalypha-compacta",
    "plant_name_scientific": "acalypha compacta",
    "intro": "Acalypha compacta, commonly known as the compact flame bush, is a shrub native to tropical regions of the Americas. It is characterized by its dense, rounded growth habit and striking red or orange bracts that resemble flowers. The plant produces small, inconspicuous yellow flowers clustered in umbels, which are often surrounded by the showy bracts. Its leaves are typically ovate to elliptical, with a smooth or slightly hairy surface. Acalypha compacta is often cultivated for its ornamental value and ability to thrive in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha compacta is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with disturbed habitats like roadsides, clearings, and secondary forests. It is also known to grow in coastal areas and mangrove ecosystems in some parts of its range. Acalypha compacta is a common ornamental and medicinal plant in many parts of its native distribution.",
    "distribution_introduced_art_desc": "Acalypha compacta was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was brought there as an ornamental plant due to its attractive, compact growth habit and colorful foliage. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in disturbed soils and can spread rapidly through seeds dispersed by wind and water. Its introduction has raised concerns among ecologists due to its potential to alter local ecosystems."
}
