{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha meyeri",
    "plant_slug": "acalypha-meyeri",
    "plant_name_scientific": "acalypha meyeri",
    "intro": "Acalypha meyeri, commonly known as the velvetleaf or meyer's spurflower, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, colorful bracts that often resemble flowers, though they are actually modified leaves. The plant typically has palmate leaves with lobed or divided margins, and its stems are often covered in fine, soft hairs. It thrives in moist, well-drained soils and is often found in woodland or disturbed areas. Acalypha meyeri is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha meyeri is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with forest understories or disturbed sites. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Acalypha meyeri is valued for its ornamental foliage and is sometimes cultivated for horticultural purposes.",
    "distribution_introduced_art_desc": "Acalypha meyeri was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in disturbed soils and can spread rapidly through seeds dispersed by wind, water, or animals. Its introduction highlights the ecological risks associated with non-native plant species in island environments."
}
