{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha zambesica",
    "plant_slug": "acalypha-zambesica",
    "plant_name_scientific": "acalypha zambesica",
    "intro": "Acalypha zambesica, commonly known as the Zambesian spurflower, is a flowering plant native to southern Africa. It belongs to the Euphorbiaceae family and is characterized by its distinctive, spiky inflorescences. The plant typically grows as an upright shrub, reaching heights of up to 2 meters. Its leaves are alternate, ovate, and often have a slightly pubescent surface. The flowers are small and clustered, with a unique structure that includes cyathia, typical of the Euphorbiaceae family.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha zambesica is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in grassland and savanna habitats, often growing along riverbanks and in open woodlands. This plant thrives in regions with warm climates and well-drained soils. It is adapted to seasonal rainfall patterns and can tolerate periods of drought. Its native distribution is largely confined to the southern parts of the African continent.",
    "distribution_introduced_art_desc": "Acalypha zambesica was mainly introduced to new environments as an ornamental plant due to its attractive foliage and adaptability. It has been reported in several regions outside its native range, including parts of Southeast Asia and the Pacific Islands. The plant's rapid growth and ability to thrive in various soil types have contributed to its spread. However, it is considered invasive in some areas where it outcompetes native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
