{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ocymoides",
    "plant_slug": "acalypha-ocymoides",
    "plant_name_scientific": "acalypha ocymoides",
    "intro": "Acalypha ocymoides, commonly known as the velvetleaf or red-rooted ironweed, is a flowering plant native to tropical and subtropical regions of the Americas. It is a herbaceous perennial that typically grows to a height of 1 to 3 meters, featuring broad, heart-shaped leaves with a velvety texture. The plant produces clusters of small, greenish-white flowers arranged in dense inflorescences, which are often surrounded by bracts that can be red or purple in color. Its roots are fibrous and can become invasive, making it a common weed in disturbed soils. Acalypha ocymoides is adapted to thrive in moist, sunny environments and is often found in wetlands, roadsides, and forest edges.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha ocymoides"
    },
    "taxonomy_art_desc": "Acalypha ocymoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide variety of growth forms and ecological adaptations. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha ocymoides, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ocymoides is primarily native to Mexico Central and Mexico Southwest. It is commonly found in tropical and subtropical regions within these areas. This plant typically thrives in moist, shaded environments such as forests and along riverbanks. It is known for its striking foliage and is often used in horticulture for its ornamental value. Its native range includes parts of Central America and southern Mexico.",
    "distribution_introduced_art_desc": "Acalypha ocymoides was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and adaptability. It is commonly found in countries such as Australia, Hawaii, and parts of Southeast Asia. The plant thrives in warm climates with well-drained soil and full sun exposure. Its rapid growth and ability to spread through seeds and vegetative propagation have led to its establishment in some areas. However, it is not considered invasive in most regions where it is cultivated."
}
