{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha ecuadorica",
    "plant_slug": "acalypha-ecuadorica",
    "plant_name_scientific": "acalypha ecuadorica",
    "intro": "Acalypha ecuadorica, commonly known as the Ecuadorian spurge, is a flowering plant native to the Andean regions of Ecuador. It belongs to the Euphorbiaceae family, which is known for its diverse and often strikingly ornamental species. The plant features palmate leaves with a distinctive, almost fern-like appearance, and it produces small, clustered yellowish flowers. It is typically found in moist, shaded environments such as cloud forests. Due to its unique foliage and relatively low maintenance requirements, it is occasionally cultivated as an ornamental plant in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha ecuadorica is primarily native to the tropical regions of South America, particularly Ecuador and Peru. It is commonly found in lowland rainforests and humid montane areas. This plant thrives in shaded to semi-shaded environments with high humidity. It is often associated with secondary growth forests and disturbed habitats. Its distribution is also reported in parts of Colombia and northern Brazil.",
    "distribution_introduced_art_desc": "Acalypha ecuadorica was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and adaptability. It thrives in warm climates with well-drained soil and full sun to partial shade. The plant is commonly cultivated in gardens and landscapes for its vibrant leaves and ease of care. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its rapid growth and ability to spread through seeds make it a potential ecological concern in non-native habitats."
}
