{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hernandiifolia var. pubescens",
    "plant_slug": "acalypha-hernandiifolia-var-pubescens",
    "plant_name_scientific": "acalypha hernandiifolia var. pubescens",
    "intro": "Acalypha hernandiifolia var. pubescens, commonly known as the velvetleaf or silky hibiscus, is a shrub native to tropical regions of the Americas. It features heart-shaped, hairy leaves that give it a soft, velvety texture. The plant produces showy, trumpet-shaped flowers in shades of red, orange, or yellow, which bloom in clusters. Its growth habit is typically upright, with branching that can become somewhat woody over time. This species is often cultivated for its ornamental value in gardens and as a decorative plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hernandiifolia var. pubescens is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. This variant is commonly found in lowland rainforests and secondary growth areas. It thrives in humid, warm climates with high levels of rainfall. The plant is often associated with disturbed habitats and can be found near streams or in swampy areas. Its native distribution is largely confined to the archipelagos of the Indo-Malayan region.",
    "distribution_introduced_art_desc": "Acalypha hernandiifolia var. pubescens was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in gardens and green spaces in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in moist, well-drained soils and partial to full sunlight. Its rapid growth and ability to spread through vegetative reproduction have led to its establishment in some natural areas. However, it is considered a potential invasive species in certain regions where it can outcompete native vegetation."
}
