{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha alopecuroidea lusus glanduligera",
    "plant_slug": "acalypha-alopecuroidea-lusus-glanduligera",
    "plant_name_scientific": "acalypha alopecuroidea lusus glanduligera",
    "intro": "Acalypha alopecuroidea lusus glanduligera, commonly known as the woolly acalypha, is a shrub native to tropical regions of Africa. It is characterized by its dense, fuzzy foliage that gives it a soft, woolly appearance. The plant produces small, clustered flowers that are typically greenish-white in color. Its leaves are often covered in fine, glandular hairs, which contribute to its unique texture and appearance. This species is often cultivated for ornamental purposes due to its striking visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha alopecuroidea lusus glanduligera is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats like forest edges and agricultural lands. It is also present in parts of northern Australia and the Pacific Islands. Its distribution is closely linked to its ability to adapt to a variety of environmental conditions in these regions.",
    "distribution_introduced_art_desc": "Acalypha alopecuroidea lusus glanduligera was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first brought to the country in the early 20th century by horticultural enthusiasts and gardeners. Despite its ornamental value, it has since become a potential invasive species in certain regions of New Zealand. The plant spreads rapidly through seeds and can outcompete native vegetation in disturbed or poorly managed areas. Its introduction highlights the importance of monitoring non-native plants for ecological impacts."
}
