{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha perrieri",
    "plant_slug": "acalypha-perrieri",
    "plant_name_scientific": "acalypha perrieri",
    "intro": "Acalypha perrieri, commonly known as the Perrier's candle bush, is a flowering plant native to Madagascar. It belongs to the Euphorbiaceae family and is characterized by its distinctive, showy inflorescences that resemble candles. The plant produces small, greenish-yellow flowers arranged in dense clusters, often surrounded by colorful bracts. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight. Acalypha perrieri is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha perrieri"
    },
    "taxonomy_art_desc": "Acalypha perrieri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical and subtropical species with a wide range of morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a variety of growth forms and some that produce toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha perrieri, a specific type of Acalypha known for its unique morphological features and native to certain regions in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha perrieri is primarily native to Madagascar. It is found in the diverse ecosystems of this island nation, which is known for its unique and endemic flora. The plant typically grows in moist, shaded areas within forested regions. Its distribution is limited to specific habitats within Madagascar, reflecting the island's distinct ecological conditions. Due to its restricted range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Acalypha perrieri was mainly introduced to the Hawaiian Islands. It was first documented in the early 20th century and has since become established in several coastal and lowland areas. The plant is often found growing in disturbed soils and along roadsides. Its introduction is believed to be accidental, likely through shipping or landscaping activities. Due to its rapid growth and adaptability, it has become a common weed in certain regions of Hawaii."
}
