{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis f. longipetiolata",
    "plant_slug": "acalypha-communis-f-longipetiolata",
    "plant_name_scientific": "acalypha communis f. longipetiolata",
    "intro": "Acalypha communis f. longipetiolata, commonly known as the long-petioled spurflower, is a cultivar of the spurflower plant native to tropical regions. It is characterized by its distinctive, vibrant red bracts that surround small, inconspicuous flowers. The plant features elongated petioles, which give it a unique appearance and make it a popular choice for ornamental gardening. Its foliage is typically green with a slightly glossy texture, and it thrives in warm, humid environments. It is often cultivated for its ornamental value and can be grown in containers or as part of a tropical garden display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis f. longipetiolata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed habitats or secondary forests. It is also present in parts of eastern India and the Andaman Islands. Its native distribution is largely confined to the Indo-Malayan region.",
    "distribution_introduced_art_desc": "Acalypha communis f. longipetiolata was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and vibrant flowers. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and public spaces. The plant is often used as a decorative shrub or ground cover because of its dense growth habit and seasonal color changes. It has been reported in several countries outside its native range, including parts of the United States and Australia. However, it is considered an invasive species in some areas where it can outcompete native vegetation."
}
