{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha polymorpha var. angustifolia",
    "plant_slug": "acalypha-polymorpha-var-angustifolia",
    "plant_name_scientific": "acalypha polymorpha var. angustifolia",
    "intro": "Acalypha polymorpha var. angustifolia, commonly known as narrowleaf velvetleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its ovate, dark green leaves with a distinctive velvety texture on the upper surface. The plant produces small, clustered greenish-white flowers that are often overlooked due to their modest appearance. Its growth habit is typically herbaceous, with upright stems that can reach heights of up to 2 meters. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and abandoned fields.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha polymorpha var. angustifolia is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in tropical and subtropical regions, often found in moist lowland areas and secondary forests. This variant is known for its narrow leaves and is commonly used in traditional medicine and as an ornamental plant. It prefers well-drained soil and partial to full sunlight. The plant is also occasionally found in coastal regions and is adapted to humid climates.",
    "distribution_introduced_art_desc": "Acalypha polymorpha var. angustifolia was mainly introduced to tropical and subtropical regions as an ornamental plant due to its striking foliage. It is commonly found in gardens and greenhouses where it is cultivated for its vibrant leaf colors and unique appearance. The plant thrives in warm climates with high humidity and well-drained soil, making it suitable for coastal and inland areas. Its introduction has sometimes led to it becoming invasive in certain regions, outcompeting native vegetation. Proper management is essential to prevent its spread beyond cultivated areas."
}
