{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mildbraediana var. pubescens",
    "plant_slug": "acalypha-mildbraediana-var-pubescens",
    "plant_name_scientific": "acalypha mildbraediana var. pubescens",
    "intro": "Acalypha mildbraediana var. pubescens, commonly known as the hairy ironweed, is a flowering plant native to certain regions of Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, colorful bracts that resemble flowers. The plant has hairy foliage, which gives it its common name, and it produces small, inconspicuous flowers clustered in inflorescences. It thrives in moist, shaded environments and is often found in forest understories. The species is valued for its ornamental appeal and has been cultivated for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mildbraediana var. pubescens is primarily native to parts of Southeast Asia, including Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland and hill forest areas. This plant thrives in moist, shaded environments and is often associated with secondary growth and disturbed habitats. It is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its distribution is limited to specific geographic areas within the region.",
    "distribution_introduced_art_desc": "Acalypha mildbraediana var. pubescens was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this plant is primarily confined to the North Island, where it has been cultivated in gardens and botanical collections. Despite its ornamental value, it is considered a potential weed in some regions due to its ability to spread in disturbed soils. Its introduction has raised concerns about its impact on native ecosystems."
}
