{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brasiliensis var. brevipes",
    "plant_slug": "acalypha-brasiliensis-var-brevipes",
    "plant_name_scientific": "acalypha brasiliensis var. brevipes",
    "intro": "Acalypha brasiliensis var. brevipes, commonly known as the Brazilian nettle, is a flowering plant native to South America. It is characterized by its upright growth habit and striking, palmate leaves with a velvety texture. The plant produces small, greenish-white flowers arranged in clusters, which are followed by spherical, fleshy fruits. It thrives in moist, shady environments and is often found in tropical and subtropical regions. Due to its ornamental value, it is occasionally cultivated in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brasiliensis var. brevipes is primarily native to the Atlantic Forest biome of eastern Brazil. This variant is found in the states of Paraná, Santa Catarina, and Rio Grande do Sul. It typically grows in moist, shaded areas within the understory of dense forest vegetation. The plant is adapted to the humid and subtropical climate of this region. Its native distribution is limited to specific microhabitats within the Atlantic Forest ecosystem.",
    "distribution_introduced_art_desc": "Acalypha brasiliensis var. brevipes was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It thrives in full sun to partial shade and is often found in disturbed habitats such as roadsides, clearings, and along riverbanks. This plant is commonly used as an ornamental due to its attractive foliage and unique inflorescences. It has been reported in several countries in South America, particularly in Brazil, where it has established itself in natural and urban environments. However, its invasive potential remains under study in some regions."
}
