{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha insulana var. anisodonta",
    "plant_slug": "acalypha-insulana-var-anisodonta",
    "plant_name_scientific": "acalypha insulana var. anisodonta",
    "intro": "Acalypha insulana var. anisodonta, commonly known as the hairy sycamore or island glorybower, is a flowering plant native to tropical regions of Southeast Asia. It is characterized by its distinctive, showy bracts that resemble petals, often appearing in clusters at the ends of branches. The leaves are typically ovate to elliptic, with a hairy texture, and the plant produces small, inconspicuous flowers. It thrives in moist, shaded environments and is often found in lowland forests. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha insulana"
    },
    "taxonomy_art_desc": "Acalypha insulana var. anisodonta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true root system, vascular tissue, and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with unique adaptations, such as specialized leaves and flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with distinctive flowers and often toxic sap. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy leaves, commonly found in tropical and subtropical regions. Its species is Acalypha insulana, a specific type within the genus Acalypha, characterized by its unique morphological features and native habitat, with the variety anisodonta representing a distinct variant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha insulana var. anisodonta is primarily native to Fiji. This variant of the species is found in the tropical regions of the country. It typically grows in moist, shaded environments within forest understories. The plant is commonly observed in lowland and coastal areas of Fiji. Its distribution is limited to specific habitats within the island's biodiversity.",
    "distribution_introduced_art_desc": "Acalypha insulana var. anisodonta was mainly introduced to areas with warm, humid climates and well-drained soils, often in coastal or lowland regions. It thrives in environments with moderate to high light exposure and is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant is known for its rapid growth and ability to colonize open spaces, making it a potential invasive species in some regions. Its introduction has been documented in parts of Southeast Asia, the Pacific Islands, and the Caribbean. Due to its adaptability, it can outcompete native vegetation, altering local ecosystems and reducing biodiversity."
}
