{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis var. tomentella",
    "plant_slug": "acalypha-communis-var-tomentella",
    "plant_name_scientific": "acalypha communis var. tomentella",
    "intro": "Acalypha communis var. tomentella, commonly known as velvetleaf or woolly hibiscus, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, hairy foliage that gives it a velvety texture. The plant produces showy, vibrant flowers in shades of red, pink, and yellow, which bloom throughout the growing season. Its leaves are typically heart-shaped and covered in fine, white to grayish hairs. It thrives in moist, well-drained soils and is often found in woodland or disturbed areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis var. tomentella is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This variant of Acalypha communis is typically associated with lowland forests and secondary growth areas. It thrives in humid climates with well-drained soil. The plant is also occasionally reported in parts of the Pacific Islands.",
    "distribution_introduced_art_desc": "Acalypha communis var. tomentella was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly used in gardens and as a decorative plant in tropical and subtropical regions. The plant's ability to thrive in both full sun and partial shade makes it a versatile choice for different garden settings. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impact in regions where it is not native."
}
