{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pubiflora subsp. pubiflora",
    "plant_slug": "acalypha-pubiflora-subsp-pubiflora",
    "plant_name_scientific": "acalypha pubiflora subsp. pubiflora",
    "intro": "Acalypha pubiflora subsp. pubiflora, commonly known as the velvetleaf or red-veined plant, is a species native to tropical regions of Asia and Africa. It is a herbaceous perennial plant characterized by its striking, colorful leaves with prominent veins. The leaves are often covered in fine, soft hairs, giving the plant its common name. It produces small, greenish-white flowers that are clustered in dense inflorescences. This plant is valued for its ornamental qualities and is often cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pubiflora"
    },
    "taxonomy_art_desc": "Acalypha pubiflora subsp. pubiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes species with a wide range of morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper bush,\" characterized by their distinctive leaves and flowering structures. Its species is Acalypha pubiflora, a specific type within the genus known for its hairy leaves and showy flowers, often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Madagascar",
        "Malawi",
        "Mozambique",
        "Northern Provinces",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pubiflora subsp. pubiflora is primarily native to Botswana, Madagascar, Malawi, Mozambique, Northern Provinces, and Zimbabwe. This species is commonly found in regions with tropical and subtropical climates. It typically grows in open woodlands, grasslands, and along riverbanks. The plant is well adapted to the local environmental conditions of these areas. Its distribution reflects its preference for well-drained soils and moderate to high rainfall.",
    "distribution_introduced_art_desc": "Acalypha pubiflora subsp. pubiflora was mainly introduced to tropical and subtropical regions of the Pacific Islands, including Hawaii, Guam, and parts of Southeast Asia. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and coastal areas. This species has been introduced as an ornamental plant due to its attractive foliage and flowering habits. However, it has become invasive in some areas, outcompeting native vegetation. Its distribution is largely limited by its preference for warm, humid climates and well-drained soils."
}
