{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha adscendens",
    "plant_slug": "acalypha-adscendens",
    "plant_name_scientific": "acalypha adscendens",
    "intro": "Acalypha adscendens, commonly known as the red veined plant or velvetleaf, is a tropical shrub native to Southeast Asia. It is characterized by its striking, velvety leaves with deep red veins that contrast beautifully with its dark green background. The plant produces small, inconspicuous green flowers that are followed by clusters of orange-red berries. It thrives in humid, warm climates and is often found in disturbed soils or along forest edges. Due to its ornamental value, it is cultivated in gardens and as a houseplant in many regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha adscendens is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also present in parts of India and the Pacific Islands. Its native range extends across the Indo-Malayan region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha adscendens was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and growth habit. It is commonly found in gardens and landscaped areas in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm, humid climates and is often cultivated for its vibrant leaf colors and ability to form dense shrubs. However, it has also been reported as an invasive species in some regions where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
