{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schiedeana var. macrodonta",
    "plant_slug": "acalypha-schiedeana-var-macrodonta",
    "plant_name_scientific": "acalypha schiedeana var. macrodonta",
    "intro": "Acalypha schiedeana var. macrodonta, commonly known as the broad-leafed ironweed, is a shrub native to tropical regions of Africa. It features palmately lobed leaves that are often covered in fine hairs, giving them a velvety texture. The plant produces clusters of small, greenish-yellow flowers that are typically hidden within the leaf axils. Its growth habit is upright, with multiple branches forming a dense, bushy structure. The plant is valued for its ornamental qualities and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schiedeana var. macrodonta is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in moist, shaded environments, often found in lowland rainforests and along riverbanks. This plant is commonly associated with humid climates and is often seen growing in secondary forests and disturbed areas. It is also present in parts of northern Australia and New Guinea. Its distribution is closely linked to areas with high rainfall and warm temperatures throughout the year.",
    "distribution_introduced_art_desc": "Acalypha schiedeana var. macrodonta was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for use in landscaping and garden design. The plant is often used as a foliage plant or in mixed borders because of its vibrant leaf colors. It has also been introduced as a potential ornamental species in some parts of the world where it is grown for its aesthetic value. However, its introduction outside its native range requires careful management to prevent potential ecological impacts."
}
