{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula f. chathamensis",
    "plant_slug": "acalypha-parvula-f-chathamensis",
    "plant_name_scientific": "acalypha parvula f. chathamensis",
    "intro": "Acalypha parvula f. chathamensis, commonly known as the Chatham Islands copperleaf, is a unique variant of the copperleaf genus native to the Chatham Islands. It is a small shrub characterized by its distinctive, copper-colored foliage that gives it its common name. The plant features opposite, ovate leaves with a velvety texture and prominent veins. It produces small, greenish-white flowers that are clustered in dense inflorescences. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula f. chathamensis is primarily native to the Chatham Islands, a group of islands in the South Pacific Ocean. This subspecies is found specifically on the main island of Chatham, which is part of New Zealand's territory. It grows in coastal and lowland areas, often in sandy or rocky soils. The plant is adapted to the temperate climate and maritime conditions of the region. It is a rare and endemic species, reflecting the unique ecological conditions of the Chatham Islands.",
    "distribution_introduced_art_desc": "Acalypha parvula f. chathamensis was mainly introduced to the Chatham Islands. It is a variant of the common velvetleaf plant, native to tropical regions of Asia and Africa. This introduction likely occurred through human activity, such as accidental transport or intentional cultivation. The plant has adapted well to the local environment, thriving in coastal areas and disturbed soils. Its presence has raised concerns about its potential impact on native flora in the region."
}
