{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis var. hispida",
    "plant_slug": "acalypha-communis-var-hispida",
    "plant_name_scientific": "acalypha communis var. hispida",
    "intro": "Acalypha communis var. hispida, commonly known as velvetleaf, is a herbaceous annual plant native to tropical and subtropical regions. It features heart-shaped leaves with a distinctive velvety texture due to the presence of dense, fine hairs. The plant produces small, greenish-yellow flowers arranged in clusters, which are often overlooked due to their inconspicuous nature. It thrives in moist, disturbed soils and is commonly found in agricultural fields and along roadsides. Its rapid growth and adaptability make it a potential weed in various ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis var. hispida is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing near streams or in dense forests. It is also present in parts of the Pacific Islands, including the Philippines and New Guinea. Its distribution is closely associated with humid, tropical climates where it can form dense undergrowth in forested areas.",
    "distribution_introduced_art_desc": "Acalypha communis var. hispida was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique appearance. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant is often used in garden designs and as a decorative element in public spaces. Its introduction has led to its establishment in some non-native areas, sometimes becoming invasive. Careful management is recommended to prevent its spread beyond controlled environments."
}
