{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha petiolaris",
    "plant_slug": "acalypha-petiolaris",
    "plant_name_scientific": "acalypha petiolaris",
    "intro": "Acalypha petiolaris, commonly known as the silverleaf ironweed, is a flowering plant native to tropical regions of Africa. It is characterized by its striking silver-white foliage, which contrasts beautifully with its deep green veins. The plant produces small, clustered yellow flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Its compact growth habit and low maintenance requirements make it suitable for both indoor and outdoor cultivation.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha petiolaris"
    },
    "taxonomy_art_desc": "Acalypha petiolaris belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and a wide variety of floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive floral structures and often contains latex. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cottontree,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha petiolaris, a specific plant within the genus Acalypha, distinguished by its unique morphological features and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Benin",
        "Botswana",
        "Burundi",
        "Cameroon",
        "Cape Provinces",
        "Central African Republic",
        "Chad",
        "Congo",
        "DR Congo",
        "Eritrea",
        "Eswatini",
        "Ethiopia",
        "Guinea",
        "Guinea-Bissau",
        "Ivory Coast",
        "Kenya",
        "KwaZulu-Natal",
        "Malawi",
        "Mali",
        "Mozambique",
        "Namibia",
        "Nigeria",
        "Northern Provinces",
        "Rwanda",
        "Senegal",
        "Sierra Leone",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha petiolaris is primarily native to Angola, Benin, Botswana, Burundi, Cameroon, Cape Provinces, Central African Republic, Chad, Congo, DR Congo, Eritrea, Eswatini, Ethiopia, Guinea, Guinea-Bissau, Ivory Coast, Kenya, KwaZulu-Natal, Malawi, Mali, Mozambique, Namibia, Nigeria, Northern Provinces, Rwanda, Senegal, Sierra Leone, Sudan-South Sudan, Tanzania, Uganda, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions across these countries. The plant thrives in moist, well-drained soils and is often associated with riverbanks and forest understories. It is a shrub or small tree that can reach heights of up to 5 meters. Acalypha petiolaris is known for its ornamental value and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acalypha petiolaris was mainly introduced to ornamental horticulture due to its striking foliage and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its decorative value. The plant thrives in well-drained soil and partial to full sunlight, making it suitable for gardens and landscapes. Its introduction has led to its use in both indoor and outdoor settings. However, it is important to note that it may become invasive in certain environments if not managed properly."
}
