{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha minahassae",
    "plant_slug": "acalypha-minahassae",
    "plant_name_scientific": "acalypha minahassae",
    "intro": "Acalypha minahassae, commonly known as the Minahassa copperleaf, is a flowering plant native to Indonesia. It belongs to the Euphorbiaceae family and is characterized by its striking copper-colored leaves. The plant produces small, inconspicuous flowers that are often clustered in cyathium structures. It thrives in tropical climates and is often cultivated as an ornamental plant due to its vibrant foliage. Acalypha minahassae is relatively easy to care for, making it a popular choice for indoor and outdoor gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha minahassae is primarily native to the island of Minahassa in the Indonesian province of North Sulawesi. It is found in the tropical rainforests of this region, where it thrives in humid and shaded environments. The plant is typically associated with secondary growth areas and disturbed habitats within the lowland forests. It is known for its distinctive foliage and is often used in traditional medicine by local communities. Its distribution is limited to this specific geographic area, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Acalypha minahassae was mainly introduced to tropical and subtropical regions, particularly in areas with high humidity and well-drained soils. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and forest edges. The plant thrives in warm climates and can tolerate partial shade, making it adaptable to various environments. Its rapid growth and ability to spread through both seeds and vegetative means contribute to its invasive potential in new regions. However, it is often considered a weed in agricultural and natural areas due to its competitive nature."
}
