{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha wightiana var. ovata",
    "plant_slug": "acalypha-wightiana-var-ovata",
    "plant_name_scientific": "acalypha wightiana var. ovata",
    "intro": "Acalypha wightiana var. ovata, commonly known as the woolly mallow, is a shrub native to tropical regions of Asia. It is characterized by its soft, fuzzy leaves that give it a distinctive appearance. The plant produces small, clustered flowers that are typically pink or red in color. It thrives in well-drained soil and prefers full sun to partial shade. Acalypha wightiana var. ovata is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha wightiana var. ovata is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and parts of Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with secondary forests and disturbed sites. It is also present in some parts of southern China and the Philippines. Its distribution is largely restricted to the Indian Ocean region and adjacent tropical areas.",
    "distribution_introduced_art_desc": "Acalypha wightiana var. ovata was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage. It is commonly found in gardens and landscaping in countries such as India, Sri Lanka, and parts of Southeast Asia. The plant thrives in warm climates with high humidity and well-drained soil. It is often cultivated for its vibrant leaves, which can display shades of red, pink, and green. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation."
}
