{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mutisii",
    "plant_slug": "acalypha-mutisii",
    "plant_name_scientific": "acalypha mutisii",
    "intro": "Acalypha mutisii, commonly known as the velvetleaf or silverleaf acalypha, is a flowering plant native to tropical regions of Asia and the Pacific. It is characterized by its striking, velvety foliage that ranges from silver to deep green. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shaded environments and is often found in forest understories. Acalypha mutisii is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique leaf texture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha mutisii"
    },
    "taxonomy_art_desc": "Acalypha mutisii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral structures and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and often produces toxic compounds. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha mutisii, a specific type within the genus Acalypha, characterized by its unique morphological traits and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mutisii is primarily native to Colombia. It is found in the tropical regions of the country, particularly in the Andes and lowland areas. This plant thrives in moist, shaded environments, often in forests or along riverbanks. It is commonly distributed in the departments of Nariño, Putumayo, and Cauca. Its native range is limited to specific ecological zones within Colombia.",
    "distribution_introduced_art_desc": "Acalypha mutisii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, wastelands, and forest edges. It thrives in tropical and subtropical regions with high humidity and moderate to high rainfall. The plant is often found in regions with poor soil quality, where it can outcompete native vegetation. Its rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its invasive potential. It is commonly reported in countries across Southeast Asia, the Pacific Islands, and parts of Africa."
}
