{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha polystachya var. lacera",
    "plant_slug": "acalypha-polystachya-var-lacera",
    "plant_name_scientific": "acalypha polystachya var. lacera",
    "intro": "Acalypha polystachya var. lacera, commonly known as the silky hibiscus, is a flowering plant native to tropical regions of the Americas. It is characterized by its soft, hairy foliage and showy, pink to red bract-like flowers that resemble those of hibiscus. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are ovate to lanceolate, with a distinctive silvery underside that gives it a shimmering appearance. It thrives in warm, humid climates and is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha polystachya var. lacera is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also present in parts of the Indian subcontinent, including India and Sri Lanka. Due to its adaptability, it can be found in a variety of ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acalypha polystachya var. lacera was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The distribution of this species has been limited to specific regions within New Zealand, primarily in the North Island. It is commonly found in gardens and along roadsides where it thrives in moist, well-drained soils. Despite its ornamental value, it is considered a potential weed in some areas due to its rapid growth and ability to spread vegetatively."
}
