{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cinerea",
    "plant_slug": "acalypha-cinerea",
    "plant_name_scientific": "acalypha cinerea",
    "intro": "Acalypha cinerea, commonly known as silverleaf ironweed, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its grayish-white, hairy leaves that give it a distinctive silvery appearance. The plant produces small, clustered yellow flowers that bloom in the summer months. It thrives in moist, well-drained soils and is often found in wetlands or along riverbanks. Acalypha cinerea is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cinerea"
    },
    "taxonomy_art_desc": "Acalypha cinerea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their hairy leaves and showy flowers. Its species is Acalypha cinerea, a specific type within the genus Acalypha known for its grayish appearance and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cinerea is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in rocky and sandy soils. It is commonly seen in desert scrub and chaparral habitats. Its distribution is limited to specific geographic locations within Mexico.",
    "distribution_introduced_art_desc": "Acalypha cinerea was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first brought there in the late 19th century by horticulturalists who valued its unique silver-green leaves. Despite its aesthetic appeal, it has since become an invasive species, outcompeting native vegetation in wet forest habitats. Its rapid spread is attributed to its ability to thrive in disturbed soils and its prolific seed production. Efforts to control its spread have been challenging due to its resilience and adaptability to various environmental conditions."
}
