{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha amblyodonta var. repanda",
    "plant_slug": "acalypha-amblyodonta-var-repanda",
    "plant_name_scientific": "acalypha amblyodonta var. repanda",
    "intro": "Acalypha amblyodonta var. repanda, commonly known as the velvetleaf or red-veined nettle, is a flowering plant native to tropical and subtropical regions. It is characterized by its heart-shaped leaves with a distinctive reddish veining and a soft, velvety texture. The plant produces small, clustered greenish-white flowers that are typically borne in leaf axils. It thrives in moist, well-drained soils and is often found in disturbed areas or along stream banks. Its rapid growth and ability to spread through both seeds and rhizomes make it an invasive species in many regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha amblyodonta var. repanda is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with rainforests or secondary growth habitats. It is typically found in the understory of dense vegetation, where it receives partial to full shade. Its native distribution is largely confined to the region encompassing the Malay Archipelago and adjacent islands.",
    "distribution_introduced_art_desc": "Acalypha amblyodonta var. repanda was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. The plant has since become naturalized in several regions of the country. It is commonly found in coastal areas and disturbed habitats. However, it is not considered invasive and poses minimal ecological risk."
}
