{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula var. cordifolia",
    "plant_slug": "acalypha-parvula-var-cordifolia",
    "plant_name_scientific": "acalypha parvula var. cordifolia",
    "intro": "Acalypha parvula var. cordifolia, commonly known as heartleaf acalypha, is a small shrub native to tropical and subtropical regions. It features palmate leaves with five to seven lobes, often resembling a heart shape, which gives it its common name. The plant produces small, greenish-white flowers arranged in clusters, followed by distinctive, papery bracts that can range in color from red to purple. It thrives in moist, well-drained soils and prefers partial to full shade. Its ornamental value makes it a popular choice for garden landscapes and container planting.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula var. cordifolia is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, shaded environments. This variant of Acalypha parvula is often associated with rainforests and secondary growth habitats. It thrives in humid climates and is frequently seen along forest edges or in disturbed soils. Its distribution is closely linked to the ecological conditions of the region, making it a characteristic species of the area's flora.",
    "distribution_introduced_art_desc": "Acalypha parvula var. cordifolia was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was brought there during the 19th century by horticulturists and gardeners who sought to diversify the local flora with exotic species. Despite its aesthetic appeal, the plant has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through seeds and vegetative reproduction have contributed to its success in non-native environments. Efforts are now underway to control its spread and mitigate its ecological impact."
}
