{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha caturus f. angustifolia",
    "plant_slug": "acalypha-caturus-f-angustifolia",
    "plant_name_scientific": "acalypha caturus f. angustifolia",
    "intro": "Acalypha caturus f. angustifolia, commonly known as narrow-leaf copperleaf, is a shrub native to tropical regions of Africa. It features lance-shaped leaves that are often tinged with red or purple at the edges, giving it a distinctive appearance. The plant produces small, clustered flowers that are typically greenish-white in color. Its foliage is often used in traditional medicine for its purported healing properties. The plant thrives in moist, well-drained soils and is often found in woodland or swampy areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha caturus f. angustifolia is primarily native to Southeast Asia, particularly Indonesia and the Philippines. This plant is commonly found in tropical and subtropical regions, growing in moist, shaded environments such as forests and shrublands. It thrives in areas with high humidity and well-drained soil, often near rivers or in coastal regions. The species is known for its ornamental value, with its vibrant foliage making it a popular choice for landscaping. However, it is not widely cultivated outside its native range due to specific environmental requirements.",
    "distribution_introduced_art_desc": "Acalypha caturus f. angustifolia was mainly introduced to the Pacific Islands as an ornamental plant due to its attractive foliage. It has been reported in countries such as Hawaii, Guam, and the Mariana Islands, where it thrives in tropical and subtropical climates. The plant is often found growing in disturbed areas, along roadsides, and in coastal habitats. Its rapid growth and ability to spread through seeds make it a potential invasive species in some regions. Despite its ornamental value, it requires careful management to prevent ecological impacts."
}
