{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrostachya var. hirsutissima",
    "plant_slug": "acalypha-macrostachya-var-hirsutissima",
    "plant_name_scientific": "acalypha macrostachya var. hirsutissima",
    "intro": "Acalypha macrostachya var. hirsutissima, commonly known as the woolly copperleaf, is a tropical shrub native to Southeast Asia. It is characterized by its distinctive, fuzzy, silver-gray foliage that gives it a soft, velvety appearance. The plant produces clusters of small, red bracts that resemble flowers, adding a striking visual contrast to its foliage. It thrives in warm, humid environments and is often cultivated as an ornamental plant. The leaves are also used in traditional medicine for their purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrostachya var. hirsutissima is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid climates with high rainfall and is often associated with disturbed or shaded environments. It is also known to occur in parts of northern Australia and the Pacific Islands. Its distribution is closely linked to areas with rich soil and ample moisture.",
    "distribution_introduced_art_desc": "Acalypha macrostachya var. hirsutissima was mainly introduced to the United States as an ornamental plant due to its attractive foliage and unique appearance. It is commonly found in gardens and greenhouses, particularly in the southern and western regions where the climate is warm and humid. This plant has been reported in several states, including Florida, Texas, and California, where it has established itself in both cultivated and naturalized settings. Despite its ornamental value, it has the potential to become invasive in certain environments if not managed properly. Its introduction has raised concerns among ecologists regarding its impact on native plant species and local ecosystems."
}
