{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha leonensis",
    "plant_slug": "acalypha-leonensis",
    "plant_name_scientific": "acalypha leonensis",
    "intro": "Acalypha leonensis, commonly known as the red leaf acalypha, is a flowering plant native to tropical regions of Central and South America. It is characterized by its striking, velvety red leaves that are often variegated with green and yellow patterns. The plant produces small, inconspicuous greenish-white flowers that are clustered in spikes. It is often cultivated as an ornamental plant due to its vibrant foliage. Acalypha leonensis prefers well-drained soil and partial to full sunlight, making it suitable for tropical and subtropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha leonensis is primarily native to the Caribbean islands, including Cuba, Hispaniola, Jamaica, and the Bahamas. It is commonly found in tropical and subtropical regions, particularly in coastal areas and moist lowland forests. The plant thrives in humid climates with well-drained soil, often growing near water sources or in shaded undergrowth. It is also present in parts of Central America, such as southern Mexico and northern Colombia. Due to its adaptability, it has been introduced to other tropical regions outside its native range.",
    "distribution_introduced_art_desc": "Acalypha leonensis was mainly introduced to Hawaii, where it has become an invasive species. It was likely brought there through human activities, such as accidental transport in soil or on plant material. The plant thrives in disturbed areas and has spread rapidly in native ecosystems. It competes with native plants for resources, leading to ecological imbalances. Efforts are ongoing to control its spread and mitigate its impact on local biodiversity."
}
