{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha divaricata",
    "plant_slug": "acalypha-divaricata",
    "plant_name_scientific": "acalypha divaricata",
    "intro": "Acalypha divaricata, commonly known as the red-veined or variegated spurflower, is a flowering plant native to tropical regions of Africa and Asia. It is a shrub or small tree that typically grows up to 3 meters in height, featuring opposite, ovate leaves with distinctive red or yellow veins. The plant produces small, greenish-yellow flowers arranged in spikes, which are often clustered at the ends of branches. Its ornamental value comes from its colorful foliage, making it a popular choice for ornamental gardening. Acalypha divaricata is also valued for its ability to thrive in a variety of soil types and its tolerance to partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha divaricata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in shaded to semi-shaded environments, often growing in forests or along streambanks. It is also present in parts of Australia and the Pacific Islands. Its native range extends across various island chains in the Indo-Pacific region.",
    "distribution_introduced_art_desc": "Acalypha divaricata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ease of cultivation. It has since become naturalized in various regions, particularly in coastal and disturbed areas. The plant spreads primarily through seed dispersal by wind and water, contributing to its rapid colonization of new habitats. Its introduction has raised concerns due to its potential to outcompete native species in certain ecosystems. Despite its ornamental value, management strategies are being developed to control its spread and mitigate ecological impacts."
}
