{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha marginata",
    "plant_slug": "acalypha-marginata",
    "plant_name_scientific": "acalypha marginata",
    "intro": "Acalypha marginata, commonly known as the velvetleaf or red-veined plant, is a tropical shrub native to Southeast Asia. It is characterized by its striking, velvety, red-veined leaves that are often variegated with green and white. The plant produces small, greenish flowers that are clustered in spikes, followed by orange or red berries. It thrives in moist, shaded environments and is often found in forest undergrowth. Acalypha marginata is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha marginata"
    },
    "taxonomy_art_desc": "Acalypha marginata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with unique floral structures and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some that produce toxic sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false holly,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha marginata, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological role in its native habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mauritius",
        "Réunion"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha marginata is primarily native to Mauritius and Réunion. This plant is commonly found in the coastal areas and lowland regions of these islands. It thrives in moist, well-drained soils and is often seen growing in disturbed habitats. Acalypha marginata is an important component of the local flora and plays a role in the ecological balance of these regions. Its presence is a testament to the unique biodiversity of the Mascarene Islands.",
    "distribution_introduced_art_desc": "Acalypha marginata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since become naturalized in certain regions, spreading through both seed dispersal and vegetative propagation. The plant is commonly found in disturbed habitats such as roadsides, riverbanks, and urban areas. Its rapid growth and ability to thrive in different soil types contribute to its successful establishment. However, it is not considered a major invasive species in New Zealand."
}
