{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha zeyheri var. pubescens",
    "plant_slug": "acalypha-zeyheri-var-pubescens",
    "plant_name_scientific": "acalypha zeyheri var. pubescens",
    "intro": "Acalypha zeyheri var. pubescens, commonly known as the velvetleaf or silverleaf, is a shrub native to tropical and subtropical regions. It is characterized by its distinctive, velvety foliage with a soft, pubescent texture. The leaves are typically ovate to elliptic in shape and exhibit a striking silver or gray-green hue due to dense trichomes. It produces small, clustered flowers that are usually greenish-white in color. This plant is often cultivated for its ornamental value and is adapted to thrive in well-drained soils and full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha zeyheri var. pubescens is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, growing in sandy or rocky soils. This plant thrives in open habitats like grasslands, shrublands, and along riverbanks. It is often seen in coastal areas and is well adapted to drought conditions. Its distribution is largely restricted to the region where it has evolved over time.",
    "distribution_introduced_art_desc": "Acalypha zeyheri var. pubescens was mainly introduced to ornamental horticulture due to its attractive foliage and unique appearance. It is commonly cultivated as a decorative plant in gardens and landscapes. The plant is native to southern Africa but has been introduced to other regions for its aesthetic value. It thrives in warm, humid climates and is often used in tropical and subtropical gardens. However, it is important to manage its growth to prevent potential invasiveness in non-native environments."
}
