{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha spiciflora var. menavody",
    "plant_slug": "acalypha-spiciflora-var-menavody",
    "plant_name_scientific": "acalypha spiciflora var. menavody",
    "intro": "Acalypha spiciflora var. menavody, commonly known as the Menavody spurflower, is a shrub native to tropical regions of Africa. It is characterized by its dense, branching structure and vibrant, spiculate inflorescences that range in color from red to orange. The leaves are typically ovate to elliptic, with a smooth or slightly hairy surface, and often have a reddish or purple tinge. The plant thrives in moist, well-drained soils and is often found in woodland or shrubland habitats. It is valued for its ornamental appeal and is sometimes cultivated in gardens for its striking floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha spiciflora var. menavody is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is commonly found in coastal areas and moist lowland forests. This variant thrives in humid climates with well-drained soils. It is often associated with disturbed habitats such as roadsides and abandoned fields. The plant is known for its striking foliage and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha spiciflora var. menavody was mainly introduced to coastal and sandy areas of the southeastern United States, particularly in Florida and the Gulf Coast. It thrives in well-drained soils and full sun, making it a common sight in disturbed habitats such as roadsides and dunes. This plant is often found in areas with high salinity and can tolerate periodic flooding, which contributes to its invasive potential. Its rapid growth and ability to form dense stands have led to its classification as a noxious weed in several states. Due to its adaptability, it has spread beyond its original introduction range, posing challenges for native ecosystems."
}
