{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha dupraeana",
    "plant_slug": "acalypha-dupraeana",
    "plant_name_scientific": "acalypha dupraeana",
    "intro": "Acalypha dupraeana, commonly known as the velvetleaf or red-veined nettle, is a flowering plant native to Southeast Asia. It is characterized by its striking, often reddish or purple-veined leaves that give it a distinctive appearance. The plant produces small, clustered greenish-white flowers that are typically borne on short pedicels. It thrives in moist, shady environments and is often found in tropical and subtropical regions. Acalypha dupraeana is valued for its ornamental qualities and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha dupraeana is primarily native to the island of Madagascar. It is found in the eastern part of the island, particularly in the northeastern regions. This plant typically grows in moist, shaded forest environments. It is commonly found in areas with rich organic soil and high humidity. Its native distribution is limited to specific microhabitats within Madagascar's diverse ecosystems.",
    "distribution_introduced_art_desc": "Acalypha dupraeana was mainly introduced to tropical and subtropical regions, particularly in Southeast Asia, the Pacific Islands, and parts of Africa. It is commonly found in disturbed habitats such as roadsides, wastelands, and along riverbanks. The plant thrives in areas with high humidity and well-drained soils. Its rapid growth and ability to spread through seeds make it an invasive species in many of these regions. Due to its adaptability, it has become a significant ecological concern in several countries."
}
