{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha euphrasiostachys",
    "plant_slug": "acalypha-euphrasiostachys",
    "plant_name_scientific": "acalypha euphrasiostachys",
    "intro": "Acalypha euphrasiostachys, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, velvety leaves with prominent red veins, which give it its common name. The plant produces small, greenish-white flowers arranged in clusters, typically blooming during the wet season. It thrives in moist, shaded environments and is often found in forests or along stream banks. The species is valued for its ornamental appeal and has been introduced to other tropical regions for horticultural purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha euphrasiostachys"
    },
    "taxonomy_art_desc": "Acalypha euphrasiostachys belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and a wide range of morphological adaptations. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical species, often with distinctive floral structures and specialized leaves. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup plants,\" characterized by their hairy foliage and showy inflorescences. Its species is Acalypha euphrasiostachys, a specific type within the genus Acalypha, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Mexico Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha euphrasiostachys is primarily native to Guatemala and central Mexico. This species is commonly found in the tropical and subtropical regions of these areas. It thrives in moist, well-drained soils and is often associated with forest understories. The plant is known for its striking foliage and is sometimes cultivated for ornamental purposes. Its distribution is largely restricted to the specific ecosystems of central Mexico and northern Guatemala.",
    "distribution_introduced_art_desc": "Acalypha euphrasiostachys was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant thrives in moist, shaded environments and is commonly found in coastal and lowland regions. Its rapid growth and ability to spread through both seeds and vegetative reproduction have made it a concern for local ecosystems."
}
