{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha adenotricha",
    "plant_slug": "acalypha-adenotricha",
    "plant_name_scientific": "acalypha adenotricha",
    "intro": "Acalypha adenotricha, commonly known as the silky ironwood, is a flowering plant native to tropical regions of Africa. It is characterized by its woody stems and dense, soft, silvery foliage that gives it a distinctive appearance. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in humid, shaded environments and is often found in forest understories. Acalypha adenotricha is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha adenotricha is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant is typically associated with lowland rainforests and secondary forest areas. It thrives in areas with high humidity and well-drained soil. Its distribution is also reported in some parts of Australia, particularly in northern regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acalypha adenotricha was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was originally native to Southeast Asia and the Pacific region, but its introduction to new areas has led to its establishment in various tropical and subtropical environments. The plant's rapid growth and ability to thrive in disturbed soils have contributed to its spread beyond cultivated areas. It is now considered an invasive species in some regions, outcompeting native vegetation and altering local ecosystems. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
