{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha amentacea var. amentacea",
    "plant_slug": "acalypha-amentacea-var-amentacea",
    "plant_name_scientific": "acalypha amentacea var. amentacea",
    "intro": "Acalypha amentacea var. amentacea, commonly known as the silky bush or silky mallow, is a flowering plant native to tropical and subtropical regions of Asia. It is characterized by its soft, silky hairs that cover its stems and leaves, giving it a distinctive, fluffy appearance. The plant produces small, inconspicuous greenish-white flowers arranged in dense, drooping clusters called catkins. Its leaves are typically ovate to elliptical in shape and often have a smooth or slightly serrated margin. This species thrives in moist, well-drained soils and is often found in forest understories or along stream banks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha amentacea"
    },
    "taxonomy_art_desc": "Acalypha amentacea var. amentacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malpighiales, a diverse group of flowering plants that includes many species with unique adaptations, such as the ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive cyathia and a wide range of ecological roles. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their often hairy foliage and showy inflorescences. Its species is Acalypha amentacea, a specific variety within the genus known for its unique growth habits and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo",
        "Maluku",
        "New Guinea",
        "Philippines",
        "Sulawesi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha amentacea var. amentacea is primarily native to Borneo, Maluku, New Guinea, Philippines, Sulawesi. This plant is commonly found in tropical and subtropical regions within these areas. It typically grows in moist, shaded environments such as forests and undergrowth. The species is known for its distinctive foliage and is often used in ornamental horticulture. Its native range reflects its adaptation to the diverse ecosystems of the Indo-Pacific region.",
    "distribution_introduced_art_desc": "Acalypha amentacea var. amentacea was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique growth habit. The plant has since become naturalized in certain regions, particularly in coastal and riparian areas. It is considered a potential weed in some parts of the country due to its ability to spread rapidly. However, it is not currently classified as a noxious weed in New Zealand."
}
