{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis f. hirsutissima",
    "plant_slug": "acalypha-communis-f-hirsutissima",
    "plant_name_scientific": "acalypha communis f. hirsutissima",
    "intro": "Acalypha communis f. hirsutissima, commonly known as the velvetleaf or woolly hibiscus, is a flowering plant native to tropical and subtropical regions. It is characterized by its hairy, velvety leaves that give it a distinctive texture. The plant produces showy, five-petaled flowers in shades of yellow, red, or orange, often with a prominent central disk. It thrives in humid environments and is often found in disturbed soils or along roadsides. Its botanical features make it a popular choice for ornamental gardening and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis f. hirsutissima is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This variant is known for its hairy foliage and is often cultivated as an ornamental plant. It thrives in humid climates and is typically found in lowland areas near rivers or in dense forests. The plant is also occasionally seen in coastal regions where the climate is warm and humid.",
    "distribution_introduced_art_desc": "Acalypha communis f. hirsutissima was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this plant has expanded beyond its original introduction, leading to its establishment in various habitats across the country. It is now considered a potential invasive species in some regions. Its spread is often facilitated by its ability to thrive in disturbed soils and adapt to different environmental conditions."
}
