{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cancana",
    "plant_slug": "acalypha-cancana",
    "plant_name_scientific": "acalypha cancana",
    "intro": "Acalypha cancana, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family and is characterized by its striking, palmately lobed leaves with bright red veins. The plant produces small, greenish-yellow flowers arranged in clusters, which are often surrounded by modified leaves called bracts. It thrives in moist, shaded environments and is often found in forest understories. Due to its ornamental value, it is occasionally cultivated as a decorative plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cancana is primarily native to tropical and subtropical regions of the Americas, including parts of Central and South America. It is commonly found in countries such as Brazil, Colombia, and Peru. This plant thrives in humid, shaded environments, often growing in the undergrowth of tropical forests. It is also known to occur in some Caribbean islands. Its native distribution includes a variety of ecosystems, from lowland rainforests to coastal areas.",
    "distribution_introduced_art_desc": "Acalypha cancana was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by human activity, such as horticultural trade or intentional planting. The plant has since spread beyond its original introduction sites, becoming naturalized in some areas. It is now considered an invasive species in certain regions of the Pacific, where it competes with native vegetation. Its rapid growth and adaptability have contributed to its success in new environments."
}
