{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha odorata",
    "plant_slug": "acalypha-odorata",
    "plant_name_scientific": "acalypha odorata",
    "intro": "Acalypha odorata, commonly known as the \"Copperleaf\" or \"Redleaf,\" is a tropical shrub native to Southeast Asia. It is characterized by its vibrant, colorful leaves that range from red to orange, often with contrasting green veins. The plant produces small, inconspicuous greenish-white flowers that are clustered in spikes. Its leaves are often used in traditional medicine for their purported anti-inflammatory and antiseptic properties. Acalypha odorata thrives in moist, shaded environments and is popular as an ornamental plant in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha odorata is primarily native to tropical and subtropical regions of Asia, including countries such as India, Sri Lanka, Malaysia, Indonesia, and the Philippines. It thrives in warm, humid climates and is commonly found in lowland areas, along riverbanks, and in moist forests. This plant is also present in parts of Africa, particularly in East and Central regions, where it grows in similar environmental conditions. It is often cultivated for its ornamental value due to its attractive foliage and unique flower structures. Despite its widespread distribution, it remains most prevalent in its native habitats across Southeast Asia and the Indian subcontinent.",
    "distribution_introduced_art_desc": "Acalypha odorata was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive foliage and vibrant flowers. It is commonly found in areas with warm climates, such as parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant has been unintentionally spread through human activities, including the movement of soil and plant material. It thrives in moist, well-drained soils and can often be found near water bodies or in disturbed habitats. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
