{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha heterodonta var. hirsuta",
    "plant_slug": "acalypha-heterodonta-var-hirsuta",
    "plant_name_scientific": "acalypha heterodonta var. hirsuta",
    "intro": "Acalypha heterodonta var. hirsuta, commonly known as the hairy iron plant, is a shrub native to tropical regions of Africa. It is characterized by its hairy, glandular leaves that are typically bright green and have a velvety texture. The plant produces clusters of small, yellowish-green flowers that are followed by distinctive, spiny seed capsules. It thrives in humid, well-drained soils and is often found in forest understories. Due to its ornamental value, it is cultivated in some subtropical and tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha heterodonta var. hirsuta is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. This plant is commonly found in lowland areas, often growing in moist, shaded environments such as forests and along stream banks. It is well adapted to humid climates and thrives in areas with high rainfall and warm temperatures. The species is also occasionally reported in parts of southern China and northern Australia. Its native range reflects its preference for tropical rainforests and disturbed habitats.",
    "distribution_introduced_art_desc": "Acalypha heterodonta var. hirsuta was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking to diversify local plant collections. The plant has since become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. Its introduction has raised concerns due to its potential to outcompete native species in disturbed habitats. Despite its ornamental value, it is now considered a potential invasive species in certain regions."
}
