{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hutchinsonii",
    "plant_slug": "acalypha-hutchinsonii",
    "plant_name_scientific": "acalypha hutchinsonii",
    "intro": "Acalypha hutchinsonii, commonly known as the red-flowered spurflower, is a shrub native to tropical regions of Africa. It is characterized by its striking red bracts that surround small yellow flowers, making it a visually distinctive plant. The leaves are typically ovate or elliptical, with a smooth or slightly hairy surface. It thrives in moist, well-drained soils and is often found in woodland or swampy areas. This species is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha hutchinsonii"
    },
    "taxonomy_art_desc": "Acalypha hutchinsonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse habitats and ecological roles. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some toxic properties. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha hutchinsonii, a specific type within the genus Acalypha, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hutchinsonii is primarily native to Cuba. It is found in various habitats across the island, including coastal areas and dry forests. This species is adapted to the tropical climate of Cuba, where it thrives in well-drained soils. It is often seen in disturbed or secondary growth areas. Due to its restricted range, it is considered a rare and endemic plant in the region.",
    "distribution_introduced_art_desc": "Acalypha hutchinsonii was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and unique appearance. It is commonly found in tropical and subtropical regions where it is cultivated for its aesthetic value. The plant is often used in garden settings to add visual interest and texture to the landscape. However, it has also been reported as an invasive species in some areas, where it can outcompete native vegetation. Its distribution is primarily limited to regions with warm climates and adequate moisture."
}
