{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gracilens subsp. monococca",
    "plant_slug": "acalypha-gracilens-subsp-monococca",
    "plant_name_scientific": "acalypha gracilens subsp. monococca",
    "intro": "Acalypha gracilens subsp. monococca, commonly known as the slender beauty leaf, is a flowering plant native to tropical regions of Africa. It is characterized by its slender, upright stems and strikingly colorful, palmate leaves that often display shades of red, orange, and yellow. The plant produces small, inconspicuous greenish-white flowers arranged in clusters, which are typically followed by spherical, dry fruits. It thrives in moist, well-drained soil and partial to full sunlight, making it a popular choice for ornamental gardening. Its unique foliage makes it a valuable addition to both indoor and outdoor landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gracilens subsp. monococca is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with disturbed or secondary growth habitats. It is also present in parts of northern Australia and New Guinea. Its distribution is largely limited to the Indo-Malayan region, where it grows in open woodlands and along stream banks.",
    "distribution_introduced_art_desc": "Acalypha gracilens subsp. monococca was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and forest edges. It thrives in tropical and subtropical regions due to its preference for warm, humid climates. This subspecies is known for its rapid growth and ability to spread through both seeds and vegetative propagation. It has been reported in several countries in Southeast Asia and the Pacific Islands. However, its introduction has raised concerns about its potential to become an invasive species in non-native environments."
}
