{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula var. strobilifera",
    "plant_slug": "acalypha-parvula-var-strobilifera",
    "plant_name_scientific": "acalypha parvula var. strobilifera",
    "intro": "Acalypha parvula var. strobilifera, commonly known as the coral bells, is a low-growing herbaceous plant native to the southeastern United States. It features striking, colorful bracts that resemble small coral-like structures, which are actually modified leaves rather than flowers. The plant produces small, inconspicuous flowers that are clustered in dense, cone-shaped inflorescences. It thrives in moist, shaded environments and has a fibrous root system that helps it anchor in wet soils. Its foliage is often variegated with shades of green, red, and yellow, making it a popular ornamental plant in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha parvula"
    },
    "taxonomy_art_desc": "Acalypha parvula var. strobilifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral structures and often show a wide range of growth forms. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha parvula, a specific type within the genus known for its small size and unique varietal form strobilifera, which refers to its specialized inflorescence structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula var. strobilifera is primarily native to the Galápagos. This variant of Acalypha parvula is found in the unique ecosystems of the Galápagos Islands. It thrives in the volcanic soils and coastal habitats of the archipelago. The plant is adapted to the specific climate and environmental conditions of the region. Its distribution is limited to the Galápagos, making it a distinctive component of the local flora.",
    "distribution_introduced_art_desc": "Acalypha parvula var. strobilifera was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and forest edges. It thrives in regions with moderate to high rainfall and full sun exposure. This plant is commonly found in the southeastern United States, particularly in Florida and Georgia. Its rapid growth and ability to colonize disturbed areas make it an aggressive weed in agricultural and natural landscapes. It is often used in ornamental horticulture due to its unique foliage and adaptability to various soil types."
}
