{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha salicina",
    "plant_slug": "acalypha-salicina",
    "plant_name_scientific": "acalypha salicina",
    "intro": "Acalypha salicina, commonly known as silky acalypha, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the Euphorbiaceae family and is characterized by its attractive, soft, silky leaves that give it its common name. The plant produces small, clustered flowers that are often surrounded by bracts, which can be colorful and serve as ornamental features. It thrives in moist, well-drained soils and is often used in landscaping for its aesthetic appeal. Acalypha salicina is also valued for its potential medicinal properties in traditional herbal practices.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha salicina"
    },
    "taxonomy_art_desc": "Acalypha salicina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of flowering plants. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental gardening. Its species is Acalypha salicina, a specific type of plant within the genus Acalypha, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha salicina is primarily native to Peru. It is commonly found in the Andean regions of the country. This plant thrives in moist, shaded environments such as forest understories. It is often associated with humid tropical and subtropical climates. Its native distribution is limited to specific ecological niches within Peru.",
    "distribution_introduced_art_desc": "Acalypha salicina was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ease of cultivation. It has since become naturalized in various regions, particularly in coastal and riparian areas. The plant spreads through both seed dispersal and vegetative propagation, contributing to its rapid establishment in new environments. Despite its aesthetic appeal, it has raised concerns due to its potential to outcompete native species in certain ecosystems. Its distribution highlights the ecological impacts of introducing non-native plants to new habitats."
}
