{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha andringitrensis",
    "plant_slug": "acalypha-andringitrensis",
    "plant_name_scientific": "acalypha andringitrensis",
    "intro": "Acalypha andringitrensis, commonly known as the Madagascar spurflower, is a flowering plant native to Madagascar. It belongs to the Euphorbiaceae family and is characterized by its unique, spiky inflorescences. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are usually ovate or elliptic, with a smooth or slightly hairy surface. It thrives in tropical climates and is often found in humid, shaded environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha andringitrensis"
    },
    "taxonomy_art_desc": "Acalypha andringitrensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes horsetails and other ancient vascular plants with a distinctive morphology. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers. Its order is Malpighiales, a diverse group of flowering plants that includes many economically important species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with latex and often showy flowers. Its genus is Acalypha, a group of flowering plants known for their showy, often colorful inflorescences and hairy leaves. Its species is Acalypha andringitrensis, a specific plant within the Acalypha genus found in Madagascar, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha andringitrensis is primarily native to Madagascar. This unique plant is found in the eastern part of the island, specifically in the rainforest regions. It thrives in humid, tropical conditions with high levels of rainfall. The plant is known for its striking foliage and is often found in shaded undergrowth. Due to its limited distribution, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Acalypha andringitrensis was mainly introduced to areas with warm, humid climates and well-drained soils, often found in tropical and subtropical regions. It is commonly cultivated as an ornamental plant due to its striking foliage and unique inflorescences. The plant thrives in full sun to partial shade and requires consistent moisture to maintain its vibrant appearance. It is often used in landscaping and garden design for its aesthetic value. However, it may become invasive in certain environments if not properly managed."
}
