{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha erecta",
    "plant_slug": "acalypha-erecta",
    "plant_name_scientific": "acalypha erecta",
    "intro": "Acalypha erecta, commonly known as the upright or erect candleplant, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its upright growth habit and striking, showy bracts that resemble candles, often in shades of red, orange, or yellow. The plant produces small, inconspicuous flowers clustered within the bracts, which are often the main ornamental feature. Acalypha erecta thrives in moist, well-drained soils and is often cultivated as a decorative plant in gardens and greenhouses. It is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha erecta"
    },
    "taxonomy_art_desc": "Acalypha erecta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true root system, stems, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species, often with distinctive floral and leaf morphology. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha erecta, a specific plant within the genus Acalypha, known for its upright growth habit and distinctive floral structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha erecta is primarily native to Mexico Central. It is commonly found in the tropical and subtropical regions of this area. The plant thrives in moist, well-drained soils and is often seen in open woodlands and along stream banks. It is an important component of the local flora and is adapted to the warm, humid climate. Its distribution is largely restricted to the central regions of Mexico.",
    "distribution_introduced_art_desc": "Acalypha erecta was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and growth habit. It was first recorded in the 19th century and has since become naturalized in various regions of the country. The plant thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and riverbanks. Although it is not considered a major invasive species, it has the potential to spread and compete with native vegetation. Its distribution is primarily limited to the northern and central parts of New Zealand."
}
