{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha acuta",
    "plant_slug": "acalypha-acuta",
    "plant_name_scientific": "acalypha acuta",
    "intro": "Acalypha acuta, commonly known as the sharpleaf cudweed, is a flowering plant belonging to the Euphorbiaceae family. It is native to tropical and subtropical regions of Asia, including India, China, and Southeast Asia. The plant is characterized by its slender, erect stems and small, opposite leaves that are often covered in fine hairs. Its flowers are unisexual, with male and female flowers occurring on separate plants, a feature common in the Euphorbiaceae family. Acalypha acuta typically grows in moist, shady environments such as forests and along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha acuta is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, Thailand, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often found in forests, along riverbanks, and in disturbed habitats. It is also present in parts of Australia and the Pacific Islands. Acalypha acuta is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha acuta was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and growth habit. It is commonly used in tropical and subtropical regions for its decorative value. The plant thrives in warm, humid climates and is often cultivated in gardens and as a houseplant. It has been reported to escape cultivation in some areas, leading to its naturalization in certain environments. However, its invasive potential varies depending on the region and local ecological conditions."
}
