{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha indica var. australis",
    "plant_slug": "acalypha-indica-var-australis",
    "plant_name_scientific": "acalypha indica var. australis",
    "intro": "Acalypha indica var. australis, commonly known as the Australian hibiscus or velvetleaf, is a tropical shrub native to Southeast Asia and Australia. It features palmate leaves with a velvety texture, often covered in fine hairs, and produces showy, bisexual flowers in clusters. The plant is known for its rapid growth and ability to thrive in a variety of soil types, making it adaptable to different environments. It is often cultivated as an ornamental plant due to its attractive foliage and vibrant floral displays. However, it can become invasive in certain regions if not managed properly.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha indica var. australis is primarily native to eastern Australia, including parts of Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in coastal and lowland areas, often growing in sandy soils along the shoreline. This variant is adapted to the warm, humid climate of these regions and thrives in full sun to partial shade. It is often seen in coastal dunes, rocky outcrops, and open woodlands. The plant is known for its distinctive red bracts that attract pollinators and contribute to its ornamental value.",
    "distribution_introduced_art_desc": "Acalypha indica var. australis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It is commonly found in gardens and along roadsides, where it thrives in sunny to partially shaded conditions. The plant's rapid growth and ability to spread through both seeds and rhizomes have led to its establishment in natural areas, raising concerns about its potential invasiveness. Despite its ornamental value, its introduction has resulted in ecological impacts, including competition with native species. It is now considered a weed in some regions of New Zealand."
}
