{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha digynostachya",
    "plant_slug": "acalypha-digynostachya",
    "plant_name_scientific": "acalypha digynostachya",
    "intro": "Acalypha digynostachya, commonly known as the two-flowered cupplant, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family, which includes many species with unique floral structures. The plant is characterized by its showy, cup-shaped inflorescences that contain both male and female flowers. Its leaves are typically alternate and have a rough, hairy texture. It is often found in moist, shaded environments and is valued for its ornamental appeal in horticulture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha digynostachya"
    },
    "taxonomy_art_desc": "Acalypha digynostachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants with a wide range of morphological diversity, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with distinctive floral structures and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy foliage and showy flowers. Its species is Acalypha digynostachya, a specific type of plant within the Acalypha genus, known for its unique floral structure and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Paraguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha digynostachya is primarily native to Argentina Northeast, Brazil South, Brazil Southeast, and Paraguay. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, well-drained soils and is often associated with open woodlands and shrublands. The species is known for its distinctive foliage and is sometimes used in traditional medicine. Its native range reflects its adaptation to the diverse ecosystems of South America.",
    "distribution_introduced_art_desc": "Acalypha digynostachya was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activities such as horticulture or accidental transport. The plant thrives in disturbed areas and can outcompete native vegetation. It is now found in various habitats across the islands, including coastal and lowland regions. Efforts are being made to control its spread to protect local ecosystems."
}
