{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha transvaalensis",
    "plant_slug": "acalypha-transvaalensis",
    "plant_name_scientific": "acalypha transvaalensis",
    "intro": "Acalypha transvaalensis, commonly known as Transvaal glorybower, is a shrub native to southern Africa. It is characterized by its striking, showy bracts that resemble flowers, often displaying vibrant red, orange, or yellow hues. The plant has palmate leaves with lobed margins, and it produces small, inconspicuous flowers that are clustered in dense inflorescences. It thrives in full sun to partial shade and is relatively drought-tolerant once established. Acalypha transvaalensis is often used in ornamental gardening for its visual appeal and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha transvaalensis is primarily native to southern Africa, particularly South Africa, Zimbabwe, and Mozambique. It is commonly found in grasslands, savannas, and rocky outcrops in these regions. This plant thrives in well-drained soils and is often associated with open habitats. It is also present in parts of eastern and central Africa, including Kenya and Tanzania. Due to its adaptability, it can be found in both coastal and inland areas within its native range.",
    "distribution_introduced_art_desc": "Acalypha transvaalensis was mainly introduced to urban and disturbed areas due to its rapid growth and adaptability. It is often found along roadsides, in vacant lots, and near human settlements. The plant has become a common weed in many parts of the world, including Africa, Asia, and the Americas. Its introduction is largely attributed to its ability to thrive in poor soil conditions and its capacity for vegetative propagation. However, it is considered invasive in some regions, where it can outcompete native vegetation."
}
