{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha medibracteata var. calcicola",
    "plant_slug": "acalypha-medibracteata-var-calcicola",
    "plant_name_scientific": "acalypha medibracteata var. calcicola",
    "intro": "Acalypha medibracteata var. calcicola, commonly known as the limestone acalypha, is a flowering plant native to arid and semi-arid regions. It is characterized by its distinctive, palmate leaves that are often covered in fine, silky hairs. The plant produces small, clustered flowers that range in color from white to pale pink. It is adapted to grow in limestone soils and can thrive in environments with limited water availability. This species is often used in xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha medibracteata var. calcicola is primarily native to the arid and semi-arid regions of southern Africa, particularly in Namibia and South Africa. This variant is adapted to grow in calcium-rich soils, which are common in the rocky and sandy landscapes of these areas. It is often found in shrublands and grasslands, thriving in environments with low rainfall and high sunlight exposure. The plant is well-suited to the harsh conditions of the Namib Desert and surrounding regions. Due to its specialized habitat, it is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Acalypha medibracteata var. calcicola was mainly introduced to areas with calcareous soils, typically found in arid or semi-arid regions. It thrives in environments with low rainfall and high mineral content in the soil. This plant is commonly found in rocky or gravelly habitats where other vegetation struggles to grow. Its introduction has been noted in parts of Australia, particularly in New South Wales and Queensland. It is often used for erosion control due to its hardy nature and ability to stabilize soil."
}
