{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha chirindica",
    "plant_slug": "acalypha-chirindica",
    "plant_name_scientific": "acalypha chirindica",
    "intro": "Acalypha chirindica, commonly known as the African spurge, is a shrub native to tropical Africa. It features palmate leaves with five to seven lobes, often tinged with red or purple at the base. The plant produces small, greenish-yellow flowers arranged in dense, spike-like clusters. Its seeds are encased in a fleshy, orange or red蒴果, which is attractive to birds. It is often used in ornamental gardening due to its vibrant foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha chirindica"
    },
    "taxonomy_art_desc": "Acalypha chirindica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with varied growth forms. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse structures and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha chirindica, a specific plant within the genus Acalypha, native to certain regions and known for its distinctive appearance and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Burundi",
        "DR Congo",
        "Malawi",
        "Mozambique",
        "Tanzania",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha chirindica is primarily native to Burundi, DR Congo, Malawi, Mozambique, Tanzania, Zambia, and Zimbabwe. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in open woodland and savanna habitats. The species is well adapted to the regional climate and soil conditions. It plays an important ecological role in its native range.",
    "distribution_introduced_art_desc": "Acalypha chirindica was mainly introduced to new habitats through human activities such as gardening and landscaping. It has been reported in several regions outside its native range, including parts of Southeast Asia and the Pacific Islands. The plant is often cultivated for its ornamental value due to its attractive foliage and flowering habits. Its introduction has raised concerns about its potential to become an invasive species in certain ecosystems. However, further research is needed to fully understand its impact on local biodiversity."
}
