{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brevicaulis",
    "plant_slug": "acalypha-brevicaulis",
    "plant_name_scientific": "acalypha brevicaulis",
    "intro": "Acalypha brevicaulis, commonly known as the narrow-leaved spurge, is a flowering plant native to tropical and subtropical regions. It is characterized by its slender, upright growth habit and small, ovate leaves that are often covered in fine hairs. The plant produces clusters of small, greenish-yellow flowers that are typically inconspicuous and borne in dense inflorescences. It thrives in moist, well-drained soils and is often found in woodland or disturbed habitats. Acalypha brevicaulis is valued for its ornamental foliage and is sometimes cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha brevicaulis"
    },
    "taxonomy_art_desc": "Acalypha brevicaulis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized structures such as stipules and unique leaf arrangements. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often produces latex. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and hairy foliage. Its species is Acalypha brevicaulis, a specific plant within the genus Acalypha, known for its short stature and distinctive foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brevicaulis is primarily native to Mexico Northeast and Mexico Southwest. This plant is commonly found in the arid and semi-arid regions of these areas. It thrives in rocky soils and dry landscapes typical of the region. The species is well adapted to the climate and environmental conditions of its native range. It is often seen in open habitats such as grasslands and disturbed areas.",
    "distribution_introduced_art_desc": "Acalypha brevicaulis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and compact growth habit. Despite its aesthetic appeal, it has since become invasive in certain regions, outcompeting native species for resources. The plant thrives in moist, well-drained soils and can spread rapidly through seed dispersal. Its introduction highlights the importance of monitoring non-native species to prevent ecological disruption."
}
