{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha levinii",
    "plant_slug": "acalypha-levinii",
    "plant_name_scientific": "acalypha levinii",
    "intro": "Acalypha levinii, commonly known as the velvetleaf or silverleaf acalypha, is a shrub native to tropical and subtropical regions of the Americas. It is characterized by its soft, fuzzy leaves that give it a velvety texture, often with a silver or grayish hue. The plant produces small, greenish-yellow flowers arranged in clusters, which are typically followed by three-lobed, maple-like seeds. It thrives in moist, well-drained soils and is often found in disturbed areas or along stream banks. Acalypha levinii is also known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha levinii"
    },
    "taxonomy_art_desc": "Acalypha levinii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Malpighiales, a group of flowering plants that includes many species with unique floral and vegetative features, such as the presence of stipules. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha levinii, a specific plant within the Acalypha genus, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha levinii is primarily native to Madagascar. This species is found throughout various regions of the island, including both coastal and inland areas. It thrives in a range of habitats, such as forests, grasslands, and disturbed soils. The plant is well adapted to the unique climate and soil conditions of Madagascar. Due to its restricted distribution, it is considered endemic to the country.",
    "distribution_introduced_art_desc": "Acalypha levinii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, shaded environments and can spread rapidly through vegetative propagation. Its introduction has led to ecological concerns, prompting management efforts to control its spread."
}
