{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mairei f. schneideriana",
    "plant_slug": "acalypha-mairei-f-schneideriana",
    "plant_name_scientific": "acalypha mairei f. schneideriana",
    "intro": "Acalypha mairei f. schneideriana, commonly known as the Schneider's beautyleaf, is a flowering plant native to Southeast Asia. It is characterized by its striking, colorful bracts that resemble flowers, which are actually modified leaves. The plant features palmate leaves with a velvety texture and a variety of hues, including red, orange, and yellow. It thrives in tropical climates and is often cultivated for its ornamental value. The species is part of the Euphorbiaceae family, known for its diverse and often striking foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mairei f. schneideriana is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Vietnam, and Cambodia. It is commonly found in lowland rainforests and secondary growth areas. This species thrives in humid, warm climates with high rainfall. It is often seen growing along riverbanks and in disturbed forested areas. Its native distribution is closely associated with the biodiversity hotspots of the Indochina Peninsula.",
    "distribution_introduced_art_desc": "Acalypha mairei f. schneideriana was mainly introduced to regions with warm, humid climates, particularly in tropical and subtropical areas. It thrives in well-drained soil and requires ample sunlight to flourish. This plant is often cultivated as an ornamental due to its attractive foliage and vibrant flowers. It has been introduced to several countries in Southeast Asia, including Thailand and Indonesia. However, its spread is limited due to its specific environmental requirements."
}
