{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha polystachya",
    "plant_slug": "acalypha-polystachya",
    "plant_name_scientific": "acalypha polystachya",
    "intro": "Acalypha polystachya, commonly known as the flame acanthus, is a striking tropical shrub native to Southeast Asia. It is characterized by its vibrant, feather-like bracts that range in color from red to orange, giving it a fiery appearance. The plant produces small, inconspicuous flowers that are clustered in dense, spike-like inflorescences. Its leaves are typically ovate to elliptical, with a smooth or slightly hairy surface. Acalypha polystachya is often cultivated for its ornamental value in gardens and as a houseplant due to its striking foliage and ease of care.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha polystachya"
    },
    "taxonomy_art_desc": "Acalypha polystachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes many species with specialized structures like stipules and clustered flowers. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide variety of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha polystachya, a specific plant within the genus Acalypha known for its distinctive appearance and ecological significance in its native habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Costa Rica",
        "Ecuador",
        "Honduras",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha polystachya is primarily native to Belize, Costa Rica, Ecuador, Honduras, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, and Nicaragua. This species is commonly found in tropical and subtropical regions across these countries. It thrives in moist, shaded environments such as forests and undergrowth. The plant is often associated with humid climates and is well adapted to the diverse ecosystems of Central America. Its native distribution reflects its preference for warm, humid habitats with adequate rainfall.",
    "distribution_introduced_art_desc": "Acalypha polystachya was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and rapid growth. It has since become naturalized in various coastal and disturbed areas, often forming dense thickets that can outcompete native vegetation. The plant's ability to thrive in a wide range of soil types and its tolerance to both drought and salt spray contribute to its invasive potential. It is considered a noxious weed in several regions, posing a threat to native ecosystems and agricultural lands. Management efforts typically involve mechanical removal and the use of herbicides to control its spread."
}
