{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha castroviejoi",
    "plant_slug": "acalypha-castroviejoi",
    "plant_name_scientific": "acalypha castroviejoi",
    "intro": "Acalypha castroviejoi, commonly known as the Castroviejo's spurge, is a species of flowering plant in the Euphorbiaceae family. It is native to Mexico and is characterized by its striking, colorful bracts that resemble flowers. The plant typically grows as an herbaceous perennial, often reaching heights of up to 1 meter. Its leaves are usually opposite and have a distinctive, velvety texture. Acalypha castroviejoi is valued in horticulture for its ornamental appeal and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha castroviejoi"
    },
    "taxonomy_art_desc": "Acalypha castroviejoi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malpighiales, a large and diverse order of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup-leaf,\" often characterized by their distinctive foliage. Its species is Acalypha castroviejoi, a specific type within the genus Acalypha, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha castroviejoi is primarily native to Colombia. This species is found in the tropical regions of the country, particularly in the Andean foothills and lowland areas. It thrives in humid, warm climates with well-drained soils. The plant is often associated with secondary forests and disturbed habitats. Its limited distribution highlights its ecological specificity and conservation importance.",
    "distribution_introduced_art_desc": "Acalypha castroviejoi was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activities such as agriculture and land clearing. It thrives in tropical and subtropical regions, where it can quickly colonize abandoned fields and roadsides. This plant is known for its rapid growth and ability to spread through both seeds and vegetative propagation. Its introduction has led to concerns about its potential to become invasive in certain ecosystems. Due to its adaptability, it is now found in several countries across the Americas."
}
