{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha eastmostpointensis",
    "plant_slug": "acalypha-eastmostpointensis",
    "plant_name_scientific": "acalypha eastmostpointensis",
    "intro": "Acalypha eastmostpointensis, commonly known as Eastmostpoint gloryleaf, is a species of flowering plant native to the tropical regions of eastern Africa. It belongs to the Euphorbiaceae family, which includes many plants with unique floral structures. The plant is characterized by its striking, palmate leaves that are often brightly colored, ranging from green to reddish hues. It produces small, clustered flowers that are typically yellow or green, surrounded by modified leaves called bracts. This species is valued for its ornamental appeal and is often cultivated in gardens and greenhouses for its visual interest.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha eastmostpointensis"
    },
    "taxonomy_art_desc": "Acalypha eastmostpointensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants that includes species with a wide range of morphological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive flowers and often milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupseed,\" characterized by their showy inflorescences. Its species is Acalypha eastmostpointensis, a specific type of plant within the genus Acalypha, known for its unique characteristics and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha eastmostpointensis is primarily native to Taiwan. This species is found in the wild within the island's diverse ecosystems. It thrives in moist, tropical conditions typical of Taiwan's climate. The plant is commonly observed in forested areas and along stream banks. Its native distribution is limited to Taiwan, where it plays a role in local biodiversity.",
    "distribution_introduced_art_desc": "Acalypha eastmostpointensis was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It thrives in environments with moderate to high light exposure and is often found in disturbed soils near human activity. This plant has been reported in several countries in the Pacific and Southeast Asia, where it has established itself in both natural and cultivated settings. Its introduction is largely attributed to ornamental horticulture and accidental dispersal through trade. However, it is not considered invasive in most regions where it has been introduced."
}
