{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neeana",
    "plant_slug": "acalypha-neeana",
    "plant_name_scientific": "acalypha neeana",
    "intro": "Acalypha neeana, commonly known as the velvetleaf or red veined strobilanthes, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking, velvety leaves with deep red veins. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in tropical and subtropical climates, often found in moist, shaded environments. Acalypha neeana is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha neeana"
    },
    "taxonomy_art_desc": "Acalypha neeana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a true root system and complex structures like leaves and vascular tissues. Its class is Equisetopsida, which comprises ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha neeana, a specific plant within the genus Acalypha, known for its unique morphological traits and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neeana is primarily native to Bolivia. It is found in the eastern regions of the country, particularly in the departments of Beni and Pando. This plant thrives in tropical and subtropical environments, often in moist, shaded areas within the rainforest. It is commonly associated with secondary growth and disturbed habitats. Its native distribution is largely confined to these specific regions within Bolivia.",
    "distribution_introduced_art_desc": "Acalypha neeana was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various growing conditions. It is commonly found in tropical and subtropical regions where it is cultivated for its aesthetic value. The plant has been reported in several countries, including parts of the United States, Australia, and Southeast Asia. However, it is not considered invasive in most of these regions. Its distribution is largely limited to human-modified environments rather than natural ecosystems."
}
