{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha stuhlmannii",
    "plant_slug": "acalypha-stuhlmannii",
    "plant_name_scientific": "acalypha stuhlmannii",
    "intro": "Acalypha stuhlmannii, commonly known as the velvetleaf or silverleaf. It is a shrub native to tropical and subtropical regions of Africa, characterized by its hairy, silver-green foliage. The plant produces small, greenish-white flowers arranged in clusters, which are followed by distinctive, three-lobed seed capsules. It thrives in well-drained soil and full sun, making it suitable for ornamental gardening. Acalypha stuhlmannii is also known for its adaptability and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha stuhlmannii is primarily native to tropical and subtropical regions of Africa, including countries such as Tanzania, Kenya, and Uganda. It is commonly found in moist, shaded areas within forests and along stream banks. This species thrives in humid climates with well-drained soils. It is also occasionally reported in parts of southern Arabia and the island of Madagascar. Acalypha stuhlmannii is often used in traditional medicine and as an ornamental plant due to its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha stuhlmannii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners seeking exotic species for landscaping. The plant has since become naturalized in certain areas, spreading through both seed dispersal and vegetative propagation. Its introduction has raised concerns due to its potential to outcompete native flora in disturbed habitats. Despite its ornamental value, its invasive potential has led to efforts to control its spread in some regions."
}
