{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha virginica var. intermedia",
    "plant_slug": "acalypha-virginica-var-intermedia",
    "plant_name_scientific": "acalypha virginica var. intermedia",
    "intro": "Acalypha virginica var. intermedia, commonly known as the woollyleaf ironweed, is a herbaceous perennial native to the southeastern United States. It features striking, fuzzy, silver-green foliage that adds visual interest to gardens. The plant produces clusters of small, pinkish-white flowers in late summer, which attract pollinators like bees and butterflies. It thrives in moist, well-drained soils and prefers partial to full sun. Its unique appearance and ecological benefits make it a valuable addition to native plant gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha virginica var. intermedia is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and North Carolina. It thrives in wetland habitats, particularly in marshes, swamps, and along the edges of ponds and streams. This variant is commonly found in coastal areas and is adapted to fluctuating water levels and moist soil conditions. It is often associated with disturbed sites and can be found in both natural and human-altered environments. The plant plays an important role in supporting local wildlife and maintaining ecological balance in its native range.",
    "distribution_introduced_art_desc": "Acalypha virginica var. intermedia was mainly introduced to the eastern and central United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant thrives in moist to wet soils and is often seen in riparian zones. Its rapid growth and ability to spread through seeds make it a common invasive species in these regions. It is sometimes used as a ornamental plant due to its attractive foliage."
}
