{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pilocardia",
    "plant_slug": "acalypha-pilocardia",
    "plant_name_scientific": "acalypha pilocardia",
    "intro": "Acalypha pilocardia, commonly known as the velvetleaf or silky ironwood, is a shrub or small tree native to tropical and subtropical regions of the Americas. It is characterized by its thick, velvety leaves that are covered in fine, soft hairs, giving it a distinctive texture. The plant produces small, greenish flowers that are clustered in dense inflorescences, often surrounded by bracts that are brightly colored. Its woody stems are sturdy and can grow quite tall, making it a hardy species adapted to various soil types. Acalypha pilocardia is often used in ornamental horticulture for its attractive foliage and resilience in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pilocardia is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in lowland areas with moist, warm climates. This plant thrives in disturbed habitats such as roadside verges, forest edges, and open woodlands. It is also present in parts of Indonesia and the Philippines. Its distribution is closely linked to areas with high humidity and well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha pilocardia was mainly introduced to the Pacific Islands as an ornamental plant due to its attractive foliage and adaptability to tropical climates. It was initially brought for horticultural purposes but has since become naturalized in several regions. The plant's rapid growth and ability to thrive in disturbed soils have led to its spread beyond cultivated areas. It is now considered a potential invasive species in some island ecosystems. Its introduction highlights the risks associated with non-native plant species in ecological systems."
}
