{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha morfontanensis",
    "plant_slug": "acalypha-morfontanensis",
    "plant_name_scientific": "acalypha morfontanensis",
    "intro": "Acalypha morfontanensis, commonly known as the flame bush, is a shrub native to tropical regions of Africa. It is characterized by its striking, bright red bracts that resemble flowers, which are actually modified leaves. The plant produces small, yellowish-green flowers that are clustered in dense inflorescences. Its leaves are typically ovate or elliptical with a smooth or slightly hairy surface. Acalypha morfontanensis is often cultivated for its ornamental value in gardens and as a landscape plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha morfontanensis is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid and warm climates with high rainfall. It is often seen growing along riverbanks and in swampy habitats. Its native distribution is closely linked to the diverse ecosystems of the region's tropical forests.",
    "distribution_introduced_art_desc": "Acalypha morfontanensis was mainly introduced to urban and disturbed areas due to its rapid growth and adaptability to various soil types. It is commonly found along roadsides, construction sites, and in abandoned lots where it can thrive in poor soil conditions. This plant is often considered an invasive species in many regions because of its ability to outcompete native vegetation. Its spread is facilitated by its prolific seed production and ability to regrow from cut stems. However, it is also valued for its ornamental foliage and is sometimes cultivated in gardens."
}
