{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis f. decumbens",
    "plant_slug": "acalypha-communis-f-decumbens",
    "plant_name_scientific": "acalypha communis f. decumbens",
    "intro": "Acalypha communis f. decumbens, commonly known as the prostrate spurge, is a low-growing herbaceous plant native to tropical and subtropical regions. It features succulent, fleshy stems that often lie close to the ground, forming a dense mat. The leaves are typically ovate to elliptical, with smooth or slightly hairy surfaces, and they often have a waxy texture. Small, greenish-white flowers are borne in clusters, and the plant produces tiny, spherical berries that are often red or yellow when mature. It is well adapted to humid environments and is often found in disturbed soils or along roadsides.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis f. decumbens is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with disturbed habitats like roadside verges and abandoned fields. It is also present in parts of southern China and northern Australia. Its native range extends to the Pacific Islands as well, where it is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha communis f. decumbens was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The introduction occurred in the 19th century during the colonial expansion period. It has since naturalized in certain regions, particularly in coastal and disturbed areas. However, it is not considered invasive and poses minimal ecological risk in its introduced range."
}
