{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha languida",
    "plant_slug": "acalypha-languida",
    "plant_name_scientific": "acalypha languida",
    "intro": "Acalypha languida, commonly known as the softleaf ironweed, is a herbaceous plant native to tropical and subtropical regions of the Americas. It belongs to the Euphorbiaceae family, which is known for its diverse and often strikingly ornamental species. The plant features alternate, ovate to lanceolate leaves that are typically soft and hairy, giving it its common name. Its flowers are small and clustered in yellowish to greenish cyathia, typical of the Euphorbiaceae family. Acalypha languida is often cultivated for its attractive foliage and is relatively easy to grow in well-drained soil with partial to full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha languida is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, shaded environments, often found in lowland forests and along stream banks. This species is also present in parts of northern Australia and the Pacific Islands. It is commonly found in areas with rich, moist soil and high humidity. Its distribution is closely associated with tropical rainforests and secondary growth habitats.",
    "distribution_introduced_art_desc": "Acalypha languida was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed areas, including roadsides, abandoned fields, and urban environments. The plant thrives in moist, well-drained soils and can tolerate a range of light conditions. Its rapid growth and ability to spread through seeds make it a potential invasive species in certain regions. However, it is not considered a major threat in its introduced range due to its limited spread and manageable growth habits."
}
