{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pittieri",
    "plant_slug": "acalypha-pittieri",
    "plant_name_scientific": "acalypha pittieri",
    "intro": "Acalypha pittieri, commonly known as the golden mistflower, is a flowering plant native to Central America and the Caribbean. It belongs to the Euphorbiaceae family, which is known for its diverse and often unique floral structures. The plant is characterized by its showy, yellow bracts that resemble flowers, which are actually modified leaves. It typically grows in moist, shaded environments and is often found in tropical and subtropical regions. Acalypha pittieri is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant foliage and unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pittieri"
    },
    "taxonomy_art_desc": "Acalypha pittieri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral and vegetative features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of morphological diversity and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"spurge,\" characterized by their often hairy foliage and showy inflorescences. Its species is Acalypha pittieri, a specific plant within the genus Acalypha, known for its unique morphological traits and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Central American Pacific Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pittieri is primarily native to the Central American Pacific Islands. This species is found in the tropical regions of these islands, where it thrives in humid and warm climates. It is commonly associated with coastal and lowland habitats. The plant is known for its distinctive foliage and is often found in secondary growth areas. Its distribution is limited to specific islands within this region.",
    "distribution_introduced_art_desc": "Acalypha pittieri was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there by humans for its aesthetic value, such as its vibrant leaves and unique growth form. However, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid spread has raised concerns among conservationists and land managers. Efforts are being made to control its population to prevent further ecological damage."
}
