{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pallescens",
    "plant_slug": "acalypha-pallescens",
    "plant_name_scientific": "acalypha pallescens",
    "intro": "Acalypha pallescens, commonly known as the silverleaf or silverleaf mallow, is a flowering plant native to tropical and subtropical regions of the Americas. It is characterized by its distinctive silver-gray foliage, which gives it its common name, and its showy, pink to red bracts that resemble petals. The plant typically grows as an herbaceous annual or perennial, often reaching heights of up to 1 meter. Its flowers are small and clustered in inflorescences, and it thrives in well-drained soils with full sun exposure. Acalypha pallescens is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pallescens"
    },
    "taxonomy_art_desc": "Acalypha pallescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and citrus. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features, such as the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with various growth forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their hairy leaves and showy flowers. Its species is Acalypha pallescens, a specific type of Acalypha known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Jamaica"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pallescens is primarily native to Jamaica. It is commonly found in the wet tropical regions of the island. This plant thrives in moist, shaded environments, often growing along stream banks and in forest understories. It is known for its distinctive foliage and is sometimes used in local horticulture. Its distribution is largely restricted to Jamaica, where it plays a role in the native flora.",
    "distribution_introduced_art_desc": "Acalypha pallescens was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in wet forest habitats. The plant spreads rapidly through seeds dispersed by birds and water. Its introduction has led to concerns about ecological impact and habitat degradation."
}
