{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha integrifolia var. parvifolia",
    "plant_slug": "acalypha-integrifolia-var-parvifolia",
    "plant_name_scientific": "acalypha integrifolia var. parvifolia",
    "intro": "Acalypha integrifolia var. parvifolia, commonly known as the small-leaved gloryflower, is a tropical shrub native to Southeast Asia. It is characterized by its smooth, dark green leaves that are entire and often have a slight sheen. The plant produces clusters of small, bright yellow flowers that are borne on short peduncles. It thrives in moist, well-drained soils and prefers partial to full sun. This variant is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha integrifolia var. parvifolia is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant is often associated with disturbed habitats, such as roadsides, riverbanks, and secondary forests. It thrives in humid climates and is sometimes cultivated for its ornamental value due to its attractive foliage. The plant is also known to occur in parts of Australia, particularly in northern regions with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha integrifolia var. parvifolia was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. This variant is known for its small, lance-shaped leaves and is often used in garden designs. It has also been introduced to some areas as a potential invasive species, raising concerns about its ecological impact. Despite its ornamental appeal, its spread outside of controlled environments requires careful management."
}
