{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha phyllonomifolia",
    "plant_slug": "acalypha-phyllonomifolia",
    "plant_name_scientific": "acalypha phyllonomifolia",
    "intro": "Acalypha phyllonomifolia, commonly known as the velvetleaf or golden leaf plant, is a shrub native to tropical regions of Asia. It is characterized by its striking, velvety leaves that range in color from green to reddish-brown. The plant produces small, pale yellow flowers that are clustered in dense inflorescences. Its leaves are often used in traditional medicine for their purported health benefits. Acalypha phyllonomifolia is also valued as an ornamental plant due to its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha phyllonomifolia"
    },
    "taxonomy_art_desc": "Acalypha phyllonomifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized structures such as stipules and unique leaf arrangements. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha phyllonomifolia, a specific type within the genus Acalypha, distinguished by its unique leaf structure and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha phyllonomifolia is primarily native to New Guinea. It is found in the tropical regions of this island, particularly in the lowland and montane forests. The plant thrives in humid and shaded environments, often growing along stream banks and in forest understories. It is a member of the Euphorbiaceae family and is known for its distinctive foliage. Due to its restricted range, it is considered a rare and endemic species within New Guinea.",
    "distribution_introduced_art_desc": "Acalypha phyllonomifolia was mainly introduced to ornamental horticulture and tropical landscaping due to its attractive foliage and unique growth habit. It is commonly cultivated in regions with warm climates for its aesthetic value in gardens and public spaces. The plant is often used as a ground cover or in containers because of its compact size and vibrant leaf colors. However, it has raised concerns in some areas due to its potential to become invasive if not properly managed. Its introduction has led to increased research on its ecological impact and control methods."
}
