{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha dewevrei",
    "plant_slug": "acalypha-dewevrei",
    "plant_name_scientific": "acalypha dewevrei",
    "intro": "Acalypha dewevrei, commonly known as the African copperleaf, is a shrub native to tropical Africa. It is characterized by its striking, copper-colored leaves that turn reddish in the shade. The plant produces small, greenish-white flowers arranged in clusters, which are followed by spherical, woody fruits. It thrives in moist, well-drained soils and is often found in forest understories. Acalypha dewevrei is valued for its ornamental appeal and has traditional uses in some African cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha dewevrei"
    },
    "taxonomy_art_desc": "Acalypha dewevrei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants often found in tropical and subtropical regions, characterized by their distinctive leaf shapes and often showy inflorescences. Its species is Acalypha dewevrei, a specific type within the genus Acalypha, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "DR Congo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha dewevrei is primarily native to the Democratic Republic of the Congo. It is found in the tropical rainforest regions of this country. The plant thrives in humid and warm climates with high rainfall. It is commonly found in lowland areas and along riverbanks. Its distribution is limited to specific ecological zones within DR Congo.",
    "distribution_introduced_art_desc": "Acalypha dewevrei was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and coastal areas. It thrives in tropical and subtropical climates, often spreading through seeds dispersed by wind, water, or animals. This plant is considered invasive in some regions due to its rapid growth and ability to outcompete native vegetation. It is commonly found in parts of Southeast Asia, the Pacific Islands, and the Caribbean. Its distribution is largely influenced by human activity and environmental conditions that favor its establishment."
}
