{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha peduncularis var. crassa",
    "plant_slug": "acalypha-peduncularis-var-crassa",
    "plant_name_scientific": "acalypha peduncularis var. crassa",
    "intro": "Acalypha peduncularis var. crassa, commonly known as the broadleaf spurge, is a perennial herb native to tropical regions of Africa and Asia. It features succulent, fleshy leaves that are typically broad and ovate, often with a waxy texture. The plant produces small, greenish-yellow flowers arranged in clusters, which are borne on slender, branching stalks. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Due to its rapid growth and spreading habit, it can become invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha peduncularis var. crassa is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This variant thrives in open woodlands, disturbed soils, and near water bodies. It is often seen growing along riverbanks and in secondary forests. Its native range extends to parts of Oceania, including Papua New Guinea and some Pacific islands.",
    "distribution_introduced_art_desc": "Acalypha peduncularis var. crassa was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, agricultural fields, and abandoned sites. It thrives in tropical and subtropical climates, often spreading rapidly due to its prolific seed production. This plant is considered an invasive species in many regions where it has been introduced, outcompeting native vegetation. Its ability to grow in poor soil conditions makes it a common weed in both urban and rural environments. However, it also provides habitat and food for certain wildlife species, contributing to local biodiversity."
}
