{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula var. chathamensis",
    "plant_slug": "acalypha-parvula-var-chathamensis",
    "plant_name_scientific": "acalypha parvula var. chathamensis",
    "intro": "Acalypha parvula var. chathamensis, commonly known as the Chatham Island false nettle, is a small shrub native to the Chatham Islands of New Zealand. It features opposite, ovate to elliptic leaves that are usually smooth or slightly hairy. The plant produces small, greenish-white flowers in clusters, which are followed by three-lobed, papery bracts that give it a distinctive appearance. It thrives in coastal habitats and is adapted to the harsh conditions of its native environment. Due to its limited distribution, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha parvula"
    },
    "taxonomy_art_desc": "Acalypha parvula var. chathamensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their distinctive bracts and flowers. Its species is Acalypha parvula, a specific type within the genus Acalypha, which is known for its small size and is a variant found in specific geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula var. chathamensis is primarily native to the Galápagos Islands. This rare variant of the species is found exclusively in the unique ecosystems of this archipelago. It thrives in the volcanic soils and varied microclimates of the islands. The plant is adapted to the specific environmental conditions of the Galápagos, making it an important part of the local flora. Its limited distribution highlights its ecological significance and vulnerability.",
    "distribution_introduced_art_desc": "Acalypha parvula var. chathamensis was mainly introduced to New Zealand, where it has become naturalized in certain regions. It is commonly found in coastal and lowland areas, particularly in the Chatham Islands. This plant thrives in disturbed soils and is often associated with human-modified environments. Its introduction is believed to have occurred through accidental transport by humans, likely as a contaminant in soil or plant material. Due to its adaptability, it has spread beyond its original introduction sites, raising concerns about its ecological impact."
}
