{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hernandiifolia var. genuina",
    "plant_slug": "acalypha-hernandiifolia-var-genuina",
    "plant_name_scientific": "acalypha hernandiifolia var. genuina",
    "intro": "Acalypha hernandiifolia var. genuina, commonly known as the velvetleaf or velvetleaf ironwood, is a species of flowering plant in the Euphorbiaceae family. It is native to tropical regions of Central America and northern South America. The plant is characterized by its striking, velvety leaves that are often a deep red or purple in color, especially when mature. It produces small, clustered flowers that are typically green or yellowish, and it is often cultivated for ornamental purposes. The plant is also valued for its hard, durable wood, which has been used in traditional crafts and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hernandiifolia var. genuina is primarily native to the tropical regions of Southeast Asia, including parts of Malaysia, Indonesia, and the Philippines. This species thrives in humid, warm climates and is commonly found in lowland forests and disturbed areas. It is often associated with secondary growth and can be seen in swampy or wetland environments. The plant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its distribution is closely linked to the ecological conditions of the region, making it a characteristic species of the area.",
    "distribution_introduced_art_desc": "Acalypha hernandiifolia var. genuina was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the late 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. The species has since become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. It is often found in disturbed habitats such as roadsides, streambanks, and coastal areas. Despite its ornamental value, it has raised concerns due to its potential invasive tendencies in certain ecosystems."
}
