{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha decumbens var. genuina",
    "plant_slug": "acalypha-decumbens-var-genuina",
    "plant_name_scientific": "acalypha decumbens var. genuina",
    "intro": "Acalypha decumbens var. genuina, commonly known as the silverleaf ironweed, is a low-growing perennial plant native to the southeastern United States. It features delicate, fern-like leaves with a silvery underside, which give it its common name. The plant produces small, clustered flowers that range in color from white to pink, typically blooming in late spring to early summer. It thrives in moist, well-drained soils and is often found in shaded to partially shaded environments. Its ornamental value makes it a popular choice for native plant gardens and restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha decumbens var. genuina is primarily native to the Caribbean region, including parts of the Greater and Lesser Antilles. It is commonly found in tropical and subtropical areas, particularly in coastal and lowland habitats. This variant thrives in humid environments with well-drained soils, often growing in shaded or semi-shaded areas. It is particularly associated with disturbed sites and can be found in gardens and along roadsides in its native range. The plant is also occasionally cultivated for its ornamental value due to its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha decumbens var. genuina was mainly introduced to the Hawaiian Islands. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred primarily during the late 19th to early 20th century. It has since become naturalized in certain areas, particularly in disturbed habitats and along stream banks. However, its spread is limited compared to other invasive species in the region."
}
