{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha caperonioides var. galpinii",
    "plant_slug": "acalypha-caperonioides-var-galpinii",
    "plant_name_scientific": "acalypha caperonioides var. galpinii",
    "intro": "Acalypha caperonioides var. galpinii, commonly known as the Cape York beauty, is a flowering plant native to parts of Australia. It belongs to the Euphorbiaceae family and is characterized by its striking, palmate leaves that are often brightly colored. The plant produces small, clustered flowers that are usually green or yellow, surrounded by modified leaves called bracts. It thrives in moist, well-drained soils and is often found in coastal or wetland areas. Due to its ornamental value, it is occasionally cultivated in gardens, though it can be invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha caperonioides var. galpinii is primarily native to the coastal regions of southern Africa, particularly in South Africa and Namibia. This variant is commonly found in sandy or rocky coastal habitats along the Atlantic coast. It thrives in areas with well-drained soils and is often associated with dune environments. The plant is adapted to the harsh, saline conditions typical of these coastal zones. It is an important component of the local flora and is often used in coastal stabilization efforts.",
    "distribution_introduced_art_desc": "Acalypha caperonioides var. galpinii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The introduction occurred in the late 19th or early 20th century, during a period of increased botanical exchange between Europe and the Pacific. It has since become naturalized in some regions, particularly in the North Island. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
