{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha venosa",
    "plant_slug": "acalypha-venosa",
    "plant_name_scientific": "acalypha venosa",
    "intro": "Acalypha venosa, commonly known as the velvetleaf or red veined plant, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, multicolored leaves that often feature red, purple, and green veins. The plant belongs to the family Euphorbiaceae and is known for its showy, small greenish-yellow flowers. Acalypha venosa is often cultivated as an ornamental plant due to its vibrant foliage. It thrives in warm, humid climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha venosa is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is also found in parts of tropical Africa, including Nigeria and Sudan. This plant thrives in moist, shaded environments and is commonly found in rainforests and along riverbanks. It is known for its ornamental value due to its vibrant leaves and is sometimes cultivated as a decorative plant. Its native distribution reflects its adaptation to humid tropical climates.",
    "distribution_introduced_art_desc": "Acalypha venosa was mainly introduced to ornamental horticulture due to its attractive foliage and unique leaf patterns. It is commonly cultivated as a decorative plant in gardens and indoor spaces. The plant thrives in warm, humid climates and is often used in landscaping for its aesthetic appeal. However, it has also been reported as an invasive species in some regions where it can outcompete native vegetation. Its rapid growth and ability to spread through vegetative propagation make it a concern in certain ecosystems."
}
