{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha zeyheri",
    "plant_slug": "acalypha-zeyheri",
    "plant_name_scientific": "acalypha zeyheri",
    "intro": "Acalypha zeyheri, commonly known as the silverleaf acalypha, is a perennial shrub native to southern Africa. It is characterized by its striking silver-gray foliage, which is covered in fine, soft hairs. The plant produces small, inconspicuous greenish-white flowers arranged in clusters at the ends of its branches. It thrives in full sun to partial shade and is drought-tolerant once established. Acalypha zeyheri is often used in ornamental gardening for its attractive leaves and low maintenance requirements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha zeyheri"
    },
    "taxonomy_art_desc": "Acalypha zeyheri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some with toxic properties. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cottontree,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha zeyheri, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha zeyheri is primarily native to the Cape Provinces of South Africa. This species is commonly found in coastal and inland areas within this region. It thrives in a variety of habitats, including rocky outcrops and sandy soils. The plant is well adapted to the Mediterranean climate of the Cape Provinces. Its natural distribution is largely confined to this geographic area.",
    "distribution_introduced_art_desc": "Acalypha zeyheri was mainly introduced to urban and disturbed areas due to its rapid growth and adaptability. It is commonly found along roadsides, in vacant lots, and near construction sites. The plant thrives in nutrient-rich soils and can tolerate a wide range of environmental conditions. Its spread is often facilitated by human activity, such as dumping or accidental transport. However, it is considered a weed in some regions where it outcompetes native vegetation."
}
