{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha paniculata",
    "plant_slug": "acalypha-paniculata",
    "plant_name_scientific": "acalypha paniculata",
    "intro": "Acalypha paniculata, commonly known as the flame bush, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is a shrub or small tree that can grow up to 6 meters in height, characterized by its palmate leaves and showy, clustered inflorescences. The plant produces small, yellowish-white flowers that are clustered in paniculate arrangements, giving it its scientific name. Its foliage is often used in traditional medicine, and it is also valued for its ornamental appeal in gardens. Acalypha paniculata thrives in full sun to partial shade and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha paniculata"
    },
    "taxonomy_art_desc": "Acalypha paniculata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Malpighiales, a large group of flowering plants that includes species with diverse morphologies and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contain milky sap. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha paniculata, a specific plant within the genus Acalypha characterized by its panicle-like inflorescences and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Benin",
        "Burundi",
        "Cameroon",
        "Central African Republic",
        "Chad",
        "Congo",
        "DR Congo",
        "Equatorial Guinea",
        "Eritrea",
        "Ethiopia",
        "Ghana",
        "Gulf of Guinea Is.",
        "India",
        "Ivory Coast",
        "Jawa",
        "Kenya",
        "Lesser Sunda Is.",
        "Liberia",
        "Malawi",
        "Maldives",
        "Mozambique",
        "Nigeria",
        "Rwanda",
        "Saudi Arabia",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Tanzania",
        "Togo",
        "Uganda",
        "Yemen",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha paniculata is primarily native to Angola, Benin, Burundi, Cameroon, Central African Republic, Chad, Congo, DR Congo, Equatorial Guinea, Eritrea, Ethiopia, Ghana, Gulf of Guinea Is., India, Ivory Coast, Jawa, Kenya, Lesser Sunda Is., Liberia, Malawi, Maldives, Mozambique, Nigeria, Rwanda, Saudi Arabia, Sri Lanka, Sudan-South Sudan, Tanzania, Togo, Uganda, Yemen, and Zimbabwe. This species is commonly found in tropical and subtropical regions across these countries. It thrives in a variety of habitats, including moist forests, grasslands, and disturbed areas. The plant is known for its ornamental value and is sometimes cultivated for its foliage. Its wide distribution suggests a high adaptability to different environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha paniculata was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage and showy inflorescences. It has been widely cultivated in gardens and landscapes across Southeast Asia, the Pacific Islands, and parts of the Americas. The plant is often used in hedges, borders, and as a ground cover because of its rapid growth and adaptability to various soil types. However, it has also become an invasive species in some areas, outcompeting native vegetation and altering local ecosystems. Its introduction has led to increased management efforts to control its spread in non-native habitats."
}
