{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fruticosa var. eglandulosa",
    "plant_slug": "acalypha-fruticosa-var-eglandulosa",
    "plant_name_scientific": "acalypha fruticosa var. eglandulosa",
    "intro": "Acalypha fruticosa var. eglandulosa, commonly known as the woolly croton, is a shrub native to tropical regions of the Americas. It is characterized by its dense, glandular hairs covering the stems and leaves, giving it a distinctive, fuzzy appearance. The leaves are typically ovate to lanceolate, with a dark green upper surface and a lighter underside. The plant produces small, yellowish flowers in clusters, followed by orange or red berries that are often used in traditional medicine. It thrives in moist, shady environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha fruticosa"
    },
    "taxonomy_art_desc": "Acalypha fruticosa var. eglandulosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive vascular systems. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and a wide variety of morphological features. Its order is Malpighiales, a large and diverse order of flowering plants that includes many economically important species such as cotton and coffee. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and a wide range of growth forms. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cudweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha fruticosa, a shrub-like plant known for its branching structure and variable leaf shapes, with the varietal form eglandulosa distinguished by the absence of glands on its leaves.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Burundi",
        "Ethiopia",
        "Kenya",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fruticosa var. eglandulosa is primarily native to Burundi, Ethiopia, Kenya, Sudan-South Sudan, Tanzania, and Uganda. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments, often growing in forest understories or along riverbanks. The species is known for its ornamental value and is sometimes cultivated for its vibrant foliage. Its native distribution reflects its adaptation to the diverse ecological conditions of East and Central Africa.",
    "distribution_introduced_art_desc": "Acalypha fruticosa var. eglandulosa was mainly introduced to Hawaii, where it has become naturalized in disturbed habitats such as roadsides, streambanks, and open woodlands. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. The plant spreads through its prolific seed production and can form dense stands that alter local ecosystems. It is often found in low elevations with well-drained soils. Despite its invasive nature, it is sometimes used in horticulture for its ornamental value."
}
