{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha decidua",
    "plant_slug": "acalypha-decidua",
    "plant_name_scientific": "acalypha decidua",
    "intro": "Acalypha decidua, commonly known as the desert mallow, is a flowering plant native to arid and semi-arid regions of Africa, the Middle East, and parts of Asia. It is a shrub or small tree that typically grows to a height of 1-3 meters, characterized by its thick, waxy leaves that help reduce water loss in dry environments. The plant produces small, clustered flowers that are usually pink or purple, which bloom during the rainy season. Its root system is deep and extensive, allowing it to access groundwater and survive prolonged droughts. Acalypha decidua is also valued for its ornamental appeal and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha decidua is primarily native to parts of Africa, specifically South Africa, where it is found in the eastern and southern regions. It thrives in arid and semi-arid environments, often growing in rocky soils and along riverbanks. This plant is commonly found in the Karoo region and other dry areas of the country. It is adapted to withstand drought conditions and can survive in harsh, low-nutrient soils. Acalypha decidua plays a role in local ecosystems by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acalypha decidua was mainly introduced to areas with disturbed soils and arid conditions, often as a result of human activity. It thrives in environments with low rainfall and poor soil quality, making it a common weed in agricultural fields and along roadsides. The plant spreads rapidly through its prolific seed production and ability to establish itself in fragmented habitats. Its introduction has led to competition with native species, altering local ecosystems in some regions. Despite its invasive tendencies, it is sometimes used in restoration projects due to its hardiness and quick growth."
}
