{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis var. saltensis",
    "plant_slug": "acalypha-communis-var-saltensis",
    "plant_name_scientific": "acalypha communis var. saltensis",
    "intro": "Acalypha communis var. saltensis, commonly known as Saltgrass, is a flowering plant native to arid and semi-arid regions. It is characterized by its slender, grass-like leaves and small, inconspicuous flowers that typically appear in spikes. The plant is adapted to thrive in saline and drought-prone soils, making it a hardy species in challenging environments. Its growth habit is usually low and spreading, forming dense mats that help prevent soil erosion. It plays an important ecological role in stabilizing soils and providing habitat for small wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis var. saltensis is primarily native to the southern United States, specifically Texas and New Mexico. It is commonly found in arid and semi-arid regions, growing in sandy or rocky soils. This variety thrives in environments with full sun exposure and is often seen in disturbed areas such as roadsides and fields. It is well adapted to drought conditions and can tolerate high temperatures. The plant is also known to occur in parts of northern Mexico.",
    "distribution_introduced_art_desc": "Acalypha communis var. saltensis was mainly introduced to the southern United States, particularly in Texas and Arizona. It was brought in for its ornamental value due to its vibrant red bracts and compact growth habit. The plant thrives in well-drained soils and full sun, making it suitable for xeriscaping and drought-tolerant gardens. However, it has become invasive in some areas, outcompeting native vegetation. Its spread has raised concerns among land managers and conservationists."
}
