{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha karsteniana",
    "plant_slug": "acalypha-karsteniana",
    "plant_name_scientific": "acalypha karsteniana",
    "intro": "Acalypha karsteniana, commonly known as the velvetleaf or karsten's spurge, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, colorful bracts that range from red to purple, which are often mistaken for flowers. The plant has simple, opposite leaves that are usually covered in fine hairs, giving it a soft, velvety texture. It produces small, inconspicuous yellow flowers that are clustered in dense inflorescences. Acalypha karsteniana is often cultivated as an ornamental plant due to its vibrant foliage and unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha karsteniana is primarily native to tropical and subtropical regions of Central and South America. It is found in countries such as Mexico, Guatemala, Belize, Honduras, Nicaragua, Costa Rica, and Panama. This plant thrives in moist, shaded environments, often in forests or along stream banks. It is commonly found in lowland areas but can also occur in higher elevations up to around 1,000 meters. Its distribution is closely linked to humid climates with well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha karsteniana was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique growth habit. It is commonly found in tropical and subtropical regions where it is cultivated for its aesthetic value. The plant's introduction has led to its establishment in some non-native areas, raising concerns about its potential invasiveness. It prefers well-drained soil and partial to full sunlight, making it adaptable to various garden environments. However, its spread outside of controlled cultivation requires monitoring to prevent ecological disruption."
}
