{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha striolata",
    "plant_slug": "acalypha-striolata",
    "plant_name_scientific": "acalypha striolata",
    "intro": "Acalypha striolata, commonly known as the red-veined nettle, is a flowering plant native to tropical and subtropical regions. It belongs to the Euphorbiaceae family and is characterized by its striking red veins on its heart-shaped leaves. The plant produces small, inconspicuous flowers that are clustered in dense inflorescences. It thrives in moist, shady environments and is often found in wetlands or along stream banks. Its ornamental value comes from its vibrant foliage, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha striolata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often seen in forest understories or near water bodies. It is also native to parts of Oceania, including Papua New Guinea and some Pacific islands. Acalypha striolata is known for its striking red and green foliage, making it a popular ornamental plant in horticulture.",
    "distribution_introduced_art_desc": "Acalypha striolata was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activity, such as accidental transport in soil or plant material. The plant thrives in disturbed areas and can outcompete native vegetation. It is commonly found in coastal and lowland habitats across the islands. Due to its rapid growth and ability to spread, it poses a significant threat to local ecosystems."
}
