{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula var. reniformis",
    "plant_slug": "acalypha-parvula-var-reniformis",
    "plant_name_scientific": "acalypha parvula var. reniformis",
    "intro": "Acalypha parvula var. reniformis, commonly known as the round-leaf copperleaf, is a flowering plant native to tropical regions of Africa. It features small, round or heart-shaped leaves that are often brightly colored, ranging from red to orange. The plant produces clusters of tiny, pale yellow flowers that are followed by distinctive, papery bracts. It thrives in moist, well-drained soils and is often used in ornamental gardening. Its unique foliage makes it a popular choice for both indoor and outdoor cultivation.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha parvula"
    },
    "taxonomy_art_desc": "Acalypha parvula var. reniformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex reproductive structures and vascular systems. Its class is Equisetopsida, a group that includes ferns, horsetails, and some mosses, known for their vascular tissues and often primitive features. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, characterized by their diverse floral structures and vascular systems. Its order is Malpighiales, a group of flowering plants that includes many species with specialized adaptations, such as the production of latex and unique leaf structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains toxic compounds. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy leaves, commonly found in tropical and subtropical regions. Its species is Acalypha parvula, a specific type within the genus Acalypha, characterized by its small size and distinctive leaf shape, with the variety reniformis indicating a leaf form resembling a kidney shape.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula var. reniformis is primarily native to the Galápagos. This variant of the species is found in the unique ecosystems of the Galápagos Islands. It thrives in the volcanic soils and coastal areas of the archipelago. The plant is adapted to the arid and semi-arid conditions typical of the region. Its distribution is limited to specific habitats within the Galápagos, reflecting its ecological specialization.",
    "distribution_introduced_art_desc": "Acalypha parvula var. reniformis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. The plant has since spread beyond cultivated areas and is now found in various habitats, including coastal and urban environments. It is considered a potential weed in some regions due to its ability to establish readily. However, its impact on native ecosystems is still being studied."
}
