{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fuscescens",
    "plant_slug": "acalypha-fuscescens",
    "plant_name_scientific": "acalypha fuscescens",
    "intro": "Acalypha fuscescens, commonly known as the blackleaf croton, is a flowering plant native to tropical regions of Africa. It is characterized by its dark green, velvety leaves and clusters of small, yellowish-green flowers. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind. It thrives in moist, shady environments and is often found in forest understories. Its ornamental value makes it a popular choice for tropical gardens and indoor plant collections.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha fuscescens"
    },
    "taxonomy_art_desc": "Acalypha fuscescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their ability to reproduce via spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" often characterized by their showy inflorescences. Its species is Acalypha fuscescens, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Zambia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fuscescens is primarily native to Angola and Zambia. This species is commonly found in the dry savanna and woodland regions of these countries. It thrives in well-drained soils and is often seen in open habitats with moderate sunlight. The plant is known for its distinctive foliage and is sometimes used in traditional medicine. Its distribution is largely restricted to the southern parts of Central Africa.",
    "distribution_introduced_art_desc": "Acalypha fuscescens was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It thrives in tropical and subtropical climates, making it common in regions such as Southeast Asia and parts of the Pacific Islands. This plant is often found in disturbed habitats like roadsides, clearings, and abandoned fields. Its rapid growth and ability to spread through seeds contribute to its invasive potential in non-native environments. However, it is also valued for its ornamental leaves and is sometimes cultivated in gardens."
}
