{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schneideriana",
    "plant_slug": "acalypha-schneideriana",
    "plant_name_scientific": "acalypha schneideriana",
    "intro": "Acalypha schneideriana, commonly known as the Schneider's spurge or velvetleaf, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its attractive, palmate leaves that are often covered in a fine, velvety texture. The plant produces small, greenish flowers that are typically clustered in dense inflorescences. It thrives in moist, shady environments and is often found in forest understories. Acalypha schneideriana is valued in horticulture for its ornamental foliage and is sometimes cultivated as a decorative plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha schneideriana"
    },
    "taxonomy_art_desc": "Acalypha schneideriana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises vascular plants that include ferns, horsetails, and their allies. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their showy flowers and diverse leaf structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many economically important species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha schneideriana, a specific plant within the Acalypha genus, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schneideriana is primarily native to China South-Central. This plant is found in regions of central China, including provinces such as Hubei, Hunan, and Sichuan. It thrives in moist, tropical or subtropical climates with well-drained soil. The species is commonly found in forests and along stream banks. It is a member of the Euphorbiaceae family and is known for its ornamental value.",
    "distribution_introduced_art_desc": "Acalypha schneideriana was mainly introduced to Hawaii, where it has become naturalized in certain areas. It is commonly found in disturbed habitats such as roadsides, open woodlands, and along streambanks. The plant is known for its striking red bracts that resemble flowers, making it visually distinctive. It thrives in tropical and subtropical climates with high humidity and well-drained soil. Despite its ornamental value, it can sometimes spread aggressively and compete with native vegetation."
}
