{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata var. arborea",
    "plant_slug": "acalypha-reticulata-var-arborea",
    "plant_name_scientific": "acalypha reticulata var. arborea",
    "intro": "Acalypha reticulata var. arborea, commonly known as the tree nettle, is a shrub or small tree native to tropical regions of Asia. It is characterized by its palmately lobed leaves, which are often covered in fine hairs and have a distinctive net-like venation pattern. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences, followed by reddish or purplish berries. It thrives in moist, well-drained soils and is often found in lowland forests or along stream banks. The species is valued for its ornamental appeal and has traditional uses in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata var. arborea is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also present in parts of northern Australia and the Pacific Islands. Its distribution is closely linked to its adaptability to warm, humid climates.",
    "distribution_introduced_art_desc": "Acalypha reticulata var. arborea was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there during the late 19th or early 20th century by horticulturists and gardeners seeking to diversify local landscapes. The plant has since naturalized in certain areas, spreading through both seed dispersal and vegetative growth. Its introduction has raised concerns due to its potential to become invasive in native ecosystems. Despite its ornamental value, management efforts are ongoing to control its spread and minimize ecological impact."
}
