{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha parvula f. sericea",
    "plant_slug": "acalypha-parvula-f-sericea",
    "plant_name_scientific": "acalypha parvula f. sericea",
    "intro": "Acalypha parvula f. sericea, commonly known as silverleaf ironweed, is a compact, low-growing shrub native to tropical regions of Africa. It features small, ovate to elliptic leaves that are densely covered with silky, silver-white hairs, giving it a distinctive, silvery appearance. The plant produces clusters of small, greenish-white flowers that are typically arranged in spike-like inflorescences. It thrives in moist, well-drained soils and is often found in disturbed or open habitats. Due to its ornamental value, it is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha parvula f. sericea is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in disturbed soils and along forest edges. This plant thrives in humid climates and is often seen in lowland areas with partial shade. It is known for its hairy leaves and small, showy flowers. Its distribution is closely tied to the natural habitats of these regions, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acalypha parvula f. sericea was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive silver foliage. The distribution is primarily confined to the North Island, where it thrives in coastal and urban environments. It has been recorded in several regions including Auckland, Wellington, and Christchurch. Despite its introduction, it is not considered invasive and is often cultivated in gardens."
}
