{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha caeciliae",
    "plant_slug": "acalypha-caeciliae",
    "plant_name_scientific": "acalypha caeciliae",
    "intro": "Acalypha caeciliae, commonly known as the Cécile's spurge, is a flowering plant native to Madagascar. It belongs to the Euphorbiaceae family, which includes many species with milky sap. The plant is characterized by its striking, palmate leaves that are often brightly colored. It produces small, clustered flowers that are typically green or yellow. Acalypha caeciliae is often cultivated for its ornamental value in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha caeciliae"
    },
    "taxonomy_art_desc": "Acalypha caeciliae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often retaining primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical species, often with distinctive floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide range of morphological diversity and some toxic properties. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper bush,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha caeciliae, a specific plant within the genus Acalypha, known for its unique characteristics and possibly limited distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Missouri"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha caeciliae is primarily native to Missouri. This species is found in the central United States, specifically within the state of Missouri. It thrives in moist, shaded environments such as woodlands and stream banks. The plant is known for its striking red bracts that attract pollinators. However, it is considered rare and has a limited geographic range within Missouri.",
    "distribution_introduced_art_desc": "Acalypha caeciliae was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. The distribution of this species is primarily limited to the North Island. It has been found in gardens and along roadsides in urban areas. Despite its introduction, it is not considered invasive in the region."
}
