{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha entumenica",
    "plant_slug": "acalypha-entumenica",
    "plant_name_scientific": "acalypha entumenica",
    "intro": "Acalypha entumenica, commonly known as the flame bush, is a shrub native to the tropical regions of Africa. It is characterized by its striking, colorful bracts that resemble flames, which are actually modified leaves rather than flowers. The plant produces small, inconspicuous flowers that are clustered in dense inflorescences. It thrives in full sun and well-drained soil, making it a popular ornamental plant in gardens. The leaves are often used in traditional medicine for their purported healing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha entumenica is primarily native to the island of Madagascar. It is found in the eastern part of the island, particularly in the humid lowland forests. The plant thrives in tropical climates with high rainfall and warm temperatures. It is often seen growing in shaded undergrowth near rivers and streams. Its native distribution is limited to this specific region, making it a unique part of Madagascar's flora.",
    "distribution_introduced_art_desc": "Acalypha entumenica was mainly introduced to new habitats in tropical and subtropical regions due to its ornamental value and adaptability. It is commonly found in disturbed soils and along roadsides, where it thrives in moist, sunny environments. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its invasive potential in non-native areas. Its introduction has raised concerns among ecologists due to its competitive nature and impact on native flora. Despite its aesthetic appeal, proper management is necessary to prevent its spread into sensitive ecosystems."
}
