{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha saxicola",
    "plant_slug": "acalypha-saxicola",
    "plant_name_scientific": "acalypha saxicola",
    "intro": "Acalypha saxicola, commonly known as the rock spurge, is a flowering plant native to arid and rocky regions of Africa. It is characterized by its succulent, fleshy leaves and clusters of small, yellowish-green flowers. The plant typically grows in well-drained soils and thrives in full sun, making it well adapted to harsh environments. Its structure is low-growing, with a sprawling habit that helps it conserve moisture. Acalypha saxicola is often used in xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha saxicola"
    },
    "taxonomy_art_desc": "Acalypha saxicola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with a wide variety of growth forms and some toxic species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha saxicola, a specific type within the genus Acalypha, known for its unique morphology and adaptation to rocky or arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha saxicola is primarily native to Mexico Northwest. It is found in the arid and semi-arid regions of this area. The plant typically grows in rocky or sandy soils. It is commonly seen in desert environments and along dry slopes. Its distribution is limited to specific habitats within the northwest part of Mexico.",
    "distribution_introduced_art_desc": "Acalypha saxicola was mainly introduced to rocky and coastal habitats, where it thrives in well-drained soils. It is commonly found in areas with moderate to high sunlight exposure. This plant is often seen growing on cliffs, rock outcrops, and along shores. Its introduction has been documented in several regions, including parts of the Pacific Islands and coastal areas of Southeast Asia. It is considered an invasive species in some locations due to its rapid growth and ability to outcompete native vegetation."
}
