{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neomexicana var. jaliscana",
    "plant_slug": "acalypha-neomexicana-var-jaliscana",
    "plant_name_scientific": "acalypha neomexicana var. jaliscana",
    "intro": "Acalypha neomexicana var. jaliscana, commonly known as the Jalisco copperleaf, is a shrub native to the dry regions of Mexico. It features small, copper-colored leaves that give it its common name, and it typically grows in rocky or sandy soils. The plant produces clusters of small, greenish-yellow flowers that are followed by distinctive, papery bracts. It is adapted to arid environments and is often found in desert scrub habitats. This variety is valued for its ornamental appeal and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neomexicana var. jaliscana is primarily native to the southern United States, specifically Texas, and parts of northeastern Mexico, including the states of Nuevo León and Tamaulipas. This variant is adapted to arid and semi-arid environments, often found in rocky soils and along dry streambeds. It thrives in regions with low annual rainfall and high temperatures, typical of the Chihuahuan Desert ecosystem. The plant is commonly seen in disturbed areas such as roadsides and abandoned fields. Its distribution is limited to specific microhabitats that provide the necessary conditions for its growth.",
    "distribution_introduced_art_desc": "Acalypha neomexicana var. jaliscana was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in regions of Mexico and Central America. It thrives in full sun to partial shade and is commonly found in disturbed habitats such as roadsides, fields, and along riverbanks. This variant is known for its ornamental value due to its vibrant foliage and unique flower structure. It has been observed spreading into new areas, sometimes becoming invasive in certain ecosystems. Its distribution is largely influenced by human activity and environmental conditions that support its growth."
}
