{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha australis var. glareosa",
    "plant_slug": "acalypha-australis-var-glareosa",
    "plant_name_scientific": "acalypha australis var. glareosa",
    "intro": "Acalypha australis var. glareosa, commonly known as the shining ironwood, is a shrub native to New Zealand. It is characterized by its striking, bright green, glossy leaves that are often covered in fine, silky hairs. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in well-drained soils and is often found in coastal and inland areas. Due to its ornamental value, it is cultivated in gardens for its attractive foliage and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha australis var. glareosa is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in coastal and subcoastal regions, often growing in sandy or rocky soils. This plant thrives in moist, well-drained environments and is often seen in open forests or along riverbanks. It is well adapted to the temperate to subtropical climates of its native range. The variety is known for its attractive, bright red bracts that make it a popular ornamental plant.",
    "distribution_introduced_art_desc": "Acalypha australis var. glareosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this plant has been limited to specific regions within New Zealand, primarily in the North Island. It is commonly found in gardens and along coastal areas where the climate is mild. Despite its ornamental value, it is considered a potential weed in some parts of its introduced range."
}
