{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha manniana",
    "plant_slug": "acalypha-manniana",
    "plant_name_scientific": "acalypha manniana",
    "intro": "Acalypha manniana, commonly known as the velvetleaf or red-rooted false hibiscus, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, velvety leaves that range from green to reddish in color. The plant produces showy, five-petaled flowers that are typically pink or red, attracting pollinators such as bees and butterflies. Its root system is fibrous and often used in traditional medicine for its purported healing properties. Acalypha manniana thrives in moist, well-drained soils and is often found in woodland or disturbed areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha manniana"
    },
    "taxonomy_art_desc": "Acalypha manniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" often characterized by their showy inflorescences. Its species is Acalypha manniana, a specific plant within the genus Acalypha, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Benin",
        "Burundi",
        "Cameroon",
        "DR Congo",
        "Ghana",
        "Gulf of Guinea Is.",
        "Nigeria",
        "Rwanda",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha manniana is primarily native to Benin, Burundi, Cameroon, DR Congo, Ghana, Gulf of Guinea Is., Nigeria, Rwanda, and Uganda. This species is commonly found in tropical and subtropical regions within these countries. It typically grows in moist, shaded environments such as forests and shrublands. The plant is well adapted to the humid climate and seasonal rainfall patterns of its native range. It plays an important ecological role in its natural habitat.",
    "distribution_introduced_art_desc": "Acalypha manniana was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed areas, along roadsides, and in urban environments. This plant has adapted well to a variety of soil types and can thrive in both full sun and partial shade. Its rapid growth and ability to spread vegetatively make it an invasive species in some regions. However, it is also valued for its ornamental foliage and is sometimes used in ecological restoration projects."
}
