{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata f. glabrescens",
    "plant_slug": "acalypha-reticulata-f-glabrescens",
    "plant_name_scientific": "acalypha reticulata f. glabrescens",
    "intro": "Acalypha reticulata f. glabrescens, commonly known as the velvetleaf or silky mallow, is a variant of the species Acalypha reticulata. It is characterized by its smooth, glabrous leaves that are typically a vibrant green, often with a waxy texture. The plant produces small, clustered flowers that are usually greenish-white in color. It is native to tropical regions and thrives in warm, humid climates. This cultivar is often cultivated for its ornamental value and is used in both garden and landscape settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata f. glabrescens is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. This plant is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It thrives in lowland areas with high humidity and is often associated with rainforests or secondary vegetation. The species is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Its native distribution is closely linked to its preference for warm, humid climates and rich, well-drained soils.",
    "distribution_introduced_art_desc": "Acalypha reticulata f. glabrescens was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage. It is commonly found in landscapes and gardens in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with high humidity and well-drained soil. It is often used in horticulture for its vibrant leaf colors and ability to form dense foliage. However, it has raised concerns in some areas due to its potential to become invasive if not properly managed."
}
