{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha villosa var. intermedia",
    "plant_slug": "acalypha-villosa-var-intermedia",
    "plant_name_scientific": "acalypha villosa var. intermedia",
    "intro": "Acalypha villosa var. intermedia, commonly known as velvetleaf or red leaf hibiscus, is a herbaceous plant native to tropical and subtropical regions. It is characterized by its soft, velvety leaves that range in color from green to red or purple, depending on the variety. The plant produces small, showy flowers in shades of yellow, orange, or red, typically blooming in the summer months. It thrives in well-drained soil and full sun to partial shade, making it a popular choice for ornamental gardening. Its rapid growth and ability to spread through both seeds and rhizomes make it an adaptable and sometimes invasive species in certain environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha villosa var. intermedia is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant is often associated with disturbed habitats like roadsides, forest edges, and abandoned fields. It thrives in humid climates and is sometimes considered an invasive species in some parts of its range. The plant is known for its distinctive foliage and is used in horticulture for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha villosa var. intermedia was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and coastal dunes. It thrives in sunny environments with moderate to high levels of sunlight. The plant is often found in tropical and subtropical regions where it can establish itself quickly due to its rapid growth rate. Its adaptability to various soil types and ability to tolerate both drought and flooding conditions contribute to its widespread distribution. This introduced species can sometimes outcompete native vegetation, leading to ecological concerns in certain regions."
}
