{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha leptopoda",
    "plant_slug": "acalypha-leptopoda",
    "plant_name_scientific": "acalypha leptopoda",
    "intro": "Acalypha leptopoda, commonly known as the slender spurge, is a flowering plant native to tropical and subtropical regions of Asia. It is characterized by its upright growth habit and narrow, lance-shaped leaves that are often covered in fine hairs. The plant produces small, greenish-yellow flowers arranged in clusters, which are typically borne on slender stalks. Acalypha leptopoda is a member of the Euphorbiaceae family, known for its diverse and often showy inflorescences. It thrives in moist, well-drained soils and is often found in woodland or shaded areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha leptopoda"
    },
    "taxonomy_art_desc": "Acalypha leptopoda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and a wide distribution. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cup plants,\" characterized by their hairy leaves and showy inflorescences. Its species is Acalypha leptopoda, a specific plant within the genus Acalypha, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Costa Rica",
        "El Salvador",
        "Guatemala",
        "Honduras",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua",
        "Panamá"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha leptopoda is primarily native to Belize, Costa Rica, El Salvador, Guatemala, Honduras, Mexico Gulf, Mexico Northeast, Mexico Southeast, Mexico Southwest, Nicaragua, and Panamá. This species is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments such as forest understories and along stream banks. The plant is often associated with humid lowland areas and is part of the local flora in these regions. Its distribution reflects its adaptation to the diverse ecosystems of Central America.",
    "distribution_introduced_art_desc": "Acalypha leptopoda was mainly introduced to new habitats through human activity, such as landscaping and horticultural trade. It is commonly found in disturbed areas, including roadsides, vacant lots, and gardens. This plant thrives in moist, well-drained soils and can tolerate a range of environmental conditions. Its rapid growth and ability to spread through seeds make it an invasive species in some regions. However, it is also valued for its ornamental leaves and is sometimes used in ecological restoration projects."
}
