{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha repanda var. denudata",
    "plant_slug": "acalypha-repanda-var-denudata",
    "plant_name_scientific": "acalypha repanda var. denudata",
    "intro": "Acalypha repanda var. denudata, commonly known as the red-twigged ironweed, is a deciduous shrub native to the southeastern United States. It is characterized by its striking red stems that become more prominent in the winter months. The plant produces small, greenish-white flowers in clusters, which are typically borne in the summer. Its leaves are ovate to lanceolate in shape and have a smooth texture. This species is often cultivated for its ornamental value, particularly for its vibrant winter color.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha repanda"
    },
    "taxonomy_art_desc": "Acalypha repanda var. denudata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and algae that have a complex life cycle with a dominant sporophyte stage. Its class is Equisetopsida, which comprises ferns and their allies, characterized by vascular tissue and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical species with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some toxic properties. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha repanda, a specific type within the genus known for its unique foliage and variability in form, with the varietal form denudata exhibiting distinct characteristics such as reduced leaf coverage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha repanda var. denudata is primarily native to Fiji. This variant of Acalypha repanda is commonly found in the tropical regions of the country. It thrives in humid and warm environments, often growing in coastal areas and lowland forests. The plant is well adapted to the local climate and soil conditions of Fiji. It plays an important role in the local ecosystem and is sometimes used in traditional practices.",
    "distribution_introduced_art_desc": "Acalypha repanda var. denudata was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and as a decorative plant. The plant's ability to thrive in a variety of soil types and its relatively low maintenance requirements contribute to its popularity among gardeners. However, it has also been reported as an invasive species in some areas, where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
