{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brasiliensis f. obtusa",
    "plant_slug": "acalypha-brasiliensis-f-obtusa",
    "plant_name_scientific": "acalypha brasiliensis f. obtusa",
    "intro": "Acalypha brasiliensis f. obtusa, commonly known as the Brazilian nettle or velvetleaf, is a flowering plant native to South America. It is characterized by its soft, velvety foliage and clusters of small, greenish-white flowers. The plant typically grows as an herbaceous annual or perennial, often found in moist, tropical environments. Its leaves are usually ovate to elliptical in shape, with a distinctive waxy texture. The species is noted for its ornamental value and is sometimes cultivated for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brasiliensis f. obtusa is primarily native to Brazil. It is found in the northeastern region of the country, particularly in the states of Ceará, Pernambuco, and Piauí. This plant thrives in tropical and subtropical climates, often growing in coastal areas and near riverbanks. It is commonly found in secondary forests and disturbed habitats. Its native distribution is closely associated with the Atlantic Forest biome.",
    "distribution_introduced_art_desc": "Acalypha brasiliensis f. obtusa was mainly introduced to enhance ornamental value in gardens and landscapes due to its unique foliage and growth habit. It is commonly cultivated in tropical and subtropical regions for its attractive, variegated leaves. This plant thrives in well-drained soil and partial to full sunlight, making it suitable for a variety of garden settings. Its introduction has expanded the diversity of foliage plants available to horticulturists and gardeners. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
