{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha subtomentosa",
    "plant_slug": "acalypha-subtomentosa",
    "plant_name_scientific": "acalypha subtomentosa",
    "intro": "Acalypha subtomentosa, commonly known as silky abutilon, is a flowering plant native to Southeast Asia. It is characterized by its soft, hairy leaves that give it a velvety texture. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in tropical and subtropical climates and prefers well-drained soil. Acalypha subtomentosa is often cultivated as an ornamental plant for its attractive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha subtomentosa"
    },
    "taxonomy_art_desc": "Acalypha subtomentosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized adaptations for various ecological niches. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their hairy foliage and showy inflorescences. Its species is Acalypha subtomentosa, a specific type of Acalypha known for its dense, soft hairs and is commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha subtomentosa is primarily native to Mexico Central. It is found in the tropical and subtropical regions of this area. The plant thrives in humid environments with well-drained soil. It is commonly associated with disturbed habitats such as roadsides and open forests. Its distribution is limited to specific parts of Mexico Central, where it grows in lowland and montane regions.",
    "distribution_introduced_art_desc": "Acalypha subtomentosa was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for landscaping. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in moist, shaded environments and spreads through both seeds and vegetative growth. Its introduction highlights the ecological risks associated with non-native species in island ecosystems."
}
