{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schiedeana f. latifolia",
    "plant_slug": "acalypha-schiedeana-f-latifolia",
    "plant_name_scientific": "acalypha schiedeana f. latifolia",
    "intro": "Acalypha schiedeana f. latifolia, commonly known as the broad-leafed ironweed, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family, characterized by its unique floral structures and milky sap. The plant features palmately lobed leaves that are broad and glossy, contributing to its ornamental appeal. Its small, clustered flowers are typically greenish-yellow, and it produces distinctive, spiny capsules as fruit. It thrives in moist, well-drained soils and is often cultivated for its foliage rather than its blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schiedeana f. latifolia is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. This plant thrives in tropical and subtropical regions, often found in lowland areas with high humidity. It is commonly associated with moist forest environments and is sometimes found near rivers or in swampy areas. The species is also known to occur in parts of the Philippines and northern Australia. Its natural range is largely confined to these geographic regions, where it grows as an ornamental or semi-wild plant.",
    "distribution_introduced_art_desc": "Acalypha schiedeana f. latifolia was mainly introduced to tropical and subtropical regions where it thrives in warm, humid climates. It is commonly found in areas with well-drained soils and partial to full sunlight. This plant is often used as an ornamental species due to its attractive foliage and adaptability. It has been introduced to several countries in the Pacific Islands, Southeast Asia, and parts of the Americas. However, its spread has raised concerns about its potential to become invasive in certain ecosystems."
}
