{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha hispida var. sanderi",
    "plant_slug": "acalypha-hispida-var-sanderi",
    "plant_name_scientific": "acalypha hispida var. sanderi",
    "intro": "Acalypha hispida var. sanderi, commonly known as the velvetleaf or sanders' spurge, is a shrub native to tropical regions of Africa. It is characterized by its hairy, glandular leaves that give it a velvety texture. The plant produces small, greenish-yellow flowers arranged in clusters, which are followed by distinctive, three-lobed seed capsules. It thrives in moist, well-drained soils and is often found in disturbed habitats. Due to its ornamental value, it is occasionally cultivated in gardens, though it can be invasive in certain areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha hispida var. sanderi is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. This variant is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It is typically associated with lowland forests and can be found in areas with high humidity and warm temperatures. The plant thrives in coastal and inland regions where the climate supports its growth. Its native distribution is largely limited to the tropical parts of Southeast Asia.",
    "distribution_introduced_art_desc": "Acalypha hispida var. sanderi was mainly introduced to New Zealand. It was first recorded in the 19th century and has since become naturalized in various regions of the country. The plant is commonly found in coastal areas and disturbed soils, often growing along roadsides and in urban environments. It is considered an invasive species in some parts of New Zealand due to its rapid growth and ability to outcompete native vegetation. Despite its invasive tendencies, it is also valued for its ornamental qualities and is sometimes cultivated in gardens."
}
