{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha multifida",
    "plant_slug": "acalypha-multifida",
    "plant_name_scientific": "acalypha multifida",
    "intro": "Acalypha multifida, commonly known as the palmate spurge, is a flowering plant native to tropical and subtropical regions. It is characterized by its palmate leaves, which are deeply lobed and give the plant a distinctive appearance. The plant produces small, greenish-yellow flowers arranged in clusters, followed by capsule fruits containing seeds. It thrives in moist, well-drained soils and is often found in disturbed areas or along stream banks. Due to its ornamental value, it is sometimes cultivated in gardens, though it can become invasive in certain environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha multifida"
    },
    "taxonomy_art_desc": "Acalypha multifida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes species with various adaptations for different environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive flowers and often milky sap. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often hairy leaves. Its species is Acalypha multifida, a specific type of plant within the genus Acalypha, characterized by its branching structure and unique leaf morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "DR Congo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha multifida is primarily native to DR Congo. It is commonly found in the tropical rainforests of the region. The plant thrives in humid and shaded environments. It is often seen growing along riverbanks and in dense undergrowth. Its native distribution is largely restricted to this specific geographic area.",
    "distribution_introduced_art_desc": "Acalypha multifida was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first brought to the country in the late 19th century by European settlers who admired its aesthetic value. Despite its initial popularity in gardens, it has since become a weed in some areas, spreading rapidly in disturbed soils and along roadsides. The plant's ability to thrive in a variety of conditions has contributed to its successful establishment in the environment. However, its invasive potential has led to increased monitoring and management efforts in certain regions."
}
