{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cardiophylla",
    "plant_slug": "acalypha-cardiophylla",
    "plant_name_scientific": "acalypha cardiophylla",
    "intro": "Acalypha cardiophylla, commonly known as the heart-leaf alyssum, is a flowering plant native to Southeast Asia. It is characterized by its striking, heart-shaped leaves that are often variegated with white or yellow markings. The plant produces small, clustered flowers that range in color from pink to purple, adding visual interest to gardens. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Acalypha cardiophylla is relatively low maintenance, making it a popular choice for tropical and subtropical landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cardiophylla"
    },
    "taxonomy_art_desc": "Acalypha cardiophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malpighiales, a large group of flowering plants that includes many tropical and subtropical species, often with distinctive floral structures. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha cardiophylla, a specific plant within the genus Acalypha, noted for its heart-shaped leaves and ornamental value in horticulture.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo",
        "Caroline Is.",
        "Philippines",
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cardiophylla is primarily native to Borneo, Caroline Is., Philippines, and Taiwan. This plant is commonly found in tropical and subtropical regions within these areas. It typically grows in moist, shaded environments such as forest understories. The species is known for its distinctive heart-shaped leaves. Its native range reflects its adaptation to humid, warm climates across these islands.",
    "distribution_introduced_art_desc": "Acalypha cardiophylla was mainly introduced to ornamental horticulture due to its striking foliage and unique leaf shapes. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been widely distributed in gardens and greenhouses across the United States, Australia, and parts of Southeast Asia. Its introduction has led to its presence in both cultivated and naturalized settings. However, it is not considered invasive in most regions where it is grown."
}
