{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha grisebachiana",
    "plant_slug": "acalypha-grisebachiana",
    "plant_name_scientific": "acalypha grisebachiana",
    "intro": "Acalypha grisebachiana, commonly known as the silverleaf or velvetleaf, is a flowering plant native to Southeast Asia. It belongs to the Euphorbiaceae family and is characterized by its striking silver or gray-green foliage. The plant produces small, inconspicuous flowers surrounded by colorful bracts, which are often the main attraction. It thrives in moist, shaded environments and is often found in tropical and subtropical regions. Acalypha grisebachiana is valued in horticulture for its ornamental leaves and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha grisebachiana"
    },
    "taxonomy_art_desc": "Acalypha grisebachiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and diverse leaf structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphologies, such as shrubs and trees. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf,\" characterized by their distinctive leaves and often showy inflorescences. Its species is Acalypha grisebachiana, a specific type within the genus Acalypha, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Trinidad-Tobago"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha grisebachiana is primarily native to Trinidad and Tobago. It is commonly found in the coastal regions and lowland areas of these islands. The plant thrives in moist, tropical environments with ample sunlight. It is often seen growing in disturbed soils near human settlements. Its native distribution is limited to the Caribbean region, specifically Trinidad and Tobago.",
    "distribution_introduced_art_desc": "Acalypha grisebachiana was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the late 19th or early 20th century by horticultural enthusiasts and gardeners. The plant has since naturalized in certain areas, becoming part of the local flora in some regions. It is often found growing in disturbed soils and along roadsides. However, its spread has raised concerns about its potential impact on native ecosystems."
}
