{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha filiformis var. ovalifolia",
    "plant_slug": "acalypha-filiformis-var-ovalifolia",
    "plant_name_scientific": "acalypha filiformis var. ovalifolia",
    "intro": "Acalypha filiformis var. ovalifolia, commonly known as the narrow-leaf spurge, is a herbaceous plant native to tropical regions of Africa. It features slender, lance-shaped leaves that are often arranged in a whorled pattern along the stems. The plant produces small, yellowish-green flowers in clusters, which are typically borne on short, hairy pedicels. Its growth habit is prostrate or spreading, making it suitable for ground cover in shaded or moist environments. It is often cultivated for its ornamental value and ability to thrive in humid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha filiformis var. ovalifolia is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This variant thrives in moist, shaded environments, often growing near rivers, swamps, or in dense forest undergrowth. It is a member of the Euphorbiaceae family and is known for its delicate, elongated leaves. Due to its ornamental value, it is sometimes cultivated in gardens in regions with a suitable climate.",
    "distribution_introduced_art_desc": "Acalypha filiformis var. ovalifolia was mainly introduced to Hawaii, where it has become an invasive species. It was originally from Southeast Asia and was likely introduced through human activity, such as horticultural trade or accidental transport. The plant thrives in disturbed areas and can outcompete native vegetation, leading to ecological concerns. It is commonly found in coastal areas and disturbed soils, spreading rapidly due to its prolific seed production. Efforts are being made to control its spread to protect native ecosystems."
}
