{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrostachya var. tristis",
    "plant_slug": "acalypha-macrostachya-var-tristis",
    "plant_name_scientific": "acalypha macrostachya var. tristis",
    "intro": "Acalypha macrostachya var. tristis, commonly known as the velvetleaf or silky ironweed, is a flowering plant native to tropical regions of the Americas. It is characterized by its striking, velvety foliage that ranges from green to reddish hues, often with a soft, fuzzy texture. The plant produces clusters of small, pink to red flowers that bloom in summer, adding visual interest to its appearance. It thrives in moist, sunny environments and is often found in wetlands or along stream banks. Due to its ornamental value, it is occasionally cultivated in gardens, though it can become invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrostachya var. tristis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant of Acalypha macrostachya is often associated with disturbed habitats, such as roadsides, forest edges, and abandoned fields. It thrives in warm climates with high humidity and is sometimes cultivated as an ornamental plant. The plant is also known to occur in parts of eastern India and the Andaman Islands.",
    "distribution_introduced_art_desc": "Acalypha macrostachya var. tristis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was first brought to these regions in the late 19th century by European settlers and horticulturalists. Despite its aesthetic appeal, it has since become an invasive species, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through both seeds and vegetative propagation have made it a significant ecological concern. Efforts to control its spread have been ongoing, but its establishment in natural habitats remains a challenge."
}
