{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha indica",
    "plant_slug": "acalypha-indica",
    "plant_name_scientific": "acalypha indica",
    "intro": "Acalypha indica, commonly known as the Indian copperleaf, is a flowering plant native to tropical regions of Asia. It is characterized by its striking, palmate leaves that often display vibrant red, orange, or yellow veins. The plant produces small, clustered flowers that are typically green or red, adding to its ornamental value. It thrives in warm, humid climates and is often cultivated as a decorative plant. Acalypha indica is also known for its ability to tolerate partial shade and is used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha indica"
    },
    "taxonomy_art_desc": "Acalypha indica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with distinctive floral and leaf characteristics. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha indica, a specific plant within the genus Acalypha, native to Asia and known for its ornamental value and medicinal uses.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Angola",
        "Assam",
        "Bangladesh",
        "Botswana",
        "Cambodia",
        "Cape Provinces",
        "Djibouti",
        "DR Congo",
        "Eritrea",
        "Eswatini",
        "Ethiopia",
        "Hainan",
        "India",
        "Jawa",
        "Kenya",
        "KwaZulu-Natal",
        "Laccadive Is.",
        "Lesser Sunda Is.",
        "Malawi",
        "Malaya",
        "Maldives",
        "Maluku",
        "Mozambique",
        "Myanmar",
        "Namibia",
        "Nansei-shoto",
        "Nepal",
        "New Guinea",
        "Nicobar Is.",
        "Northern Provinces",
        "Oman",
        "Pakistan",
        "Philippines",
        "Saudi Arabia",
        "Socotra",
        "Somalia",
        "South China Sea",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Sulawesi",
        "Sumatera",
        "Taiwan",
        "Tanzania",
        "Thailand",
        "Uganda",
        "Vietnam",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Caroline Is.",
        "Chagos Archipelago",
        "Christmas I.",
        "Cocos (Keeling) Is.",
        "Comoros",
        "Cuba",
        "Leeward Is.",
        "Madagascar",
        "Marianas",
        "Mauritius",
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Puerto Rico",
        "Réunion",
        "Samoa",
        "Seychelles",
        "Tokelau-Manihiki",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Acalypha indica is primarily native to the Andaman Is., Angola, Assam, Bangladesh, Botswana, Cambodia, Cape Provinces, Djibouti, DR Congo, Eritrea, Eswatini, Ethiopia, Hainan, India, Jawa, Kenya, KwaZulu-Natal, Laccadive Is., Lesser Sunda Is., Malawi, Malaya, Maldives, Maluku, Mozambique, Myanmar, Namibia, Nansei-shoto, Nepal, New Guinea, Nicobar Is., Northern Provinces, Oman, Pakistan, Philippines, Saudi Arabia, Socotra, Somalia, South China Sea, Sri Lanka, Sudan-South Sudan, Sulawesi, Sumatera, Taiwan, Tanzania, Thailand, Uganda, Vietnam, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions, often growing in moist environments such as forests, wetlands, and along riverbanks. The plant is known for its adaptability to various soil types and can thrive in both coastal and inland areas. It is widely distributed across South and Southeast Asia, parts of Africa, and the Indian Ocean islands. Its native range reflects its ability to colonize diverse habitats across these regions.",
    "distribution_introduced_art_desc": "Acalypha indica was mainly introduced to Caroline Is., Chagos Archipelago, Christmas I., Cocos (Keeling) Is., Comoros, Cuba, Leeward Is., Madagascar, Marianas, Mauritius, Mexico Central, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, Puerto Rico, Réunion, Samoa, Seychelles, Tokelau-Manihiki, and Windward Is. It is commonly found in coastal and disturbed areas, often growing in sandy soils. The plant is known for its ornamental value and has been cultivated for its colorful foliage. It has become naturalized in many of these regions, sometimes forming dense stands. Its introduction is likely due to human activities such as horticulture and accidental seed dispersal."
}
