{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha sanderi alba",
    "plant_slug": "acalypha-sanderi-alba",
    "plant_name_scientific": "acalypha sanderi alba",
    "intro": "Acalypha sanderi alba, commonly known as the white-leaf iron plant, is a flowering plant native to the Caribbean and parts of Central America. It is characterized by its striking, white-variegated leaves that provide a unique visual contrast. The plant produces small, inconspicuous greenish-white flowers that are clustered in dense inflorescences. It thrives in warm, humid climates and prefers well-drained soil. Acalypha sanderi alba is often cultivated as an ornamental plant for its attractive foliage and ability to tolerate partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha sanderi alba is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetland areas, including marshes, swamps, and along the edges of ponds and streams. This plant thrives in moist to aquatic environments and is often associated with disturbed or riparian habitats. It is known for its distinctive white bracts that give it a striking appearance. Due to its preference for wet conditions, it is an important component of the wetland flora in its native range.",
    "distribution_introduced_art_desc": "Acalypha sanderi alba was mainly introduced to areas with tropical and subtropical climates, particularly in regions with high humidity and well-drained soils. It thrives in full sun to partial shade, making it suitable for a variety of garden settings. This plant is often used as an ornamental due to its vibrant, showy flowers and attractive foliage. It has been introduced to several countries in the Pacific Islands, including Hawaii and Guam, where it has become naturalized. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
