{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha villosa var. latiuscula",
    "plant_slug": "acalypha-villosa-var-latiuscula",
    "plant_name_scientific": "acalypha villosa var. latiuscula",
    "intro": "Acalypha villosa var. latiuscula, commonly known as silky ironweed, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its soft, hairy foliage and clusters of small, greenish-white flowers. The plant typically grows in moist, shaded environments such as forests or along stream banks. Its leaves are often covered in fine, silky hairs, giving it a distinctive appearance. The flowers are usually borne in dense, spike-like inflorescences, which contribute to its ornamental value in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha villosa var. latiuscula is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant is often associated with rainforests and secondary growth habitats. It thrives in humid climates and is typically found in shaded or semi-shaded environments. The plant is known for its hairy foliage and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acalypha villosa var. latiuscula was mainly introduced to areas with disturbed soils and wetland habitats. It thrives in environments with moderate to high moisture levels. This plant is often found in riparian zones and along stream banks. Its introduction has led to its establishment in both natural and human-altered landscapes. It is considered an invasive species in some regions due to its rapid growth and competitive nature."
}
