{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha torta",
    "plant_slug": "acalypha-torta",
    "plant_name_scientific": "acalypha torta",
    "intro": "Acalypha torta, commonly known as the velvetleaf or false hibiscus, is a flowering plant native to tropical regions of Africa, Asia, and the Pacific. It is characterized by its striking, palmate leaves that are often covered in fine, silky hairs, giving it a velvety texture. The plant produces showy, bract-based inflorescences that range in color from red to orange, attracting various pollinators. It thrives in moist, shady environments and is often found in disturbed areas or along stream banks. Acalypha torta is valued in horticulture for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha torta is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Due to its ornamental value, it has been introduced to other regions around the world.",
    "distribution_introduced_art_desc": "Acalypha torta was mainly introduced to the Pacific Islands, including Hawaii, as an ornamental plant due to its striking foliage. It was likely brought by early settlers or horticulturalists who appreciated its unique leaf patterns and vibrant colors. The plant has since become naturalized in many areas, often growing in disturbed soils and along roadsides. Its rapid growth and ability to thrive in various conditions have led to its classification as an invasive species in some regions. Despite its ornamental value, it can outcompete native vegetation and alter local ecosystems."
}
