{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha schiedeana var. latifolia",
    "plant_slug": "acalypha-schiedeana-var-latifolia",
    "plant_name_scientific": "acalypha schiedeana var. latifolia",
    "intro": "Acalypha schiedeana var. latifolia, commonly known as the broadleaf ironweed, is a shrub native to tropical regions of South America. It features striking, velvety leaves with a broad, lance-shaped form and a distinctive reddish or purple underside. The plant produces small, clustered greenish-white flowers that bloom in summer, followed by fluffy, cotton-like seed heads. It thrives in moist, well-drained soils and is often found in shaded to semi-shaded environments. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha schiedeana var. latifolia is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, shaded environments, often found in lowland forests and along stream banks. This variant is particularly common in the island of Borneo, where it grows in dense undergrowth. It is also present in parts of the Indian subcontinent, though less frequently. The plant is well adapted to moist, nutrient-rich soils and plays a role in the ecological balance of its native habitats.",
    "distribution_introduced_art_desc": "Acalypha schiedeana var. latifolia was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage. It is commonly found in gardens and landscaped areas in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with high humidity and well-drained soil. It is often used in ornamental horticulture for its vibrant leaf colors and unique growth form. However, it has raised concerns in some areas due to its potential to become invasive if not managed properly."
}
