{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha paucifolia",
    "plant_slug": "acalypha-paucifolia",
    "plant_name_scientific": "acalypha paucifolia",
    "intro": "Acalypha paucifolia, commonly known as the silverleaf ironweed, is a flowering plant native to tropical and subtropical regions of Africa. It belongs to the Euphorbiaceae family, which is known for its diverse and often unique botanical features. The plant is characterized by its striking silver-gray foliage, which is covered in fine, soft hairs. Its small, inconspicuous flowers are typically clustered in dense inflorescences, and it produces capsule fruits that contain numerous seeds. Acalypha paucifolia is often cultivated as an ornamental plant due to its attractive appearance and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha paucifolia"
    },
    "taxonomy_art_desc": "Acalypha paucifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malpighiales, a large order of flowering plants that includes many species with distinctive floral and vegetative features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" species, characterized by their showy flowers and often hairy leaves. Its species is Acalypha paucifolia, a specific plant within the genus Acalypha, known for its limited foliage and unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Malawi",
        "Mozambique",
        "Tanzania",
        "Zambia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha paucifolia is primarily native to Malawi, Mozambique, Tanzania, and Zambia. This species is commonly found in the eastern African region, particularly in areas with tropical and subtropical climates. It thrives in moist, well-drained soils and is often seen in woodland and savanna habitats. The plant is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its native range spans across several countries in southeastern Africa.",
    "distribution_introduced_art_desc": "Acalypha paucifolia was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and coastal dunes. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in tropical and subtropical climates, particularly in parts of Southeast Asia and the Pacific Islands. Its rapid growth and ability to spread through seeds make it an invasive species in some areas. However, it is also valued for its ornamental foliage and is sometimes cultivated in gardens."
}
