{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha monococca",
    "plant_slug": "acalypha-monococca",
    "plant_name_scientific": "acalypha monococca",
    "intro": "Acalypha monococca, commonly known as the velvetleaf or silverleaf acalypha, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, velvety foliage that ranges from silver to deep green, often with a waxy texture. The plant produces small, inconspicuous flowers that are typically clustered in dense inflorescences. It thrives in warm, humid climates and is often cultivated as an ornamental plant for its aesthetic appeal. Acalypha monococca is also known for its ability to tolerate a variety of soil types and light conditions, making it a versatile choice for landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha monococca"
    },
    "taxonomy_art_desc": "Acalypha monococca belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by a wide variety of floral structures. Its order is Malpighiales, a diverse group of flowering plants that includes many species with distinctive floral and vegetative features, such as the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false mallow,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha monococca, a specific type within the genus Acalypha, known for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arkansas",
        "Illinois",
        "Kansas",
        "Kentucky",
        "Louisiana",
        "Missouri",
        "Oklahoma",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha monococca is primarily native to Arkansas, Illinois, Kansas, Kentucky, Louisiana, Missouri, Oklahoma, and Texas. This plant is commonly found in moist to wet habitats such as swamps, marshes, and along the edges of water bodies. It thrives in areas with rich, alluvial soils and is often associated with riparian zones. The species is known for its distinctive foliage and is sometimes used in wetland restoration projects. Its native range spans across much of the central and southeastern United States.",
    "distribution_introduced_art_desc": "Acalypha monococca was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed soils and along roadsides in countries such as Hawaii, Puerto Rico, and parts of Southeast Asia. The plant thrives in warm, humid climates and can spread rapidly through its prolific seed production. Due to its invasive nature, it has become a concern in some areas where it outcompetes native vegetation. Efforts to manage its spread include mechanical removal and the use of herbicides in affected regions."
}
