{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha scutellariifolia",
    "plant_slug": "acalypha-scutellariifolia",
    "plant_name_scientific": "acalypha scutellariifolia",
    "intro": "Acalypha scutellariifolia, commonly known as the \"spider plant\" or \"false nettle,\" is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, palmate leaves that resemble a spider's web, giving it its common name. The plant produces small, clustered greenish-white flowers that are often followed by bright red or orange berries. It thrives in moist, well-drained soil and prefers partial to full sun. Acalypha scutellariifolia is often cultivated as an ornamental plant due to its attractive foliage and ease of care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha scutellariifolia is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is also found in parts of tropical regions in Africa, such as Kenya and Tanzania. This plant thrives in humid, tropical climates and is often found in lowland areas with rich soil. It is commonly seen in wetlands, forest edges, and disturbed habitats. Its native distribution reflects its adaptation to warm, moist environments across these regions.",
    "distribution_introduced_art_desc": "Acalypha scutellariifolia was mainly introduced to ornamental horticulture and as a potential medicinal plant. It is commonly cultivated for its attractive foliage and is used in landscaping and garden design. The plant has been introduced to several tropical and subtropical regions around the world. It is valued for its ability to thrive in a variety of soil types and its tolerance to partial shade. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation."
}
