{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha peduncularis",
    "plant_slug": "acalypha-peduncularis",
    "plant_name_scientific": "acalypha peduncularis",
    "intro": "Acalypha peduncularis, commonly known as the red-hot poker or fireplant, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its striking, spiky red bracts that surround small yellow flowers, creating a vivid visual display. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are usually alternate, ovate, and have a smooth or slightly hairy surface. Acalypha peduncularis thrives in full sun and well-drained soil, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha peduncularis is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in moist, well-drained soils and is often seen in forests or near water bodies. It is also present in parts of the Pacific Islands, including Hawaii and the Philippines. Its native distribution is closely associated with warm, humid environments where it can grow vigorously.",
    "distribution_introduced_art_desc": "Acalypha peduncularis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and growth habit. It was first brought to Hawaii in the early 20th century by horticulturists and gardeners who valued its aesthetic qualities. However, it has since become naturalized and is now considered an invasive species in several areas of the region. Its rapid spread has led to concerns over its impact on native ecosystems and biodiversity. Despite its ornamental appeal, efforts are being made to control its spread and prevent further ecological damage."
}
