{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha crockeri",
    "plant_slug": "acalypha-crockeri",
    "plant_name_scientific": "acalypha crockeri",
    "intro": "Acalypha crockeri, commonly known as Crocker's spurge, is a flowering plant native to the Hawaiian Islands. It is a member of the Euphorbiaceae family, characterized by its unique floral structures and milky sap. The plant typically grows as a shrub with lance-shaped leaves and produces small, clustered flowers that are often surrounded by modified leaves called bracts. It thrives in moist, shaded environments and is adapted to the tropical climate of Hawaii. Due to its limited distribution, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha crockeri"
    },
    "taxonomy_art_desc": "Acalypha crockeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique adaptations such as sticky seeds and specialized leaves. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with milky sap and often showy flowers. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their distinctive foliage and showy inflorescences. Its species is Acalypha crockeri, a specific plant within the genus Acalypha, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Solomon Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha crockeri is primarily native to the Solomon Islands. It is found in the tropical regions of this archipelago, which is located in the South Pacific Ocean. The plant thrives in humid and warm climates, typically in forested areas or near coastal regions. It is a species that is well adapted to the unique ecological conditions of the Solomon Islands. Due to its limited range, it is considered a rare and endemic plant in the region.",
    "distribution_introduced_art_desc": "Acalypha crockeri was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was first documented in the early 20th century and has since become naturalized in several coastal areas. The plant thrives in moist, shaded environments and is often found growing in disturbed habitats. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to concerns about its invasive potential. Despite its aesthetic appeal, it is now considered a potential weed in some regions."
}
