{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha bussei",
    "plant_slug": "acalypha-bussei",
    "plant_name_scientific": "acalypha bussei",
    "intro": "Acalypha bussei, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, palmate leaves with prominent red veins contrasting against the green foliage. The plant produces small, inconspicuous greenish-white flowers arranged in clusters. It thrives in moist, shaded environments and is often found in tropical rainforests. Acalypha bussei is valued for its ornamental appeal and is sometimes cultivated as a decorative plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha bussei"
    },
    "taxonomy_art_desc": "Acalypha bussei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a large and diverse order of flowering plants that includes many tropical species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of shrubs and trees. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha bussei, a specific plant within the genus Acalypha, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kenya",
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha bussei is primarily native to Kenya and Tanzania. It is commonly found in the eastern and southern regions of these countries. This plant typically grows in tropical and subtropical climates, often in open woodland or along riverbanks. It is well adapted to the local environmental conditions of its native range. Its distribution is largely confined to these specific geographic areas.",
    "distribution_introduced_art_desc": "Acalypha bussei was mainly introduced to the Hawaiian Islands. It is considered an invasive species that has spread across various ecosystems there. The plant was initially introduced as an ornamental due to its attractive foliage. However, it has since become a threat to native plant communities. Its rapid growth and ability to outcompete native species have led to increased management efforts."
}
