{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fimbriata",
    "plant_slug": "acalypha-fimbriata",
    "plant_name_scientific": "acalypha fimbriata",
    "intro": "Acalypha fimbriata, commonly known as the silky fanleaf or fimbriated spurge, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its soft, hairy leaves that give it a velvety texture, and its clusters of small, yellowish-green flowers. The plant typically grows as an annual or perennial herb, often reaching heights of up to 1 meter. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and gardens. Acalypha fimbriata is valued for its ornamental appeal and is sometimes cultivated for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fimbriata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, shaded environments, often growing along riverbanks or in dense forests. It is known for its attractive foliage and is sometimes cultivated as an ornamental plant. Its native range also extends to parts of the Pacific Islands, where it is adapted to coastal and wetland habitats.",
    "distribution_introduced_art_desc": "Acalypha fimbriata was mainly introduced to ornamental horticulture due to its attractive, colorful foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions as a decorative plant in gardens and landscapes. The plant's ability to thrive in a variety of soil types and its relatively low maintenance requirements contribute to its popularity. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
