{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha affinis",
    "plant_slug": "acalypha-affinis",
    "plant_name_scientific": "acalypha affinis",
    "intro": "Acalypha affinis, commonly known as the velvetleaf or Indian nettle, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, palmate leaves that are often covered in fine hairs, giving it a velvety texture. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in moist, well-drained soils and is often found in disturbed areas such as roadsides and forests. Acalypha affinis is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha affinis is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is also found in parts of tropical regions in Africa and the Pacific Islands. This plant thrives in humid, tropical climates and is commonly found in lowland forests and along riverbanks. It is often seen growing in shaded undergrowth or in disturbed habitats. Its native range extends across several island nations in the Indo-Pacific region.",
    "distribution_introduced_art_desc": "Acalypha affinis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It was first recorded in the 19th century and has since spread throughout the country, particularly in coastal and lowland areas. The plant thrives in moist, well-drained soils and is commonly found in gardens, riverbanks, and disturbed sites. Although it is not considered invasive, it has the potential to naturalize and compete with native species in certain environments. Its distribution is now well-established across much of the North Island and parts of the South Island."
}
