{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha scandens var. mollis",
    "plant_slug": "acalypha-scandens-var-mollis",
    "plant_name_scientific": "acalypha scandens var. mollis",
    "intro": "Acalypha scandens var. mollis, commonly known as velvetleaf or woolly leaf, is a tropical plant characterized by its soft, velvety leaves. The foliage is typically dark green with a dense, fuzzy texture that gives it a distinctive appearance. It is a climbing or trailing plant that thrives in warm, humid climates. The plant produces small, inconspicuous flowers followed by spiny, three-lobed seed capsules. It is often cultivated as an ornamental plant for its unique leaf structure and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha scandens var. mollis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This variant thrives in moist, shaded environments, often growing along riverbanks or in dense forest undergrowth. It is well adapted to the warm and humid climate of its native range. The plant is sometimes cultivated as an ornamental due to its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha scandens var. mollis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It was popular among gardeners for its soft, velvety leaves and vibrant coloration. However, its introduction has led to concerns about its potential to become invasive in local ecosystems. The plant's rapid growth and ability to spread through seeds have raised questions about its impact on native flora. Despite its aesthetic appeal, careful management is recommended to prevent its spread beyond cultivated areas."
}
