{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha segetalis",
    "plant_slug": "acalypha-segetalis",
    "plant_name_scientific": "acalypha segetalis",
    "intro": "Acalypha segetalis, commonly known as the grain amaranth, is an annual herbaceous plant native to tropical and subtropical regions. It belongs to the Amaranthaceae family and is characterized by its simple, alternate leaves that are often green with red or purple veins. The plant produces small, clustered flowers that are usually green or yellow, followed by small, three-angled seeds. It thrives in disturbed soils and is often found in agricultural fields or along roadsides. Due to its nutritional value, it is cultivated as a potential crop for food and forage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha segetalis"
    },
    "taxonomy_art_desc": "Acalypha segetalis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Malpighiales, a large and diverse order of flowering plants that includes many species with specialized adaptations for various environments. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupid's whisk,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha segetalis, a specific plant within the genus Acalypha, known for its growth habits and potential ecological or agricultural significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Benin",
        "Botswana",
        "Burkina",
        "Cameroon",
        "Cape Provinces",
        "Central African Republic",
        "Chad",
        "Congo",
        "DR Congo",
        "Ethiopia",
        "Free State",
        "Gambia",
        "Ghana",
        "Guinea",
        "Ivory Coast",
        "Kenya",
        "KwaZulu-Natal",
        "Malawi",
        "Mali",
        "Mozambique",
        "Niger",
        "Nigeria",
        "Northern Provinces",
        "Senegal",
        "Sierra Leone",
        "Sudan-South Sudan",
        "Togo",
        "Uganda",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha segetalis is primarily native to Angola, Benin, Botswana, Burkina, Cameroon, Cape Provinces, Central African Republic, Chad, Congo, DR Congo, Ethiopia, Free State, Gambia, Ghana, Guinea, Ivory Coast, Kenya, KwaZulu-Natal, Malawi, Mali, Mozambique, Niger, Nigeria, Northern Provinces, Senegal, Sierra Leone, Sudan-South Sudan, Togo, Uganda, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions across these countries. The plant thrives in open habitats such as grasslands, woodland edges, and disturbed soils. It is often seen growing along roadsides and in agricultural areas. Its wide distribution suggests it is well-adapted to a variety of environmental conditions within its native range.",
    "distribution_introduced_art_desc": "Acalypha segetalis was mainly introduced to agricultural areas and disturbed sites due to its rapid growth and ability to thrive in poor soil conditions. It is commonly found along roadsides, in fields, and near human settlements where it can outcompete native vegetation. The plant's introduction has led to concerns about its potential invasiveness in certain regions. It is often used as a forage plant for livestock due to its high biomass production. However, its spread can reduce biodiversity and alter ecosystem dynamics in non-native habitats."
}
