{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lovelandii",
    "plant_slug": "acalypha-lovelandii",
    "plant_name_scientific": "acalypha lovelandii",
    "intro": "Acalypha lovelandii, commonly known as the velvetleaf or silverleaf acalypha, is a flowering plant native to the southern United States and parts of Mexico. It is characterized by its striking, velvety foliage that ranges from silver to deep green, often with a reddish tinge on the underside. The plant produces small, clustered flowers that are typically greenish-white in color, appearing in late spring to early summer. It thrives in moist, well-drained soils and prefers partial to full sun, making it a popular choice for ornamental gardens. Acalypha lovelandii is also known for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha lovelandii"
    },
    "taxonomy_art_desc": "Acalypha lovelandii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with diverse morphological features, including a wide range of floral structures and growth forms. Its order is Malpighiales, a large group of flowering plants that includes many economically important species, such as those in the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf,\" characterized by their showy bracts and often hairy foliage. Its species is Acalypha lovelandii, a specific plant within the genus Acalypha, known for its unique morphological traits and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lovelandii is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in rocky soils and is commonly found in desert environments. It is a shrub that is well adapted to the harsh climate of the region. Its distribution is limited to specific areas within the southwestern part of Mexico.",
    "distribution_introduced_art_desc": "Acalypha lovelandii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first brought to the islands in the early 20th century by horticulturists and plant collectors. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments and is often found along stream banks and in coastal forests. Its rapid spread has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
