{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fruticulosa",
    "plant_slug": "acalypha-fruticulosa",
    "plant_name_scientific": "acalypha fruticulosa",
    "intro": "Acalypha fruticulosa, commonly known as the flame bush, is a shrub native to tropical regions of Africa and the Americas. It is characterized by its striking, colorful bracts that resemble flowers, which are actually modified leaves. The plant typically grows to a height of 1 to 3 meters and has a bushy, compact form. Its leaves are usually opposite, ovate, and have a smooth or slightly hairy surface. Acalypha fruticulosa thrives in full sun to partial shade and is often cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fruticulosa is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is also found in parts of India, particularly in the eastern and southern regions. This plant thrives in tropical and subtropical climates, often growing in moist, shaded environments. It is commonly found in forest understories and along riverbanks. Its native range extends to the Philippines and parts of Oceania as well.",
    "distribution_introduced_art_desc": "Acalypha fruticulosa was mainly introduced to control soil erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed areas, along roadsides, and in agricultural fields. The plant spreads through its prolific seed production and can form dense mats that outcompete native vegetation. Due to its invasive nature, it is often classified as a weed in many parts of the world. However, it is also valued for its ability to stabilize soil and provide habitat for small animals."
}
