{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha fournieri",
    "plant_slug": "acalypha-fournieri",
    "plant_name_scientific": "acalypha fournieri",
    "intro": "Acalypha fournieri, commonly known as the red-flowered false mallow, is a shrub native to Madagascar. It is characterized by its striking, bright red bracts that surround small, yellow flowers, making it a visually appealing plant. The leaves are opposite, ovate, and often covered with fine hairs. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight. The plant is often cultivated for ornamental purposes due to its vibrant floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha fournieri"
    },
    "taxonomy_art_desc": "Acalypha fournieri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species, often with distinctive floral and vegetative features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false holly,\" characterized by their often showy inflorescences. Its species is Acalypha fournieri, a specific type of plant within the Acalypha genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha fournieri is primarily native to Mexico Central, Mexico Gulf, and Mexico Southwest. This species is commonly found in these regions, where it thrives in a variety of habitats. It is often associated with disturbed areas, such as roadsides and open fields. The plant is known for its distinctive foliage and is sometimes used in ornamental gardening. Its native range is limited to these specific areas within Mexico.",
    "distribution_introduced_art_desc": "Acalypha fournieri was mainly introduced to urban and disturbed areas due to its adaptability to various soil types and tolerance to environmental stress. It is commonly found along roadsides, in abandoned lots, and in areas with human activity. This plant has been reported in several regions of the Americas, including parts of the Caribbean and the southeastern United States. Its introduction is likely due to accidental dispersal through human activities such as construction and landscaping. However, its ecological impact remains under study, as it has not been widely documented as an invasive species."
}
