{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha multicaulis var. tenuispica",
    "plant_slug": "acalypha-multicaulis-var-tenuispica",
    "plant_name_scientific": "acalypha multicaulis var. tenuispica",
    "intro": "Acalypha multicaulis var. tenuispica, commonly known as the narrow-leaved nettleleaf, is a herbaceous plant native to parts of Southeast Asia. It features slender, lance-shaped leaves that are often covered in fine hairs, giving it a soft, velvety texture. The plant produces small, inconspicuous greenish-white flowers arranged in clusters, which are typically borne on bracted inflorescences. Its growth habit is upright, with multiple stems emerging from a single base, contributing to its bushy appearance. It thrives in moist, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha multicaulis var. tenuispica is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant of Acalypha multicaulis thrives in humid environments and is often associated with secondary forests and disturbed habitats. It is also occasionally found in parts of Indonesia and the Philippines. The plant is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Acalypha multicaulis var. tenuispica was mainly introduced to ornamental horticulture due to its attractive foliage and unique growth habit. It is commonly cultivated in tropical and subtropical regions for use in gardens and landscaping. The plant is often favored for its ability to thrive in shaded environments and its low maintenance requirements. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Its distribution has expanded beyond its native range due to its adaptability and aesthetic appeal."
}
