{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha lindheimeri",
    "plant_slug": "acalypha-lindheimeri",
    "plant_name_scientific": "acalypha lindheimeri",
    "intro": "Acalypha lindheimeri, commonly known as Lindheimer's spurge, is a flowering plant native to the southern United States. It belongs to the Euphorbiaceae family, which is characterized by its unique floral structures and often milky sap. The plant features showy, clustered inflorescences that are typically green with red or yellow bracts, attracting pollinators. Its leaves are usually opposite and have a smooth or slightly hairy surface. Acalypha lindheimeri thrives in moist, well-drained soils and is often found in woodland or streamside habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha lindheimeri is primarily native to the southeastern United States, particularly Texas, Oklahoma, and Louisiana. It is commonly found in moist, well-drained soils in woodland edges, along stream banks, and in open pine forests. This species thrives in humid climates and is often associated with disturbed or transitional habitats. It is also found in parts of Mexico, including the states of Tamaulipas and Nuevo León. The plant is known for its striking red bracts that attract pollinators and add ornamental value to the landscape.",
    "distribution_introduced_art_desc": "Acalypha lindheimeri was mainly introduced to the southern United States, particularly in Texas and Louisiana. It was originally from Mexico and Central America, and its introduction is associated with ornamental horticulture. The plant thrives in warm, humid climates and is often found in disturbed areas such as roadsides and abandoned fields. It has become naturalized in certain regions, leading to its classification as an invasive species in some areas. Due to its rapid growth and ability to spread through seeds, it poses a challenge to native plant communities."
}
