{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha pendula",
    "plant_slug": "acalypha-pendula",
    "plant_name_scientific": "acalypha pendula",
    "intro": "Acalypha pendula, commonly known as the hanging glorybower, is a flowering plant native to tropical regions of the Americas. It is characterized by its pendulous, showy inflorescences that consist of clusters of small, brightly colored bracts. The plant typically grows as a shrub or small tree, reaching heights of up to 6 meters. Its leaves are opposite, ovate, and often have a velvety texture. Acalypha pendula thrives in moist, well-drained soils and is often found in forest understories or along stream banks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha pendula"
    },
    "taxonomy_art_desc": "Acalypha pendula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many tropical and temperate species with varied morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with unique floral structures and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"beard-tongue,\" characterized by their showy inflorescences and often hairy foliage. Its species is Acalypha pendula, a specific plant within the genus known for its pendulous growth habit and distinctive floral display.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba",
        "Dominican Republic",
        "Haiti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha pendula is primarily native to Cuba, the Dominican Republic, and Haiti. This plant is commonly found in tropical and subtropical regions within these countries. It typically grows in open areas, such as disturbed soils or along roadsides. The species is known for its attractive, pendulous inflorescences. It plays a role in local ecosystems and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acalypha pendula was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive, pendulous flowers. However, it has since spread beyond cultivated areas and is now found in disturbed habitats throughout the islands. The plant's rapid growth and ability to thrive in various soil types contribute to its invasive nature. Efforts are ongoing to control its spread and mitigate its impact on native ecosystems."
}
