{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha neptunica var. genuina",
    "plant_slug": "acalypha-neptunica-var-genuina",
    "plant_name_scientific": "acalypha neptunica var. genuina",
    "intro": "Acalypha neptunica var. genuina, commonly known as the Neptune's necklace, is a striking ornamental plant native to Madagascar. It is characterized by its unique, cascading clusters of bright red bracts that resemble tiny flames or beads, giving it its common name. The plant features opposite, lance-shaped leaves that are often covered in fine, silky hairs. It thrives in warm, humid climates and prefers well-drained soil. Due to its vibrant appearance, it is often cultivated in gardens and as a potted plant for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha neptunica var. genuina is primarily native to the western Pacific, including parts of Indonesia, the Philippines, and New Guinea. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. It thrives in moist, well-drained soils and is often associated with rainforests or secondary growth habitats. The plant is known for its striking, colorful bracts that attract pollinators. Its distribution is largely restricted to the islands of Southeast Asia and the Pacific.",
    "distribution_introduced_art_desc": "Acalypha neptunica var. genuina was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activities such as horticultural trade or accidental transport. The plant thrives in moist, shaded environments and has spread rapidly in native forest areas. Its rapid growth and ability to form dense stands have led to the displacement of native vegetation. Conservation efforts are underway to control its spread and protect local ecosystems."
}
