{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha glandulifera",
    "plant_slug": "acalypha-glandulifera",
    "plant_name_scientific": "acalypha glandulifera",
    "intro": "Acalypha glandulifera, commonly known as the glandular spurflower, is a species of flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its striking, colorful bracts that resemble petals, often displaying shades of red, orange, and yellow. The plant produces small, inconspicuous flowers clustered within the bracts, which are often the primary attraction for pollinators. Its leaves are typically ovate with prominent veins and may have glandular structures, contributing to its scientific name. Acalypha glandulifera is often cultivated as an ornamental plant due to its vibrant foliage and showy inflorescences.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha glandulifera is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland forests and disturbed areas. This plant thrives in humid climates with well-drained soil, often growing near streams or in shaded undergrowth. Its distribution extends to parts of New Guinea and the Indian subcontinent as well. It is a member of the Euphorbiaceae family and is known for its distinctive foliage and flowering patterns.",
    "distribution_introduced_art_desc": "Acalypha glandulifera was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native vegetation in certain areas. The plant spreads rapidly through its seeds, which are dispersed by wind and water. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
