{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha aldabrica",
    "plant_slug": "acalypha-aldabrica",
    "plant_name_scientific": "acalypha aldabrica",
    "intro": "Acalypha aldabrica, commonly known as the Aldabra spurge, is a shrub native to the Comoros Islands. It is characterized by its hairy, lance-shaped leaves and small, yellowish-green flowers that appear in clusters. The plant produces capsule fruits that contain numerous tiny seeds. It thrives in coastal and sandy environments, often growing in dune habitats. Due to its limited distribution, it is considered a rare and potentially endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha aldabrica is primarily native to the island of Aldabra in the Seychelles. It is found in the arid and semi-arid regions of the island, particularly in coastal areas and dry woodlands. This plant thrives in sandy soils and is adapted to the tropical climate of the region. It is an important component of the local flora and plays a role in the ecosystem of Aldabra. Due to its restricted range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Acalypha aldabrica was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and forest edges. It thrives in tropical and subtropical climates with high humidity and moderate to high rainfall. The plant spreads primarily through its prolific seed production and ability to colonize disturbed areas quickly. Its introduction has led to its establishment in several regions outside its native range. However, it is not considered highly invasive and does not pose significant ecological threats in most environments."
}
