{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha dupraeana var. gaudichaudii",
    "plant_slug": "acalypha-dupraeana-var-gaudichaudii",
    "plant_name_scientific": "acalypha dupraeana var. gaudichaudii",
    "intro": "Acalypha dupraeana var. gaudichaudii, commonly known as the velvetleaf or red leaf acalypha, is a shrub native to Southeast Asia. It is characterized by its striking, velvety foliage that ranges from deep red to purple in color. The plant produces small, inconspicuous greenish-white flowers that are clustered in dense inflorescences. It thrives in warm, humid climates and is often cultivated for its ornamental value. The leaves are typically heart-shaped with a smooth texture and can vary in size depending on environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha dupraeana var. gaudichaudii is primarily native to the tropical regions of Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. This variant of Acalypha dupraeana is commonly found in lowland rainforests and secondary growth areas. It thrives in humid, warm climates with high rainfall and partial to full sunlight. The plant is often seen growing along forest edges, riverbanks, and in disturbed habitats. Its native distribution is closely linked to the biodiversity hotspots of the region.",
    "distribution_introduced_art_desc": "Acalypha dupraeana var. gaudichaudii was mainly introduced to New Caledonia. It is a variant of the species Acalypha dupraeana, which is native to the Pacific islands. This plant is commonly found in coastal areas and lowland forests. It has been reported as an invasive species in some regions of the Pacific. Its introduction has raised concerns due to its potential to outcompete native vegetation."
}
