{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha websteri",
    "plant_slug": "acalypha-websteri",
    "plant_name_scientific": "acalypha websteri",
    "intro": "Acalypha websteri, commonly known as the red veined strobilanthes, is a flowering plant native to Southeast Asia. It is characterized by its striking, bright red veins on its heart-shaped leaves, which give it a distinctive appearance. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in tropical and subtropical climates, often found in moist, shaded environments. Due to its ornamental value, it is cultivated as a houseplant and in botanical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha websteri"
    },
    "taxonomy_art_desc": "Acalypha websteri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants known for their varied growth forms and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupleaf,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha websteri, a specific type of plant within the Acalypha genus, distinguished by its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha websteri is primarily native to Ecuador. It is found in the tropical regions of the country, particularly in the western and central parts. This plant thrives in humid, lowland environments with rich soil. It is commonly found in secondary forests and along riverbanks. Its distribution is limited to specific ecological niches within Ecuador's biodiversity hotspots.",
    "distribution_introduced_art_desc": "Acalypha websteri was mainly introduced to New Zealand. It was first recorded in the 19th century and has since become naturalized in various regions of the country. The plant thrives in coastal and disturbed habitats, often spreading along the edges of forests and in open areas. Its rapid growth and ability to tolerate different soil types have contributed to its spread. However, it is not considered a major invasive species in New Zealand."
}
