{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha grandis var. genuina",
    "plant_slug": "acalypha-grandis-var-genuina",
    "plant_name_scientific": "acalypha grandis var. genuina",
    "intro": "Acalypha grandis var. genuina, commonly known as the velvetleaf or redroot, is a shrub native to tropical regions of the Americas. It is characterized by its smooth, reddish stems and heart-shaped leaves with a velvety texture. The plant produces clusters of small, greenish-white flowers followed by distinctive, three-lobed seed capsules. It thrives in moist, well-drained soils and is often found in disturbed habitats. Due to its ornamental value, it is sometimes cultivated in gardens, though it can become invasive in certain areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha grandis var. genuina is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland environments and is commonly found in forests and along riverbanks. This variant is particularly adapted to the warm and wet climate of these areas. It is also known to occur in parts of northern Australia. The plant is often associated with disturbed or secondary growth habitats due to its rapid growth and ability to colonize open areas.",
    "distribution_introduced_art_desc": "Acalypha grandis var. genuina was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for cultivation. The plant has since become naturalized in certain areas, spreading through both seed dispersal and vegetative propagation. Its rapid growth and ability to thrive in disturbed soils have led to its classification as an invasive species in some regions of Hawaii. Despite its ornamental value, it poses a threat to native ecosystems by outcompeting indigenous plants for resources."
}
