{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha brachyclada",
    "plant_slug": "acalypha-brachyclada",
    "plant_name_scientific": "acalypha brachyclada",
    "intro": "Acalypha brachyclada, commonly known as the narrow-leaved spurge, is a flowering plant native to tropical regions of Africa. It belongs to the Euphorbiaceae family, which is known for its diverse and often toxic species. The plant features small, clustered flowers surrounded by colorful bracts, which are modified leaves that serve to attract pollinators. Its leaves are typically narrow and have a smooth texture, while its stems are often hairy. Acalypha brachyclada is often found in disturbed habitats such as roadsides and clearings.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha brachyclada"
    },
    "taxonomy_art_desc": "Acalypha brachyclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized structures such as stipules and unique leaf arrangements. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"caper spurge,\" characterized by their showy flowers and often hairy foliage. Its species is Acalypha brachyclada, a specific plant within the genus Acalypha, distinguished by its unique morphological traits such as short branches and specific leaf structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha brachyclada is primarily native to Peru. It is found in the tropical and subtropical regions of the country. This plant typically grows in moist, shaded areas within the Andean foothills. It is commonly observed in forest understories and along riverbanks. Its native distribution is limited to specific ecological zones within Peru.",
    "distribution_introduced_art_desc": "Acalypha brachyclada was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since become naturalized in several regions, often thriving in disturbed soils and along riverbanks. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its establishment in native ecosystems. While it is not considered a major invasive species, it can outcompete native plants in certain areas. Its distribution is currently limited to specific regions of New Zealand, with ongoing monitoring to assess its ecological impact."
}
