{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha obtusifolia",
    "plant_slug": "acalypha-obtusifolia",
    "plant_name_scientific": "acalypha obtusifolia",
    "intro": "Acalypha obtusifolia, commonly known as the velvetleaf or Indian velvet, is a flowering plant native to tropical and subtropical regions. It is characterized by its smooth, waxy leaves that are typically green on the upper surface and purplish or reddish on the underside. The plant produces small, inconspicuous greenish-white flowers arranged in clusters. It thrives in moist, well-drained soils and is often found in disturbed areas or along roadsides. Acalypha obtusifolia is also known for its ornamental value due to its attractive foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha obtusifolia is primarily native to tropical and subtropical regions of Asia, Africa, and the Pacific Islands. It is commonly found in countries such as India, China, Indonesia, and the Philippines. The plant thrives in moist, shaded environments and is often associated with wetlands and forest understories. It is also present in parts of Australia and the Caribbean. Its native range includes a variety of habitats, from lowland forests to coastal areas.",
    "distribution_introduced_art_desc": "Acalypha obtusifolia was mainly introduced to areas with warm, humid climates where it can thrive in disturbed soils and open habitats. It is commonly found in tropical and subtropical regions, including parts of Southeast Asia, Africa, and the Pacific Islands. The plant is often cultivated as an ornamental due to its attractive foliage and ability to spread rapidly. However, it can become invasive in some regions, outcompeting native vegetation. Its distribution is largely influenced by human activity, such as landscaping and accidental seed dispersal."
}
