{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cuneata",
    "plant_slug": "acalypha-cuneata",
    "plant_name_scientific": "acalypha cuneata",
    "intro": "Acalypha cuneata, commonly known as the arrowleaf acalypha, is a flowering plant native to tropical and subtropical regions of Africa, Asia, and the Pacific. It is a herbaceous annual or perennial species that typically grows to a height of 1 to 3 meters. The plant features heart-shaped, arrowhead-shaped leaves that are often covered in fine hairs, giving it a distinctive appearance. Its small, clustered flowers are usually greenish-yellow and are followed by distinctive, three-lobed seed capsules. Acalypha cuneata is often cultivated as an ornamental plant due to its attractive foliage and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cuneata"
    },
    "taxonomy_art_desc": "Acalypha cuneata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large group of flowering plants known for their diverse morphological features and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their distinctive leaves and colorful bracts. Its species is Acalypha cuneata, a specific type of plant within the Acalypha genus, known for its unique leaf shape and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Colombia",
        "Ecuador",
        "Panamá",
        "Peru",
        "Venezuela",
        "Venezuelan Antilles"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cuneata is primarily native to Bolivia, Brazil North, Colombia, Ecuador, Panamá, Peru, Venezuela, Venezuelan Antilles. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in moist, well-drained soils and is often found in forest understories or along stream banks. The species is known for its ornamental value and is sometimes cultivated for its unique foliage. Its native range spans a significant portion of South America, particularly in the Andean and Amazonian regions.",
    "distribution_introduced_art_desc": "Acalypha cuneata was mainly introduced to coastal and wetland areas for its ornamental value and ability to stabilize soil. It is commonly found in regions with high humidity and saline conditions. This plant has become naturalized in several tropical and subtropical regions. Its rapid growth and adaptability have led to its spread along shorelines and in disturbed habitats. However, it is considered a potential invasive species in some areas due to its competitive nature."
}
