{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha persimilis",
    "plant_slug": "acalypha-persimilis",
    "plant_name_scientific": "acalypha persimilis",
    "intro": "Acalypha persimilis, commonly known as the silky fanleaf, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, palmate leaves that are soft to the touch and often covered in fine hairs. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Acalypha persimilis is valued in horticulture for its ornamental foliage and ability to add texture to garden landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha persimilis"
    },
    "taxonomy_art_desc": "Acalypha persimilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide range of growth forms. Its order is Malpighiales, a large order of flowering plants that includes many species with diverse morphological features. Its family is Euphorbiaceae, commonly known as the spurge family, characterized by their latex-producing structures and often showy inflorescences. Its genus is Acalypha, which consists of flowering plants commonly known as \"velvetleaf\" or \"cuprum,\" often with unique leaf shapes and structures. Its species is Acalypha persimilis, a specific plant within the genus Acalypha, known for its distinctive appearance and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Alabama",
        "Arizona",
        "Arkansas",
        "Bahamas",
        "Belize",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "El Salvador",
        "Florida",
        "Georgia",
        "Guatemala",
        "Haiti",
        "Honduras",
        "Illinois",
        "Indiana",
        "Iowa",
        "Jamaica",
        "Kansas",
        "Kentucky",
        "Leeward Is.",
        "Louisiana",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Mississippi",
        "Missouri",
        "Nebraska",
        "New Mexico",
        "Nicaragua",
        "North Carolina",
        "Ohio",
        "Oklahoma",
        "Puerto Rico",
        "South Carolina",
        "Tennessee",
        "Texas",
        "Virginia",
        "West Virginia"
    ],
    "distribution_introduced": [
        "Ecuador",
        "Italy"
    ],
    "distribution_native_art_desc": "Acalypha persimilis is primarily native to Alabama, Arizona, Arkansas, Bahamas, Belize, Costa Rica, Cuba, Dominican Republic, El Salvador, Florida, Georgia, Guatemala, Haiti, Honduras, Illinois, Indiana, Iowa, Jamaica, Kansas, Kentucky, Leeward Is., Louisiana, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, Mississippi, Missouri, Nebraska, New Mexico, Nicaragua, North Carolina, Ohio, Oklahoma, Puerto Rico, South Carolina, Tennessee, Texas, Virginia, and West Virginia. This plant thrives in a variety of habitats, including woodlands, prairies, and disturbed areas. It is commonly found in regions with warm climates and well-drained soils. Acalypha persimilis is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Its wide distribution across the southeastern and southwestern United States, as well as parts of the Caribbean, reflects its adaptability to different environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha persimilis was mainly introduced to Ecuador and Italy. It is a flowering plant native to tropical and subtropical regions of Asia. In Ecuador, it has been reported in the coastal and lowland areas, often growing in disturbed habitats. In Italy, it has been found in urban and suburban environments, likely due to its ornamental value. Its introduction to these regions may have occurred through horticultural trade or accidental dispersal."
}
