{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha macrostachya var. genuina",
    "plant_slug": "acalypha-macrostachya-var-genuina",
    "plant_name_scientific": "acalypha macrostachya var. genuina",
    "intro": "Acalypha macrostachya var. genuina, commonly known as the red-veined nettle, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, reddish veins on its heart-shaped leaves, which give it a distinctive appearance. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shaded environments and is often found in forest understories. Its ornamental value makes it a popular choice for tropical gardens and indoor plant collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha macrostachya var. genuina is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, shaded environments. This variant thrives in humid climates and is often associated with rainforests or secondary growth vegetation. It is known for its attractive foliage and is sometimes cultivated as an ornamental plant. The plant's natural range extends into parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Acalypha macrostachya var. genuina was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred in the early 20th century, primarily through horticultural trade. It has since become naturalized in certain regions, particularly in coastal and disturbed areas. However, its spread is limited compared to other invasive species in the region."
}
