{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha × cristata",
    "plant_slug": "acalypha-×-cristata",
    "plant_name_scientific": "acalypha × cristata",
    "intro": "Acalypha × cristata, commonly known as the crested spurge, is a hybrid plant belonging to the Euphorbiaceae family. It is characterized by its unique, flattened, and often branched stems that resemble a crown or crest, giving it its common name. The plant produces small, inconspicuous flowers clustered in cyathia, which are surrounded by modified leaves called bracts. It is native to Southeast Asia and thrives in tropical and subtropical climates. Acalypha × cristata is often cultivated as an ornamental plant due to its striking appearance and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha × cristata"
    },
    "taxonomy_art_desc": "Acalypha × cristata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar families such as the Magnoliaceae and Lauraceae. Its order is Malpighiales, a diverse group of flowering plants that includes many economically important species, such as those in the Euphorbiaceae family. Its family is Euphorbiaceae, commonly known as the spurge family, which includes a wide variety of plants with diverse morphologies and ecological roles. Its genus is Acalypha, a group of flowering plants known for their showy inflorescences and often used in ornamental horticulture. Its species is Acalypha × cristata, a hybrid plant known for its distinctive, crinkled leaves and is commonly cultivated for its ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kenya",
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha × cristata is primarily native to Kenya and Tanzania. This plant is commonly found in the coastal regions of these countries. It thrives in tropical and subtropical climates with high humidity. It is often seen growing in open woodlands and along the edges of forests. Its native distribution is limited to these specific areas in East Africa.",
    "distribution_introduced_art_desc": "Acalypha × cristata was mainly introduced to ornamental horticulture due to its unique and striking foliage. It is commonly cultivated as a houseplant or in indoor gardens for its colorful, velvety leaves. The plant is native to tropical regions but has been widely distributed in temperate climates as a decorative species. Its introduction has led to its presence in various parts of the world, including North America and Europe. However, it is not typically considered an invasive species in most regions where it is grown."
}
