{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rhomboidea",
    "plant_slug": "acalypha-rhomboidea",
    "plant_name_scientific": "acalypha rhomboidea",
    "intro": "Acalypha rhomboidea, commonly known as the round-leaf or velvetleaf, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its distinctive, rhomboid-shaped leaves that are often covered in a fine, velvety texture. The plant produces small, clustered flowers that are typically greenish-yellow in color. It is often found in moist, shaded environments such as forests or along stream banks. Acalypha rhomboidea is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha rhomboidea"
    },
    "taxonomy_art_desc": "Acalypha rhomboidea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with unique morphological and ecological adaptations. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"false holly,\" characterized by their often hairy leaves and showy inflorescences. Its species is Acalypha rhomboidea, a specific plant within the genus Acalypha known for its distinctive rhomboid-shaped leaves and is native to tropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Alabama",
        "Arkansas",
        "Connecticut",
        "Delaware",
        "District of Columbia",
        "Florida",
        "Georgia",
        "Illinois",
        "Indiana",
        "Iowa",
        "Kansas",
        "Kentucky",
        "Louisiana",
        "Maine",
        "Maryland",
        "Massachusetts",
        "Michigan",
        "Minnesota",
        "Mississippi",
        "Missouri",
        "Nebraska",
        "New Brunswick",
        "New Hampshire",
        "New Jersey",
        "New York",
        "North Carolina",
        "North Dakota",
        "Nova Scotia",
        "Ohio",
        "Oklahoma",
        "Ontario",
        "Pennsylvania",
        "Québec",
        "Rhode I.",
        "South Carolina",
        "South Dakota",
        "Tennessee",
        "Texas",
        "Vermont",
        "Virginia",
        "West Virginia",
        "Wisconsin"
    ],
    "distribution_introduced": [
        "Italy",
        "Romania"
    ],
    "distribution_native_art_desc": "Acalypha rhomboidea is primarily native to the eastern and central United States, including Alabama, Arkansas, Connecticut, Delaware, District of Columbia, Florida, Georgia, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri, Nebraska, New Brunswick, New Hampshire, New Jersey, New York, North Carolina, North Dakota, Nova Scotia, Ohio, Oklahoma, Ontario, Pennsylvania, Québec, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Vermont, Virginia, West Virginia, and Wisconsin. It thrives in a variety of habitats, including woodlands, wetlands, and disturbed areas. The plant is commonly found in moist soils and is often associated with riparian zones. It is known for its distinctive rhomboid-shaped leaves and is sometimes used in horticulture for its ornamental value. Its wide distribution across these regions reflects its adaptability to different environmental conditions.",
    "distribution_introduced_art_desc": "Acalypha rhomboidea was mainly introduced to Italy and Romania. It is considered an invasive species in these regions due to its rapid growth and ability to outcompete native vegetation. The plant thrives in disturbed soils and can spread quickly along roadsides and in agricultural areas. Its introduction has led to concerns about its impact on local ecosystems and biodiversity. Efforts are being made to monitor and control its spread in these countries."
}
