{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha cuprea",
    "plant_slug": "acalypha-cuprea",
    "plant_name_scientific": "acalypha cuprea",
    "intro": "Acalypha cuprea, commonly known as copperleaf, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the Euphorbiaceae family and is characterized by its striking reddish-orange foliage. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences. Its leaves are typically ovate to elliptical in shape and have a smooth or slightly hairy texture. Acalypha cuprea is often cultivated as an ornamental plant due to its vibrant leaf color and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha cuprea"
    },
    "taxonomy_art_desc": "Acalypha cuprea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized structures such as stipules and unique leaf arrangements. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse growth forms and often contains latex-producing species. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cuphea,\" characterized by their showy flowers and hairy foliage. Its species is Acalypha cuprea, a specific type within the genus known for its distinctive red stems and is commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha cuprea is primarily native to Bolivia. It is commonly found in the eastern regions of the country, particularly in the departments of Beni, Santa Cruz, and Tarija. This plant thrives in tropical and subtropical environments, often growing in moist, shaded areas within the rainforest. It is an important component of the local flora and is adapted to the humid climate of the region. Its distribution is largely restricted to specific ecological zones within Bolivia.",
    "distribution_introduced_art_desc": "Acalypha cuprea was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first recorded in the 19th century and has since become established in various regions across the country. The plant thrives in moist, well-drained soils and is often found in disturbed areas such as roadsides and riverbanks. Although it is not considered highly invasive, it has the potential to spread and compete with native vegetation if left unchecked. Conservation efforts focus on monitoring its distribution and preventing further spread to protect local ecosystems."
}
