{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha mollis var. polystachya",
    "plant_slug": "acalypha-mollis-var-polystachya",
    "plant_name_scientific": "acalypha mollis var. polystachya",
    "intro": "Acalypha mollis var. polystachya, commonly known as velvetleaf or silky ironweed, is a tropical shrub native to regions of Southeast Asia. It is characterized by its soft, velvety foliage, which gives it its common name, and its clusters of small, greenish-white flowers. The plant produces fluffy, woolly seed heads that are often mistaken for cotton, adding to its ornamental appeal. It thrives in moist, shady environments and is often found in wetlands or along stream banks. Due to its attractive appearance and adaptability, it is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha mollis var. polystachya is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary forests and disturbed habitats. It is also known to grow in coastal areas and along riverbanks. Its native range extends into parts of Oceania, including New Guinea and the Solomon Islands.",
    "distribution_introduced_art_desc": "Acalypha mollis var. polystachya was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering habits. The distribution of this plant has been primarily confined to cultivated areas and gardens. However, it has occasionally escaped into the wild, leading to localized naturalization. Its spread is limited, but it is considered a potential weed in some regions."
}
