{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha gentryi",
    "plant_slug": "acalypha-gentryi",
    "plant_name_scientific": "acalypha gentryi",
    "intro": "Acalypha gentryi, commonly known as the Gentry's spurge, is a flowering plant native to the southeastern United States. It belongs to the Euphorbiaceae family, which is characterized by its unique floral structures and often milky sap. The plant typically grows as an annual herb with opposite, ovate leaves that are often covered in fine hairs. Its small, inconspicuous flowers are clustered in cup-like structures called cyathia, a feature common in the Euphorbiaceae family. Acalypha gentryi is known for its ability to thrive in disturbed soils and is often found in open woods and along roadsides.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha gentryi is primarily native to the Caribbean islands, particularly the Greater Antilles. It is found in countries such as Cuba, Hispaniola, and Jamaica. This species thrives in tropical and subtropical environments, often in disturbed or open habitats. It is commonly associated with coastal areas and may be found in dry or moist forests. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acalypha gentryi was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It is commonly found in disturbed habitats such as roadsides, vacant lots, and wetlands. This species thrives in moist to wet soil conditions and is often associated with riparian zones. Its introduction has led to its establishment in both natural and urban environments. However, it is not considered invasive and is primarily valued for its ornamental qualities."
}
