{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha reticulata var. rubra",
    "plant_slug": "acalypha-reticulata-var-rubra",
    "plant_name_scientific": "acalypha reticulata var. rubra",
    "intro": "Acalypha reticulata var. rubra, commonly known as red leaf spurges, is a striking ornamental plant native to tropical regions. It is characterized by its vibrant red or orange bracts that surround small yellow flowers, creating a striking visual display. The plant has palmately lobed leaves that are often covered in a fine, silky hair, adding to its ornamental appeal. It thrives in warm, humid climates and prefers well-drained soil. Due to its ornamental value, it is often cultivated in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha reticulata var. rubra is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often seen growing in forest understories or near water sources. It is also present in parts of Oceania, including Papua New Guinea and the Solomon Islands. Its distribution is closely linked to its preference for warm, humid climates and its ability to adapt to various soil types.",
    "distribution_introduced_art_desc": "Acalypha reticulata var. rubra was mainly introduced to the Pacific Islands as an ornamental plant due to its vibrant red foliage. It was first documented in Hawaii in the early 20th century and has since spread to other tropical regions. The plant is commonly found in gardens and disturbed areas, where it thrives in warm, humid climates. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to its establishment in natural habitats. However, it is considered a potential invasive species in some areas, raising concerns about its ecological impact."
}
