{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha grandifolia",
    "plant_slug": "acalypha-grandifolia",
    "plant_name_scientific": "acalypha grandifolia",
    "intro": "Acalypha grandifolia, commonly known as the large-leaved spurge, is a herbaceous plant native to tropical regions of the Americas. It is characterized by its striking, palmate leaves that are often covered in fine hairs. The plant produces small, greenish-yellow flowers arranged in clusters, which are followed by distinctive, three-lobed seed capsules. It thrives in moist, shaded environments and is often found in rainforests. Acalypha grandifolia is valued for its ornamental appeal and has traditional uses in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha grandifolia is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in humid, shaded environments, often found in lowland forests and along riverbanks. The plant is commonly associated with disturbed or secondary growth areas due to its ability to colonize open spaces. It is also present in parts of northern Australia and some Pacific Islands. Acalypha grandifolia is known for its showy, colorful bracts that attract pollinators and contribute to its ecological significance in native habitats.",
    "distribution_introduced_art_desc": "Acalypha grandifolia was mainly introduced to the Pacific Islands as an ornamental plant due to its attractive foliage and vibrant flowers. It has since become naturalized in several coastal areas, particularly in Hawaii and other tropical regions. The plant thrives in moist, sunny environments and is often found growing along stream banks and in disturbed soils. Its rapid growth and ability to spread through seeds have led to concerns about its impact on native ecosystems. Despite its beauty, it is considered a potential invasive species in some areas."
}
