{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha subintegra",
    "plant_slug": "acalypha-subintegra",
    "plant_name_scientific": "acalypha subintegra",
    "intro": "Acalypha subintegra, commonly known as the velvetleaf or silky leaf plant, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking, velvety foliage that ranges from green to reddish hues. The plant produces small, clustered flowers that are typically green or yellowish in color. It thrives in humid environments and requires well-drained soil for optimal growth. Acalypha subintegra is often cultivated as an ornamental plant due to its attractive leaves and ease of care.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha subintegra"
    },
    "taxonomy_art_desc": "Acalypha subintegra belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malpighiales, a large and diverse group of flowering plants that includes many tropical and temperate species. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with diverse morphologies and some containing toxic compounds. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupweed,\" characterized by their often hairy leaves and showy flowers. Its species is Acalypha subintegra, a specific type of Acalypha known for its distinctive leaf structure and growth habits, typically found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha subintegra is primarily native to New Guinea. It is found in the tropical regions of this island, where it thrives in humid and warm climates. The plant is commonly found in lowland areas and near water sources. It is often seen growing in disturbed soils and along forest edges. Its native distribution is largely confined to the eastern and western parts of New Guinea.",
    "distribution_introduced_art_desc": "Acalypha subintegra was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for cultivation. The species has since become naturalized in some areas, spreading through both seed dispersal and vegetative reproduction. It thrives in tropical and subtropical climates, often found in disturbed habitats such as roadsides and vacant lots. However, its invasive potential remains a concern in some regions where it can outcompete native vegetation."
}
