{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha communis var. brevipes",
    "plant_slug": "acalypha-communis-var-brevipes",
    "plant_name_scientific": "acalypha communis var. brevipes",
    "intro": "Acalypha communis var. brevipes, commonly known as the narrowleaf ironweed, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its slender, upright growth habit and small, lance-shaped leaves that are usually covered in fine hairs. The plant produces clusters of tiny, greenish-white flowers that are often surrounded by bracts, giving it a distinctive appearance. It thrives in moist, well-drained soils and is often found in woodland or streamside habitats. This species is valued for its ornamental qualities and is sometimes cultivated in gardens for its attractive foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha communis var. brevipes is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in lowland tropical regions with high humidity and warm temperatures. This variant is often associated with moist forest understories and riverine habitats. It thrives in areas with well-drained to moderately wet soils. Its distribution is also reported in parts of Indonesia and Malaysia.",
    "distribution_introduced_art_desc": "Acalypha communis var. brevipes was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and compact growth habit. The introduction occurred during the 19th century when many exotic plants were imported for horticultural purposes. Despite its aesthetic value, it has since become invasive in certain areas, outcompeting native species. Its rapid spread has led to increased management efforts to control its impact on local ecosystems."
}
