{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalyphopsis celebica",
    "plant_slug": "acalyphopsis-celebica",
    "plant_name_scientific": "acalyphopsis celebica",
    "intro": "Acalyphopsis celebica, commonly known as the Celebes acalyphopsis, is a flowering plant native to the Indonesian island of Sulawesi. It belongs to the family Euphorbiaceae, which includes many species with diverse morphological characteristics. The plant is typically shrub-like, with small, simple leaves and produces clusters of yellowish flowers. It thrives in tropical and subtropical climates, often found in moist, well-drained soils. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalyphopsis celebica is primarily native to the Indonesian island of Sulawesi. It is found in the lowland and montane forest areas of the island. This plant thrives in humid, tropical climates with high rainfall. It is commonly observed in secondary growth and disturbed habitats. Its distribution is limited to specific regions within Sulawesi, indicating a narrow ecological niche.",
    "distribution_introduced_art_desc": "Acalyphopsis celebica was mainly introduced to the island of Sulawesi in Indonesia. It was introduced as an ornamental plant due to its attractive foliage and compact growth habit. The plant has since become established in certain areas of the island, particularly in disturbed habitats and along roadsides. Its introduction has raised concerns due to its potential to become invasive in native ecosystems. However, its impact on local biodiversity is still being studied."
}
