{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acalypha rapensis",
    "plant_slug": "acalypha-rapensis",
    "plant_name_scientific": "acalypha rapensis",
    "intro": "Acalypha rapensis, commonly known as the red-veined or red-leaf acalypha, is a flowering plant native to tropical regions of Africa. It is characterized by its striking, colorful foliage, often featuring vibrant red, yellow, and green veins on its leaves. The plant belongs to the Euphorbiaceae family, which includes many species with unique floral structures. Acalypha rapensis typically grows as an upright shrub, reaching heights of up to 2 meters. Its ornamental value makes it a popular choice for garden landscapes and indoor cultivation.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Euphorbiaceae",
        "genus": "Acalypha",
        "species": "Acalypha rapensis"
    },
    "taxonomy_art_desc": "Acalypha rapensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with specialized flowers and often showy fruits. Its family is Euphorbiaceae, commonly known as the spurge family, which includes plants with distinctive flowers and often produces toxic milky sap. Its genus is Acalypha, a group of flowering plants commonly known as \"velvetleaf\" or \"cupplant,\" characterized by their showy inflorescences and often hairy leaves. Its species is Acalypha rapensis, a specific plant within the genus Acalypha, native to certain regions and distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tubuai Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acalypha rapensis is primarily native to the Tubuai Is. This plant is found in the tropical regions of the Tubuai Islands, which are part of the French Polynesia archipelago. It thrives in coastal and lowland areas with sandy soils. The species is adapted to the humid and warm climate of the region. It plays a role in the local ecosystem and is often found in open vegetation.",
    "distribution_introduced_art_desc": "Acalypha rapensis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become an invasive species, outcompeting native plants in certain areas. The plant thrives in moist, disturbed soils and can spread rapidly through seeds. Its introduction has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
