{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acamptopappus sphaerocephalus var. hirtellus",
    "plant_slug": "acamptopappus-sphaerocephalus-var-hirtellus",
    "plant_name_scientific": "acamptopappus sphaerocephalus var. hirtellus",
    "intro": "Acamptopappus sphaerocephalus var. hirtellus, commonly known as the hairy globemallow, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its globular, pale yellow to orange flowers that bloom in late spring to early summer. The plant has hairy stems and leaves, which help it retain moisture in arid environments. It thrives in well-drained soils and full sunlight, making it well adapted to desert conditions. Its unique morphology and ecological role make it an important species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acamptopappus",
        "species": "Acamptopappus sphaerocephalus"
    },
    "taxonomy_art_desc": "Acamptopappus sphaerocephalus var. hirtellus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms. Its order is Asterales, which consists of flowering plants with showy flowers, often with composite inflorescences. Its family is Asteraceae, commonly known as the sunflower family, characterized by their head-like flower clusters and wind-pollinated flowers. Its genus is Acamptopappus, a group of flowering plants in the Asteraceae family with distinctive morphological features. Its species is Acamptopappus sphaerocephalus, a specific type within the genus known for its spherical heads and hairy structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Nevada"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acamptopappus sphaerocephalus var. hirtellus is primarily native to Arizona, California, and Nevada. This plant is commonly found in the arid and semi-arid regions of these states. It thrives in sandy or rocky soils, often in desert or scrubland habitats. The species is adapted to the dry climate and can tolerate high temperatures. It plays a role in local ecosystems by providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acamptopappus sphaerocephalus var. hirtellus was mainly introduced to areas with well-drained sandy or gravelly soils, often in disturbed or open habitats. It thrives in full sun and is commonly found in coastal dunes, sandy fields, and along roadsides. This plant is adapted to arid and semi-arid environments, making it resilient to drought conditions. It is often considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction has raised concerns about its impact on local ecosystems and biodiversity."
}
