{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe hulae",
    "plant_slug": "acampe-hulae",
    "plant_name_scientific": "acampe hulae",
    "intro": "Acampe hulae, commonly known as the Hula Hala, is a rare flowering plant native to the tropical regions of Southeast Asia. It belongs to the family Araceae, which includes plants like philodendrons and calla lilies. The plant is characterized by its striking, heart-shaped leaves and clusters of small, white flowers that bloom in the summer. Acampe hulae thrives in moist, shaded environments and is often found in humid forest understories. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acampe",
        "species": "Acampe hulae"
    },
    "taxonomy_art_desc": "Acampe hulae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Asparagales, a large group of flowering plants that includes familiar plants such as asparagus, orchids, and agaves, known for their diverse growth forms and ecological adaptations. Its family is Orchidaceae, commonly known as the orchid family, which is one of the largest families of flowering plants, characterized by their intricate and often showy flowers. Its genus is Acampe, a relatively small genus of orchids native to specific regions, known for its unique floral features and ecological niche. Its species is Acampe hulae, a specific type of orchid that is likely endemic to a particular habitat, distinguished by its unique morphology and genetic makeup.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cambodia",
        "Laos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe hulae is primarily native to Cambodia and Laos. This plant is found in the tropical regions of these countries. It typically grows in moist, shaded habitats such as forests and along riverbanks. Acampe hulae is part of the Rubiaceae family, which includes many economically important plants. Its distribution is limited to specific ecological zones within Cambodia and Laos.",
    "distribution_introduced_art_desc": "Acampe hulae was mainly introduced to the Hawaiian Islands. It was brought there by humans, likely for ornamental purposes due to its unique appearance. The plant has since spread to various coastal areas, particularly in wetlands and disturbed sites. Its introduction has raised concerns due to its potential to outcompete native species. However, it is not currently classified as an invasive species in the region."
}
