{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe longifolia",
    "plant_slug": "acampe-longifolia",
    "plant_name_scientific": "acampe longifolia",
    "intro": "Acampe longifolia, commonly known as the long-leaved acampe, is a flowering plant native to certain regions of Southeast Asia. It belongs to the family Rubiaceae, which includes many species of shrubs and herbs. The plant is characterized by its elongated, lance-shaped leaves and clusters of small, white to pale yellow flowers. It typically grows in moist, shaded environments such as forest understories. Acampe longifolia is valued for its ornamental appeal and has been used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe longifolia is primarily native to the eastern and southern regions of South Africa, including the provinces of KwaZulu-Natal, Eastern Cape, and parts of Mpumalanga. It is commonly found in coastal areas, sand dunes, and rocky outcrops, where it thrives in well-drained sandy soils. This plant is adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters. It is often seen growing in open vegetation types such as fynbos and coastal scrub. Acampe longifolia is also occasionally found in the northern parts of the Western Cape, though it is less common there.",
    "distribution_introduced_art_desc": "Acampe longifolia was mainly introduced to areas with suitable climate conditions, particularly regions with warm, humid climates and well-drained soils. It is commonly found in disturbed habitats such as roadsides, open woodlands, and along stream banks. The plant has been reported in several countries in the Pacific and Southeast Asia, including Australia, Hawaii, and parts of Indonesia. Due to its rapid growth and ability to spread through seeds, it has become an invasive species in some regions. Its introduction has raised concerns about its impact on native flora and ecosystems."
}
