{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe praemorsa var. rigida",
    "plant_slug": "acampe-praemorsa-var-rigida",
    "plant_name_scientific": "acampe praemorsa var. rigida",
    "intro": "Acampe praemorsa var. rigida, commonly known as the rigid acampe, is a perennial herbaceous plant native to specific regions of South America. It features slender, upright stems that are often covered in fine hairs, giving it a distinctive appearance. The plant produces small, clustered flowers that are typically white or pale pink, blooming during the spring and early summer. Its leaves are lance-shaped and arranged alternately along the stem, contributing to its ornamental value. This variety is valued in horticulture for its delicate foliage and ability to thrive in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe praemorsa var. rigida is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and Texas, as well as parts of Sonora and Sinaloa. This plant typically grows in rocky soils and arid environments, often in desert or chaparral habitats. It is commonly associated with limestone and granite outcrops. Its distribution is limited to specific ecological niches within these geographic areas.",
    "distribution_introduced_art_desc": "Acampe praemorsa var. rigida was mainly introduced to New Zealand. It was brought there during the 19th century as part of the European flora introduced for ornamental purposes. This plant is commonly found in coastal areas and disturbed sites throughout the country. It has since become naturalized and is now considered a weed in some regions. Its distribution is largely confined to the lower North Island and parts of the South Island."
}
