{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe thailandica",
    "plant_slug": "acampe-thailandica",
    "plant_name_scientific": "acampe thailandica",
    "intro": "Acampe thailandica, commonly known as Thai acampe, is a flowering plant native to Southeast Asia, particularly Thailand. It belongs to the family Acanthaceae and is characterized by its showy, tubular flowers that range in color from white to pink. The plant typically grows in moist, shaded environments such as forest understories and along stream banks. Its leaves are opposite, ovate, and often have a velvety texture. Acampe thailandica is valued for its ornamental appeal and is sometimes cultivated in gardens for its aesthetic qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe thailandica is primarily native to tropical and subtropical regions of Southeast Asia, particularly Thailand, Malaysia, and Indonesia. It thrives in humid, warm climates and is commonly found in lowland forests and along riverbanks. This species is well adapted to moist environments and often grows in shaded undergrowth. It is also occasionally found in parts of southern China and the Philippines. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acampe thailandica was mainly introduced to tropical and subtropical regions for its ornamental value and potential medicinal uses. It thrives in warm, humid climates with well-drained soil, making it suitable for cultivation in southern Asia, parts of the Americas, and the Caribbean. The plant is often grown in gardens and as part of landscape designs due to its attractive foliage and resilience. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems. Proper management is recommended to prevent unintended ecological impacts."
}
