{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acamptopappus sphaerocephalus",
    "plant_slug": "acamptopappus-sphaerocephalus",
    "plant_name_scientific": "acamptopappus sphaerocephalus",
    "intro": "Acamptopappus sphaerocephalus, commonly known as the globe-headed acamptopappus, is a flowering plant native to the southwestern United States and northern Mexico. It belongs to the Asteraceae family, characterized by its composite flower heads. The plant is distinguished by its spherical, dense flower heads that are typically pink to purple in color. Its leaves are narrow and grass-like, and it thrives in arid and semi-arid environments. The species is often found in rocky soils and is adapted to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acamptopappus",
        "species": "Acamptopappus sphaerocephalus"
    },
    "taxonomy_art_desc": "Acamptopappus sphaerocephalus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging lineages, often characterized by their primitive floral structures and diverse forms. Its order is Asterales, a group of flowering plants that includes many familiar families such as the sunflowers and daisies, known for their composite flower heads and diverse ecological roles. Its family is Asteraceae, commonly known as the sunflower family, which is one of the largest families of flowering plants, characterized by their composite inflorescences and a wide range of ecological adaptations. Its genus is Acamptopappus, a group of flowering plants within the Asteraceae family, typically characterized by their distinctive floral structures and specific geographic distributions. Its species is Acamptopappus sphaerocephalus, a specific plant within the genus Acamptopappus, known for its spherical heads and unique morphological features that distinguish it from other species in the genus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Nevada",
        "Utah"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acamptopappus sphaerocephalus is primarily native to Arizona, California, Nevada, and Utah. This plant is commonly found in the western United States, particularly in arid and semi-arid regions. It thrives in sandy or gravelly soils and is often associated with desert scrub and chaparral habitats. The species is well adapted to the harsh environmental conditions of these states. It plays an important role in local ecosystems by providing food and habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acamptopappus sphaerocephalus was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed soils along roadsides, railroads, and in open areas. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It thrives in a variety of soil types but prefers well-drained areas. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
