{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acamptopappus shockleyi",
    "plant_slug": "acamptopappus-shockleyi",
    "plant_name_scientific": "acamptopappus shockleyi",
    "intro": "Acamptopappus shockleyi, commonly known as Shockley's acamptopappus, is a flowering plant native to the southwestern United States. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant produces small, yellowish flowers that bloom in late spring to early summer. It has linear, grass-like leaves and is typically found in sandy or rocky soils. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acamptopappus",
        "species": "Acamptopappus shockleyi"
    },
    "taxonomy_art_desc": "Acamptopappus shockleyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails, and is known for having true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species such as roses and magnolias, and is distinguished by their complex floral structures and diverse reproductive systems. Its order is Asterales, which includes flowering plants with showy flowers, such as daisies and sunflowers, and is notable for its economic importance and ecological roles. Its family is Asteraceae, commonly known as the sunflower family, which includes over 32,000 species and is characterized by composite flowers made up of many small florets. Its genus is Acamptopappus, a group of flowering plants within the Asteraceae family, typically with narrow leaves and a specific structure in their pappus, which aids in seed dispersal. Its species is Acamptopappus shockleyi, a specific plant within the genus Acamptopappus, known for its unique morphological features and limited geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California",
        "Nevada"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acamptopappus shockleyi is primarily native to California and Nevada. This plant is commonly found in the arid and semi-arid regions of these states. It thrives in sandy or gravelly soils, often in desert or scrubland habitats. The species is adapted to the dry climate and limited water availability typical of its native range. It plays a role in the local ecosystem by providing habitat and forage for native wildlife.",
    "distribution_introduced_art_desc": "Acamptopappus shockleyi was mainly introduced to the western United States, particularly in California and Nevada. It is commonly found in disturbed areas such as roadsides, fields, and along fence lines. This plant thrives in dry, sunny environments with well-drained soils. Its introduction has been associated with human activity, including transportation and land development. Due to its adaptability, it has become an invasive species in some regions, outcompeting native vegetation."
}
