{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe pachyphylla",
    "plant_slug": "acampe-pachyphylla",
    "plant_name_scientific": "acampe pachyphylla",
    "intro": "Acampe pachyphylla, commonly known as the thick-leaved acampe, is a succulent plant native to the arid regions of South Africa. It is characterized by its thick, fleshy leaves that store water, allowing it to survive in dry conditions. The plant produces small, yellow flowers during the rainy season, adding a subtle beauty to its environment. Its growth habit is typically low and compact, forming a dense mat that helps prevent soil erosion. Due to its resilience, it is often used in xeriscaping and as a drought-tolerant ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe pachyphylla is primarily native to the arid regions of southern Africa, particularly in Namibia and South Africa. It thrives in rocky and sandy soils within the Namib Desert and surrounding areas. This plant is well adapted to extreme desert conditions, with thick, fleshy leaves that store water. It is commonly found in gravelly plains and along rocky outcrops. Due to its limited range and specific habitat requirements, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acampe pachyphylla was mainly introduced to areas with arid and semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the southern parts of the country. This plant is often used in landscaping due to its drought tolerance and ornamental value. It prefers full sun exposure and minimal water, making it suitable for xeriscaping. Its introduction has been primarily for ornamental and erosion control purposes in suitable environments."
}
