{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acamptopappus microcephalus",
    "plant_slug": "acamptopappus-microcephalus",
    "plant_name_scientific": "acamptopappus microcephalus",
    "intro": "Acamptopappus microcephalus, commonly known as the small-headed acamptopappus, is a flowering plant native to the southwestern United States and northern Mexico. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows in rocky or sandy soils and is adapted to arid environments. Its small, compact stature and gray-green foliage help it conserve water in harsh conditions. It produces tiny, inconspicuous flowers that are often overlooked but play a role in its ecological niche.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acamptopappus microcephalus is primarily native to the southwestern United States and northern Mexico. It is commonly found in arid and semi-arid regions, including parts of Arizona, New Mexico, Texas, and California. This plant thrives in sandy or rocky soils and is often associated with desert scrub and grassland habitats. It is well adapted to hot, dry climates and can withstand periods of drought. Its native range extends into the Chihuahuan and Sonoran Deserts, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acamptopappus microcephalus was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and along stream banks. It thrives in environments with full sun and well-drained soil, making it a common weed in agricultural and urban settings. This plant is often found in the western United States, particularly in states like California, Nevada, and Oregon. Its rapid growth and ability to produce large numbers of seeds contribute to its invasive potential in new regions. However, it is not considered a major threat in most areas where it is established."
}
