{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe nyassana",
    "plant_slug": "acampe-nyassana",
    "plant_name_scientific": "acampe nyassana",
    "intro": "Acampe nyassana, commonly known as the East African spurge, is a flowering plant native to eastern Africa. It belongs to the Euphorbiaceae family and is characterized by its distinctive, milky sap. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are alternate, simple, and often have a waxy texture. Acampe nyassana produces small, clustered flowers that are usually greenish-yellow in color.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe nyassana is primarily native to eastern and southern Africa, including countries such as Tanzania, Kenya, Uganda, and Zambia. It is commonly found in woodland and savanna habitats, often growing in areas with well-drained soils. The plant is adapted to the tropical and subtropical climates of these regions, thriving in both dry and wet seasons. It is an important component of the local flora and is sometimes used in traditional medicine. Its distribution is closely linked to the natural vegetation patterns of the African continent.",
    "distribution_introduced_art_desc": "Acampe nyassana was mainly introduced to areas with suitable climatic conditions for its growth, such as tropical and subtropical regions. It has been reported in several countries across Africa, particularly in regions with high humidity and well-drained soils. The plant is often found in disturbed habitats, including agricultural fields and along roadsides. Its introduction has raised concerns due to its potential to become an invasive species. However, further research is needed to fully understand its ecological impact."
}
