{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe mombasensis",
    "plant_slug": "acampe-mombasensis",
    "plant_name_scientific": "acampe mombasensis",
    "intro": "Acampe mombasensis, commonly known as the Mombasa acacia, is a flowering plant native to East Africa. It belongs to the Fabaceae family, characterized by its pod fruits and nitrogen-fixing ability. The plant typically grows as a shrub or small tree, with compound leaves and yellow flowers. It is often found in coastal and sandy soils, thriving in arid and semi-arid regions. Due to its ecological and potential medicinal importance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe mombasensis is primarily native to coastal regions of eastern Africa, specifically Tanzania and Kenya. It is commonly found in sandy or rocky coastal habitats along the Indian Ocean coast. This plant thrives in areas with high salinity and strong winds typical of the coastal environment. It is often seen growing near mangroves or in dune ecosystems. Its distribution is limited to these specific ecological zones within the region.",
    "distribution_introduced_art_desc": "Acampe mombasensis was mainly introduced to coastal regions of East Africa, particularly in Tanzania and Kenya. It is commonly found in sandy soils near the shoreline, where it thrives in the warm, humid climate. The plant is often used for dune stabilization due to its deep root system and ability to withstand salt spray. It has also been introduced to some parts of southern Africa for similar ecological purposes. However, its spread is limited due to its specific habitat requirements."
}
