{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe carinata",
    "plant_slug": "acampe-carinata",
    "plant_name_scientific": "acampe carinata",
    "intro": "Acampe carinata, commonly known as the mountain holly, is a shrub native to the Andean regions of South America. It is characterized by its dense, evergreen foliage and small, dark green leaves with a slightly waxy texture. The plant produces clusters of small, white flowers that bloom in late spring, followed by bright red berries in the fall. It thrives in cool, moist environments and is often found in mountainous forests. Due to its ornamental value and ecological importance, it is sometimes cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acampe",
        "species": "Acampe carinata"
    },
    "taxonomy_art_desc": "Acampe carinata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Asparagales, a large group of monocot flowering plants that includes familiar plants like orchids, asparagus, and lilies. Its family is Orchidaceae, commonly known as the orchid family, which is renowned for its diverse and often showy flowers. Its genus is Acampe, a small group of orchids native to specific regions in South America, characterized by their unique floral morphology. Its species is Acampe carinata, a specific type of orchid known for its distinctive features and habitat preferences within its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "Cambodia",
        "China South-Central",
        "East Himalaya",
        "Hainan",
        "India",
        "Laos",
        "Myanmar",
        "Nepal",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe carinata is primarily native to Assam, Bangladesh, Cambodia, China South-Central, East Himalaya, Hainan, India, Laos, Myanmar, Nepal, Thailand, Vietnam, and West Himalaya. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in moist, shaded environments, often in forest understories. The species is known for its ornamental value and is sometimes cultivated for its attractive foliage. Its native range spans a wide geographic area in South and Southeast Asia.",
    "distribution_introduced_art_desc": "Acampe carinata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It was first recorded in the 19th century and has since spread beyond cultivated areas into natural ecosystems. The plant thrives in a variety of soil types and is particularly common in disturbed habitats such as roadsides and forest margins. Its rapid growth and ability to form dense stands have led to concerns about its impact on native plant communities. Despite its invasive tendencies, it remains a popular choice for gardeners due to its low maintenance requirements."
}
