{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acamptopappus sphaerocephalus var. sphaerocephalus",
    "plant_slug": "acamptopappus-sphaerocephalus-var-sphaerocephalus",
    "plant_name_scientific": "acamptopappus sphaerocephalus var. sphaerocephalus",
    "intro": "Acamptopappus sphaerocephalus var. sphaerocephalus, commonly known as the globe-headed acamptopappus, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its compact, globular shape and dense clusters of small, yellowish flowers. The plant has hairy stems and leaves that are typically gray-green in color. It thrives in arid and semi-arid environments, often found in rocky soils and open woodlands. This species is valued for its ornamental appeal and drought tolerance in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acamptopappus",
        "species": "Acamptopappus sphaerocephalus"
    },
    "taxonomy_art_desc": "[WRONG START] Acamptopopappus sphaerocephalus var. sphaerocephalus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex vascular system and the ability to perform photosynthesis. Its class is Equisetopsida, which includes ferns and horsetails, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Asterales, which comprises flowering plants with showy flowers, often arranged in heads, and includes many familiar species like daisies and sunflowers. Its family is Asteraceae, commonly known as the aster family, which is characterized by composite flowers made up of many small florets and includes over 32,000 species. Its genus is Acamptopappus, a group of flowering plants typically found in arid and semi-arid regions, with distinctive capitula and bracteate involucres. Its species is Acamptopappus sphaerocephalus, a specific variety known for its spherical heads and is native to certain regions of North America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Nevada",
        "Utah"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acamptopappus sphaerocephalus var. sphaerocephalus is primarily native to Arizona, California, Nevada, and Utah. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy or gravelly soils, often in open habitats such as deserts and scrublands. The species is well adapted to the harsh environmental conditions of the southwestern United States. Its distribution is largely restricted to the western parts of the country where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acamptopappus sphaerocephalus var. sphaerocephalus was mainly introduced to the United States, particularly in the western regions. It is commonly found in disturbed soils and open habitats such as roadsides, fields, and waste areas. This plant has been documented in states like California, Nevada, and Arizona. Its introduction is believed to be through human activities, including transportation of contaminated soil or seeds. Due to its adaptability, it has established itself in various ecological zones within these regions."
}
