{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe ochracea",
    "plant_slug": "acampe-ochracea",
    "plant_name_scientific": "acampe ochracea",
    "intro": "Acampe ochracea, commonly known as the yellow bellflower, is a flowering plant native to South America. It is characterized by its showy, yellow-orange bell-shaped flowers that bloom in late summer. The plant typically grows in moist, well-drained soils and thrives in partial to full sunlight. Its leaves are lance-shaped and have a slightly hairy texture. Acampe ochracea is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acampe",
        "species": "Acampe ochracea"
    },
    "taxonomy_art_desc": "Acampe ochracea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and diverse growth forms. Its order is Asparagales, a large group of flowering plants that includes many familiar genera such as orchids, lilies, and asparagus. Its family is Orchidaceae, commonly known as the orchid family, which is one of the largest families of flowering plants, characterized by their intricate and often showy flowers. Its genus is Acampe, a relatively small genus of orchids native to Southeast Asia, known for its unique floral structures and ecological adaptations. Its species is Acampe ochracea, a specific orchid species recognized by its distinctive yellowish coloration and habitat preferences in tropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "Cambodia",
        "China South-Central",
        "East Himalaya",
        "India",
        "Laos",
        "Myanmar",
        "Sri Lanka",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe ochracea is primarily native to Assam, Bangladesh, Cambodia, China South-Central, East Himalaya, India, Laos, Myanmar, Sri Lanka, Thailand, and Vietnam. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in moist, shaded environments such as forests and along riverbanks. The species is part of the Rubiaceae family and is known for its ornamental value. Its native distribution reflects its adaptation to diverse ecological conditions in South and Southeast Asia.",
    "distribution_introduced_art_desc": "Acampe ochracea was mainly introduced to New Zealand. It is considered an invasive species in the region. The plant was likely introduced through accidental means, such as transport on contaminated soil or equipment. It has since spread to various parts of the country, outcompeting native vegetation. Efforts are being made to control its spread and prevent further ecological damage."
}
