{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe joiceyana",
    "plant_slug": "acampe-joiceyana",
    "plant_name_scientific": "acampe joiceyana",
    "intro": "Acampe joiceyana, commonly known as the Joicey's acampe, is a flowering plant native to the arid regions of South America. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows as a shrub or small tree, with woody stems and narrow, lance-shaped leaves. Its flowers are small and yellow, arranged in dense clusters, and it produces small, dry fruits called achenes. Acampe joiceyana is adapted to survive in harsh, dry environments, often with deep root systems to access water.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acampe",
        "species": "Acampe joiceyana"
    },
    "taxonomy_art_desc": "Acampe joiceyana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include horsetails and other ancient plant groups. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Asparagales, which consists of flowering plants with diverse forms, including orchids, grasses, and lilies. Its family is Orchidaceae, known as the orchid family, which includes over 25,000 species of flowering plants. Its genus is Acampe, a group of flowering plants within the orchid family, typically found in specific geographic regions. Its species is Acampe joiceyana, a specific type of orchid known for its unique characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Myanmar",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe joiceyana is primarily native to Myanmar, Thailand, and Vietnam. This plant is found in the tropical regions of these countries. It typically grows in forested areas and is adapted to the humid climate. The distribution of Acampe joiceyana is limited to these specific geographic locations. It is not commonly found outside of this native range.",
    "distribution_introduced_art_desc": "Acampe joiceyana was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and waste areas. It thrives in regions with moderate to high rainfall and well-drained soils. The plant has been reported in several states across the southeastern United States. Its introduction is often associated with human activity, including landscaping and accidental seed dispersal. Due to its rapid growth and adaptability, it can become invasive in certain environments."
}
