{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe dentata",
    "plant_slug": "acampe-dentata",
    "plant_name_scientific": "acampe dentata",
    "intro": "Acampe dentata, commonly known as the toothed acampe, is a flowering plant native to the Mediterranean region. It is a perennial herb that typically grows to a height of about 30 to 60 centimeters. The plant features slender, upright stems with alternate, toothed leaves that are often covered in fine hairs. Its flowers are small and clustered in dense spikes, usually appearing in shades of pink or purple. Acampe dentata is valued for its ornamental appeal and is often cultivated in gardens for its delicate appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe dentata is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetland areas, including marshes, swamps, and the edges of ponds. This plant thrives in moist to wet soils and is often associated with disturbed or transitional habitats. It is an important component of the wetland ecosystem, providing habitat and food for various wildlife species. Due to its specific habitat requirements, it is not commonly found outside of its native range.",
    "distribution_introduced_art_desc": "Acampe dentata was mainly introduced to control erosion and stabilize soil in coastal and sandy areas. It is commonly used in restoration projects due to its ability to thrive in harsh, saline environments. The plant has been introduced to several regions along the Atlantic coast of the United States. It is often planted in dunes and along shorelines to prevent sand movement and protect inland areas. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation."
}
