{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe renschiana",
    "plant_slug": "acampe-renschiana",
    "plant_name_scientific": "acampe renschiana",
    "intro": "Acampe renschiana, commonly known as the Rensch's acampe, is a flowering plant native to the tropical regions of South America. It belongs to the family Campanulaceae, which includes bellflowers, and is characterized by its showy, bell-shaped flowers. The plant typically grows in moist, shaded environments, such as forest understories, and prefers well-drained soil. Its foliage consists of broad, lance-shaped leaves, and it produces clusters of blue or purple flowers during the warmer months. Acampe renschiana is valued in horticulture for its ornamental appeal and ability to thrive in humid, tropical climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe renschiana is primarily native to South America, particularly in regions of Brazil, Bolivia, and Paraguay. It is commonly found in the Amazon rainforest and surrounding areas, thriving in humid, tropical environments. This plant prefers well-drained soils and is often associated with secondary growth and disturbed habitats. It is an important component of the understory vegetation in these ecosystems. Due to its limited range, it is considered a rare and endemic species in parts of its native habitat.",
    "distribution_introduced_art_desc": "Acampe renschiana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive yellow flowers. However, it has since become invasive, spreading rapidly in native ecosystems. The plant competes with native species for resources, leading to ecological concerns. Efforts are being made to control its spread and prevent further harm to the environment."
}
