{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe taiwaniana",
    "plant_slug": "acampe-taiwaniana",
    "plant_name_scientific": "acampe taiwaniana",
    "intro": "Acampe taiwaniana, commonly known as the Taiwan acampe, is a flowering plant native to Taiwan. It belongs to the family Campanulaceae and is characterized by its bell-shaped flowers. The plant typically grows in moist, shaded environments, such as mountain forests. Its leaves are opposite and ovate, with a smooth surface. Acampe taiwaniana is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe taiwaniana is primarily native to Taiwan. It is commonly found in the mountainous regions of the island, particularly in the central and eastern areas. This plant thrives in humid, shaded environments, often growing in forests or on rocky slopes. It is an endemic species, meaning it is not found naturally anywhere else in the world. Its distribution is limited to specific habitats within Taiwan, making it a unique part of the region's biodiversity.",
    "distribution_introduced_art_desc": "Acampe taiwaniana was mainly introduced to the eastern coastal regions of Taiwan, where it thrives in moist, shaded environments. It has been observed growing in forest understories and along stream banks, often in areas with high humidity. The plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction is primarily attributed to human activities such as horticultural trade and accidental seed dispersal. Efforts are being made to monitor its spread and manage its impact on local ecosystems."
}
