{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe bidoupense",
    "plant_slug": "acampe-bidoupense",
    "plant_name_scientific": "acampe bidoupense",
    "intro": "Acampe bidoupense, commonly known as the Bidoup Mountain acampe, is a flowering plant native to the mountainous regions of Southeast Asia. It belongs to the family Campanulaceae and is characterized by its bell-shaped flowers that range in color from white to pale blue. The plant typically grows in moist, shaded environments within forested areas. Its leaves are lance-shaped and arranged alternately along the stem. Acampe bidoupense is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe bidoupense is primarily native to the rainforests of eastern Australia, specifically in the states of New South Wales and Queensland. It is commonly found in areas with high humidity and well-drained soils, often growing in the understorey of dense forest canopies. This plant is particularly associated with the coastal and mountainous regions of these areas, where it thrives in the moist, shaded environments. It is an important component of the local flora, contributing to the biodiversity of the region. Due to its specific habitat requirements, it is considered a rare and endemic species within its native range.",
    "distribution_introduced_art_desc": "Acampe bidoupense was mainly introduced to areas with suitable climate and soil conditions, particularly in regions with warm, humid climates. It is commonly found in disturbed habitats such as roadsides, clearings, and abandoned fields. The plant spreads through its seeds, which are dispersed by wind, water, and animals. Its introduction has led to its establishment in several regions beyond its native range. However, its ecological impact remains largely unknown due to limited research."
}
