{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe pachyglossa",
    "plant_slug": "acampe-pachyglossa",
    "plant_name_scientific": "acampe pachyglossa",
    "intro": "Acampe pachyglossa, commonly known as the broad-lipped acampe, is a perennial herb native to the mountainous regions of South America. It is characterized by its thick, fleshy leaves that are often covered in a waxy coating, which helps it retain moisture in arid environments. The plant produces small, tubular flowers that are typically pink or purple in color, arranged in clusters at the ends of the stems. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and xeriscaping. Its botanical features make it an interesting subject for both horticultural study and ecological research.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acampe",
        "species": "Acampe pachyglossa"
    },
    "taxonomy_art_desc": "Acampe pachyglossa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels, and is characterized by their diverse floral structures. Its order is Asparagales, a large group of flowering plants that includes many familiar genera like orchids, grasses, and lilies, often with complex reproductive systems. Its family is Orchidaceae, commonly known as the orchid family, which is one of the largest families of flowering plants, characterized by their showy flowers and specialized pollination mechanisms. Its genus is Acampe, a small genus of orchids native to South America, known for its unique floral morphology and ecological adaptations. Its species is Acampe pachyglossa, a specific type of orchid found in certain regions of South America, distinguished by its distinctive features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Aldabra",
        "Angola",
        "Comoros",
        "DR Congo",
        "Eswatini",
        "Kenya",
        "KwaZulu-Natal",
        "Madagascar",
        "Malawi",
        "Mauritius",
        "Mozambique",
        "Northern Provinces",
        "Réunion",
        "Seychelles",
        "Somalia",
        "Tanzania",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe pachyglossa is primarily native to Aldabra, Angola, Comoros, DR Congo, Eswatini, Kenya, KwaZulu-Natal, Madagascar, Malawi, Mauritius, Mozambique, Northern Provinces, Réunion, Seychelles, Somalia, Tanzania, Zambia, and Zimbabwe. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in diverse habitats such as coastal dunes, rocky outcrops, and dry forests. Its distribution spans across multiple islands and mainland countries in eastern and southern Africa. The species is well adapted to the climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acampe pachyglossa was mainly introduced to the western United States, particularly in California and Oregon. It was brought there for its ornamental value due to its striking blue and purple flowers. The plant thrives in well-drained soils and full sun, making it suitable for garden settings. However, it has shown invasive tendencies in some areas, outcompeting native vegetation. Conservationists are monitoring its spread to prevent ecological disruption."
}
