{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe cephalotes",
    "plant_slug": "acampe-cephalotes",
    "plant_name_scientific": "acampe cephalotes",
    "intro": "Acampe cephalotes, commonly known as the golden rain tree, is a deciduous tree native to Southeast Asia. It is characterized by its showy, yellow flowers that bloom in clusters, creating a striking visual display. The plant has compound leaves that are alternate and pinnate, with small, oval-shaped leaflets. It thrives in tropical and subtropical climates and is often cultivated for its ornamental value. The tree is also valued for its fast growth rate and ability to provide shade in urban landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acampe",
        "species": "Acampe cephalotes"
    },
    "taxonomy_art_desc": "Acampe cephalotes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes green algae and land plants, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Asparagales, a large group of flowering plants that includes plants like orchids, asparagus, and lilies. Its family is Orchidaceae, commonly known as the orchid family, which is one of the largest families of flowering plants, known for their diverse and often showy flowers. Its genus is Acampe, a group of flowering plants within the Orchidaceae family, typically characterized by their unique floral structures and specific ecological adaptations. Its species is Acampe cephalotes, a specific type of orchid known for its distinctive features and habitat preferences within its native region.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "Myanmar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe cephalotes is primarily native to Assam, Bangladesh, and Myanmar. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in moist, shaded environments, often growing in forest understories. The species is well adapted to the humid climate and rich soil conditions of its native range. It plays an important ecological role in the local biodiversity of these regions.",
    "distribution_introduced_art_desc": "Acampe cephalotes was mainly introduced to areas with warm, humid climates to support its growth in tropical and subtropical regions. It is often found in disturbed habitats such as abandoned fields, roadsides, and forest edges. The plant has been introduced to several countries in Southeast Asia and parts of the Pacific Islands. Its rapid growth and ability to thrive in poor soil conditions have made it a common invasive species in some regions. However, it is not considered highly invasive and has limited ecological impact compared to other introduced plants."
}
