{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe penangiana",
    "plant_slug": "acampe-penangiana",
    "plant_name_scientific": "acampe penangiana",
    "intro": "Acampe penangiana, commonly known as the Penang acampe, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the family Rubiaceae, which includes over 13,000 species of flowering plants. The plant is characterized by its small, clustered flowers that are typically white or pale pink in color. It thrives in moist, shaded environments and is often found in forest understories. Its leaves are simple, ovate, and have a slightly hairy texture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe penangiana is primarily native to the tropical regions of Southeast Asia, particularly Malaysia and Indonesia. It is commonly found in the states of Peninsular Malaysia, including Penang and Perak. This plant thrives in humid, lowland areas with rich soil and high rainfall. It is often associated with secondary forests and disturbed habitats. Its natural range extends to parts of Brunei and the western region of Sumatra.",
    "distribution_introduced_art_desc": "Acampe penangiana was mainly introduced to Malaysia, particularly in Penang, where it has become a notable species in local ecosystems. It is commonly found in coastal areas and mangrove forests, thriving in saline and brackish water environments. The plant is valued for its ornamental qualities and has been cultivated for its unique foliage. However, its introduction has also raised concerns about its potential impact on native flora. Due to its adaptability, it has spread to other regions with similar climatic conditions."
}
