{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe praemorsa var. longepedunculata",
    "plant_slug": "acampe-praemorsa-var-longepedunculata",
    "plant_name_scientific": "acampe praemorsa var. longepedunculata",
    "intro": "Acampe praemorsa var. longepedunculata, commonly known as the long pedunculate acampe, is a rare and distinctive plant species characterized by its elongated peduncles and showy inflorescences. It belongs to the family Apiaceae, which includes many aromatic and medicinal plants. The plant typically grows in moist, shaded environments, such as woodlands or stream sides, and is native to specific regions in Europe. Its flowers are usually white or pale yellow, and the leaves are finely divided, contributing to its ornamental appeal. Due to its rarity and specific habitat requirements, it is often considered a conservation concern.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acampe",
        "species": "Acampe praemorsa"
    },
    "taxonomy_art_desc": "Acampe praemorsa var. longepedunculata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their algae relatives, characterized by their complex cellular structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a unique structure known as a rhizome and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is known for its diverse floral structures. Its order is Asparagales, a large group of flowering plants that includes many familiar species like orchids, asparagus, and lilies, characterized by their diverse growth forms and floral adaptations. Its family is Orchidaceae, commonly known as orchids, which is one of the largest families of flowering plants, known for their intricate and often showy flowers. Its genus is Acampe, a relatively small genus of orchids native to tropical regions, typically characterized by their unique floral morphology and specific ecological preferences. Its species is Acampe praemorsa, a specific type of orchid within the genus Acampe, distinguished by its particular morphological traits and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Assam",
        "Bangladesh",
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Hainan",
        "India",
        "Laos",
        "Malaya",
        "Myanmar",
        "Nepal",
        "Philippines",
        "Sri Lanka",
        "Taiwan",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Cuba"
    ],
    "distribution_native_art_desc": "Acampe praemorsa var. longepedunculata is primarily native to the Andaman Is., Assam, Bangladesh, Cambodia, China South-Central, China Southeast, East Himalaya, Hainan, India, Laos, Malaya, Myanmar, Nepal, Philippines, Sri Lanka, Taiwan, Thailand, Vietnam, and West Himalaya. This variant of Acampe praemorsa is commonly found in tropical and subtropical regions across Southeast Asia and the Himalayan foothills. It thrives in moist, shaded environments, often in forested areas or along riverbanks. The plant is known for its distinctive floral structures and is often associated with humid, lowland habitats. Its wide distribution suggests adaptability to a range of ecological conditions within its native range.",
    "distribution_introduced_art_desc": "Acampe praemorsa var. longepedunculata was mainly introduced to Cuba. It is a variant of the species Acampe praemorsa, which is native to the Caribbean region. This plant was likely introduced for ornamental purposes due to its distinctive floral characteristics. It has been observed growing in cultivated gardens and naturalized areas in Cuba. However, its ecological impact and distribution in the wild are still being studied."
}
