{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe multiflora",
    "plant_slug": "acampe-multiflora",
    "plant_name_scientific": "acampe multiflora",
    "intro": "Acampe multiflora, commonly known as the many-flowered acampe, is a flowering plant native to specific regions of Africa. It belongs to the family Asteraceae, which is characterized by its composite flower heads. The plant typically grows as a shrub or small tree, reaching heights of up to several meters. Its leaves are usually opposite and lance-shaped, with a rough texture. The flowers are small and yellow, arranged in dense clusters, making it an attractive plant for ornamental purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe multiflora is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in wetland habitats such as marshes, swamps, and along the edges of ponds and streams. This plant is commonly found in the coastal regions and lower elevations of these areas. It plays an important ecological role by providing habitat and food for various wildlife species. Due to its preference for moist environments, it is often associated with areas that experience seasonal flooding.",
    "distribution_introduced_art_desc": "Acampe multiflora was mainly introduced to the United States as an ornamental plant due to its attractive yellow flowers and hardy nature. It has since spread into natural areas, particularly in the southeastern region, where it thrives in disturbed soils and sunny environments. This plant is considered invasive in some states because it can outcompete native vegetation and alter ecosystem dynamics. Its rapid growth and ability to form dense stands make it a challenge for land managers. Efforts to control its spread often involve mechanical removal and herbicide application in affected areas."
}
