{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe madagascariensis",
    "plant_slug": "acampe-madagascariensis",
    "plant_name_scientific": "acampe madagascariensis",
    "intro": "Acampe madagascariensis, commonly known as the Madagascar acampe, is a flowering plant native to Madagascar. It belongs to the family Rubiaceae and is characterized by its woody stems and small, clustered flowers. The plant typically grows in moist, shaded environments within the island's tropical rainforests. Its leaves are simple, opposite, and often have a glossy surface. Acampe madagascariensis is noted for its ornamental value and is sometimes cultivated for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acampe madagascariensis is primarily native to Madagascar. It is found in the eastern and northern parts of the island, where the climate is humid and tropical. This plant typically grows in forested areas and along riverbanks. It is adapted to the rich, moist soils of these regions. Due to its restricted range, it is considered a endemic species of Madagascar.",
    "distribution_introduced_art_desc": "Acampe madagascariensis was mainly introduced to Madagascar as an ornamental plant due to its unique foliage and adaptability to tropical climates. It has since spread to other parts of the island, particularly in disturbed habitats and along roadsides. The plant's rapid growth and ability to thrive in various soil types have contributed to its widespread distribution. However, its introduction has raised concerns about its potential impact on native flora and ecosystems. Despite its ornamental value, efforts are being made to monitor and manage its spread to prevent ecological disruption."
}
