{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acampe praemorsa",
    "plant_slug": "acampe-praemorsa",
    "plant_name_scientific": "acampe praemorsa",
    "intro": "Acampe praemorsa, commonly known as the death's-head hawkmoth, is a striking plant characterized by its large, velvety leaves and showy, bioluminescent flowers. Native to South Africa, it thrives in arid and semi-arid environments, showcasing adaptations to conserve water. The plant's flowers emit a strong, sweet scent at night, attracting nocturnal pollinators like moths. Its leaves are often covered in a fine, white powdery coating, which helps reduce water loss. Acampe praemorsa is also notable for its ability to produce toxic compounds that deter herbivores.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acampe",
        "species": "Acampe praemorsa"
    },
    "taxonomy_art_desc": "Acampe praemorsa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle with a dominant sporophyte stage. Its class is Equisetopsida, which comprises ferns and their allies, characterized by the presence of true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often associated with aromatic compounds. Its order is Asparagales, a diverse group of flowering plants that includes many economically important species such as orchids, lilies, and asparagus. Its family is Orchidaceae, commonly known as the orchid family, which is known for its intricate and often colorful flowers. Its genus is Acampe, a group of orchids that are typically found in specific geographic regions and have unique floral structures. Its species is Acampe praemorsa, a specific type of orchid that is distinguished by its particular morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Assam",
        "Bangladesh",
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Hainan",
        "India",
        "Laos",
        "Malaya",
        "Myanmar",
        "Nepal",
        "Philippines",
        "Sri Lanka",
        "Taiwan",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Cuba"
    ],
    "distribution_native_art_desc": "Acampe praemorsa is primarily native to the Andaman Is., Assam, Bangladesh, Cambodia, China South-Central, China Southeast, East Himalaya, Hainan, India, Laos, Malaya, Myanmar, Nepal, Philippines, Sri Lanka, Taiwan, Thailand, Vietnam, West Himalaya. This plant is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It is typically associated with forest understories and is often found in areas with high humidity. Acampe praemorsa is well adapted to the diverse climates and soil conditions of its native range. Its distribution spans across several Southeast Asian and South Asian countries, reflecting its ecological versatility.",
    "distribution_introduced_art_desc": "Acampe praemorsa was mainly introduced to Cuba. It is considered an invasive species in the region, outcompeting native plants for resources. The plant thrives in disturbed habitats such as roadsides and abandoned fields. Its rapid growth and spread pose a threat to local biodiversity. Efforts are being made to control its distribution and prevent further ecological impact."
}
