{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum sarawschanicum f. coloratum",
    "plant_slug": "acanthophyllum-sarawschanicum-f-coloratum",
    "plant_name_scientific": "acanthophyllum sarawschanicum f. coloratum",
    "intro": "Acanthophyllum sarawschanicum f. coloratum, commonly known as the colorful acanthophyllum, is a rare succulent plant native to the arid regions of Central Asia. It is characterized by its compact, cushion-like growth form and thick, fleshy leaves that store water, enabling it to thrive in harsh, dry environments. The plant produces small, spiky flowers in shades of pink to purple, which attract pollinators such as bees and butterflies. Its unique morphology and limited distribution make it a subject of interest for botanists and conservationists. Due to habitat loss and over-collection, it is considered vulnerable and requires protection.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum sarawschanicum f. coloratum is primarily native to the arid and semi-arid regions of Central Asia, particularly in parts of Kazakhstan and southern Siberia. It thrives in sandy and gravelly soils, often found in steppes and desert margins. This plant is well adapted to harsh environmental conditions, including extreme temperatures and limited water availability. It is commonly found in regions with low precipitation and high solar exposure. Its distribution is closely linked to specific ecological zones that support its growth and survival.",
    "distribution_introduced_art_desc": "Acanthophyllum sarawschanicum f. coloratum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Kazakhstan and southern Siberia. It is commonly found in sandy and gravelly soils, often in areas with low precipitation. This plant is well adapted to harsh environmental conditions, including high temperatures and limited water availability. Its introduction has been associated with ecological restoration projects aimed at stabilizing dunes and preventing soil erosion. It plays a vital role in maintaining local biodiversity and soil structure in its native habitats."
}
