{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon glabratum subsp. kashanense",
    "plant_slug": "acantholimon-glabratum-subsp-kashanense",
    "plant_name_scientific": "acantholimon glabratum subsp. kashanense",
    "intro": "Acantholimon glabratum subsp. kashanense, commonly known as Kashan's sandwort, is a perennial plant native to arid and semi-arid regions of Central Asia. It belongs to the family Montiaceae and is characterized by its low-growing, cushion-like growth habit. The plant features narrow, linear leaves and produces small, white or pale blue flowers in spring. It is adapted to withstand drought and extreme temperatures, making it a hardy species in harsh environments. Its botanical structure reflects its evolutionary adaptation to survive in nutrient-poor, sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon glabratum"
    },
    "taxonomy_art_desc": "Acantholimon glabratum subsp. kashanense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive flower structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a genus of flowering plants known for their succulent leaves and showy flowers, typically found in arid and semi-arid regions. Its species is Acantholimon glabratum, a specific plant within the genus known for its hairy stems and blue to purple flowers, and the subspecies kashanense refers to a distinct variant found in specific geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon glabratum subsp. kashanense is primarily native to Iran. This subspecies is found in the arid and semi-arid regions of the country. It typically grows in rocky and gravelly soils, often in mountainous areas. Its distribution is limited to specific ecological zones within Iran. It is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acantholimon glabratum subsp. kashanense was mainly introduced to areas with rocky or gravelly soils in arid and semi-arid regions. It thrives in environments with low precipitation and high sunlight exposure. This subspecies is commonly found in mountainous areas and along dry streambeds. Its introduction has been documented in several regions of Central Asia, including parts of Kazakhstan and southern Russia. It is valued for its drought tolerance and ability to stabilize soil in harsh landscapes."
}
