{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus imbricatus",
    "plant_slug": "acanthus-imbricatus",
    "plant_name_scientific": "acanthus imbricatus",
    "intro": "Acanthus imbricatus, commonly known as the narrow-leaved acanthus, is a flowering plant native to southern Europe and western Asia. It is characterized by its striking, spiny leaves with a distinctive ribbed structure and its showy, spire-like inflorescences. The plant produces small, pale blue to purple flowers that bloom in late summer. It thrives in well-drained soil and full sun, often growing in rocky or coastal areas. Acanthus imbricatus is valued in horticulture for its ornamental foliage and historical use in classical architecture and decorative arts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus imbricatus is primarily native to India. It is commonly found in the southern and eastern regions of the country. This plant thrives in tropical and subtropical climates, often growing in moist, shaded areas. It is a popular ornamental plant due to its distinctive foliage and flowering patterns. Its native range includes parts of South India, such as Tamil Nadu and Kerala.",
    "distribution_introduced_art_desc": "Acanthus imbricatus was mainly introduced to ornamental horticulture and landscaping due to its striking, palmately lobed leaves and showy, spiny flowers. It is commonly cultivated in gardens and public spaces for its aesthetic appeal and ability to thrive in a variety of soil conditions. Despite its ornamental value, it has become invasive in some regions, outcompeting native vegetation and altering local ecosystems. The plant is native to southern Africa but has been introduced to parts of the Americas and Europe. Its rapid spread highlights the need for careful management to prevent ecological disruption."
}
