{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon pskemense",
    "plant_slug": "acantholimon-pskemense",
    "plant_name_scientific": "acantholimon pskemense",
    "intro": "Acantholimon pskemense, commonly known as the Pskem stonecress, is a flowering plant native to the mountainous regions of Turkey. It belongs to the family Brassicaceae, which includes many economically important plants such as cabbages and mustards. The plant is characterized by its basal rosette of fleshy, hairy leaves and produces small, white or pale yellow flowers arranged in racemes. It is adapted to rocky and arid environments, showcasing features like succulent leaves that help conserve water. The species is of interest to botanists due to its unique morphology and ecological niche.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon pskemense"
    },
    "taxonomy_art_desc": "Acantholimon pskemense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a wide variety of flower structures and are often found in diverse habitats. Its order is Caryophyllales, a group of flowering plants that includes many species with showy flowers and often contains plants adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a genus of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon pskemense, a specific type of plant native to certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon pskemense is primarily native to Kirgizstan and Uzbekistan. This plant is found in the mountainous regions of these countries. It typically grows in rocky or gravelly soils at higher elevations. The species is adapted to the arid and semi-arid climates of the Central Asian steppe and mountain areas. It plays a role in the local flora and is part of the natural vegetation of the region.",
    "distribution_introduced_art_desc": "Acantholimon pskemense was mainly introduced to areas with rocky or gravelly soils, often found in mountainous regions. It thrives in arid and semi-arid environments where it can receive limited moisture. This plant is typically found in regions with high sunlight exposure and well-drained soil conditions. It is commonly associated with disturbed or open habitats such as slopes and cliffs. Its introduction has been documented in several regions outside its native range, including parts of Europe and North America."
}
