{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum humile",
    "plant_slug": "acanthospermum-humile",
    "plant_name_scientific": "acanthospermum humile",
    "intro": "Acanthospermum humile, commonly known as the small pricklyseed, is a low-growing annual herb native to tropical and subtropical regions. It belongs to the family Asteraceae, characterized by its composite flower heads. The plant features small, narrow leaves and produces tiny, spiny fruits that contain seeds. It thrives in disturbed soils and is often found in grasslands and along roadsides. Its botanical structure supports its adaptation to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acanthospermum",
        "species": "Acanthospermum humile"
    },
    "taxonomy_art_desc": "Acanthospermum humile belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their relatives, known for their primitive characteristics and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Asterales, which comprises flowering plants with showy inflorescences, often referred to as heads or composite flowers. Its family is Asteraceae, commonly known as the aster family, which is one of the largest families of flowering plants, characterized by their composite flower heads. Its genus is Acanthospermum, a group of flowering plants typically found in tropical and subtropical regions, often with hairy or spiny structures. Its species is Acanthospermum humile, a specific plant within this genus known for its small size and distinctive floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bahamas",
        "Cuba",
        "Dominican Republic",
        "Haiti",
        "Jamaica",
        "Netherlands Antilles",
        "Panamá"
    ],
    "distribution_introduced": [
        "Alabama",
        "Florida",
        "New York",
        "South Carolina"
    ],
    "distribution_native_art_desc": "Acanthospermum humile is primarily native to the Bahamas, Cuba, Dominican Republic, Haiti, Jamaica, Netherlands Antilles, and Panamá. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in open, sunny habitats such as grasslands and coastal dunes. The species is well adapted to the warm, humid climate of its native range. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthospermum humile was mainly introduced to Alabama, Florida, New York, and South Carolina. It is a species that has become established in these regions, often found in disturbed habitats such as roadsides and open fields. The plant is known for its rapid growth and ability to thrive in a variety of soil conditions. Its introduction has led to concerns about its potential impact on native plant communities. Due to its adaptability, it has spread relatively quickly in these areas."
}
