{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon caryophyllaceum subsp. parviflorum",
    "plant_slug": "acantholimon-caryophyllaceum-subsp-parviflorum",
    "plant_name_scientific": "acantholimon caryophyllaceum subsp. parviflorum",
    "intro": "Acantholimon caryophyllaceum subsp. parviflorum, commonly known as the small-flowered thrift, is a member of the Caryophyllaceae family. It is a perennial herb characterized by its low-growing, mat-forming habit and succulent stems. The plant produces small, pink to purple flowers that bloom in early summer, typically from June to July. It thrives in rocky or sandy soils and is often found in coastal areas and dry habitats. Its foliage consists of narrow, grass-like leaves that are covered in fine hairs, contributing to its drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon caryophyllaceum subsp. parviflorum is primarily native to the western United States, particularly in California and Oregon. It grows in coastal and inland areas, often in sandy or gravelly soils. This subspecies is commonly found in open habitats such as dunes, coastal bluffs, and disturbed sites. It thrives in mild, temperate climates with moderate rainfall. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acantholimon caryophyllaceum subsp. parviflorum was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in dry, rocky soils and open habitats such as grasslands and disturbed areas. This subspecies is often associated with coastal and inland regions where it thrives in full sun. Its introduction has been linked to both natural dispersal and human activities, including seed transport. It is considered a non-native plant in many areas where it has established populations."
}
