{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum brevicalycale",
    "plant_slug": "acanthophyllum-brevicalycale",
    "plant_name_scientific": "acanthophyllum brevicalycale",
    "intro": "Acanthophyllum brevicalycale, commonly known as the short-stemmed thorned grass, is a low-growing, mat-forming shrub native to arid and semi-arid regions of Central Asia. It features dense clusters of small, spiny leaves that help reduce water loss in harsh environments. The plant produces small, pale green or yellow flowers during the summer months, which are adapted for pollination by wind or short-range insects. Its root system is extensive and deep, allowing it to access moisture from deeper soil layers. This species is often used in ecological restoration projects due to its ability to stabilize soils and provide habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum brevicalycale is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. It is commonly found in sandy and gravelly soils, often in steppes and desert steppes. This plant thrives in environments with low precipitation and high solar radiation. It is well adapted to harsh climatic conditions, making it a characteristic species of these ecosystems. Its distribution is closely associated with specific ecological zones that support its growth and survival.",
    "distribution_introduced_art_desc": "Acanthophyllum brevicalycale was mainly introduced to areas with dry, sandy soils and low precipitation, typically in arid and semi-arid regions. It is commonly found in regions such as parts of North Africa, the Middle East, and Central Asia. This plant thrives in environments with minimal water availability and can tolerate high temperatures. Its introduction has been associated with human activities, including land degradation and agricultural expansion. It is considered an invasive species in some areas where it outcompetes native vegetation."
}
