{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax spinosus",
    "plant_slug": "acanthopanax-spinosus",
    "plant_name_scientific": "acanthopanax spinosus",
    "intro": "Acanthopanax spinosus, commonly known as the spiny devil's ivy, is a deciduous climbing shrub native to eastern Asia. It is characterized by its woody stems and compound leaves with serrated margins. The plant produces small, greenish-yellow flowers followed by red berries that are toxic to humans and animals. It thrives in moist, shaded environments and is often found in forest undergrowth. Due to its aggressive growth habit, it can become invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax spinosus is primarily native to East Asia, including regions such as China, Korea, and Japan. It is commonly found in temperate forests and mountainous areas within these countries. The plant thrives in humid climates and is often associated with understory vegetation in mixed forests. It is particularly prevalent in the northeastern parts of China, especially in provinces like Heilongjiang, Jilin, and Liaoning. Due to its adaptability, it can also be found in parts of Southeast Asia and the Russian Far East.",
    "distribution_introduced_art_desc": "Acanthopanax spinosus was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive foliage and unique spiny appearance. However, it has since become invasive, outcompeting native vegetation in forest understories. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to concerns about its ecological impact. Despite its aesthetic value, management efforts are ongoing to control its spread and mitigate its effects on local ecosystems."
}
