{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ilicifolius var. volubilis",
    "plant_slug": "acanthus-ilicifolius-var-volubilis",
    "plant_name_scientific": "acanthus ilicifolius var. volubilis",
    "intro": "Acanthus ilicifolius var. volubilis, commonly known as the climbing acanthus, is a variant of the acanthus plant characterized by its vigorous climbing habit. It features heart-shaped leaves with a waxy texture and a distinctive silvery-white underside. The plant produces spiny, purplish flowers in dense clusters, which bloom in late summer. Native to the Mediterranean region, it thrives in sunny, well-drained soils. Its ornamental value makes it a popular choice for gardeners seeking both aesthetic appeal and structural interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ilicifolius var. volubilis is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. This variant of the acanthus plant is commonly found in rocky coastal areas and dry, sunny habitats. It thrives in well-drained soils and is often associated with cliffs, sea walls, and disturbed coastal environments. The plant is known for its distinctive spiny leaves and showy, spires of pink or purple flowers. Due to its hardy nature, it is sometimes cultivated in gardens in similar climates.",
    "distribution_introduced_art_desc": "Acanthus ilicifolius var. volubilis was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and flowering habits. It is often cultivated for its aesthetic value in gardens and as a decorative plant. This variety is particularly favored in regions with temperate climates where it can thrive in partial shade to full sun. Its introduction has led to its presence in both cultivated and naturalized settings in various parts of the world. However, it is important to note that its spread can sometimes pose challenges in certain ecosystems."
}
