{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus nitidus",
    "plant_slug": "acanthus-nitidus",
    "plant_name_scientific": "acanthus nitidus",
    "intro": "Acanthus nitidus, commonly known as the glossy acanthus, is a species of flowering plant native to southern Africa. It is characterized by its striking, palmate leaves that are often covered in a waxy, glossy sheen. The plant produces tall spikes of small, tubular flowers that range in color from white to pink, depending on the variety. It is typically found in rocky or coastal areas, where it thrives in well-drained soils. Due to its ornamental value, it is occasionally cultivated in gardens, though it is more commonly seen in its natural habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus nitidus is primarily native to the Mediterranean region, including parts of southern Europe, northern Africa, and the Middle East. It thrives in coastal areas and rocky habitats, often found along the shores of the Mediterranean Sea. This plant is well adapted to the warm, sunny climates and well-drained soils typical of its native range. It is commonly found in countries such as Spain, Italy, Greece, and Turkey. Due to its ornamental value, it has been introduced to other regions outside its natural distribution.",
    "distribution_introduced_art_desc": "Acanthus nitidus was mainly introduced to ornamental horticulture and garden design due to its striking foliage and architectural appearance. It is commonly cultivated in regions with mild climates where it can thrive throughout the growing season. The plant is often used in landscape architecture and as a decorative element in public spaces and private gardens. Its introduction has led to its naturalization in some areas, raising concerns about its potential impact on local ecosystems. Despite its aesthetic value, careful management is recommended to prevent its spread into native habitats."
}
