{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon gulistanum",
    "plant_slug": "acantholimon-gulistanum",
    "plant_name_scientific": "acantholimon gulistanum",
    "intro": "Acantholimon gulistanum, commonly known as the Gulistan's thornweed, is a flowering plant native to Central Asia, particularly found in regions of Afghanistan and Pakistan. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant typically grows in rocky or arid environments, showcasing its adaptability to harsh conditions. It produces small, pink or purple flowers that bloom in the summer months. Its succulent leaves and compact growth habit make it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon gulistanum"
    },
    "taxonomy_art_desc": "Acantholimon gulistanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a unique type of vascular tissue and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes many species with medicinal properties. Its genus is Acantholimon, a genus of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon gulistanum, a specific plant species native to certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon gulistanum is primarily native to Afghanistan and Iran. This plant is typically found in rocky and arid environments within these regions. It thrives in areas with limited rainfall and well-drained soils. The species is commonly associated with mountainous and semi-desert landscapes. Its native distribution is limited to specific ecological niches in these two countries.",
    "distribution_introduced_art_desc": "Acantholimon gulistanum was mainly introduced to areas with rocky or gravelly soils, often in mountainous or semi-arid regions. It thrives in well-drained environments and is commonly found in alpine or subalpine zones. This plant is typically associated with disturbed or open habitats, such as roadsides, quarries, and cultivated fields. Its introduction has been documented in several regions outside its native range, including parts of Europe and North America. Due to its hardy nature, it can establish itself quickly in new environments, sometimes becoming invasive in local ecosystems."
}
