{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hormozganense",
    "plant_slug": "acantholimon-hormozganense",
    "plant_name_scientific": "acantholimon hormozganense",
    "intro": "Acantholimon hormozganense, commonly known as Hormozgan thornweed, is a flowering plant native to Iran. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant is characterized by its spiny leaves and small, clustered flowers that typically bloom in the spring. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. Due to its limited distribution, it is considered a rare and endemic species within its range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hormozganense"
    },
    "taxonomy_art_desc": "Acantholimon hormozganense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes many species with a distinctive flower structure and often contains plants adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a genus of flowering plants that typically have succulent leaves and are found in arid or semi-arid regions. Its species is Acantholimon hormozganense, a specific plant species native to Iran, known for its unique adaptations to its local environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hormozganense is primarily native to Iran. It is found in the southwestern region of the country, particularly in the Hormozgan province. This plant thrives in arid and semi-arid environments, often growing in rocky or sandy soils. It is adapted to the harsh climatic conditions of the region, including high temperatures and low rainfall. Its native distribution is limited to specific areas within Iran, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Acantholimon hormozganense was mainly introduced to the region of Hormozgan in southern Iran. It is a flowering plant belonging to the family Plumbaginaceae. The species is adapted to arid and semi-arid environments, making it suitable for the local climate. It is commonly found in rocky and sandy soils along coastal areas. This plant plays a role in stabilizing dunes and preventing soil erosion in its native habitat."
}
