{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus pitajaya",
    "plant_slug": "acanthocereus-pitajaya",
    "plant_name_scientific": "acanthocereus pitajaya",
    "intro": "Acanthocereus pitajaya, commonly known as the Pitajaya cactus, is a species native to the arid regions of northern Mexico. It is a columnar cactus with a ribbed stem and spines that provide protection against herbivores. The plant produces yellow flowers during the spring and summer months, which are followed by small, red fruits. It is drought-tolerant and thrives in well-drained soil, making it suitable for xeriscaping. Its structure and adaptations reflect its evolutionary response to harsh desert environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus pitajaya is primarily native to the southern regions of the United States, particularly Arizona and New Mexico. It is also found in parts of northern Mexico, including the states of Sonora and Chihuahua. This cactus thrives in arid and semi-arid environments, often growing in rocky soils and on limestone formations. It is commonly found in desert scrublands and canyons where it receives full sun exposure. Due to its limited distribution, it is considered a rare and endangered species in many areas of its native range.",
    "distribution_introduced_art_desc": "Acanthocereus pitajaya was mainly introduced to the tropical and subtropical regions of Central and South America. It was brought there for its ornamental value due to its unique appearance and ability to thrive in arid conditions. The plant is commonly cultivated in gardens and as a houseplant because of its low maintenance requirements. It has also been introduced to parts of the United States, particularly in states with warm climates. However, its introduction has raised concerns about its potential impact on local ecosystems if it becomes invasive."
}
