{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon libanoticum",
    "plant_slug": "acantholimon-libanoticum",
    "plant_name_scientific": "acantholimon libanoticum",
    "intro": "Acantholimon libanoticum, commonly known as the Lebanese flax, is a flowering plant native to the Mediterranean region, particularly found in Lebanon and Syria. It belongs to the family Plumbaginaceae and is characterized by its basal rosette of blue-gray, woolly leaves. The plant produces small, pink or purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in rocky and arid environments, demonstrating drought tolerance and adapted root systems. Due to its ornamental value and ecological significance, it is sometimes cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon libanoticum"
    },
    "taxonomy_art_desc": "Acantholimon libanoticum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, characterized by their complex flower structures and varied reproductive strategies. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive floral morphology and some with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants often found in dry and saline soils, with some species producing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon libanoticum, a specific plant native to the Levant region, known for its unique morphology and ecological adaptations to its harsh environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lebanon-Syria",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon libanoticum is primarily native to Lebanon-Syria, Turkey. This plant is commonly found in the mountainous regions of these areas. It thrives in rocky and arid environments, often growing on slopes and in crevices. The species is adapted to the Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It plays an important role in the local flora and is a symbol of the region's unique biodiversity.",
    "distribution_introduced_art_desc": "Acantholimon libanoticum was mainly introduced to areas with Mediterranean-type climates characterized by dry summers and wet winters. It thrives in well-drained soils and full sun exposure, making it suitable for rocky or gravelly habitats. This plant is often found in coastal and inland regions where it can establish itself in disturbed or open areas. Its introduction has been primarily through human activities such as gardening and landscaping. However, it is considered a non-native species in many regions where it has not been historically recorded."
}
