{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax yui",
    "plant_slug": "acanthopanax-yui",
    "plant_name_scientific": "acanthopanax yui",
    "intro": "Acanthopanax yui, commonly known as the Chinese goat's beard, is a climbing shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves with serrated edges. The plant produces small, greenish-yellow flowers followed by red berries that are edible for birds and mammals. It thrives in temperate climates and is often found in moist, shaded environments. Due to its ornamental value and medicinal properties, it is sometimes cultivated in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax yui is primarily native to Southeast Asia, including countries such as China, Vietnam, and Thailand. It is commonly found in tropical and subtropical regions, particularly in forested areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with secondary growth habitats. It is also present in parts of India and the Philippines, where it grows in similar environmental conditions. Due to its limited distribution, it is considered a regionally restricted species.",
    "distribution_introduced_art_desc": "Acanthopanax yui was mainly introduced to the data as a rare and lesser-known species within the genus Acanthopanax. It is primarily found in specific regions of East Asia, including parts of China, Korea, and Japan. The distribution data highlights its limited range and habitat preferences, such as temperate forests and rocky slopes. Due to its restricted occurrence, it is considered a species of conservation interest. This introduction helps in understanding its ecological niche and potential threats to its survival."
}
