{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon solidum",
    "plant_slug": "acantholimon-solidum",
    "plant_name_scientific": "acantholimon solidum",
    "intro": "Acantholimon solidum, commonly known as the hardstem flax, is a perennial flowering plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its upright, often branched stems and small, clustered blue or purple flowers. The plant typically grows in rocky or gravelly soils and is adapted to dry, sunny environments. Its leaves are usually narrow and grass-like, and it produces small, capsule-like fruits that contain seeds. Acantholimon solidum is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardy nature and floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon solidum"
    },
    "taxonomy_art_desc": "Acantholimon solidum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a wide range of morphological diversity and often contain aromatic compounds. Its order is Caryophyllales, which includes plants with a distinctive flower structure and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in dry habitats and known for their often blue or violet flowers. Its genus is Acantholimon, which consists of flowering plants typically characterized by their succulent leaves and showy flowers. Its species is Acantholimon solidum, a specific plant within the genus known for its robust growth and ability to thrive in harsh, arid conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon solidum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central parts. This plant thrives in rocky and arid environments, often growing at higher elevations. It is adapted to the harsh climate and limited soil conditions of its native habitat. Due to its specific ecological requirements, it is not widely distributed beyond Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon solidum was mainly introduced to areas with rocky or gravelly soils, often in arid or semi-arid environments. It thrives in regions with low precipitation and high sunlight exposure. This plant is commonly found in coastal dunes and inland slopes. Its introduction has been noted in several Mediterranean and temperate regions. It is valued for its hardiness and ability to stabilize soil in challenging landscapes."
}
