{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthostachys exilis",
    "plant_slug": "acanthostachys-exilis",
    "plant_name_scientific": "acanthostachys exilis",
    "intro": "Acanthostachys exilis, commonly known as the slender acanthostachy, is a species of flowering plant in the grass family. It is native to tropical regions of Africa and is characterized by its slender, erect stems and narrow leaves. The plant produces small, inconspicuous flowers arranged in spikelets, typical of the grass family. It thrives in moist, well-drained soils and is often found in open woodlands or grasslands. Due to its ornamental value and adaptability, it is sometimes cultivated in gardens in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthostachys exilis is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in lowland and hill forest areas, often growing in shaded, moist environments. This plant is also present in parts of the Pacific Islands, including Hawaii and the Philippines. It thrives in humid climates and is often associated with disturbed or secondary growth habitats. Its distribution is largely restricted to these specific geographic regions within the tropics.",
    "distribution_introduced_art_desc": "Acanthostachys exilis was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activity or natural disturbances. It thrives in tropical and subtropical regions where it can establish itself quickly in nutrient-poor environments. The plant is commonly found in disturbed areas such as roadsides, clearings, and agricultural fields. Due to its rapid growth and adaptability, it can outcompete native vegetation in certain regions. Its introduction has led to concerns about its potential invasiveness in some ecosystems."
}
