{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus repens",
    "plant_slug": "acanthus-repens",
    "plant_name_scientific": "acanthus repens",
    "intro": "Acanthus repens, commonly known as the creeping acanthus, is a low-growing perennial plant native to Europe and parts of Asia. It features heart-shaped leaves that are often covered in fine, soft hairs, giving them a velvety texture. The plant produces striking spires of pink to purple flowers that bloom in late summer. Its root system is fibrous and adapted to thrive in sandy or rocky soils. Acanthus repens is often used in horticulture for its ornamental value and ability to spread along the ground.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus repens is primarily native to southern Europe, North Africa, and the Middle East. It is commonly found in regions such as Spain, Portugal, Italy, and parts of France. This plant thrives in coastal areas and rocky soils, often growing along cliffs and shores. It is also present in countries like Morocco, Algeria, and Turkey. Its distribution includes parts of the Mediterranean basin, where it adapts well to the warm, dry climate.",
    "distribution_introduced_art_desc": "Acanthus repens was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, disturbed soils along roadsides and in wetlands. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon, Washington, and California. Its spread is often facilitated by its prolific seed production and adaptability to various soil types."
}
