{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon flexuosum",
    "plant_slug": "acantholimon-flexuosum",
    "plant_name_scientific": "acantholimon flexuosum",
    "intro": "Acantholimon flexuosum, commonly known as the flexible sandthrift, is a flowering plant native to the arid regions of the western United States. It is a member of the Caryophyllaceae family and is characterized by its low-growing, mat-forming habit. The plant features slender, often branching stems and small, woolly leaves that help reduce water loss in its harsh environment. Its flowers are typically pink or purple, arranged in clusters and blooming in late spring to early summer. Acantholimon flexuosum is well adapted to sandy and gravelly soils, making it a common sight in desert and coastal dunes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon flexuosum"
    },
    "taxonomy_art_desc": "Acantholimon flexuosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures and evolutionary significance. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes plants with showy flowers and often contains toxic compounds. Its genus is Acantholimon, a group of flowering plants native to arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon flexuosum, a specific type of plant within the genus Acantholimon, known for its flexible stems and adapted to grow in dry, rocky environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon flexuosum is primarily native to Iran. It is found in specific regions within the country, particularly in the western and central parts. This plant typically grows in arid and semi-arid environments, such as rocky slopes and gravelly soils. It is adapted to the harsh climatic conditions of these areas. Its distribution is limited to certain ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon flexuosum was mainly introduced to disturbed soils and rocky outcrops in arid and semi-arid regions. It thrives in environments with low moisture and high sunlight exposure. This plant is often found along roadsides, construction sites, and areas with human activity. Its introduction has led to its establishment in several regions outside its native range. It is considered a weed in some areas due to its rapid growth and ability to spread easily."
}
