{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium klimpelianum var. macranthum",
    "plant_slug": "acanthocalycium-klimpelianum-var-macranthum",
    "plant_name_scientific": "acanthocalycium klimpelianum var. macranthum",
    "intro": "Acanthocalycium klimpelianum var. macranthum, commonly known as the Macranthum Cactus, is a member of the Cactaceae family native to Mexico. It is characterized by its cylindrical stems that are typically green and sparsely covered with white, radial spines. The flowers are large, showy, and usually pink or red, blooming in the spring. This variety is prized for its ornamental value and is often cultivated in arid gardens. It requires well-draining soil and full sun to thrive.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium klimpelianum var. macranthum is primarily native to the central and southern regions of Mexico, specifically in the states of Jalisco, Michoacán, and Guanajuato. It thrives in arid and semi-arid environments, often found in rocky soils and limestone areas. This cactus is adapted to the warm, dry climate with minimal rainfall, making it a typical species of the Mexican desert flora. It is commonly found in elevations ranging from 1,000 to 2,000 meters above sea level. Due to its limited distribution and specific habitat requirements, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthocalycium klimpelianum var. macranthum was mainly introduced to the United States as a collectible cactus species. It is commonly found in botanical gardens and private collections due to its unique appearance and hardiness. This variety is known for its large, showy flowers and is often cultivated for ornamental purposes. It thrives in well-draining soil and requires full sun to partial shade. Although it is not native to the region, it has become a popular choice among succulent enthusiasts."
}
