{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium spicatum",
    "plant_slug": "acanthodium-spicatum",
    "plant_name_scientific": "acanthodium spicatum",
    "intro": "Acanthodium spicatum, commonly known as the spiny acanthodium, is a member of the Asteraceae family, characterized by its composite flower heads. It typically features dense clusters of small, spiny bracts that enclose the actual flowers, giving it a distinctive appearance. The plant is native to arid and semi-arid regions, where it thrives in well-drained soils. Its foliage consists of narrow, gray-green leaves that are often covered in fine hairs. Acanthodium spicatum is often found in rocky or sandy habitats, and it plays a role in stabilizing soil in its native environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium spicatum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky habitats such as scrublands and coastal areas. This plant is commonly found in regions with mild, temperate climates and low annual rainfall. It is well adapted to poor soils and can tolerate periods of drought. Its distribution is largely confined to these specific ecological zones where it plays a role in local biodiversity.",
    "distribution_introduced_art_desc": "Acanthodium spicatum was mainly introduced to new environments through human activity, such as accidental transport via contaminated soil or equipment. It thrives in disturbed habitats, including roadsides, abandoned fields, and urban areas. The plant's rapid growth and ability to spread through seeds make it an invasive species in many regions. It competes with native plants for resources, potentially altering local ecosystems. Its introduction has raised concerns among ecologists due to its ecological impact."
}
