{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax senticosus f. subinermis",
    "plant_slug": "acanthopanax-senticosus-f-subinermis",
    "plant_name_scientific": "acanthopanax senticosus f. subinermis",
    "intro": "Acanthopanax senticosus f. subinermis, commonly known as the Siberian ginseng or Chinese goat's rue, is a variant of the Acanthopanax senticosus species. It is a woody shrub native to the mountainous regions of East Asia, including China, Korea, and Russia. The plant is characterized by its compound leaves, which are typically opposite and have serrated margins. It produces small, yellowish-green flowers followed by red berries that are edible for birds and mammals. This plant is valued for its medicinal properties, particularly in traditional Chinese medicine, where it is used to enhance physical endurance and support immune function.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax senticosus f. subinermis is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It is commonly found in temperate forests and rocky slopes at high altitudes. This subspecies thrives in cool, humid climates with well-drained soil. Its distribution is closely associated with the temperate zones of these countries. It is particularly prevalent in the northeastern parts of China, such as Heilongjiang and Jilin provinces.",
    "distribution_introduced_art_desc": "Acanthopanax senticosus f. subinermis was mainly introduced to regions with temperate climates and well-drained soils, where it can thrive in both full sun and partial shade. This subspecies is commonly found in forested areas and rocky slopes, preferring moderate to high elevations. It is often cultivated for its medicinal properties, particularly in traditional Chinese medicine. The plant's distribution has expanded due to human activity and trade, leading to its presence in various parts of Asia. However, its introduction to new regions has raised concerns about potential ecological impacts."
}
