{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus marnierianus",
    "plant_slug": "acanthocereus-marnierianus",
    "plant_name_scientific": "acanthocereus marnierianus",
    "intro": "Acanthocereus marnierianus, commonly known as the Marnier's night bloomer, is a cactus species native to the desert regions of Mexico. It is characterized by its columnar stem and spiny, ribbed structure, which helps it conserve water in arid environments. The plant produces large, fragrant white flowers that open at night, attracting nocturnal pollinators such as bats and moths. Its leaves are modified into spines, reducing transpiration and allowing it to thrive in extreme conditions. The plant is valued for its ornamental appeal and is often cultivated in xeriscapes and succulent gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus marnierianus is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in desert regions, particularly in Arizona, New Mexico, and parts of Sonora. This cactus thrives in arid and semi-arid environments, often growing on rocky soils and in crevices. It is well adapted to the harsh conditions of the desert, with thick stems that store water. The plant is also known as the \"night-blooming cactus\" due to its flowering habits.",
    "distribution_introduced_art_desc": "Acanthocereus marnierianus was mainly introduced to the United States as an ornamental plant due to its striking appearance and ability to thrive in arid conditions. It is commonly found in gardens and landscapes in regions with hot, dry climates such as Texas and California. This cactus species is also cultivated in other parts of the world where it is adapted to similar environmental conditions. Its introduction has led to its presence in both natural and cultivated habitats. However, it is considered non-invasive in most areas where it is grown."
}
