{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis crenata",
    "plant_slug": "acanthorhipsalis-crenata",
    "plant_name_scientific": "acanthorhipsalis crenata",
    "intro": "Acanthorhipsalis crenata, commonly known as the zigzag haworthia, is a succulent plant native to South Africa. It features a rosette of thick, fleshy leaves with a distinctive zigzag pattern along the edges. The leaves are typically green with white or yellowish markings, and the plant produces small, star-shaped flowers in shades of yellow or orange. It thrives in bright, indirect light and requires well-draining soil to prevent root rot. Due to its compact size and unique appearance, it is a popular choice for indoor gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis crenata is primarily native to the southern United States, particularly Texas and Louisiana. It is also found in parts of Mexico, including the states of Tamaulipas and Veracruz. This plant thrives in warm, dry climates and is commonly found in rocky or sandy soils. It is often associated with coastal and inland dunes, where it can withstand harsh environmental conditions. Due to its unique appearance and adaptability, it is sometimes cultivated as an ornamental plant.",
    "distribution_introduced_art_desc": "Acanthorhipsalis crenata was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its unique appearance and ability to thrive in tropical climates. It was first documented in the early 20th century and has since been found growing in various habitats, including disturbed areas and coastal regions. Although it is not considered invasive, it has the potential to spread beyond cultivated areas if not managed properly. Its introduction has raised concerns among conservationists due to its potential impact on native plant communities. Efforts are ongoing to monitor its distribution and assess its ecological effects in the region."
}
