{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum glaucum",
    "plant_slug": "acanthophyllum-glaucum",
    "plant_name_scientific": "acanthophyllum glaucum",
    "intro": "Acanthophyllum glaucum, commonly known as the woolly acanthophyllum, is a perennial shrub native to arid and semi-arid regions of Central Asia. It is characterized by its dense, silver-gray foliage covered in fine, woolly hairs, which help reduce water loss in harsh environments. The plant produces small, inconspicuous yellow flowers during the summer months. It is well adapted to sandy soils and can survive in extreme temperatures. Due to its resilience, it plays an important ecological role in stabilizing desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum glaucum is primarily native to the arid and semi-arid regions of central Asia, particularly in countries such as Kazakhstan, Mongolia, and parts of China. It thrives in sandy or gravelly soils and is commonly found in desert steppes and dunes. This plant is well adapted to harsh environmental conditions, including extreme temperatures and limited water availability. It plays an important ecological role in stabilizing soil and providing habitat for small desert fauna. Its distribution is closely linked to the specific climatic and geological features of its native range.",
    "distribution_introduced_art_desc": "Acanthophyllum glaucum was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It is commonly found in dry, sandy soils and rocky areas, where it thrives in harsh, arid conditions. This plant is often used for erosion control due to its hardy nature and ability to stabilize soil. It has also been introduced to other regions with similar climates, such as parts of the Middle East and western United States. Its introduction has sometimes led to concerns about its potential invasiveness in non-native environments."
}
