{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosphaera amara",
    "plant_slug": "acanthosphaera-amara",
    "plant_name_scientific": "acanthosphaera amara",
    "intro": "Acanthosphaera amara, commonly known as the bitter acanthosphaera, is a species of flowering plant native to certain regions of Africa. It belongs to the family Asteraceae, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant produces small, yellowish flowers that are clustered in dense inflorescences, and its leaves are typically narrow and slightly hairy. It is known for its bitter taste, which is due to the presence of various secondary metabolites. Acanthosphaera amara is often found in rocky or arid environments, where it has adapted to thrive in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosphaera amara is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is commonly found in rocky coastal areas and sandy beaches where it can thrive in salty and well-drained soils. This plant is well adapted to harsh coastal environments, often growing in shallow tidal zones. It plays an important role in stabilizing dune systems and preventing erosion. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acanthosphaera amara was mainly introduced to coastal and estuarine environments where it thrives in brackish water conditions. It is commonly found in regions with high salinity and moderate temperatures, such as the southeastern United States and parts of Southeast Asia. This species is often associated with mangrove ecosystems and can tolerate fluctuating water levels and sediment conditions. Its introduction has been linked to human activities like coastal development and the movement of aquatic species through ballast water. Due to its adaptability, it has become an important indicator of ecological changes in coastal zones."
}
