{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon gadukense",
    "plant_slug": "acantholimon-gadukense",
    "plant_name_scientific": "acantholimon gadukense",
    "intro": "Acantholimon gadukense, commonly known as the Gadukense Thistle, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant is characterized by its tall, sparsely branched stems and clusters of small, pinkish-white flowers. Its leaves are typically narrow and covered in fine hairs, adapting to the harsh, arid environments it inhabits. Acantholimon gadukense plays a role in local ecosystems by providing nectar for pollinators and stabilizing soil in rocky habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon gadukense"
    },
    "taxonomy_art_desc": "Acantholimon gadukense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a distinctive life cycle involving both a sporophyte and a gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants known for their diverse forms and the presence of specialized structures like betalains. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid environments, characterized by their succulent leaves and showy flowers. Its species is Acantholimon gadukense, a specific plant species native to certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon gadukense is primarily native to Iran. It is found in specific regions of the country, particularly in the central and eastern parts. This plant typically grows in rocky or gravelly soils in arid and semi-arid environments. It is adapted to the harsh climate conditions of these areas. Its distribution is limited to certain ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon gadukense was mainly introduced to areas with rocky or gravelly soils, often in mountainous or semi-arid regions. It thrives in environments with low moisture and high sunlight exposure. This plant is typically found in regions with a continental climate, characterized by cold winters and warm summers. It is often associated with limestone or sandstone substrates. Its introduction has been noted in several regions outside its native range, including parts of Europe and North America."
}
