{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon tomentellum",
    "plant_slug": "acantholimon-tomentellum",
    "plant_name_scientific": "acantholimon tomentellum",
    "intro": "Acantholimon tomentellum, commonly known as the woolly sandthrift, is a flowering plant native to the arid regions of western North America. It is a low-growing perennial herb characterized by its dense, silver-gray foliage covered in fine, woolly hairs. The plant produces small, clustered flowers that range in color from white to pale pink, typically blooming in late spring to early summer. It thrives in well-drained soils and is often found in desert scrub and rocky habitats. Due to its drought tolerance and ornamental appeal, it is sometimes cultivated in xeriscapic gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon tomentellum"
    },
    "taxonomy_art_desc": "Acantholimon tomentellum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Caryophyllales, a group of flowering plants that includes plants with specialized adaptations to arid environments and often have distinctive floral features. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon tomentellum, a specific plant within the genus Acantholimon, characterized by its hairy appearance and adaptation to dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon tomentellum is primarily native to Iran. This species is found in various regions across the country, particularly in arid and semi-arid areas. It thrives in rocky and sandy soils, often growing in mountainous and steppe environments. The plant is well adapted to the dry climate and can tolerate extreme temperature fluctuations. Its distribution is largely restricted to specific ecological zones within Iran.",
    "distribution_introduced_art_desc": "Acantholimon tomentellum was mainly introduced to areas with well-drained soils and moderate climates, often found in coastal and inland regions. It thrives in environments with full sun to partial shade and is commonly found in disturbed soils or along roadsides. This plant is known for its dense, mat-forming growth habit and is often used for erosion control due to its hardy nature. It is native to Europe but has been introduced to various parts of the world, including North America. Its ability to tolerate drought and poor soil conditions makes it a versatile plant in ecological restoration projects."
}
