{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax innovans",
    "plant_slug": "acanthopanax-innovans",
    "plant_name_scientific": "acanthopanax innovans",
    "intro": "Acanthopanax innovans, commonly known as the Korean angel's trumpet, is a deciduous shrub native to the Korean Peninsula. It features compound leaves with serrated edges and produces clusters of small, fragrant white flowers in the summer. The plant is characterized by its woody stems and is often found in forested areas. It has been used in traditional medicine for its purported health benefits. Its botanical features make it a notable species in the Euphorbiaceae family.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax innovans is primarily native to the mountainous regions of eastern Asia, particularly in China, Korea, and Japan. It thrives in temperate climates and is commonly found in forested areas at higher elevations. This plant is often associated with humid, shaded environments in the understory of mixed deciduous and evergreen forests. Its distribution includes parts of the Korean Peninsula and the northeastern regions of China, such as Heilongjiang and Jilin provinces. It is also occasionally found in the Ryukyu Islands of Japan.",
    "distribution_introduced_art_desc": "Acanthopanax innovans was mainly introduced to regions with temperate to subtropical climates, where it thrives in well-drained soils and partial to full sunlight. It has been introduced to parts of Southeast Asia, including Indonesia and the Philippines, as well as some areas in the Pacific Islands. The plant is valued for its ornamental qualities, with its distinctive leaves and growth habit making it a popular choice for landscaping. However, it has also been reported as an invasive species in certain areas, outcompeting native vegetation. Due to its adaptability, it has spread beyond its original introduction sites, raising concerns about its ecological impact."
}
