{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis monacantha var. samaipatana",
    "plant_slug": "acanthorhipsalis-monacantha-var-samaipatana",
    "plant_name_scientific": "acanthorhipsalis monacantha var. samaipatana",
    "intro": "Acanthorhipsalis monacantha var. samaipatana, commonly known as the Samaipata cactus, is a unique and rare plant native to the high-altitude regions of Bolivia. It belongs to the Cactaceae family and is characterized by its compact, globular shape and dense clusters of small, spiny stems. The plant produces yellow flowers during the warmer months, adding a striking contrast to its green foliage. It thrives in well-draining soil and requires minimal water, making it suitable for arid environments. Due to its limited distribution and specific habitat requirements, it is considered a vulnerable species in its natural range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis monacantha var. samaipatana is primarily native to the cloud forests of the Andes, specifically in parts of northern Peru and western Colombia. This plant thrives in humid, high-altitude environments with moderate temperatures and frequent mist. It is commonly found in shaded, rocky or forested areas where it can receive indirect sunlight. Due to its specific habitat requirements, it is considered a rare and endemic species in its native range. Conservation efforts are ongoing to protect its natural habitat from deforestation and climate change.",
    "distribution_introduced_art_desc": "Acanthorhipsalis monacantha var. samaipatana was mainly introduced to tropical and subtropical regions as an ornamental plant due to its unique appearance and ability to thrive in warm climates. It is commonly found in gardens and greenhouses in countries such as Mexico, Central America, and parts of South America. The plant's introduction has sometimes led to its establishment in the wild, raising concerns about its potential invasiveness in certain ecosystems. Its rapid growth and adaptability make it a popular choice for horticultural use, though its ecological impact remains under study. Despite its beauty, careful management is recommended to prevent unintended spread."
}
