{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon stanjukoviczii",
    "plant_slug": "acantholimon-stanjukoviczii",
    "plant_name_scientific": "acantholimon stanjukoviczii",
    "intro": "Acantholimon stanjukoviczii, commonly known as the Balkan sandthrift, is a perennial herbaceous plant native to the Balkan Peninsula. It typically grows in sandy or gravelly soils, often in dry, open habitats such as steppes and rocky slopes. The plant features slender, upright stems with narrow, linear leaves that are often covered in fine hairs. Its flowers are small, blue to purple in color, and are arranged in dense, spike-like clusters. Acantholimon stanjukoviczii is valued for its ornamental appeal and its ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon stanjukoviczii"
    },
    "taxonomy_art_desc": "Acantholimon stanjukoviczii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often succulent or salt-tolerant species. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often contains toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or coastal areas, characterized by their spiny leaves and showy flowers. Its species is Acantholimon stanjukoviczii, a specific plant within the genus Acantholimon, native to certain regions of the Balkans, known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon stanjukoviczii is primarily native to Tajikistan. This plant is found in the mountainous regions of the country, particularly in the eastern and southern parts. It thrives in rocky and arid environments, often growing on slopes and in dry grasslands. The species is adapted to the cold and harsh climate of its native habitat. It is a rare and endemic plant, contributing to the unique biodiversity of Tajikistan.",
    "distribution_introduced_art_desc": "Acantholimon stanjukoviczii was mainly introduced to areas with well-drained soils and full sun exposure, typically found in rocky or gravelly habitats. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. This plant has been introduced to several parts of California, particularly in the coastal and inland valleys. It thrives in environments where there is minimal competition from other vegetation. Due to its hardy nature, it has become a common sight in disturbed soils and along roadsides."
}
