{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus edulis",
    "plant_slug": "acanthus-edulis",
    "plant_name_scientific": "acanthus edulis",
    "intro": "Acanthus edulis, commonly known as the edible acanthus, is a flowering plant native to southern Africa. It is characterized by its striking, palmate leaves and showy, spiny flowers that bloom in summer. The plant belongs to the Acanthaceae family and is often found in rocky or sandy habitats. Its leaves are edible when young and tender, though they become more fibrous with age. The plant is also valued for its ornamental appeal in gardens due to its distinctive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus edulis is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in grassland and rocky habitats, particularly in the coastal and inland regions of these areas. This plant thrives in well-drained soils and is often seen growing along roadsides and in disturbed areas. It is known for its striking, spiny leaves and is sometimes cultivated for ornamental purposes. Despite its native range, it is not widely distributed outside of its natural habitat in southern Africa.",
    "distribution_introduced_art_desc": "Acanthus edulis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering stems. However, it has since become invasive, outcompeting native species in coastal and riparian habitats. The plant spreads rapidly through its seed production and can form dense stands that alter local ecosystems. Efforts are ongoing to control its spread and protect native biodiversity."
}
