{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon komarovii",
    "plant_slug": "acantholimon-komarovii",
    "plant_name_scientific": "acantholimon komarovii",
    "intro": "Acantholimon komarovii, commonly known as the Komarov's thornweed, is a perennial flowering plant native to the mountainous regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy leaves and showy blue or purple flowers. The plant typically grows in rocky or sandy soils and is adapted to arid or semi-arid environments. It produces small, capsule-like fruits that contain numerous seeds, which are dispersed by wind. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon komarovii"
    },
    "taxonomy_art_desc": "Acantholimon komarovii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon komarovii, a specific type within the genus Acantholimon, native to certain regions of Asia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan",
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon komarovii is primarily native to Kirgizstan and Tadzhikistan. This plant is typically found in mountainous regions within these countries. It thrives in rocky and arid environments, often growing at high altitudes. The species is part of the Caryophyllaceae family and is adapted to the harsh climate of Central Asia. Its distribution is limited to specific ecological niches in the highlands of these regions.",
    "distribution_introduced_art_desc": "Acantholimon komarovii was mainly introduced to areas with dry, rocky soils and elevations ranging from 1,500 to 3,000 meters. It thrives in arid and semi-arid environments, often found in steppes and mountain slopes. This plant is well adapted to withstand drought and temperature fluctuations. It is commonly found in regions of Central Asia, including parts of Kazakhstan and Russia. Its introduction has been noted in ecological studies focusing on plant adaptation to harsh climates."
}
