{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum coloratum var. coloratum",
    "plant_slug": "acanthophyllum-coloratum-var-coloratum",
    "plant_name_scientific": "acanthophyllum coloratum var. coloratum",
    "intro": "Acanthophyllum coloratum var. coloratum, commonly known as the desert flax, is a flowering plant native to arid regions of Central Asia. It is a perennial shrub characterized by its compact growth habit and dense, spiny foliage. The plant produces small, yellowish flowers that bloom in late spring, adding a subtle ornamental value. It is well adapted to harsh environments, with deep roots and succulent leaves that store water. This species is often used in xeriscaping due to its drought tolerance and low maintenance requirements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum coloratum"
    },
    "taxonomy_art_desc": "Acanthophyllum coloratum var. coloratum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes many plants with showy flowers and often adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many herbs with showy, often pink or red flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum coloratum, a specific plant within this genus known for its distinctive spiny foliage and its adaptation to dry, harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan",
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum coloratum var. coloratum is primarily native to Kirgizstan, Tadzhikistan. This plant is typically found in arid and semi-arid regions, often growing in sandy or rocky soils. It is well adapted to the harsh environmental conditions of its native habitat. The species plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is limited to specific geographic areas within these countries.",
    "distribution_introduced_art_desc": "Acanthophyllum coloratum var. coloratum was mainly introduced to regions with arid and semi-arid climates, particularly in the southwestern United States and parts of northern Mexico. It thrives in sandy or gravelly soils and is often found in desert scrublands and dune environments. This plant is adapted to high temperatures and low precipitation, making it a resilient species in harsh conditions. Its introduction has been associated with both natural dispersal and human activities such as landscaping and restoration projects. However, it is not considered invasive in most areas where it is found."
}
