{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium rhodotrichum subsp. chacoanum",
    "plant_slug": "acanthocalycium-rhodotrichum-subsp-chacoanum",
    "plant_name_scientific": "acanthocalycium rhodotrichum subsp. chacoanum",
    "intro": "Acanthocalycium rhodotrichum subsp. chacoanum, commonly known as the Chacoan prickly pear, is a species of cactus native to South America, particularly Argentina and Paraguay. It is characterized by its short, cylindrical stems that are covered in dense clusters of spines. The plant produces yellow or orange flowers during the warmer months, which are followed by edible, red-fleshed fruits. It thrives in arid and semi-arid environments, adapting well to poor soil conditions. This subspecies is valued for both its ornamental appeal and its role in local ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocalycium",
        "species": "Acanthocalycium rhodotrichum"
    },
    "taxonomy_art_desc": "Acanthocalycium rhodotrichum subsp. chacoanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, which consists of flowering plants often with showy flowers and includes families like Cactaceae and Portulacaceae. Its family is Cactaceae, known as the cactus family, characterized by succulent stems and spines adapted for arid environments. Its genus is Acanthocalycium, a group of cacti native to South America, typically featuring spiny stems and flowers. Its species is Acanthocalycium rhodotrichum, a specific type within the genus known for its distinctive spines and colorful blooms, with the subspecies chacoanum being a variant adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Paraguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium rhodotrichum subsp. chacoanum is primarily native to Paraguay. This species is found in the arid and semi-arid regions of the country, particularly in the Chaco region. It thrives in sandy or rocky soils and is adapted to the dry climate of its native habitat. The plant is often found in open grasslands and scrublands. Due to its limited distribution, it is considered a rare and endemic species within Paraguay.",
    "distribution_introduced_art_desc": "Acanthocalycium rhodotrichum subsp. chacoanum was mainly introduced to the regions of Argentina, Paraguay, and Bolivia. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This subspecies is known for its compact growth and spiny stems, making it a popular choice among cactus enthusiasts. It thrives in full sun and requires minimal water, which contributes to its adaptability. However, its introduction has raised concerns about its potential impact on native flora in these regions."
}
