{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon yamense",
    "plant_slug": "acantholimon-yamense",
    "plant_name_scientific": "acantholimon yamense",
    "intro": "Acantholimon yamense, commonly known as Yamenskaya thornweed, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many species of flowering plants known for their showy blooms. The plant is characterized by its upright growth habit, hairy stems, and clusters of small, pinkish-white flowers. It typically thrives in dry, rocky habitats and is adapted to withstand harsh environmental conditions. Due to its limited distribution, it is considered a rare and specialized species within its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon yamense"
    },
    "taxonomy_art_desc": "Acantholimon yamense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern plants with true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures and evolutionary adaptations. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their typically small, showy flowers and often containing alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon yamense, a specific plant within the genus Acantholimon, native to certain regions of China, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon yamense is primarily native to Iran. It is found in the mountainous regions of the country, particularly in the central and eastern parts. This plant thrives in rocky and arid environments, often growing on slopes and in dry grasslands. It is adapted to the harsh climate of its native habitat, which includes significant temperature fluctuations and limited precipitation. Due to its specific ecological requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acantholimon yamense was mainly introduced to areas with temperate climates and well-drained soils, often found in mountainous regions. It is commonly cultivated in gardens and landscapes for its ornamental value due to its attractive, grass-like foliage and flowering spikes. The plant prefers full sun to partial shade and is relatively drought-tolerant once established. It is sometimes used in xeriscaping and as a groundcover in rocky or sandy soils. However, it is important to monitor its spread, as it may become invasive in certain environments."
}
