{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax henryi var. faberi",
    "plant_slug": "acanthopanax-henryi-var-faberi",
    "plant_name_scientific": "acanthopanax henryi var. faberi",
    "intro": "Acanthopanax henryi var. faberi, commonly known as the Chinese devil’s ivy, is a deciduous shrub native to China. It features compound leaves with serrated edges and small, greenish-white flowers that appear in clusters. The plant produces red berries that are edible for birds but toxic to humans. It thrives in temperate climates and is often found in forested areas. Its ornamental value makes it a popular choice for gardeners seeking hardy, low-maintenance plants.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax henryi var. faberi is primarily native to the mountainous regions of western China, particularly in Sichuan and Yunnan provinces. It grows in temperate forests and rocky slopes at elevations ranging from 1,500 to 3,500 meters. This variant is often found in areas with moist, well-drained soils and partial to full shade. It is an important component of the local flora and is adapted to the cool, humid climate of its native habitat. The plant is also occasionally found in neighboring regions of northern Vietnam and eastern Tibet.",
    "distribution_introduced_art_desc": "Acanthopanax henryi var. faberi was mainly introduced to regions with temperate climates and well-drained soils, often found in forested areas. It thrives in partial to full shade and is commonly used as an ornamental plant due to its attractive foliage and unique appearance. This species is also valued for its medicinal properties, which have been traditionally used in herbal remedies. Its introduction has been primarily through horticultural trade and botanical gardens. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
