{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax stenophyllus",
    "plant_slug": "acanthopanax-stenophyllus",
    "plant_name_scientific": "acanthopanax stenophyllus",
    "intro": "Acanthopanax stenophyllus, commonly known as the narrow-leafed devil's claw, is a climbing shrub native to the mountainous regions of East Asia. It is characterized by its compound leaves with serrated edges and small, greenish-white flowers that appear in clusters. The plant produces bright red berries that are toxic to humans but serve as a food source for certain wildlife. It thrives in temperate climates and is often found in forested areas with well-drained soil. Due to its medicinal properties, it has been used in traditional Chinese medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax stenophyllus is primarily native to eastern Asia, including China, Japan, and Korea. It is commonly found in mountainous regions with temperate climates. This plant thrives in forested areas, often growing along riverbanks or in rocky soils. It is particularly prevalent in the northeastern parts of China, such as in the provinces of Heilongjiang, Jilin, and Liaoning. Its natural habitat includes moist, shaded environments where it can receive adequate sunlight through the canopy.",
    "distribution_introduced_art_desc": "Acanthopanax stenophyllus was mainly introduced to regions with temperate climates and well-drained soils, particularly in East Asia. It thrives in forested areas and is commonly found in mountainous regions of China, Korea, and Japan. This plant is valued for its medicinal properties and is often cultivated for traditional herbal use. Its introduction to new areas has sometimes led to naturalization, raising concerns about its ecological impact. Due to its adaptability, it has been introduced to parts of North America and Europe as well."
}
