{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon cabulicum",
    "plant_slug": "acantholimon-cabulicum",
    "plant_name_scientific": "acantholimon cabulicum",
    "intro": "Acantholimon cabulicum, commonly known as the Kabul thornsteppe, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the Plumbaginaceae family and is characterized by its low-growing, succulent-like stems and small, clustered flowers. The plant typically produces blue or purple flowers that bloom in the summer months. It is adapted to arid and semi-arid environments, with deep root systems that help it survive in dry conditions. Acantholimon cabulicum is often found in rocky or gravelly soils and is a hardy species that thrives in high-altitude regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon cabulicum"
    },
    "taxonomy_art_desc": "Acantholimon cabulicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon cabulicum, a specific plant species native to certain regions of the Middle East, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon cabulicum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the Hindu Kush and surrounding areas. This plant typically grows in rocky and arid environments, often at higher elevations. It is well adapted to the harsh climate and limited soil conditions of its native habitat. Due to its restricted range, it is considered a rare and endemic species in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon cabulicum was mainly introduced to areas with well-drained soils and sunny to partially shaded conditions. It thrives in regions with moderate temperatures and low to moderate precipitation. This plant is often found in rocky or gravelly soils, making it suitable for xeriscaping and drought-tolerant gardens. Its introduction has been noted in several regions of the western United States and parts of California. It is valued for its ornamental appeal and ability to withstand harsh environmental conditions."
}
