{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus longipetiolatus",
    "plant_slug": "acanthus-longipetiolatus",
    "plant_name_scientific": "acanthus longipetiolatus",
    "intro": "Acanthus longipetiolatus, commonly known as the long-petioled acanthus, is a striking ornamental plant native to the Mediterranean region. It is characterized by its large, palmate leaves that are deeply lobed and often covered in a silvery-white down. The plant produces spikes of showy, spathaceous flowers that are typically pink or purple in color. It thrives in full sun and well-drained soil, making it a popular choice for garden landscapes. Due to its architectural form and ornamental value, it is often used in horticultural displays and historical garden restorations.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus longipetiolatus is primarily native to the Mediterranean region, including southern Europe, northern Africa, and parts of western Asia. It is commonly found in rocky coastal areas, cliffs, and dry, sunny habitats. This plant thrives in well-drained soils and is often associated with maritime environments. It is known for its distinctive, palmate leaves and spiny, woolly stems. Acanthus longipetiolatus is a hardy species that can withstand salt spray and coastal conditions.",
    "distribution_introduced_art_desc": "Acanthus longipetiolatus was mainly introduced to gardens and ornamental horticulture due to its striking, architectural foliage and dramatic inflorescences. It is often cultivated for its aesthetic value in landscaping and as a decorative plant in both tropical and subtropical regions. This species has been widely distributed in areas with warm climates, including parts of the United States, Australia, and the Mediterranean. Its introduction has led to its naturalization in some regions, where it can sometimes become invasive. Despite its ornamental appeal, it requires well-drained soil and full sun to thrive."
}
