{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon gaudanense",
    "plant_slug": "acantholimon-gaudanense",
    "plant_name_scientific": "acantholimon gaudanense",
    "intro": "Acantholimon gaudanense, commonly known as the Gaudan's thrift, is a flowering plant native to the Mediterranean region. It belongs to the family Caryophyllaceae and is characterized by its low-growing, mat-forming habit. The plant features narrow, grass-like leaves and produces clusters of small, pinkish-white flowers. It thrives in rocky or sandy soils and is adapted to dry, coastal environments. Acantholimon gaudanense is often found in coastal dunes and is valued for its ornamental appeal and ecological resilience.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon gaudanense"
    },
    "taxonomy_art_desc": "Acantholimon gaudanense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive structures. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive floral structures and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes plants with showy flowers and often contain secondary metabolites. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon gaudanense, a specific plant species within the genus Acantholimon, native to certain regions and distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon gaudanense is primarily native to Iran and Turkmenistan. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky and sandy soils, often in mountainous or desert landscapes. The species is adapted to withstand harsh climatic conditions, including high temperatures and limited water availability. Its native distribution is closely associated with specific ecological zones in the Central Asian region.",
    "distribution_introduced_art_desc": "Acantholimon gaudanense was mainly introduced to areas with well-drained soils and full sun exposure, typically in rocky or gravelly habitats. It is commonly found in Mediterranean climates where it thrives in dry, warm conditions. This plant is often cultivated as an ornamental due to its attractive blue-gray foliage and showy flowers. It has been introduced to several regions outside its native range, including parts of California and the Pacific Northwest. However, its spread is limited due to its specific environmental requirements."
}
