{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon gramineum",
    "plant_slug": "acantholimon-gramineum",
    "plant_name_scientific": "acantholimon gramineum",
    "intro": "Acantholimon gramineum, commonly known as the grassy acantholimon, is a perennial flowering plant native to the arid regions of southern Africa. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit with slender, grass-like leaves. The plant produces small, blue to violet flowers arranged in dense clusters, typically blooming in spring. It is well adapted to dry conditions, with thick, fleshy leaves that store water. Acantholimon gramineum is often found in rocky soils and is valued for its ornamental appeal in xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon gramineum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in rocky and sandy soils, often found in steppe and desert environments. This plant is well adapted to harsh climates with low precipitation and high temperatures. It is commonly seen in open habitats such as gravel plains and dry riverbeds. Its distribution is closely associated with the ecological zones of the Central Asian deserts and steppes.",
    "distribution_introduced_art_desc": "Acantholimon gramineum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and disturbed grasslands. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in Mediterranean climates and has been introduced to parts of California and other western United States states. Its rapid growth and ability to colonize new areas make it a potential invasive species in some regions. However, it is also valued for its ornamental qualities and is sometimes cultivated in gardens."
}
