{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus longifolius",
    "plant_slug": "acanthus-longifolius",
    "plant_name_scientific": "acanthus longifolius",
    "intro": "Acanthus longifolius, commonly known as the narrow-leaved acanthus, is a perennial plant native to southern Europe and western Asia. It is characterized by its tall, upright growth habit and its distinctive, palmately lobed leaves that are often covered in a dense layer of soft, silky hairs. The plant produces showy, spiny seed heads that are typically pink to purple in color, adding visual interest in late summer and autumn. It thrives in full sun to partial shade and prefers well-drained soil, making it a popular choice for ornamental gardens. Its architectural form and seasonal display make it a valuable addition to both traditional and modern landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus longifolius is primarily native to the Mediterranean region, including southern Europe, northern Africa, and parts of western Asia. It thrives in coastal areas, rocky shores, and dry, sunny habitats. This plant is commonly found along the coasts of countries such as Spain, Italy, Greece, and Turkey. It is also present in the Canary Islands and parts of North Africa like Morocco and Algeria. Due to its hardy nature, it has been introduced to other regions with similar climates.",
    "distribution_introduced_art_desc": "Acanthus longifolius was mainly introduced to coastal and urban areas in the United States, particularly in the southeastern region. It is commonly found in disturbed soils along roadsides, in vacant lots, and near construction sites. This plant thrives in sunny, well-drained environments and is often considered an invasive species in some areas. Its rapid growth and ability to spread through seeds make it a challenging weed to control. Despite its invasive tendencies, it is sometimes used in ornamental gardening due to its attractive foliage and flower spikes."
}
