{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hypochoerum",
    "plant_slug": "acantholimon-hypochoerum",
    "plant_name_scientific": "acantholimon hypochoerum",
    "intro": "Acantholimon hypochoerum, commonly known as the narrowleaf flaxvetch, is a flowering plant native to the Mediterranean region. It is a member of the legume family, Fabaceae, and is characterized by its slender, grass-like leaves and small, pea-like flowers. The plant typically grows in rocky or sandy soils and is adapted to arid or semi-arid environments. It produces small, hard-coated seeds that are dispersed by wind, allowing it to colonize new areas effectively. This species is often found in open habitats such as coastal dunes and disturbed soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hypochoerum is primarily native to the Mediterranean region, specifically the eastern part of the Iberian Peninsula. It is found in areas such as southern Spain, including the regions of Andalusia and Murcia. This plant thrives in rocky and coastal habitats, often growing on limestone soils. It is commonly associated with scrublands and maritime climates. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acantholimon hypochoerum was mainly introduced to New Zealand. It was brought there as part of the broader introduction of flowering plants for ornamental or horticultural purposes. This species is now considered an invasive plant in certain regions of New Zealand. It has established itself in coastal and inland areas, often outcompeting native vegetation. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
