{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum pachystegium",
    "plant_slug": "acanthophyllum-pachystegium",
    "plant_name_scientific": "acanthophyllum pachystegium",
    "intro": "Acanthophyllum pachystegium, commonly known as the woolly acanthophyllum, is a perennial shrub native to arid and semi-arid regions of Central Asia. It is characterized by its dense, spiny foliage and compact growth habit, which helps it conserve water in harsh environments. The plant produces small, yellow flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its root system is extensive and deep, allowing it to access moisture from deeper soil layers. This species is well adapted to extreme drought conditions and plays a role in stabilizing sandy soils in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum pachystegium"
    },
    "taxonomy_art_desc": "Acanthophyllum pachystegium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and specialized structures for water transport. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum pachystegium, a specific type within the genus known for its succulent leaves and adapted to harsh environments, often found in sandy or rocky soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran",
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum pachystegium is primarily native to Afghanistan, Iran, and Turkmenistan. This plant is typically found in arid and semi-arid regions within these countries. It thrives in sandy or rocky soils and is often seen in desert or steppe environments. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthophyllum pachystegium was mainly introduced to arid and semi-arid regions of central Asia, including parts of Mongolia and China. It is commonly found in sandy and gravelly soils, often in steppes and desert environments. This plant is well adapted to harsh climatic conditions, with deep root systems that allow it to survive in low-water environments. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has raised concerns about its potential impact on native plant communities."
}
