{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantharia melanocarpa",
    "plant_slug": "acantharia-melanocarpa",
    "plant_name_scientific": "acantharia melanocarpa",
    "intro": "Acantharia melanocarpa, commonly known as the black acantharian, is a species of marine protist belonging to the order Acantharia. It is characterized by its intricate, calcareous skeletal structure, which forms a complex, spiny shell. The organism is typically found in coastal waters and is part of the plankton community. Its life cycle involves both asexual and sexual reproduction, with the latter producing resting spores. Acantharia melanocarpa plays a role in marine ecosystems by contributing to nutrient cycling and serving as a food source for various marine organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantharia melanocarpa is primarily native to Argentina Northeast. This plant species is found in the northeastern regions of Argentina, where the climate and soil conditions support its growth. It thrives in areas with moderate temperatures and adequate rainfall. The distribution is limited to specific habitats within this region. Its native range does not extend beyond the northeastern part of Argentina.",
    "distribution_introduced_art_desc": "Acantharia melanocarpa was mainly introduced to new environments through human activities such as trade and transportation. It is commonly found in coastal areas where it thrives in brackish water conditions. This plant has adapted well to these new habitats, leading to its spread along shorelines. Its introduction has raised concerns about its potential impact on local ecosystems. Despite its invasive nature, it plays a role in nutrient cycling in aquatic environments."
}
