{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum hirsutum",
    "plant_slug": "acanthospermum-hirsutum",
    "plant_name_scientific": "acanthospermum hirsutum",
    "intro": "Acanthospermum hirsutum, commonly known as the hairy acanthospermum, is a flowering plant native to tropical and subtropical regions of the Americas. It belongs to the family Asteraceae, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows as a shrub or subshrub, featuring hairy stems and leaves that are often covered in fine, stiff hairs. Its flowers are yellow and arranged in dense, spherical clusters, making it a distinctive sight in its natural habitat. Acanthospermum hirsutum is often found in disturbed soils and can thrive in a variety of environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum hirsutum is primarily native to tropical and subtropical regions of Africa, including countries such as Kenya, Tanzania, and Uganda. It is also found in parts of southern Arabia and the Indian subcontinent, including India and Sri Lanka. This plant thrives in open habitats such as grasslands, woodland edges, and disturbed soils. It is commonly seen in dry to semi-arid environments where it can tolerate high temperatures and low rainfall. Its native distribution reflects its adaptability to diverse ecological conditions across these regions.",
    "distribution_introduced_art_desc": "Acanthospermum hirsutum was mainly introduced to the United States as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since spread beyond cultivated areas and is now considered an invasive species in several regions, particularly in the southeastern United States. The plant thrives in disturbed soils and can quickly colonize open areas, leading to the displacement of native vegetation. Its rapid growth and ability to reproduce prolifically make it a challenging weed to control. As a result, it is now classified as a noxious weed in multiple states, prompting efforts to manage its spread."
}
