{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon venustum var. oliveri",
    "plant_slug": "acantholimon-venustum-var-oliveri",
    "plant_name_scientific": "acantholimon venustum var. oliveri",
    "intro": "Acantholimon venustum var. oliveri, commonly known as the Oliver's thimbleweed, is a flowering plant native to the western United States. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features small, blue to purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its leaves are typically narrow and covered in fine hairs, adapted to reduce water loss in arid environments. This variety is often found in rocky soils and open habitats, showcasing its resilience to harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon venustum var. oliveri is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal scrub and chaparral habitats. This plant thrives in well-drained soils and is often associated with rocky or sandy terrain. It is adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters. Due to its specific habitat requirements, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acantholimon venustum var. oliveri was mainly introduced to New Zealand. It was brought there during the 19th century as part of the European botanical introductions. This plant is now considered a naturalized species in certain regions of the country. It has been found growing in coastal and lowland areas, often in disturbed habitats. However, its spread is limited and it does not pose a significant threat to native ecosystems."
}
