{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum montanum",
    "plant_slug": "acanthophyllum-montanum",
    "plant_name_scientific": "acanthophyllum montanum",
    "intro": "Acanthophyllum montanum, commonly known as mountain acanthophyllum, is a flowering plant native to arid and semi-arid regions of central Asia. It belongs to the Amaranthaceae family and is characterized by its compact, shrub-like growth habit. The plant produces small, clustered flowers that are typically greenish or reddish in color. Its leaves are usually small, fleshy, and adapted to reduce water loss in harsh environments. Acanthophyllum montanum is often found in rocky soils and is well-suited to survive in extreme climatic conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum montanum is primarily native to Afghanistan. It is commonly found in the mountainous regions of the country, particularly in the eastern and central parts. This plant thrives in arid and semi-arid environments, often growing on rocky slopes and in sandy soils. It is well adapted to the harsh climatic conditions of the region, including high altitudes and low precipitation. Acanthophyllum montanum plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthophyllum montanum was mainly introduced to the arid and semi-arid regions of western North America, particularly in the Great Basin and Mojave Desert. It is commonly found in sandy and gravelly soils, often in areas with low precipitation and high temperatures. This plant is well adapted to harsh environmental conditions, making it a resilient species in disturbed or degraded habitats. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has raised concerns about its potential impact on native plant communities."
}
