{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon talagonicum var. microstegium",
    "plant_slug": "acantholimon-talagonicum-var-microstegium",
    "plant_name_scientific": "acantholimon talagonicum var. microstegium",
    "intro": "Acantholimon talagonicum var. microstegium, commonly known as the small-stemmed sea holly, is a flowering plant native to the coastal regions of the Iberian Peninsula. It is a perennial herb characterized by its silver-gray foliage and distinctive, spiny leaves. The plant produces small, blue or violet flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in sandy or gravelly soils and is adapted to coastal conditions with high salinity and wind exposure. This variety is valued for its ornamental appeal and ecological role in coastal ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon talagonicum var. microstegium is primarily native to the western Mediterranean region, specifically the island of Sardinia. This plant is found in coastal areas and rocky habitats, often growing in sunny, well-drained soils. It is adapted to the mild, wet winters and warm, dry summers typical of the Mediterranean climate. The variety is known for its small, narrow leaves and delicate blue or purple flowers. Due to its limited distribution, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acantholimon talagonicum var. microstegium was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dunes. It thrives in arid and semi-arid environments where it can tolerate high levels of salinity and poor soil nutrients. This plant is commonly found in regions of the Mediterranean, particularly in southern Spain and parts of North Africa. It has been introduced to several areas outside its native range for erosion control and ornamental purposes. However, its spread can sometimes lead to competition with native plant species in invaded habitats."
}
