{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hoshapicum",
    "plant_slug": "acantholimon-hoshapicum",
    "plant_name_scientific": "acantholimon hoshapicum",
    "intro": "Acantholimon hoshapicum, commonly known as the Hoshap's thornscale, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its succulent, often hairy stems and small, clustered flowers. The plant typically grows in rocky or gravelly soils and is adapted to arid or semi-arid environments. Its leaves are usually fleshy and may have a waxy coating to reduce water loss. The species is of interest to botanists due to its unique morphology and ecological adaptations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hoshapicum"
    },
    "taxonomy_art_desc": "Acantholimon hoshapicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex life cycles and terrestrial adaptations. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological features. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive floral structures and often succulent or salt-tolerant adaptations. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or violet flowers and specialized seed structures. Its genus is Acantholimon, a genus of flowering plants typically found in arid or coastal regions, known for their succulent leaves and showy flowers. Its species is Acantholimon hoshapicum, a specific plant within the genus Acantholimon, native to certain regions of Asia, characterized by its unique morphology and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hoshapicum is primarily native to Turkey. It is found in the eastern part of the country, particularly in the regions of eastern Anatolia. This plant typically grows in rocky and arid environments, often in mountainous areas. It is adapted to the harsh climate and limited soil conditions of its native habitat. Its distribution is relatively restricted, making it a regionally significant species within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon hoshapicum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in rocky slopes, gravelly plains, and disturbed soils where it can establish itself quickly. This plant is often used for erosion control due to its hardy nature and ability to thrive in harsh conditions. It has been introduced to several regions outside its native range, including parts of the western United States. Its distribution is largely limited by its specific ecological requirements and the availability of suitable habitats."
}
