{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon inerme",
    "plant_slug": "acantholimon-inerme",
    "plant_name_scientific": "acantholimon inerme",
    "intro": "Acantholimon inerme, commonly known as the smooth thornsteppe, is a low-growing perennial plant native to the arid and semi-arid regions of western North America. It belongs to the family Caryophyllaceae, which includes many flowering plants adapted to harsh environments. The plant features dense, wiry stems covered with small, scale-like leaves that reduce water loss. Its flowers are typically pink or white, arranged in clusters and blooming in late spring to early summer. Acantholimon inerme is well adapted to rocky soils and is often found in sagebrush-steppe habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon inerme"
    },
    "taxonomy_art_desc": "Acantholimon inerme belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Caryophyllales, a group of flowering plants that includes many succulent species and is known for its diverse floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their distinctive blue or purple flowers. Its genus is Acantholimon, a group of flowering plants commonly known as \"thorny glassworts,\" typically found in saline or coastal environments. Its species is Acantholimon inerme, a specific plant within the genus Acantholimon, characterized by its low-growing habit and small, inconspicuous flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon inerme is primarily native to Afghanistan. It is commonly found in arid and semi-arid regions of the country. This plant thrives in rocky and sandy soils, often growing in mountainous areas. It is well adapted to the harsh climate and low precipitation typical of its native habitat. Acantholimon inerme plays a role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acantholimon inerme was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, gravelly slopes, and disturbed agricultural land. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. This plant thrives in well-drained soils and is often seen in coastal and inland areas. Its introduction has led to its establishment in several regions outside its native range. It is considered a potential invasive species in some areas due to its rapid growth and ability to colonize new environments."
}
