{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon microstegium",
    "plant_slug": "acantholimon-microstegium",
    "plant_name_scientific": "acantholimon microstegium",
    "intro": "Acantholimon microstegium, commonly known as the small-stemmed acantholimon, is a low-growing perennial plant native to the arid regions of central Asia. It belongs to the family Plumbagaceae and is characterized by its compact, mat-forming growth habit. The plant features narrow, gray-green leaves that are covered in fine hairs, which help reduce water loss in its dry habitat. Its flowers are small, blue to violet in color, and appear in clusters during the summer months. Acantholimon microstegium is adapted to harsh environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon microstegium is primarily native to the Mediterranean region, particularly in parts of southern Europe, North Africa, and western Asia. It thrives in rocky and coastal environments, often found in areas with well-drained soils. This plant is commonly associated with mountainous and coastal habitats, where it can withstand harsh climatic conditions. Its distribution includes countries such as Spain, France, Italy, and parts of the Middle East. It is typically found in open, sunny areas and is well adapted to the unique ecological conditions of its native range.",
    "distribution_introduced_art_desc": "Acantholimon microstegium was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and drought tolerance. It is commonly found in garden settings in regions with Mediterranean climates. The plant has been reported in several countries, including parts of the United States and Australia. Its spread is often associated with human activity, such as the movement of soil and plants. However, it is not considered invasive in most areas where it is cultivated."
}
