{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum leiostegium",
    "plant_slug": "acanthophyllum-leiostegium",
    "plant_name_scientific": "acanthophyllum leiostegium",
    "intro": "Acanthophyllum leiostegium, commonly known as the smooth leafed acanthophyllum, is a flowering plant native to arid and semi-arid regions of Central Asia. It belongs to the family Amaranthaceae and is characterized by its succulent, spiny stems and small, scale-like leaves. The plant is well adapted to harsh environments, storing water in its fleshy stems and reducing water loss through its reduced leaf surface. It produces small, greenish flowers that are clustered in dense inflorescences, typically blooming in late spring or early summer. Due to its hardy nature, it plays a role in stabilizing soils in desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum leiostegium is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. It is commonly found in sandy and gravelly soils, often in steppe and desert steppe ecosystems. This plant thrives in environments with low precipitation and high solar exposure. It is well adapted to withstand extreme temperatures and limited water availability. Its distribution is closely linked to specific ecological zones characterized by harsh climatic conditions.",
    "distribution_introduced_art_desc": "Acanthophyllum leiostegium was mainly introduced to arid and semi-arid regions of central Asia, including parts of Mongolia and China. It is typically found in sandy or gravelly soils where it forms dense shrublands. This plant is well adapted to harsh environmental conditions, such as high temperatures and low precipitation. Its introduction has been associated with ecological restoration efforts in degraded landscapes. However, its spread can sometimes lead to competition with native vegetation."
}
