{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthotheca integrifolia",
    "plant_slug": "acanthotheca-integrifolia",
    "plant_name_scientific": "acanthotheca integrifolia",
    "intro": "Acanthotheca integrifolia, commonly known as the smoothleaf acanthotheca, is a species of flowering plant in the family Acanthaceae. It is native to tropical regions of Africa and is characterized by its simple, smooth leaves and showy, clustered inflorescences. The plant produces small, tubular flowers that are typically pink or purple in color. It thrives in moist, well-drained soils and is often found in woodland or shrubland habitats. Due to its ornamental value, it is occasionally cultivated in gardens, though it is not widely commercialized.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthotheca integrifolia is primarily native to the western coast of North America, particularly in California and Oregon. It thrives in coastal scrub and sandy soils along the Pacific coastline. This species is commonly found in dunes and other coastal habitats where it can withstand salt spray and strong winds. It is an important part of the local flora, contributing to the ecological balance of these environments. Due to its specific habitat requirements, it is not widely distributed beyond these coastal regions.",
    "distribution_introduced_art_desc": "Acanthotheca integrifolia was mainly introduced to New Zealand. It was brought there as a potential ornamental plant due to its attractive foliage. However, it has since become an invasive species, outcompeting native vegetation in certain areas. The plant thrives in moist, shaded environments, making it particularly problematic in forested regions. Its rapid spread has led to increased management efforts to control its impact on local ecosystems."
}
