{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthogonum rigidum",
    "plant_slug": "acanthogonum-rigidum",
    "plant_name_scientific": "acanthogonum rigidum",
    "intro": "Acanthogonum rigidum, commonly known as the rigid acanthogonum, is a member of the Amaranthaceae family. It is a perennial herb characterized by its upright, branching stems that are typically covered in stiff, spiny hairs. The plant produces small, clustered flowers that are usually pink to red in color, which bloom during the summer months. Its leaves are alternate, ovate, and have a rough texture, contributing to its distinctive appearance. Acanthogonum rigidum is often found in dry, disturbed soils and is adapted to thrive in arid or semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthogonum rigidum is primarily native to the southern United States, particularly Texas and New Mexico. It is commonly found in arid and semi-arid regions, growing in sandy or gravelly soils. This plant thrives in environments with low precipitation and high sunlight exposure. It is often seen in disturbed areas such as roadsides and open fields. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acanthogonum rigidum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and waste areas. It thrives in regions with moderate to high sunlight exposure and well-drained soils. This plant is often found in temperate climates and has shown adaptability to various environmental conditions. Its introduction has been associated with human activities, including land development and transportation infrastructure. Due to its rapid growth and competitive nature, it can become invasive in certain ecosystems."
}
