{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis tuba",
    "plant_slug": "acanthopsis-tuba",
    "plant_name_scientific": "acanthopsis tuba",
    "intro": "Acanthopsis tuba, commonly known as the tuberous acanthus, is a flowering plant native to South Africa. It belongs to the Acanthaceae family and is characterized by its striking tuberous roots and showy, bract-like flowers. The plant produces clusters of vibrant blue to purple flowers that bloom in late summer. Its leaves are opposite, ovate, and often covered in fine hairs. Acanthopsis tuba is valued in horticulture for its ornamental appeal and adaptability to well-drained soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis tuba"
    },
    "taxonomy_art_desc": "Acanthopsis tuba belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which includes ferns and their relatives, known for their vascular systems and often having a distinct morphology. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Lamiales, a group of flowering plants that includes many aromatic plants with showy flowers and often complex inflorescences. Its family is Acanthaceae, a family of flowering plants commonly known as the acanthus family, characterized by their showy flowers and often hairy leaves. Its genus is Acanthopsis, a genus within the Acanthaceae family, typically featuring plants with spiny or prickly structures. Its species is Acanthopsis tuba, a specific plant within the genus Acanthopsis, distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis tuba is primarily native to the Cape Provinces. It is a flowering plant that thrives in the unique ecosystems of this region. The Cape Provinces are known for their rich biodiversity and distinct climatic conditions. This plant is commonly found in coastal and mountainous areas within the region. Its native distribution is closely tied to the specific environmental conditions of the Cape Provinces.",
    "distribution_introduced_art_desc": "Acanthopsis tuba was mainly introduced to areas with disturbed soils and human-altered landscapes. It thrives in environments with moderate moisture and full sun exposure. This plant is commonly found along roadsides, in abandoned fields, and near urban developments. Its rapid growth and ability to tolerate poor soil conditions contribute to its invasive potential. However, it is not considered a major threat in most regions where it has been introduced."
}
