{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon huetii var. breviscapum",
    "plant_slug": "acantholimon-huetii-var-breviscapum",
    "plant_name_scientific": "acantholimon huetii var. breviscapum",
    "intro": "Acantholimon huetii var. breviscapum, commonly known as the short-stemmed thornweed, is a perennial flowering plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit. The plant features dense clusters of small, blue to purple flowers that bloom in late spring to early summer. Its leaves are typically narrow and covered in fine hairs, adapting to arid conditions. It thrives in well-drained soils and is often found in rocky or gravelly habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon huetii"
    },
    "taxonomy_art_desc": "Acantholimon huetii var. breviscapum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and algae that have a distinct life cycle with a sporophyte and gametophyte stage. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their relatives, characterized by their jointed stems and spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species, often with a wide range of morphological adaptations. Its order is Caryophyllales, a group of flowering plants that includes many plants with specialized structures such as betalains and clustered flowers. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon huetii, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon huetii var. breviscapum is primarily native to Turkey. This plant is found in specific regions of Turkey, particularly in the eastern and southeastern parts of the country. It grows in rocky and arid environments, often in mountainous areas. The species is adapted to the dry and harsh conditions of its native habitat. It is a member of the Plumbagaceae family and is known for its distinctive floral characteristics.",
    "distribution_introduced_art_desc": "Acantholimon huetii var. breviscapum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It thrives in rocky or gravelly soils and is often found in open habitats such as coastal dunes, slopes, and disturbed areas. This plant is valued for its ornamental value due to its compact growth habit and flowering display. It is commonly used in xeriscaping and as a ground cover in dry, sunny gardens. However, it may require regular pruning to maintain its shape and prevent it from becoming invasive in certain environments."
}
