{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon halophilum var. halophilum",
    "plant_slug": "acantholimon-halophilum-var-halophilum",
    "plant_name_scientific": "acantholimon halophilum var. halophilum",
    "intro": "Acantholimon halophilum var. halophilum, commonly known as the saltbush or coastal saltbush, is a halophyte native to coastal regions of the Mediterranean. It thrives in saline soils and is adapted to withstand high salt concentrations and arid conditions. The plant features succulent leaves that help reduce water loss, and its flowers are typically pink or purple, arranged in dense clusters. It plays a crucial role in stabilizing coastal dunes and preventing soil erosion. This species is valued for its ecological resilience and is often used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon halophilum"
    },
    "taxonomy_art_desc": "Acantholimon halophilum var. halophilum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and chloroplasts. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and some modern seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to saline or arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in dry and saline habitats, known for their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid or saline environments, characterized by their succulent stems and small, clustered flowers. Its species is Acantholimon halophilum, a specific plant adapted to saline environments, known for its hardy nature and ability to thrive in harsh conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon halophilum var. halophilum is primarily native to Turkey. It is commonly found in coastal and saline environments across the country. This plant thrives in areas with high salt content in the soil. It is often seen in dunes and rocky coastal regions. Its distribution is closely linked to the unique ecological conditions of Turkey's coastal zones.",
    "distribution_introduced_art_desc": "Acantholimon halophilum var. halophilum was mainly introduced to coastal and saline environments, particularly in regions with high salinity and well-drained soils. It thrives in areas where other plants struggle due to its tolerance for salt and arid conditions. This plant is commonly found in Mediterranean climates and parts of the western United States. It has been introduced to several regions outside its native range for erosion control and ornamental purposes. However, its spread has raised concerns about its potential impact on local ecosystems."
}
