{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthanthus ayacuchensis",
    "plant_slug": "acanthanthus-ayacuchensis",
    "plant_name_scientific": "acanthanthus ayacuchensis",
    "intro": "Acanthanthus ayacuchensis, commonly known as the Ayacuchensis Acanthanthus, is a species of flowering plant native to the Andean regions of South America. It belongs to the family Acanthaceae and is characterized by its striking, showy inflorescences. The plant typically grows in moist, shaded environments, often in mountainous areas with rich, well-drained soil. Its leaves are usually lance-shaped and have a rough, hairy texture, while its flowers come in shades of red, orange, and yellow. This species is valued for its ornamental qualities and is sometimes cultivated in botanical gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthanthus ayacuchensis is primarily native to the Peruvian Andes, specifically in the region of Ayacucho. It thrives in high-altitude environments, typically between 3,000 and 4,500 meters above sea level. This plant is commonly found in rocky and arid habitats, often growing on slopes or in crevices. It is adapted to the cool and dry climate of its native range. Due to its limited distribution, it is considered a rare and endemic species in its region.",
    "distribution_introduced_art_desc": "Acanthanthus ayacuchensis was mainly introduced to regions with a temperate climate and well-drained soils, where it can thrive in full sun to partial shade. It is commonly found in gardens and cultivated areas in South America, particularly in Peru and neighboring countries. This plant is valued for its striking, spiky flowers that bloom in late spring or early summer. Due to its ornamental appeal, it has been introduced to other parts of the world with similar climatic conditions. However, its introduction outside its native range requires careful management to prevent potential ecological impacts."
}
