{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthochiton wrightii",
    "plant_slug": "acanthochiton-wrightii",
    "plant_name_scientific": "acanthochiton wrightii",
    "intro": "Acanthochiton wrightii, commonly known as the Wright's acanthochiton, is a species of sea apple found in the Indo-Pacific region. It belongs to the family Acanthochitonidae and is characterized by its distinctive, spiny shell. The plant's shell is typically reddish-brown with a smooth, glossy surface. It thrives in shallow, tropical waters and is often found in coral reefs. Due to its unique appearance, it is a popular subject for marine aquarists and researchers.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthochiton wrightii is primarily native to the western coast of North America, specifically from Alaska to California. It is commonly found in rocky intertidal zones along the Pacific coastline. This species thrives in areas with moderate to high wave action and is often associated with maritime forests and coastal bluffs. It plays an important role in the ecological balance of these habitats by contributing to nutrient cycling and providing shelter for smaller organisms. Due to its specific habitat requirements, it is not found outside of this geographic range.",
    "distribution_introduced_art_desc": "Acanthochiton wrightii was mainly introduced to coastal regions of the Pacific Northwest, including areas in Oregon and Washington. It is commonly found in intertidal zones where it attaches to rocky substrates. This species is known for its distinctive spiny shell and is often used as a food source by local wildlife. Its introduction has had minimal impact on native ecosystems, though it is monitored for potential changes in biodiversity. The plant's distribution is largely limited to its native range, with no significant spread beyond these areas."
}
