{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum squarrosum var. glaberrimum",
    "plant_slug": "acanthophyllum-squarrosum-var-glaberrimum",
    "plant_name_scientific": "acanthophyllum squarrosum var. glaberrimum",
    "intro": "Acanthophyllum squarrosum var. glaberrimum, commonly known as the smooth acanthophyllum, is a shrub-like plant native to arid and semi-arid regions of Central Asia. It is characterized by its low, sprawling growth habit and gray-green foliage, which helps it retain moisture in harsh environments. The plant produces small, pale yellow flowers during the summer months, typically in clusters at the ends of its branches. Its leaves are usually reduced to spines, which help reduce water loss and deter herbivores. This species is well adapted to sandy soils and can thrive in regions with limited rainfall.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum squarrosum var. glaberrimum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. This plant thrives in sandy and gravelly soils, often found in steppe and desert environments. It is well adapted to harsh climatic conditions, such as low precipitation and extreme temperature fluctuations. The species is commonly observed in regions with sparse vegetation cover. Its distribution is closely linked to the ecological zones characterized by low moisture availability and high solar exposure.",
    "distribution_introduced_art_desc": "Acanthophyllum squarrosum var. glaberrimum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Kazakhstan and Mongolia. It is adapted to harsh environmental conditions, including high temperatures and low precipitation. This plant is commonly found in sandy and gravelly soils, often in steppe and desert ecosystems. Its introduction has been associated with human activities such as land degradation and overgrazing. It plays a role in stabilizing dunes and preventing soil erosion in these regions."
}
