{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax longipes",
    "plant_slug": "acanthopanax-longipes",
    "plant_name_scientific": "acanthopanax longipes",
    "intro": "Acanthopanax longipes, commonly known as the long-stemmed Chinese dogwood, is a deciduous shrub native to the mountainous regions of East Asia. It belongs to the family Araliaceae and is characterized by its compound leaves with serrated edges and small, clustered flowers. The plant produces red berries that are edible for birds and mammals, aiding in seed dispersal. It thrives in temperate climates and is often found in moist, shaded forest environments. Due to its ornamental value and medicinal properties, it is sometimes cultivated in gardens and traditional herbal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax longipes is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It thrives in temperate climates and is commonly found in forests and rocky slopes at elevations ranging from 1,000 to 3,000 meters. This plant is particularly associated with the Korean Peninsula and parts of northeastern China, such as Heilongjiang and Jilin provinces. It is often found in mixed hardwood and coniferous forests, where it forms dense undergrowth. Due to its specific habitat requirements, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acanthopanax longipes was mainly introduced to areas with temperate to subtropical climates, where it thrives in well-drained soils and partial to full sunlight. It is commonly found in regions of East Asia, including China, Korea, and Japan, where it has been cultivated for its medicinal properties. The plant's introduction has been driven by its use in traditional medicine, particularly for its purported health benefits. However, in some regions, it has become invasive, outcompeting native flora and altering local ecosystems. Its distribution is now expanding due to both natural spread and human activity."
}
