{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon laevigatum",
    "plant_slug": "acantholimon-laevigatum",
    "plant_name_scientific": "acantholimon laevigatum",
    "intro": "Acantholimon laevigatum, commonly known as the smooth-flowered flax, is a flowering plant native to the mountainous regions of Central Asia. It is a perennial herb characterized by its erect, branched stems and narrow, linear leaves. The plant produces small, blue to purple flowers arranged in dense clusters, which bloom in late spring to early summer. It thrives in well-drained soils and is often found in rocky or gravelly habitats. Acantholimon laevigatum is valued for its ornamental appeal and is sometimes cultivated in gardens for its delicate appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon laevigatum"
    },
    "taxonomy_art_desc": "Acantholimon laevigatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle that includes both a sporophyte and a gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Caryophyllales, which includes plants known for their distinctive floral structures and often for their ability to thrive in saline or arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and coastal areas, known for their succulent leaves and showy flowers. Its species is Acantholimon laevigatum, a specific type of plant within the genus Acantholimon, characterized by its hairy stems and yellow flowers, often found in rocky or sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Xinjiang"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon laevigatum is primarily native to Xinjiang. This plant is found in the arid and semi-arid regions of Xinjiang, China. It thrives in sandy or gravelly soils and is adapted to the harsh climate of the area. It is commonly found in desert margins and along riverbanks. Its distribution is limited to specific ecological niches within Xinjiang.",
    "distribution_introduced_art_desc": "Acantholimon laevigatum was mainly introduced to areas with dry, rocky soils and open habitats such as gravelly slopes and disturbed ground. It is commonly found in regions with a Mediterranean climate, including parts of southern Europe and the western United States. This plant thrives in well-drained soils and is often seen in coastal and inland areas where it can establish itself along roadsides and in degraded landscapes. Its introduction has been associated with human activity, such as land development and transportation corridors. However, it is generally not considered invasive and is often regarded as a native or naturalized species in its range."
}
