{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum chloroleucum",
    "plant_slug": "acanthophyllum-chloroleucum",
    "plant_name_scientific": "acanthophyllum chloroleucum",
    "intro": "Acanthophyllum chloroleucum, commonly known as the whiteleaf jointvetch, is a flowering plant native to the arid regions of Central Asia. It belongs to the legume family, Fabaceae, and is characterized by its low-growing, shrub-like structure adapted to harsh desert environments. The plant features small, pale green leaves and produces yellow or green flowers that bloom in early summer. Its root system is extensive, allowing it to access water from deep underground, which is crucial for survival in its dry habitat. Acanthophyllum chloroleucum plays a role in stabilizing soil and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum chloroleucum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in sandy and gravelly soils, often found in desert steppes and dunes. This plant is well adapted to harsh environmental conditions, such as high temperatures and low precipitation. It plays an important role in stabilizing soil and preventing erosion in these ecosystems. Its distribution is closely tied to the specific climatic and geological conditions of its native range.",
    "distribution_introduced_art_desc": "Acanthophyllum chloroleucum was mainly introduced to areas with arid or semi-arid climates where it can thrive in sandy or gravelly soils. It is commonly found in regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. This plant is often used for soil stabilization due to its deep root system and ability to colonize disturbed lands. Its introduction has helped in preventing soil erosion in degraded landscapes. However, it is considered a potential invasive species in some regions where it outcompetes native vegetation."
}
