{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum cerastioides",
    "plant_slug": "acanthophyllum-cerastioides",
    "plant_name_scientific": "acanthophyllum cerastioides",
    "intro": "Acanthophyllum cerastioides, commonly known as the sandmat, is a flowering plant native to arid regions of the Middle East and Central Asia. It is a low-growing, mat-forming shrub with dense, spiny stems that help reduce water loss and provide protection against wind and herbivores. The plant produces small, yellowish flowers in clusters, typically blooming in late spring or early summer. Its root system is deep and extensive, allowing it to access water from deeper soil layers in its harsh environment. Acanthophyllum cerastioides plays an important role in stabilizing sandy soils and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum cerastioides"
    },
    "taxonomy_art_desc": "Acanthophyllum cerastioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, which encompasses a diverse group of flowering plants with a wide range of morphological adaptations. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert species, often with specialized adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny or thorny structures. Its species is Acanthophyllum cerastioides, a specific type of flowering plant known for its succulent, spiny leaves and its ability to thrive in harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "East Himalaya",
        "Nepal",
        "Pakistan",
        "Tibet",
        "West Himalaya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum cerastioides is primarily native to Assam, East Himalaya, Nepal, Pakistan, Tibet, West Himalaya. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often associated with dry grasslands and shrublands. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local fauna.",
    "distribution_introduced_art_desc": "Acanthophyllum cerastioides was mainly introduced to areas with arid or semi-arid climates, particularly in regions with well-drained sandy or gravelly soils. It is commonly found in desert environments where it plays a role in stabilizing dunes and preventing soil erosion. This plant is adapted to low precipitation and high temperatures, making it a resilient species in harsh conditions. Its introduction has been documented in parts of North America, including the southwestern United States and northern Mexico. Due to its hardy nature, it has become an invasive species in some regions, outcompeting native vegetation."
}
