{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon nuristanicum",
    "plant_slug": "acantholimon-nuristanicum",
    "plant_name_scientific": "acantholimon nuristanicum",
    "intro": "Acantholimon nuristanicum, commonly known as the Nuristan thornweed, is a perennial flowering plant native to the mountainous regions of northern Pakistan and Afghanistan. It belongs to the family Plumbagaceae and is characterized by its succulent, branched stems and small, often blue or purple flowers. The plant typically grows in rocky or gravelly soils at high altitudes, showcasing its adaptability to harsh environments. Its leaves are usually fleshy and covered in fine hairs, which help reduce water loss in arid conditions. Acantholimon nuristanicum is of interest to botanists due to its unique morphology and potential ecological role in alpine ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon nuristanicum is primarily native to the mountainous regions of northern Pakistan, specifically in the Nuristan province. It is commonly found in alpine and subalpine habitats at elevations ranging from 2,500 to 4,000 meters. The plant thrives in rocky soils and is often associated with sparse vegetation in high-altitude environments. It is an important component of the local flora and is adapted to the cold and harsh climatic conditions of the region. Due to its limited distribution, it is considered a rare and endemic species in this area.",
    "distribution_introduced_art_desc": "Acantholimon nuristanicum was mainly introduced to regions with arid and semi-arid climates, particularly in Central Asia and parts of the Himalayas. It thrives in well-drained soils and is commonly found in rocky or gravelly habitats. This plant is adapted to low rainfall and high solar exposure, making it suitable for xerophytic environments. It is often used in ecological restoration projects due to its resilience and ability to stabilize soils. Its introduction has been noted in several countries, including Afghanistan and Pakistan, where it contributes to local biodiversity."
}
