{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon peculiare",
    "plant_slug": "acantholimon-peculiare",
    "plant_name_scientific": "acantholimon peculiare",
    "intro": "Acantholimon peculiare, commonly known as the peculiar acantholimon, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy flowers. The plant is characterized by its upright growth habit and produces small, clustered flowers that are typically pink or purple in color. It thrives in well-drained soils and is adapted to cold, arid environments. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon peculiare"
    },
    "taxonomy_art_desc": "Acantholimon peculiare belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, often featuring jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are part of the broader angiosperm group. Its order is Caryophyllales, which includes flowering plants with a distinctive arrangement of petals and often contains species adapted to arid environments. Its family is Plumbaginaceae, a group of flowering plants commonly known as the leadplant family, which includes many species with medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon peculiare, a specific type of plant within the genus Acantholimon, known for its unique floral structure and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon peculiare is primarily native to Afghanistan. This plant is found in the mountainous regions of the country, particularly in the eastern and central parts. It thrives in rocky and arid environments, often growing at higher elevations. The species is adapted to the harsh climatic conditions of the region, including cold temperatures and limited rainfall. It is a rare and endemic plant, contributing to the unique biodiversity of Afghanistan's flora.",
    "distribution_introduced_art_desc": "Acantholimon peculiare was mainly introduced to the western United States, particularly in California and Oregon. It was brought there as an ornamental plant due to its attractive, silvery foliage and delicate flowers. Despite its beauty, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in well-drained soils and full sun, making it adaptable to various environments. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
