{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium thionanthum var. munitum",
    "plant_slug": "acanthocalycium-thionanthum-var-munitum",
    "plant_name_scientific": "acanthocalycium thionanthum var. munitum",
    "intro": "Acanthocalycium thionanthum var. munitum, commonly known as the Munitum Hedgehog Cactus, is a rare and unique cactus species native to the arid regions of Mexico. It is characterized by its spiny, cylindrical stems that are often covered with a fine, white waxy coating, which helps reduce water loss. The plant produces small, pale yellow flowers during the summer months, adding a delicate touch to its otherwise rugged appearance. It thrives in well-drained soil and requires minimal water, making it suitable for xeriscaping. Due to its limited distribution and habitat specificity, it is considered a threatened species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium thionanthum var. munitum is primarily native to the central and northern regions of Mexico, specifically in the states of Chihuahua, Coahuila, and Nuevo León. This cactus variety thrives in arid and semi-arid environments, often found in rocky soils and along mountain slopes. It is commonly associated with limestone and gypsum substrates, which provide the well-drained conditions it requires. The plant is adapted to withstand extreme temperatures and limited rainfall, making it a resilient species in its native habitat. Due to its specific ecological requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acanthocalycium thionanthum var. munitum was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions with low rainfall and high temperatures, such as parts of the southwestern United States and northern Mexico. This plant is often cultivated in rock gardens and xeriscaped landscapes due to its drought tolerance and ornamental value. It prefers full sun exposure and minimal water, making it suitable for dryland environments. Its introduction has been primarily for horticultural purposes rather than for ecological or agricultural use."
}
