{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthella pulchra",
    "plant_slug": "acanthella-pulchra",
    "plant_name_scientific": "acanthella pulchra",
    "intro": "Acanthella pulchra, commonly known as the beautiful acanthella, is a species of flowering plant native to South Africa. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows in rocky or sandy soils and thrives in full sun exposure. Its flowers are usually bright yellow or orange, with a distinctive central disk surrounded by ray florets. Acanthella pulchra is valued for its ornamental appeal and is often cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Myrtales",
        "family": "Melastomataceae",
        "genus": "Acanthella",
        "species": "Acanthella pulchra"
    },
    "taxonomy_art_desc": "Acanthella pulchra belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Myrtales, a group of flowering plants that includes species such as myrtles and guava, known for their aromatic oils and showy flowers. Its family is Melastomataceae, a family of flowering plants commonly found in tropical and subtropical regions, known for their vibrant flowers and often woody stems. Its genus is Acanthella, a group of flowering plants typically characterized by their distinctive floral structures and specific habitat preferences. Its species is Acanthella pulchra, a specific type within the genus Acanthella, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthella pulchra is primarily native to Colombia and Venezuela. This plant is found in the tropical and subtropical regions of these countries. It typically grows in humid, forested areas with rich soil. The species is adapted to the warm and moist climate of the region. It plays an important role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acanthella pulchra was mainly introduced to new environments due to its ornamental value and adaptability. It has been found in regions with warm climates, particularly in parts of Australia and Southeast Asia. The plant thrives in well-drained soils and full sun, making it a common choice for gardeners. However, its introduction has raised concerns about its potential to become invasive in native ecosystems. Proper management is essential to prevent its spread into natural habitats."
}
