{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthochlamys bracteata",
    "plant_slug": "acanthochlamys-bracteata",
    "plant_name_scientific": "acanthochlamys bracteata",
    "intro": "Acanthochlamys bracteata, commonly known as the hairy bract ephedra, is a flowering plant native to arid regions of Central Asia. It is characterized by its distinctive bracts covered in fine hairs and its simple, linear leaves. The plant produces small, greenish-yellow flowers arranged in clusters, which are often hidden beneath the foliage. It thrives in dry, sandy soils and is adapted to withstand extreme temperatures and limited water availability. Due to its unique morphology and ecological significance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Pandanales",
        "family": "Velloziaceae",
        "genus": "Acanthochlamys",
        "species": "Acanthochlamys bracteata"
    },
    "taxonomy_art_desc": "Acanthochlamys bracteata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species with showy flowers and a wide range of growth forms. Its order is Pandanales, which includes plants such as the pandanus and related species, typically with large, showy inflorescences and fibrous leaves. Its family is Velloziaceae, a small family of succulent plants often found in arid environments, characterized by their thick, fleshy leaves and specialized water storage tissues. Its genus is Acanthochlamys, a group of flowering plants with distinctive features such as spiny bracts and showy flowers, commonly found in tropical and subtropical regions. Its species is Acanthochlamys bracteata, a specific plant within the genus known for its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "Tibet"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthochlamys bracteata is primarily native to China South-Central and Tibet. This species is commonly found in the mountainous regions of these areas. It thrives in temperate climates with well-drained soils. The plant is often associated with rocky or forested habitats. Its distribution is limited to these specific geographic regions in China.",
    "distribution_introduced_art_desc": "Acanthochlamys bracteata was mainly introduced to new habitats through human activity, such as landscaping and horticultural trade. It is commonly found in disturbed soils and urban environments, where it thrives in areas with moderate moisture and partial shade. This plant has shown adaptability to different climates, allowing it to spread beyond its native range. Its rapid growth and ability to form dense colonies make it an invasive species in some regions. Due to its ecological impact, it is often classified as a noxious weed in areas where it has become established."
}
