{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocladus guayaquilensis",
    "plant_slug": "acanthocladus-guayaquilensis",
    "plant_name_scientific": "acanthocladus guayaquilensis",
    "intro": "Acanthocladus guayaquilensis, commonly known as the Guayaquil acanthocladus, is a flowering plant native to the tropical rainforests of South America. It belongs to the family Cucurbitaceae, which includes cucumbers and gourds, and is characterized by its climbing habit and tendrils. The plant produces small, yellowish-green flowers that are typically unisexual, with separate male and female flowers on the same plant. Its leaves are simple, alternate, and often have a rough texture, while its fruits are small, round, and sometimes edible. This species is of interest to botanists due to its unique morphology and potential ecological roles in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Polygalaceae",
        "genus": "Acanthocladus",
        "species": "Acanthocladus guayaquilensis"
    },
    "taxonomy_art_desc": "Acanthocladus guayaquilensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often retaining primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of plants with characteristic flowers and includes legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Polygalaceae, a family of flowering plants commonly known as milkvetches, often found in arid and temperate regions. Its genus is Acanthocladus, a group of flowering plants typically characterized by their distinctive leaves and flowers. Its species is Acanthocladus guayaquilensis, a specific plant species native to Ecuador, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocladus guayaquilensis is primarily native to Ecuador. It is found in the tropical regions of the country, particularly in the coastal and lowland areas. This plant thrives in humid, warm climates with well-drained soils. It is commonly associated with secondary forests and disturbed habitats. Its native distribution is limited to specific ecological zones within Ecuador.",
    "distribution_introduced_art_desc": "Acanthocladus guayaquilensis was mainly introduced to the coastal regions of Ecuador and northern Peru, where it thrives in humid, tropical climates. It is commonly found in lowland rainforests and along riverbanks, preferring well-drained soils. This species is valued for its ornamental foliage and is often cultivated in botanical gardens and private collections. Due to its limited natural range, it is not widely distributed beyond its native habitat. However, its introduction to new areas has raised concerns about potential ecological impacts."
}
