{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus mollis subsp. platyphyllus",
    "plant_slug": "acanthus-mollis-subsp-platyphyllus",
    "plant_name_scientific": "acanthus mollis subsp. platyphyllus",
    "intro": "Acanthus mollis subsp. platyphyllus, commonly known as the broadleaf acanthus, is a perennial evergreen plant native to southern Europe and western Asia. It is characterized by its large, palmately lobed leaves that are broad and often have a waxy texture. The plant produces showy, spiny bracts that enclose its small, inconspicuous flowers, typically in late spring to early summer. It thrives in well-drained soil and full sun to partial shade, making it a popular choice for ornamental gardens. Its architectural form and striking foliage make it a valuable addition to both landscape design and horticultural collections.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus mollis"
    },
    "taxonomy_art_desc": "Acanthus mollis subsp. platyphyllus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Lamiales, a group of flowering plants that includes well-known genera such as Lavandula and Olea. Its family is Acanthaceae, a family of flowering plants commonly known as the acanthus family, which includes many ornamental plants. Its genus is Acanthus, a group of flowering plants known for their distinctive spiny leaves and showy bracts. Its species is Acanthus mollis, a species of acanthus known for its broad, soft leaves and is a subspecies of Acanthus mollis subsp. platyphyllus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Algeria",
        "Morocco",
        "Tunisia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus mollis subsp. platyphyllus is primarily native to Algeria, Morocco, and Tunisia. This subspecies is commonly found in rocky and coastal areas across these North African countries. It thrives in well-drained soils and is often seen growing in sunny, arid environments. The plant is well adapted to the Mediterranean climate of the region. It is a popular choice for ornamental gardening due to its attractive foliage and flowering habits.",
    "distribution_introduced_art_desc": "Acanthus mollis subsp. platyphyllus was mainly introduced to ornamental horticulture due to its striking foliage and showy flowers. It is commonly cultivated in gardens and landscapes for its aesthetic value. The plant thrives in well-drained soil and full sun, making it suitable for a variety of climates. It has been widely distributed in regions with temperate to subtropical conditions. However, in some areas, it has become invasive, outcompeting native vegetation."
}
