{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ilicifolius var. subinteger",
    "plant_slug": "acanthus-ilicifolius-var-subinteger",
    "plant_name_scientific": "acanthus ilicifolius var. subinteger",
    "intro": "Acanthus ilicifolius var. subinteger, commonly known as the narrow-leaved acanthus, is a striking evergreen shrub native to the Mediterranean region. It features broad, lance-shaped leaves that are typically dark green and glossy, with a slightly serrated edge. The plant produces showy, spires of violet-blue flowers in the summer months, which attract pollinators such as bees and butterflies. Its robust growth habit makes it suitable for use in gardens as a specimen plant or hedge. It thrives in well-drained soil and full sun to partial shade, requiring minimal maintenance once established.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ilicifolius var. subinteger is primarily native to the Mediterranean region, including parts of southern Europe, northern Africa, and western Asia. This variety is commonly found in rocky coastal areas, cliffs, and limestone formations. It thrives in well-drained soils and full sun exposure. The plant is often associated with maritime climates and is adapted to withstand salt spray and strong winds. Its distribution is limited to specific habitats where it can establish and persist over time.",
    "distribution_introduced_art_desc": "Acanthus ilicifolius var. subinteger was mainly introduced to ornamental horticulture and landscaping due to its striking, palmate leaves and showy, spires of violet-blue flowers. It is often cultivated in gardens and public spaces for its aesthetic value and ability to thrive in well-drained soils. This variety is particularly valued for its compact growth habit and tolerance to mild frost, making it suitable for temperate climates. However, it has also been reported as an invasive species in some regions, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
