{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium angustum",
    "plant_slug": "acanthodium-angustum",
    "plant_name_scientific": "acanthodium angustum",
    "intro": "Acanthodium angustum, commonly known as the narrow-leaved acanthodium, is a perennial herb native to specific regions of southern Africa. It is characterized by its slender, erect stems and small, lance-shaped leaves that are often covered in fine hairs. The plant produces small, yellowish flowers arranged in dense clusters, which bloom during the warmer months. It thrives in well-drained soils and full sun, making it a suitable candidate for rock gardens or dry landscapes. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium angustum is primarily native to the southern United States, specifically Texas and New Mexico. It is commonly found in arid and semi-arid regions, particularly in sandy or rocky soils. This plant thrives in environments with low rainfall and high temperatures. It is often seen in open grasslands and along the edges of desert scrub habitats. Its distribution is limited to these specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acanthodium angustum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and urban wastelands. It thrives in regions with moderate to high sunlight exposure and well-drained soils. The plant has shown adaptability to various climates, allowing it to spread beyond its native range. Its introduction has been noted in several states across the United States, particularly in the southeastern region. Due to its rapid growth and ability to colonize new areas, it is considered a potential invasive species in some regions."
}
