{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon subavenaceum",
    "plant_slug": "acantholimon-subavenaceum",
    "plant_name_scientific": "acantholimon subavenaceum",
    "intro": "Acantholimon subavenaceum, commonly known as the narrow-leaved sandthrift, is a perennial flowering plant native to the arid and semi-arid regions of central Asia. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit with dense clusters of small, pale blue or purple flowers. The plant has narrow, linear leaves that are often covered in fine hairs, adapted to reduce water loss in harsh environments. It produces small, capsule-like fruits that contain numerous tiny seeds, which are dispersed by wind. This species is well-suited to sandy or gravelly soils and is often found in coastal dunes and inland deserts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon subavenaceum"
    },
    "taxonomy_art_desc": "Acantholimon subavenaceum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle and includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that are primarily found in temperate regions and are known for their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon subavenaceum, a specific plant within the genus Acantholimon, known for its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon subavenaceum is primarily native to Uzbekistan. It is found in the central and southern regions of the country. This plant typically grows in arid and semi-arid environments. It is commonly associated with rocky soils and dry steppe habitats. Its distribution is limited to specific ecological zones within Uzbekistan.",
    "distribution_introduced_art_desc": "Acantholimon subavenaceum was mainly introduced to areas with dry, rocky soils and open habitats such as slopes and gravelly plains. It is commonly found in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. This plant has been introduced to parts of California and Oregon in the United States, where it has established itself in natural and disturbed environments. It is often seen growing in coastal areas and along roadsides due to its tolerance of poor soil conditions. However, its spread is limited by its preference for specific microclimates and limited seed dispersal mechanisms."
}
