{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum confertiflorum",
    "plant_slug": "acanthophyllum-confertiflorum",
    "plant_name_scientific": "acanthophyllum confertiflorum",
    "intro": "Acanthophyllum confertiflorum, commonly known as the denseflower thrift, is a perennial shrub native to the arid regions of Central Asia. It is characterized by its compact growth habit and dense clusters of small, yellowish flowers. The plant has small, spiny leaves that help reduce water loss in its harsh environment. It thrives in well-drained soils and is adapted to extreme temperature fluctuations. Acanthophyllum confertiflorum plays a role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum confertiflorum is primarily native to the arid and semi-arid regions of central Asia, including parts of Mongolia, China, and Kazakhstan. It thrives in sandy and gravelly soils, often found in steppes and desert margins. This plant is well adapted to harsh environmental conditions, such as extreme temperatures and low precipitation. It plays an important role in stabilizing sand dunes and preventing soil erosion. Its distribution is closely linked to the specific ecological niches it occupies in these dry landscapes.",
    "distribution_introduced_art_desc": "Acanthophyllum confertiflorum was mainly introduced to arid and semi-arid regions of central Asia, particularly in countries such as Kazakhstan, Mongolia, and western China. It is typically found in sandy or gravelly soils, often in steppes and desert margins. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has raised concerns about its potential impact on native plant communities."
}
