{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hyalinum",
    "plant_slug": "acantholimon-hyalinum",
    "plant_name_scientific": "acantholimon hyalinum",
    "intro": "Acantholimon hyalinum, commonly known as the silverleaf sandmat, is a flowering plant native to the arid regions of western North America. It is a low-growing, mat-forming perennial that thrives in sandy and gravelly soils. The plant produces small, white or pale blue flowers during the spring and summer months. Its leaves are typically covered in a fine layer of white wax, which helps reduce water loss in its harsh environment. This species is adapted to withstand drought and extreme temperatures, making it a resilient component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hyalinum"
    },
    "taxonomy_art_desc": "Acantholimon hyalinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often featuring a distinct life cycle with both sporophytic and gametophytic stages. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, typically characterized by their showy flowers and diverse growth forms. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert plants, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants native to arid and semi-arid regions, typically featuring succulent leaves and showy flowers. Its species is Acantholimon hyalinum, a specific plant within the genus Acantholimon, known for its distinctive appearance and adaptation to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hyalinum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and southern parts. This plant thrives in rocky and arid environments, often growing in elevations above 2,000 meters. It is adapted to the harsh climatic conditions of the region, including cold temperatures and limited precipitation. Due to its restricted habitat, it is considered a rare and endemic species within Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon hyalinum was mainly introduced to areas with well-drained soils and full sun exposure, often found in rocky or gravelly habitats. It is commonly associated with Mediterranean climates and has been introduced to regions with similar environmental conditions. This plant is typically found in open landscapes such as slopes, hillsides, and disturbed areas. Its introduction has been largely due to its ornamental value and adaptability to various soil types. However, it is important to monitor its spread to prevent potential ecological impacts in non-native regions."
}
