{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum paniculatum",
    "plant_slug": "acanthophyllum-paniculatum",
    "plant_name_scientific": "acanthophyllum paniculatum",
    "intro": "Acanthophyllum paniculatum, commonly known as the desert sandmat, is a perennial shrub native to arid and semi-arid regions of the Middle East and Central Asia. It is characterized by its spiny stems and small, scale-like leaves that reduce water loss in harsh environments. The plant produces yellow flowers in panicles, which bloom in late spring to early summer. It thrives in sandy or gravelly soils and is adapted to extreme temperature fluctuations. Due to its resilience, it plays a vital role in stabilizing desert ecosystems and preventing soil erosion.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum paniculatum"
    },
    "taxonomy_art_desc": "Acanthophyllum paniculatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissue and true roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically characterized by their spiny leaves and adaptations to arid or semi-arid environments. Its species is Acanthophyllum paniculatum, a specific type of flowering plant known for its spiny foliage and panicle-like inflorescence, commonly found in sandy or rocky habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kazakhstan",
        "Kirgizstan",
        "Tadzhikistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum paniculatum is primarily native to Kazakhstan, Kirgizstan, Tadzhikistan, and Uzbekistan. It is commonly found in arid and semi-arid regions within these countries. This plant thrives in sandy or gravelly soils and is often seen in steppe and desert environments. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is closely linked to the climatic conditions of Central Asia.",
    "distribution_introduced_art_desc": "Acanthophyllum paniculatum was mainly introduced to areas with arid or semi-arid climates, where it can thrive in sandy or gravelly soils. It is commonly found in regions with low precipitation and high temperatures, such as parts of the Middle East, North Africa, and Central Asia. This plant is often used for dune stabilization due to its extensive root system and ability to withstand harsh environmental conditions. Its introduction has sometimes led to ecological changes in native plant communities. However, it is generally considered a hardy and resilient species that can colonize disturbed or degraded lands."
}
