{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium chionanthum",
    "plant_slug": "acanthocalycium-chionanthum",
    "plant_name_scientific": "acanthocalycium chionanthum",
    "intro": "Acanthocalycium chionanthum, commonly known as the white-flowered cactus, is a species native to the arid regions of Mexico. It belongs to the Cactaceae family and is characterized by its cylindrical stems covered in spines. The plant produces small, white flowers that bloom during the cooler months, typically in winter. Its growth habit is typically solitary or in small clusters, and it is adapted to thrive in well-drained, sandy soils. Due to its unique appearance and limited distribution, it is often cultivated by cactus enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium chionanthum is primarily native to the western United States, specifically California and Nevada. It is commonly found in the Mojave Desert and surrounding areas. This species thrives in arid and semi-arid environments, often growing on rocky soils. It is well adapted to extreme temperatures and low precipitation. Due to its limited range, it is considered a rare and endemic cactus species.",
    "distribution_introduced_art_desc": "Acanthocalycium chionanthum was mainly introduced to the United States, particularly in regions with arid or semi-arid climates. It is commonly found in states such as Arizona, Nevada, and California, where it thrives in rocky soils and open landscapes. This plant is often cultivated in xeriscaped gardens due to its low water requirements and ornamental value. However, it is considered an invasive species in some areas, outcompeting native flora. Its introduction has raised concerns among conservationists regarding its impact on local ecosystems."
}
