{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus arboreus var. ruber",
    "plant_slug": "acanthus-arboreus-var-ruber",
    "plant_name_scientific": "acanthus arboreus var. ruber",
    "intro": "Acanthus arboreus var. ruber, commonly known as the red-flowered horse's ear, is a striking perennial plant native to southern Europe. It features broad, wavy, silver-green leaves that are often used in ornamental gardening. The plant produces showy, spiky red flowers that bloom in late summer, attracting pollinators like bees and butterflies. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and borders. Its unique foliage and vibrant floral display make it a standout addition to any garden.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus sennii"
    },
    "taxonomy_art_desc": "Acanthus arboreus var. ruber belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Lamiales, which consists of flowering plants with typically opposite leaves and showy flowers, including many economically important species. Its family is Acanthaceae, a group of flowering plants known for their showy, often brightly colored flowers and their characteristic bracts. Its genus is Acanthus, a group of flowering plants known for their spiny leaves and showy, often purple or red flowers, commonly used in ornamental horticulture. Its species is Acanthus sennii, a specific type of Acanthus known for its distinctive appearance and is often cultivated for its ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ethiopia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus arboreus var. ruber is primarily native to Ethiopia. This plant is found in the highland regions of the country, where it thrives in rocky and semi-arid environments. It is commonly observed in areas with well-drained soils and moderate temperatures. The species is well adapted to the local climate and plays a role in the ecological balance of its native habitat. Its presence is indicative of the diverse flora found in Ethiopia's mountainous terrain.",
    "distribution_introduced_art_desc": "Acanthus arboreus var. ruber was mainly introduced to ornamental horticulture and landscaping due to its striking red bracts and ornate foliage. It is commonly cultivated in gardens and public spaces for its aesthetic appeal and ability to thrive in a variety of soil conditions. The plant is often used as a focal point in mixed borders or as a backdrop in container gardens. Its introduction has led to its naturalization in some regions, raising concerns about its potential invasive tendencies. Despite its beauty, proper management is recommended to prevent its spread into native ecosystems."
}
