{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium pictum",
    "plant_slug": "acanthophippium-pictum",
    "plant_name_scientific": "acanthophippium pictum",
    "intro": "Acanthophippium pictum, commonly known as the painted acanthophippium, is a species of flowering plant native to the Canary Islands. It belongs to the family Acanthaceae and is characterized by its striking, colorful bracts that resemble petals. The plant typically grows in rocky or coastal areas, thriving in well-drained soils and sunny conditions. Its unique appearance makes it a popular choice for ornamental gardening. The species is also notable for its adaptability to arid environments, showcasing its resilience in challenging climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium pictum"
    },
    "taxonomy_art_desc": "Acanthophippium pictum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex vascular system and true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Asparagales, a large group of monocot plants that includes familiar species like orchids, grasses, and lilies, known for their varied habitats and reproductive strategies. Its family is Orchidaceae, commonly known as orchids, which are renowned for their intricate and often showy flowers and are one of the largest families of flowering plants. Its genus is Acanthophippium, a group of orchids characterized by their unique floral morphology and specific ecological adaptations. Its species is Acanthophippium pictum, a particular orchid species noted for its distinctive appearance and specialized habitat requirements.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Nansei-shoto",
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium pictum is primarily native to the Nansei-shoto and Taiwan. This plant is found in the subtropical regions of these areas. It typically grows in forested habitats with high humidity. The species is adapted to the moist and warm climate of its native range. It is a rare and endemic plant within its distribution area.",
    "distribution_introduced_art_desc": "Acanthophippium pictum was mainly introduced to new environments through human activities such as horticulture and landscaping. It is often cultivated for its ornamental value due to its unique and colorful flowers. However, its introduction has led to concerns about its potential to become invasive in non-native regions. The plant's ability to thrive in a variety of soil types and climates contributes to its spread. Proper management is necessary to prevent it from outcompeting native species in ecosystems where it is not originally found."
}
