{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax eleutheristylus",
    "plant_slug": "acanthopanax-eleutheristylus",
    "plant_name_scientific": "acanthopanax eleutheristylus",
    "intro": "Acanthopanax eleutheristylus, commonly known as the Chinese devil's ivy, is a climbing shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves and small, greenish-white flowers. The plant produces berries that are typically red or yellow when mature. It is often found in forested areas and thrives in moist, shaded environments. Its botanical features make it a valuable species for ecological studies and horticultural use.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax eleutheristylus is primarily native to Southeast Asia, particularly China, where it is found in the mountainous regions of Yunnan and Sichuan provinces. This plant thrives in temperate to subtropical climates and is often found in dense forests at elevations ranging from 1,500 to 3,000 meters. It is also occasionally reported in parts of northern Vietnam and northern India. The species is known for its woody stems and compound leaves, adapting well to the shaded undergrowth of its natural habitat. Due to its limited distribution, it is considered a rare and endemic plant in certain regions of Asia.",
    "distribution_introduced_art_desc": "Acanthopanax eleutheristylus was mainly introduced to regions with temperate climates, particularly in East Asia, where it has been cultivated for its ornamental value and medicinal properties. It thrives in well-drained soils and partial to full sunlight, making it suitable for gardens and landscapes in these areas. The plant is often used in traditional medicine for its purported health benefits, contributing to its introduction and spread. Due to its adaptability, it has been introduced to other parts of the world with similar climatic conditions. However, its invasive potential in non-native regions remains a topic of ecological concern."
}
