{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax cissifolius",
    "plant_slug": "acanthopanax-cissifolius",
    "plant_name_scientific": "acanthopanax cissifolius",
    "intro": "Acanthopanax cissifolius, commonly known as the Chinese angel's trumpet, is a woody shrub or small tree native to East Asia. It features compound leaves with elongated, serrated leaflets and produces clusters of small, yellowish-green flowers. The plant is characterized by its distinctive, spiny stems and is often found in forested areas. It is valued for its ornamental appeal and has traditional medicinal uses in some cultures. Its botanical features make it an interesting subject for both horticultural and ecological studies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax cissifolius is primarily native to Southeast Asia, including countries such as China, Korea, and Japan. It is commonly found in forested areas, particularly in mountainous regions with humid climates. This plant thrives in temperate to subtropical environments and is often associated with secondary growth forests. It is also present in parts of northeastern India and the eastern Himalayas. Due to its adaptability, it can be found at elevations ranging from 500 to 2,500 meters above sea level.",
    "distribution_introduced_art_desc": "Acanthopanax cissifolius was mainly introduced to regions with temperate climates, particularly in East Asia, where it has been historically used in traditional medicine. It is commonly found in forests and shrublands, thriving in well-drained soils and partial shade. The plant is valued for its medicinal properties, including its potential anti-inflammatory and antioxidant effects. Its introduction has been largely driven by both traditional use and modern pharmacological research. However, it is important to monitor its spread to prevent potential ecological impacts in non-native areas."
}
