{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium splendidum",
    "plant_slug": "acanthophippium-splendidum",
    "plant_name_scientific": "acanthophippium splendidum",
    "intro": "Acanthophippium splendidum, commonly known as the splendid starfish cactus, is a unique succulent native to the arid regions of Mexico. It is characterized by its star-shaped, fleshy stems that are often covered in soft, spiny tubercles. The plant produces vibrant yellow flowers during the spring and summer months, adding a striking visual element to its landscape. It is well adapted to drought conditions, storing water in its thick, fleshy stems. Due to its specific habitat requirements, it is considered a rare and protected species in its native environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium splendidum"
    },
    "taxonomy_art_desc": "Acanthophippium splendidum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological adaptations. Its order is Asparagales, a large group of flowering plants that includes plants such as orchids, grasses, and asparagus, often characterized by their specialized reproductive structures. Its family is Orchidaceae, commonly known as orchids, which are renowned for their intricate flowers and diverse ecological adaptations. Its genus is Acanthophippium, a group of flowering plants within the orchid family, known for their unique floral structures and specific habitat preferences. Its species is Acanthophippium splendidum, a particular orchid species noted for its striking appearance and specific ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Fiji",
        "Maluku",
        "New Caledonia",
        "New Guinea",
        "Samoa",
        "Solomon Is.",
        "Sulawesi",
        "Tonga",
        "Vanuatu",
        "Wallis-Futuna Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium splendidum is primarily native to Fiji, Maluku, New Caledonia, New Guinea, Samoa, Solomon Is., Sulawesi, Tonga, Vanuatu, and Wallis-Futuna Is. This plant is commonly found in tropical and subtropical regions within these island groups. It thrives in humid, coastal environments and is often associated with limestone substrates. The species is known for its distinctive floral structures and is part of the Malvaceae family. Its native range reflects its adaptation to the unique ecological conditions of the Pacific Islands.",
    "distribution_introduced_art_desc": "Acanthophippium splendidum was mainly introduced to the coastal regions of southern California and northern Baja California, where it thrives in sandy and gravelly soils. It is commonly found in dune ecosystems and along the edges of salt marshes, where it forms dense stands. This plant has been reported in several protected areas, including Torrey Pines State Reserve and the San Elijo Lagoon. Its introduction has raised concerns due to its potential to outcompete native vegetation in disturbed habitats. Despite its ornamental appeal, it is considered a noxious weed in some regions due to its aggressive growth and invasive tendencies."
}
