{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon bromifolium var. iranicum",
    "plant_slug": "acantholimon-bromifolium-var-iranicum",
    "plant_name_scientific": "acantholimon bromifolium var. iranicum",
    "intro": "Acantholimon bromifolium var. iranicum, commonly known as the Iranian thimbleweed, is a perennial herb native to the arid and semi-arid regions of Iran. It belongs to the family Caryophyllaceae, which includes many flowering plants adapted to dry environments. The plant features erect, branched stems covered with dense, woolly hairs, and its leaves are typically narrow and linear. Its flowers are small, clustered in dense inflorescences, and are usually pink or purple in color. This variety is noted for its resilience to drought and poor soil conditions, making it a hardy plant in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon bromifolium"
    },
    "taxonomy_art_desc": "Acantholimon bromifolium var. iranicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, which comprises flowering plants with a diverse range of forms, including cacti and carnations, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon bromifolium, a specific type within the genus, distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon bromifolium var. iranicum is primarily native to Iran. This plant is found in various regions of Iran, particularly in the northern and central parts of the country. It typically grows in rocky and arid environments, often in mountainous areas. The species is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon bromifolium var. iranicum was mainly introduced to regions with arid and semi-arid climates, particularly in Central Asia and parts of the Middle East. It thrives in well-drained soils and is commonly found in rocky or sandy habitats. This plant is often cultivated for its ornamental value due to its attractive blue-gray foliage and showy flowers. It has been introduced to several botanical gardens and conservation areas for ecological restoration purposes. However, its spread is limited due to its specific environmental requirements."
}
