{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon puberulum subsp. puberulum",
    "plant_slug": "acantholimon-puberulum-subsp-puberulum",
    "plant_name_scientific": "acantholimon puberulum subsp. puberulum",
    "intro": "Acantholimon puberulum subsp. puberulum, commonly known as the woolly sea holly, is a flowering plant native to coastal regions of southern Africa. It is characterized by its dense, woolly foliage and striking blue to violet flowers that bloom in summer. The plant thrives in sandy or gravelly soils and is often found in maritime climates. It belongs to the family Montiaceae and is adapted to withstand salt spray and strong winds. Its unique appearance makes it a valuable ornamental plant in coastal gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon puberulum"
    },
    "taxonomy_art_desc": "Acantholimon puberulum subsp. puberulum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their showy flowers. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes plants with distinctive blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their spiny leaves and showy flowers. Its species is Acantholimon puberulum, a specific type within the genus known for its hairy leaves and small, clustered flowers, commonly found in Mediterranean and temperate regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon puberulum subsp. puberulum is primarily native to Transcaucasus, Turkey. This subspecies is found in the mountainous regions of the eastern Mediterranean. It thrives in rocky and arid environments, often growing on slopes and in open habitats. The plant is adapted to the climate and soil conditions of these regions. Its distribution is limited to specific areas within its native range.",
    "distribution_introduced_art_desc": "Acantholimon puberulum subsp. puberulum was mainly introduced to areas with well-drained sandy or gravelly soils, typically in arid or semi-arid environments. It thrives in regions with low precipitation and high sunlight exposure, often found in coastal dunes or inland deserts. This subspecies is commonly cultivated in gardens and landscaping due to its drought tolerance and ornamental value. It is also used in ecological restoration projects to stabilize soils in degraded landscapes. However, its introduction has raised concerns about potential invasiveness in non-native habitats."
}
