{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon movdarinum",
    "plant_slug": "acantholimon-movdarinum",
    "plant_name_scientific": "acantholimon movdarinum",
    "intro": "Acantholimon movdarinum, commonly known as the Armenian thimblecress, is a flowering plant native to the mountainous regions of Armenia and Turkey. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features slender, hairy stems and small, clustered flowers that are typically pink or purple in color. Its leaves are linear and often covered in fine hairs, which help reduce water loss in its arid habitat. Acantholimon movdarinum is adapted to rocky soils and is often found in alpine and subalpine environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon movdarinum"
    },
    "taxonomy_art_desc": "Acantholimon movdarinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes many plants with showy flowers and often have a distinctive salt tolerance. Its family is Plumbaginaceae, which consists of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky environments, known for their spiny leaves and showy flowers. Its species is Acantholimon movdarinum, a specific plant within the genus Acantholimon, native to certain regions and distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon movdarinum is primarily native to Iran. It is found in the central and eastern regions of the country. This plant typically grows in rocky and arid environments. It is commonly observed in mountainous areas with poor soil conditions. Its distribution is limited to specific ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon movdarinum was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive blue-gray foliage and flowering habit. It has since spread beyond its original cultivation areas, establishing itself in disturbed soils and open habitats. This plant is considered invasive in some parts of Europe, where it outcompetes native vegetation. Its rapid growth and ability to thrive in various soil types contribute to its spread. Conservation efforts are underway to control its distribution and prevent further ecological impact."
}
