{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthambrosia bryantii",
    "plant_slug": "acanthambrosia-bryantii",
    "plant_name_scientific": "acanthambrosia bryantii",
    "intro": "Acanthambrosia bryantii, commonly known as Bryant's thornbush, is a shrub native to the southeastern United States. It is characterized by its dense, spiny foliage and small, yellowish-green flowers that bloom in the spring. The plant produces small, round, brown fruits that contain seeds dispersed by wind. It thrives in sandy or well-drained soils and is often found in open woodlands and along roadsides. Due to its hardy nature, it is sometimes considered an invasive species in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthambrosia bryantii is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetlands, swamps, and other moist environments. This species thrives in areas with high humidity and well-drained sandy soils. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Due to its specific habitat requirements, it is considered a rare and endangered plant in its native range.",
    "distribution_introduced_art_desc": "Acanthambrosia bryantii was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activities such as land clearing and construction. It thrives in environments with full sun and well-drained soil, making it a common invader in degraded landscapes. This plant spreads primarily through its wind-dispersed seeds, allowing it to colonize new areas rapidly. Its introduction has led to concerns about its impact on native plant communities and ecosystem stability. Due to its aggressive growth, it is considered a potential invasive species in regions where it has been introduced."
}
