{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum rosulatum",
    "plant_slug": "acanthophyllum-rosulatum",
    "plant_name_scientific": "acanthophyllum rosulatum",
    "intro": "Acanthophyllum rosulatum, commonly known as the Rosulate Acanthophyllum, is a flowering plant native to arid and semi-arid regions of Central Asia. It belongs to the family Amaranthaceae and is characterized by its compact, rosette-like growth form. The plant produces small, greenish flowers that are typically clustered in dense inflorescences. It is well adapted to harsh environments, with thick, fleshy leaves that store water and reduce transpiration. This species is often found in sandy soils and is an important component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum rosulatum is primarily native to the arid and semi-arid regions of Central Asia, including countries such as Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in sandy and gravelly soils within the steppes and deserts of these areas. This plant thrives in harsh environmental conditions, adapting to low precipitation and extreme temperature fluctuations. It plays a significant role in stabilizing dunes and preventing soil erosion in its native habitat. Due to its resilience, it is often used in ecological restoration projects in its native range.",
    "distribution_introduced_art_desc": "Acanthophyllum rosulatum was mainly introduced to areas with sandy or gravelly soils, particularly in arid and semi-arid regions. It is commonly found in coastal dunes and inland sandy plains where it forms dense, low-growing vegetation. This plant is well adapted to harsh environmental conditions, including high salinity and low precipitation. Its introduction has been noted in several regions of the Middle East and parts of Central Asia. It plays a significant role in stabilizing sand dunes and preventing soil erosion."
}
