{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopleura involucrata",
    "plant_slug": "acanthopleura-involucrata",
    "plant_name_scientific": "acanthopleura involucrata",
    "intro": "Acanthopleura involucrata, commonly known as the velvetleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its broad, heart-shaped leaves that are often covered in a fine, velvety texture. The plant produces small, clustered flowers that are typically greenish-white in color. It thrives in moist, shady environments and is often found in wetlands or along stream banks. Its rapid growth and ability to spread through both seeds and rhizomes make it an invasive species in many areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopleura involucrata is primarily native to the eastern coast of Australia, including New South Wales and Queensland. It is commonly found in coastal areas, particularly in sandy soils along the shorelines. This species thrives in environments with moderate to high salinity and is often associated with dune ecosystems. It plays an important role in stabilizing sand dunes and providing habitat for various small invertebrates. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acanthopleura involucrata was mainly introduced to coastal regions of southern Australia, including Tasmania and New South Wales. It thrives in sandy or gravelly soils along the shoreline, often in areas with moderate to high salinity. The plant is commonly found in dune systems and estuarine environments, where it plays a role in stabilizing sand dunes. Its introduction has been associated with human activities such as coastal development and the movement of sand or soil. However, it is not considered invasive and is generally native to these areas."
}
