{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax diversifolius",
    "plant_slug": "acanthopanax-diversifolius",
    "plant_name_scientific": "acanthopanax diversifolius",
    "intro": "Acanthopanax diversifolius, commonly known as the variable-leaf Chinese angelica tree, is a deciduous shrub or small tree native to eastern Asia. It is characterized by its compound leaves, which vary in shape and size across different parts of the plant, giving it its scientific name. The plant produces small, greenish-yellow flowers in umbellate clusters, followed by red berries that are a source of food for various wildlife. It thrives in temperate climates and is often found in forested areas. Due to its ornamental value and medicinal properties, it is occasionally cultivated in gardens and traditional herbal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax diversifolius is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas, particularly in the temperate climate zones of these countries. This plant thrives in humid environments and is often associated with mixed deciduous and evergreen forests. It is known for its climbing habit and is sometimes used in traditional medicine. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acanthopanax diversifolius was mainly introduced to regions with temperate climates and well-drained soils, often as an ornamental plant due to its attractive foliage. It thrives in areas with moderate rainfall and full to partial sunlight, making it suitable for gardens and landscaped areas. The plant is known for its hardy nature and ability to adapt to various environmental conditions. However, it has also been reported as an invasive species in some regions where it outcompetes native vegetation. Its distribution is now expanding beyond its original range due to human activity and climate change."
}
