{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus vandermeirenii",
    "plant_slug": "acanthus-vandermeirenii",
    "plant_name_scientific": "acanthus vandermeirenii",
    "intro": "Acanthus vandermeirenii, commonly known as the Vandermeiren's spurge, is a perennial plant native to southern Africa. It belongs to the Euphorbiaceae family and is characterized by its striking, palmate leaves with a velvety texture. The plant produces small, yellowish-green flowers arranged in a cup-like structure called a cyathium. It thrives in well-drained soils and prefers full sun to partial shade. Due to its ornamental value, it is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus vandermeirenii is primarily native to the island of Madagascar. This plant is found in the dry deciduous forest regions of the island. It thrives in areas with well-drained soils and receives partial to full sunlight. Acanthus vandermeirenii is adapted to the unique climate and ecological conditions of Madagascar. It is a rare and endemic species, highlighting the biodiversity of the region.",
    "distribution_introduced_art_desc": "Acanthus vandermeirenii was mainly introduced to ornamental horticulture and landscape design due to its striking, architectural foliage and showy inflorescences. It is commonly cultivated in gardens and public spaces where its dramatic appearance adds visual interest. Despite its aesthetic appeal, it has the potential to become invasive in certain environments if not managed properly. The plant is native to South Africa but has been introduced to other regions, including parts of Europe and the United States. Its spread is often facilitated by its ability to thrive in a variety of soil types and its tolerance to different climatic conditions."
}
