{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon collare",
    "plant_slug": "acantholimon-collare",
    "plant_name_scientific": "acantholimon collare",
    "intro": "Acantholimon collare, commonly known as the clustered sea holly, is a flowering plant native to the coastal regions of the Mediterranean. It is a member of the Plumbagaceae family and is characterized by its blue or purple flowers and silver-gray foliage. The plant typically grows in sandy or rocky soils and is adapted to saline and coastal environments. It produces small, capsule-like fruits that contain numerous seeds. Acantholimon collare is often used in coastal landscaping due to its hardiness and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon collare"
    },
    "taxonomy_art_desc": "Acantholimon collare belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex multicellular structures and chlorophyll-based photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and their allies, typically exhibiting a wide range of morphological diversity. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species, known for their diverse floral structures and evolutionary relationships. Its order is Caryophyllales, a group of flowering plants that includes many economically important species, such as cacti and beets, and is characterized by distinctive floral and leaf structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species adapted to various habitats, often with distinctive flowers and leaves. Its genus is Acantholimon, a genus of flowering plants typically found in arid or coastal regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon collare, a specific plant species within the genus Acantholimon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon collare is primarily native to Iran. It is found in the arid and semi-arid regions of the country. This plant typically grows in rocky and gravelly soils. It is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific areas within Iran where the environmental conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Acantholimon collare was mainly introduced to areas with disturbed soils and rocky habitats, often as a result of human activity. It is commonly found in regions with temperate climates and well-drained soils. This plant has been reported in several countries across Europe and parts of Asia. Its introduction has sometimes led to competition with native species in non-native environments. However, it is generally considered a low-impact invasive species in most regions."
}
