{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum tournefortii",
    "plant_slug": "acanthophyllum-tournefortii",
    "plant_name_scientific": "acanthophyllum tournefortii",
    "intro": "Acanthophyllum tournefortii, commonly known as the crested sandmat, is a flowering plant native to arid regions of North Africa and the Middle East. It is a low-growing shrub characterized by its dense, spiny foliage and small, inconspicuous yellow flowers. The plant is well adapted to harsh desert environments, with deep root systems and reduced leaves to minimize water loss. Its growth habit and physical features make it an important component of sandy and gravelly habitats. It is often used in ecological restoration projects due to its ability to stabilize soil in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum tournefortii is primarily native to the arid and semi-arid regions of North Africa, the Middle East, and parts of southern Europe. It is commonly found in countries such as Algeria, Morocco, Tunisia, Saudi Arabia, and Turkey. This plant thrives in sandy or gravelly soils and is often found in coastal dunes or inland deserts. It is well adapted to harsh environmental conditions, including high temperatures and low precipitation. Its distribution is closely linked to areas with minimal vegetation cover and extreme climatic conditions.",
    "distribution_introduced_art_desc": "Acanthophyllum tournefortii was mainly introduced to arid and semi-arid regions of the Middle East and North Africa. It is commonly found in sandy and gravelly soils, often in areas with low rainfall. This plant is well adapted to harsh environmental conditions, making it a resilient species in these ecosystems. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has raised concerns about its impact on native plant communities in some regions."
}
