{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax koreanus",
    "plant_slug": "acanthopanax-koreanus",
    "plant_name_scientific": "acanthopanax koreanus",
    "intro": "Acanthopanax koreanus, commonly known as Korean angel's trumpet, is a climbing shrub native to the Korean Peninsula. It features compound leaves with serrated edges and produces clusters of small, yellowish-green flowers. The plant is notable for its medicinal properties, often used in traditional Korean medicine. It thrives in temperate climates and is adaptable to various soil types. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax koreanus is primarily native to the Korean Peninsula, including South Korea, North Korea, and parts of eastern China. It is commonly found in mountainous regions and forested areas, particularly in temperate climates. This plant thrives in moist, well-drained soils and is often seen growing in shaded or semi-shaded environments. It is an important component of the local flora and is sometimes used in traditional medicine. Its distribution is closely tied to the unique ecological conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acanthopanax koreanus was mainly introduced to regions with temperate climates, particularly in East Asia, where it thrives in forested areas. It is commonly found in South Korea, China, and parts of Russia, where it grows in moist, shaded environments. This plant is often cultivated for its medicinal properties, as its roots and stems are used in traditional medicine. Due to its adaptability, it has also been introduced to other parts of the world with similar climatic conditions. However, its introduction outside its native range has raised concerns about its potential impact on local ecosystems."
}
