{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum diaphanopterum",
    "plant_slug": "acanthophyllum-diaphanopterum",
    "plant_name_scientific": "acanthophyllum diaphanopterum",
    "intro": "Acanthophyllum diaphanopterum, commonly known as the transparent-leaved jointed sage, is a flowering plant native to the arid regions of Central Asia. It belongs to the Amaranthaceae family and is characterized by its succulent, jointed stems and small, scale-like leaves. The plant produces clusters of tiny, greenish-white flowers during the summer months. It is well adapted to harsh, dry environments, with features such as reduced leaf surface area to minimize water loss. Its unique morphology and ecological adaptations make it a notable species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum diaphanopterum"
    },
    "taxonomy_art_desc": "Acanthophyllum diaphanopterum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their close relatives, characterized by their complex cellular structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their unique vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, characterized by their varied floral structures and reproductive strategies. Its order is Caryophyllales, a group of flowering plants that includes species such as carnations and spinach, often featuring distinctive flower structures and a variety of ecological adaptations. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum diaphanopterum, a specific type within the genus known for its delicate, translucent leaves and is typically found in dry, sandy habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum diaphanopterum is primarily native to Iran. It is found in the arid and semi-arid regions of the country, particularly in the central and eastern parts. This plant thrives in sandy and rocky soils, often in areas with low rainfall. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is closely linked to the specific ecological zones of Iran where it can survive with minimal water availability.",
    "distribution_introduced_art_desc": "Acanthophyllum diaphanopterum was mainly introduced to areas with arid or semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions of Central Asia, including parts of Kazakhstan, Mongolia, and China. This plant is well adapted to harsh environmental conditions, making it a pioneer species in disturbed or degraded landscapes. Its introduction has been associated with both natural dispersal and human activities such as land use changes and transportation. However, it is not considered invasive in most regions where it is found."
}
