{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium procumbens",
    "plant_slug": "acanthodium-procumbens",
    "plant_name_scientific": "acanthodium procumbens",
    "intro": "Acanthodium procumbens, commonly known as the prostrate acanthodium, is a flowering plant species native to certain regions of southern Africa. It is a low-growing, mat-forming perennial that thrives in sandy or rocky soils. The plant produces small, yellowish flowers arranged in clusters, which are typically visited by insects such as bees and flies. Its leaves are linear and covered in fine hairs, giving them a slightly rough texture. Due to its unique morphology and limited distribution, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium procumbens is primarily native to southern Africa, specifically South Africa and Namibia. It is commonly found in rocky and sandy soils along the coastlines and in arid regions. This plant thrives in well-drained environments and is often seen growing on coastal cliffs and dunes. It is a low-growing species with small, spiny leaves and yellow flowers. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acanthodium procumbens was mainly introduced to new habitats through human activities such as horticulture and landscaping. It has been reported in several regions outside its native range, including parts of Europe and North America. The plant spreads primarily through its seeds, which can be transported by wind, water, or human intervention. Its adaptability to various soil types and climatic conditions has contributed to its successful establishment in non-native areas. However, its impact on local ecosystems is still under study due to limited long-term data."
}
