{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum glandulosum var. tomentellum",
    "plant_slug": "acanthophyllum-glandulosum-var-tomentellum",
    "plant_name_scientific": "acanthophyllum glandulosum var. tomentellum",
    "intro": "Acanthophyllum glandulosum var. tomentellum, commonly known as the woolly acanthophyllum, is a flowering plant native to arid and semi-arid regions of the Middle East and Central Asia. It is a low-growing shrub characterized by its dense, woolly foliage that helps reduce water loss in harsh environments. The plant produces small, yellowish flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its succulent stems and leaves are adapted for water storage, making it well-suited for survival in dry climates. This species is often found in rocky soils and is valued for its ecological role in stabilizing desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum glandulosum var. tomentellum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. This plant is commonly found in sandy and gravelly soils, often in steppes and desert margins. It thrives in areas with low precipitation and high solar exposure, adapting to harsh environmental conditions. The variety is characterized by its dense, woolly foliage, which helps reduce water loss and protect against extreme temperatures. Due to its specialized habitat requirements, it is often restricted to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acanthophyllum glandulosum var. tomentellum was mainly introduced to areas with sandy or gravelly soils in arid and semi-arid regions. It is commonly found in regions such as the southwestern United States and northern Mexico. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing soil and preventing erosion in its native habitat. However, its introduction to new areas may have ecological impacts on local flora and fauna."
}
