{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum campylacme",
    "plant_slug": "acanthophyllum-campylacme",
    "plant_name_scientific": "acanthophyllum campylacme",
    "intro": "Acanthophyllum campylacme, commonly known as the crested sandmat, is a flowering plant native to arid regions of North America. It belongs to the Amaranthaceae family and is characterized by its compact, cushion-like growth form. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences. It is well adapted to sandy and gravelly soils, exhibiting drought tolerance and minimal water requirements. Its structure helps it retain moisture and withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum campylacme is primarily native to the arid regions of Central Asia, including parts of Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in sandy and gravelly soils, often found in desert and semi-desert environments. This plant is well adapted to extreme temperatures and low precipitation, making it a resilient species in its native habitat. It is commonly found in dunes and along the edges of salt lakes. Its distribution is closely linked to specific ecological conditions that support its growth in these remote and harsh landscapes.",
    "distribution_introduced_art_desc": "Acanthophyllum campylacme was mainly introduced to arid and semi-arid regions of the southwestern United States, particularly in areas with sandy or gravelly soils. It is commonly found in states such as Nevada, Utah, and Arizona, where it thrives in harsh, dry environments. This plant is often associated with disturbed sites, including roadsides, dunes, and areas affected by grazing or fire. Its introduction has led to its establishment in native plant communities, sometimes outcompeting local flora. Due to its hardy nature, it is considered a potential invasive species in some regions."
}
