{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon tricolor",
    "plant_slug": "acantholimon-tricolor",
    "plant_name_scientific": "acantholimon tricolor",
    "intro": "Acantholimon tricolor, commonly known as the three-color thrift, is a flowering plant native to the Mediterranean region. It is characterized by its compact, mat-forming growth habit and features blue, pink, and white flowers that bloom in early summer. The plant has silver-gray foliage with glandular hairs, which help reduce water loss in arid environments. It thrives in well-drained soils and is often found in rocky or sandy habitats. Acantholimon tricolor is valued for its ornamental appeal and drought tolerance in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon tricolor"
    },
    "taxonomy_art_desc": "Acantholimon tricolor belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with a unique type of pollen and often show adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes herbaceous plants often found in dry or coastal areas. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon tricolor, a specific plant within the genus known for its colorful flowers and ability to thrive in harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon tricolor is primarily native to Afghanistan. This plant is found in the mountainous regions of the country, particularly in the eastern and central parts. It thrives in rocky and gravelly soils at high altitudes. Acantholimon tricolor is adapted to the cold and arid conditions of its native habitat. It is a member of the Plumbagaceae family and is known for its distinctive blue and purple flowers.",
    "distribution_introduced_art_desc": "Acantholimon tricolor was mainly introduced to areas with well-drained soils and full sun to partial shade, typically in dry to moist environments. It is commonly found in disturbed sites such as roadsides, fields, and along streambanks. This plant thrives in temperate climates and is often used in landscaping for its ornamental value. It has a low maintenance requirement and is drought-tolerant once established. The distribution of Acantholimon tricolor is expanding due to its adaptability and aesthetic appeal in various garden settings."
}
