{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium eburneum",
    "plant_slug": "acanthophippium-eburneum",
    "plant_name_scientific": "acanthophippium eburneum",
    "intro": "Acanthophippium eburneum, commonly known as the silverleaf honeysuckle, is a flowering plant native to South Africa. It belongs to the Caprifoliaceae family and is characterized by its slender, woody stems and opposite, lance-shaped leaves. The plant produces small, fragrant, white to yellowish flowers that bloom in clusters during the summer months. Its fruit is a small, capsule-like structure that contains several seeds. The plant is often found in rocky or sandy soils and is adapted to arid or semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium eburneum"
    },
    "taxonomy_art_desc": "Acanthophippium eburneum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises vascular plants with a distinct evolutionary lineage that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Asparagales, a diverse group of flowering plants that includes plants like orchids, asparagus, and related species. Its family is Orchidaceae, commonly known as the orchid family, which is renowned for its diverse and often showy flowers. Its genus is Acanthophippium, a group of flowering plants within the orchid family, characterized by specific morphological features. Its species is Acanthophippium eburneum, a particular type of orchid known for its unique appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo",
        "Sumatera"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium eburneum is primarily native to Borneo and Sumatera. This species is found in the tropical rainforests of these islands. It typically grows in humid, shaded environments within the understory of dense forest canopies. The plant is well adapted to the warm and wet climate of the region. Its distribution is limited to specific areas within these two Indonesian islands.",
    "distribution_introduced_art_desc": "Acanthophippium eburneum was mainly introduced to new habitats through human activities such as trade, cultivation, and accidental transport. It has been found growing in disturbed soils and along roadsides, indicating its adaptability to anthropogenic environments. This plant is often spread by wind, water, or through attachment to animals and vehicles. Its introduction has raised concerns due to its potential to outcompete native species in invaded areas. Despite its invasive tendencies, it is sometimes cultivated for ornamental purposes due to its attractive foliage."
}
