{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon capitatum",
    "plant_slug": "acantholimon-capitatum",
    "plant_name_scientific": "acantholimon capitatum",
    "intro": "Acantholimon capitatum, commonly known as the clustered sandthrift, is a flowering plant native to arid and semi-arid regions of the western United States. It is a low-growing perennial with dense, compact growth habit, featuring gray-green foliage that is covered in fine hairs. The plant produces showy, pink to red flowers in dense clusters at the ends of its stems, typically blooming in late spring to early summer. It thrives in well-drained soils and is adapted to harsh environmental conditions, making it a hardy choice for xeriscaping. Its botanical features make it an important species for stabilizing sandy soils and supporting local pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon capitatum"
    },
    "taxonomy_art_desc": "Acantholimon capitatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which includes vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with typically small, showy flowers and often contains toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon capitatum, a specific plant within the genus Acantholimon, known for its distinctive flower heads and adapted to grow in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon capitatum is primarily native to Turkey. It is commonly found in the country's central and eastern regions. This plant thrives in rocky and arid environments, often growing in mountainous areas. It is well adapted to the dry and harsh conditions of its native habitat. Its distribution is limited to specific ecological zones within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon capitatum was mainly introduced to areas with well-drained soils and full sun exposure, typically in dry to semi-arid environments. It is commonly found in disturbed soils such as roadsides, gravelly slopes, and open fields. This plant thrives in regions with low precipitation and can tolerate moderate drought conditions. Its introduction has been documented in several western U.S. states, including California and Nevada. It is often considered a pioneer species in ecological succession due to its hardy nature and rapid growth."
}
