{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis villosa",
    "plant_slug": "acanthopsis-villosa",
    "plant_name_scientific": "acanthopsis villosa",
    "intro": "Acanthopsis villosa, commonly known as the hairy acanthopsis, is a flowering plant native to southern Africa. It belongs to the Acanthaceae family and is characterized by its hairy stems and leaves. The plant produces showy, tubular flowers that are typically pink or purple in color. It thrives in well-drained soils and is often found in rocky or sandy habitats. Acanthopsis villosa is valued for its ornamental appeal and is cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis villosa"
    },
    "taxonomy_art_desc": "Acanthopsis villosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and often spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by diverse floral structures. Its order is Lamiales, which contains plants with showy flowers and often includes species with aromatic properties. Its family is Acanthaceae, a group of flowering plants known for their ornamental value and distinctive floral morphology. Its genus is Acanthopsis, which includes several species of flowering plants typically found in tropical and subtropical regions. Its species is Acanthopsis villosa, a specific plant within the genus Acanthopsis, characterized by its hairy leaves and showy flowers, commonly found in specific habitats in its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis villosa is primarily native to the Cape Provinces of South Africa. This species is commonly found in the fynbos vegetation types of the region. It thrives in coastal and mountainous areas with well-drained soils. The plant is adapted to the Mediterranean climate characterized by wet winters and dry summers. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acanthopsis villosa was mainly introduced to New Zealand. It was first recorded in the early 20th century and has since spread throughout the country. This plant is commonly found in coastal dunes and sandy soils. It is considered a weed in some areas due to its aggressive growth habit. Its introduction has raised concerns about its impact on native ecosystems."
}
