{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis glandulopalmata",
    "plant_slug": "acanthopsis-glandulopalmata",
    "plant_name_scientific": "acanthopsis glandulopalmata",
    "intro": "Acanthopsis glandulopalmata, commonly known as the glandular palmate acanthus, is a flowering plant native to the Mediterranean region. It is characterized by its distinctive, palmately lobed leaves with glandular structures along the margins. The plant produces spikes of showy, violet-blue flowers during the summer months. It thrives in well-drained soils and full sun, making it a popular choice for rock gardens and Mediterranean-style landscapes. Its ornamental value is enhanced by its sturdy, upright growth habit and long blooming period.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis glandulopalmata"
    },
    "taxonomy_art_desc": "Acanthopsis glandulopalmata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Lamiales, a group of flowering plants that includes many aromatic species with showy flowers and often secondary metabolism. Its family is Acanthaceae, commonly known as the acanthus family, characterized by their showy flowers and often hairy or glandular surfaces. Its genus is Acanthopsis, a small genus of flowering plants native to tropical regions, typically with showy, often brightly colored flowers. Its species is Acanthopsis glandulopalmata, a specific plant within the genus Acanthopsis, distinguished by its glandular leaves and palmate arrangement, commonly found in tropical habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis glandulopalmata is primarily native to the Cape Provinces of South Africa. This region is known for its rich biodiversity and unique flora. The plant thrives in the specific environmental conditions found in this area. It is commonly found in rocky outcrops and coastal habitats. Its native distribution is largely confined to this geographic region.",
    "distribution_introduced_art_desc": "Acanthopsis glandulopalmata was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its unique appearance. It was brought there in the late 19th century by European botanists and horticulturists who were fascinated by its distinctive palm-like foliage and flowering structures. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native plant species for resources. The plant thrives in tropical and subtropical climates, often spreading through seeds dispersed by birds and water. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
