{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocephala haselbergii",
    "plant_slug": "acanthocephala-haselbergii",
    "plant_name_scientific": "acanthocephala haselbergii",
    "intro": "Acanthocephala haselbergii, commonly known as the velvetleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its broad, heart-shaped leaves that are often covered in fine hairs, giving it a velvety texture. The plant produces small, clustered yellow flowers that bloom in the summer months. It is often found in disturbed soils and can thrive in a variety of environmental conditions. Due to its rapid growth and ability to spread, it is considered an invasive species in some areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocephala haselbergii is primarily native to the southern regions of South America, particularly in Brazil, Paraguay, and Argentina. It is commonly found in tropical and subtropical climates within these areas. This plant thrives in moist, well-drained soils and is often associated with riparian zones and wetlands. It is an important component of the local flora in these ecosystems. Its distribution is largely restricted to the Neotropical region, where it plays a role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthocephala haselbergii was mainly introduced to new habitats through human activities such as trade and horticultural practices. It is commonly found in disturbed soils and urban environments where it can thrive in nutrient-rich conditions. This plant has spread across several regions, including parts of Europe and North America. Its rapid growth and ability to adapt to different soil types contribute to its invasive potential. However, it is not considered a major ecological threat in most areas where it is established."
}
