{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocladus albicans",
    "plant_slug": "acanthocladus-albicans",
    "plant_name_scientific": "acanthocladus albicans",
    "intro": "Acanthocladus albicans, commonly known as the white-stemmed clubmoss, is a member of the family Lycopodiaceae. It is a small, evergreen herbaceous plant that typically grows in moist, shaded environments. The plant features whorled leaves and produces spore-bearing cones called strobili. Its leaves are usually slender and have a distinct, serrated edge. Acanthocladus albicans is characterized by its pale green to white stems and is often found in temperate regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocladus albicans is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, shaded environments, often found in lowland rainforests and secondary growth areas. This species is commonly associated with riverine and swampy habitats, where it forms dense undergrowth. Its distribution is also reported in parts of northern Australia and New Guinea. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acanthocladus albicans was mainly introduced to new environments through human activities such as horticulture and landscaping. It is often cultivated for its ornamental value due to its unique foliage and adaptability to various soil conditions. The plant has been reported in several regions outside its native range, including parts of Europe and North America. Its introduction has raised concerns about its potential to become invasive in certain ecosystems. However, its spread is generally limited by environmental factors and competition with native species."
}
