{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon androsaceum var. olympicum",
    "plant_slug": "acantholimon-androsaceum-var-olympicum",
    "plant_name_scientific": "acantholimon androsaceum var. olympicum",
    "intro": "Acantholimon androsaceum var. olympicum, commonly known as the Olympic sandwort, is a low-growing perennial plant native to the coastal areas of the Olympic Peninsula in Washington State. It is characterized by its dense, mat-forming growth habit and small, blue to purple flowers that bloom in early summer. The plant thrives in well-drained, sandy or gravelly soils and is often found in coastal dunes and rocky habitats. It has narrow, grass-like leaves and is adapted to withstand salt spray and strong winds. This variety is considered rare and is of particular interest to botanists due to its unique ecological niche and limited distribution.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon androsaceum var. olympicum is primarily native to the Olympic Mountains of Washington State, USA. This rare plant is found in high-elevation alpine environments, typically in rocky soils and open meadows. It is adapted to the cold, moist conditions of its mountainous habitat. The variety is known for its delicate, pinkish flowers and is often found in association with other alpine flora. Due to its limited range, it is considered a sensitive indicator of ecological health in the region.",
    "distribution_introduced_art_desc": "Acantholimon androsaceum var. olympicum was mainly introduced to areas with moist, well-drained soils in mountainous regions. It thrives in cool, temperate climates and is often found in alpine meadows and rocky slopes. This plant is typically spread through seed dispersal by wind and animals. It has been reported in several regions of the Pacific Northwest in the United States. Its introduction has raised concerns due to its potential to outcompete native plant species in certain habitats."
}
