{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon dianthifolium",
    "plant_slug": "acantholimon-dianthifolium",
    "plant_name_scientific": "acantholimon dianthifolium",
    "intro": "Acantholimon dianthifolium, commonly known as the silverleaf saxifrage, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Montiaceae and is characterized by its silver-gray foliage and small, white or pale pink flowers. The plant typically grows in rocky or gravelly soils and thrives in arid or semi-arid environments. It has a compact growth habit with fleshy leaves that help it conserve water. The species is valued for its ornamental appeal and is sometimes cultivated in gardens with well-drained soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon dianthifolium"
    },
    "taxonomy_art_desc": "Acantholimon dianthifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species such as roses and magnolias, known for their primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their unique leaf arrangements and floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species with showy flowers and often contain toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and coastal regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon dianthifolium, a specific plant within the genus Acantholimon, known for its distinctive leaf and flower morphology adapted to its specific habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon dianthifolium is primarily native to Iran and Turkey. This plant is typically found in rocky or arid environments within these regions. It is commonly associated with mountainous areas and dry slopes. The species is well adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific ecological niches in the countries mentioned.",
    "distribution_introduced_art_desc": "Acantholimon dianthifolium was mainly introduced to disturbed soils and rocky habitats in the western United States. It is commonly found in areas with low to moderate precipitation and well-drained soils. This plant thrives in open environments such as grasslands, shrublands, and along roadsides. It is often associated with other introduced and native plant species in these ecosystems. Its distribution is largely limited by its preference for specific soil conditions and climate."
}
