{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon bashkaleicum",
    "plant_slug": "acantholimon-bashkaleicum",
    "plant_name_scientific": "acantholimon bashkaleicum",
    "intro": "Acantholimon bashkaleicum, commonly known as the Bashkaleic thornedweed, is a flowering plant native to Central Asia. It belongs to the family Plumbagaceae and is characterized by its succulent, hairy stems and small, blue to purple flowers. The plant typically grows in rocky or sandy soils and is adapted to arid or semi-arid environments. It produces capsule fruits that contain numerous seeds, which are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a rare and potentially endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon bashkaleicum"
    },
    "taxonomy_art_desc": "Acantholimon bashkaleicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct vascular system. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon bashkaleicum, a specific plant species within the genus Acantholimon, native to certain regions of Central Asia and adapted to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon bashkaleicum is primarily native to Turkey. It is found in the eastern regions of the country, particularly in the eastern Anatolian area. This plant typically grows in rocky and gravelly soils in mountainous and semi-arid environments. It is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific ecological niches within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon bashkaleicum was mainly introduced to areas with dry, rocky soils and high elevations, typically found in mountainous regions. It is commonly found in the Caucasus and parts of Central Asia, where it thrives in arid and semi-arid environments. This plant is often associated with steppe and alpine habitats, where it forms dense, low-growing vegetation. It is adapted to withstand extreme temperature fluctuations and limited water availability. Due to its hardiness, it has been introduced to other regions with similar climatic conditions for ornamental or ecological restoration purposes."
}
