{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon stocksii",
    "plant_slug": "acantholimon-stocksii",
    "plant_name_scientific": "acantholimon stocksii",
    "intro": "Acantholimon stocksii, commonly known as the Stocks' thornweed, is a flowering plant native to the Mediterranean region. It is a member of the Caryophyllaceae family, which includes many flowering plants with showy blooms. The plant is characterized by its upright growth habit and produces small, bell-shaped flowers in shades of pink or white. It thrives in rocky or sandy soils and is often found in coastal or mountainous areas. Acantholimon stocksii is adapted to dry climates and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon stocksii"
    },
    "taxonomy_art_desc": "Acantholimon stocksii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes both herbaceous and shrub species. Its genus is Acantholimon, a genus of flowering plants native to arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon stocksii, a specific plant within the genus Acantholimon, known for its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran",
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon stocksii is primarily native to Afghanistan, Iran, and Pakistan. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky or sandy soils and is often seen in mountainous or desert-like environments. The species is adapted to withstand harsh climatic conditions, including high temperatures and limited water availability. Its native distribution reflects its ecological preference for dry, rugged landscapes in Central and South Asia.",
    "distribution_introduced_art_desc": "Acantholimon stocksii was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in disturbed soils such as roadsides, fields, and rocky outcrops. This plant thrives in regions with low precipitation and is often used for erosion control due to its hardy nature. It is native to the Mediterranean region but has been introduced to other parts of the world, including parts of California and the southwestern United States. Its distribution is largely influenced by human activity and suitable climatic conditions."
}
