{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax setulosus",
    "plant_slug": "acanthopanax-setulosus",
    "plant_name_scientific": "acanthopanax setulosus",
    "intro": "Acanthopanax setulosus, commonly known as the rough-septed dogwood, is a deciduous shrub native to eastern Asia. It belongs to the family Araliaceae and is characterized by its compound leaves with serrated edges. The plant produces small, greenish-yellow flowers followed by red berries that attract birds. It thrives in woodland areas and is valued for its ornamental qualities and ecological benefits. Acanthopanax setulosus is also used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax setulosus is primarily native to East Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas within these countries. The plant thrives in temperate climates and is often associated with humid, shaded environments. It is particularly common in the northeastern parts of China, such as in the provinces of Heilongjiang, Jilin, and Liaoning. This species is also occasionally found in parts of Southeast Asia, though it is less widespread there.",
    "distribution_introduced_art_desc": "Acanthopanax setulosus was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in temperate climates and is commonly found in regions with moderate rainfall. The plant is often considered invasive in some areas due to its rapid growth and ability to outcompete native vegetation. It is typically found in the understory of forests or in disturbed environments where light penetration is increased. Its distribution is expanding in regions where human activity has altered natural landscapes."
}
