{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon tataricum",
    "plant_slug": "acantholimon-tataricum",
    "plant_name_scientific": "acantholimon tataricum",
    "intro": "Acantholimon tataricum, commonly known as Tatarian sandwort, is a perennial flowering plant native to Central Asia. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features small, white or pale blue flowers that bloom in summer, typically from June to August. Its leaves are linear and often covered in fine hairs, adapted to withstand arid conditions. It thrives in sandy or gravelly soils and is often found in steppe and desert environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon tataricum"
    },
    "taxonomy_art_desc": "Acantholimon tataricum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants such as carnations and beets, often characterized by their specialized water-storing tissues. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes plants with distinctive blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon tataricum, a specific plant species native to certain regions of Asia, known for its hardy nature and ability to thrive in harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tadzhikistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon tataricum is primarily native to Tadzhikistan and Uzbekistan. It is commonly found in arid and semi-arid regions within these countries. This plant thrives in rocky and sandy soils, often in mountainous areas. It is well adapted to the harsh climate of Central Asia. Its distribution is limited to specific ecological niches in the region.",
    "distribution_introduced_art_desc": "Acantholimon tataricum was mainly introduced to areas with dry, rocky soils and open habitats, often as an ornamental plant or for erosion control. It has been reported in several regions outside its native range, including parts of North America and Europe. The plant thrives in full sun and requires minimal water once established. Its introduction has led to concerns about its potential invasiveness in some ecosystems. However, it is generally considered to have a low impact on native plant communities."
}
