{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus sicariguensis",
    "plant_slug": "acanthocereus-sicariguensis",
    "plant_name_scientific": "acanthocereus sicariguensis",
    "intro": "Acanthocereus sicariguensis, commonly known as the Mexican night bloomer, is a cactus species native to Mexico. It belongs to the Cactaceae family and is characterized by its cylindrical stems and spiny appearance. The plant produces large, fragrant white flowers that bloom at night, attracting nocturnal pollinators. It is well adapted to arid environments, with thick, fleshy stems that store water. Its slow growth rate and unique flowering pattern make it a popular choice for desert gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus sicariguensis is primarily native to the Caribbean islands, particularly Cuba, Hispaniola, and the Bahamas. It thrives in arid and semi-arid environments, often found in rocky soils and coastal areas. This plant is commonly associated with dry limestone habitats and is well adapted to the tropical climate of its native range. It is a member of the Cactaceae family and is known for its distinctive spiny stems and nocturnal flowering habits. Due to its limited distribution, it is considered a rare and endangered species in many parts of its native habitat.",
    "distribution_introduced_art_desc": "Acanthocereus sicariguensis was mainly introduced to the United States, particularly in the southwestern states such as Texas and Arizona. It was brought in for its ornamental value due to its distinctive appearance and ability to thrive in arid environments. The plant is commonly found in botanical gardens and private collections where it is cultivated for its aesthetic appeal. However, it has also been reported in some naturalized areas, raising concerns about its potential impact on local ecosystems. Despite its beauty, its introduction has led to discussions about its ecological risks and management."
}
