{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum coloratum var. eglandulosum",
    "plant_slug": "acanthophyllum-coloratum-var-eglandulosum",
    "plant_name_scientific": "acanthophyllum coloratum var. eglandulosum",
    "intro": "Acanthophyllum coloratum var. eglandulosum, commonly known as the glandular acanthophyllum, is a flowering plant native to arid regions of Central Asia. It is a low-growing shrub characterized by its dense, compact growth habit and spiny stems. The plant produces small, greenish-yellow flowers that bloom in early summer, adapted to the harsh conditions of its environment. Its leaves are typically small and covered in fine hairs, which help reduce water loss. This species is well-suited to sandy soils and is often found in desert or semi-desert habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum coloratum"
    },
    "taxonomy_art_desc": "Acanthophyllum coloratum var. eglandulosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often show adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum coloratum, a specific type of plant within the genus, known for its distinctive appearance and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum coloratum var. eglandulosum is primarily native to Kirgizstan. This plant is commonly found in the arid and semi-arid regions of the country. It thrives in sandy or gravelly soils and is often seen in steppe and desert environments. The species is well adapted to the harsh climate conditions of Central Asia. It plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthophyllum coloratum var. eglandulosum was mainly introduced to areas with arid and semi-arid climates, particularly in regions with well-drained sandy or gravelly soils. It thrives in environments with low precipitation and high solar exposure, making it suitable for degraded or disturbed landscapes. This plant is often found in coastal dunes, salt marshes, and inland deserts where it plays a role in stabilizing soil and preventing erosion. Its introduction has been associated with ecological restoration projects aimed at reclaiming barren lands. However, its invasive potential in certain regions requires careful monitoring to prevent negative impacts on native flora."
}
