{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon squarrosum",
    "plant_slug": "acantholimon-squarrosum",
    "plant_name_scientific": "acantholimon squarrosum",
    "intro": "Acantholimon squarrosum, commonly known as the squarrose thistle, is a perennial herb native to the western United States and parts of Canada. It is characterized by its spiny, glandular leaves and yellow flowers that bloom in summer. The plant typically grows in dry, rocky habitats such as slopes and gravelly soils. Its leaves are often covered in a fine, white, waxy coating, which helps reduce water loss. Acantholimon squarrosum plays a role in stabilizing soil and providing habitat for small invertebrates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon squarrosum"
    },
    "taxonomy_art_desc": "Acantholimon squarrosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and often possessing showy flowers. Its order is Caryophyllales, a group of flowering plants that includes many plants with colorful flowers and some with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with showy flowers and often contains compounds with medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon squarrosum, a specific plant within the genus Acantholimon, known for its distinctive appearance and adaptation to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kazakhstan",
        "Kirgizstan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon squarrosum is primarily native to Kazakhstan and Kirgizstan. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky or gravelly soils, often in mountainous or steppe-like environments. The species is well adapted to the harsh climate conditions of Central Asia. Its distribution is limited to specific ecological niches in these regions.",
    "distribution_introduced_art_desc": "Acantholimon squarrosum was mainly introduced to areas with dry, rocky soils and coastal environments. It is commonly found in regions with mild, temperate climates and low annual precipitation. This plant has been reported in several Mediterranean countries, including Spain and Italy, as well as parts of the United States. It thrives in well-drained soils and is often found in disturbed or anthropogenic habitats. Its introduction may be associated with human activity, such as landscaping or accidental transport."
}
