{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon echinus var. glaberrimum",
    "plant_slug": "acantholimon-echinus-var-glaberrimum",
    "plant_name_scientific": "acantholimon echinus var. glaberrimum",
    "intro": "Acantholimon echinus var. glaberrimum, commonly known as the smooth thorned sand-verbena, is a perennial flowering plant native to the arid regions of the western United States. It belongs to the family Boraginaceae and is characterized by its succulent, spiny stems and small, pale blue to purple flowers. The plant has narrow, grass-like leaves that are often covered in a fine layer of white wax, which helps reduce water loss in its harsh environment. It typically grows in sandy or gravelly soils and is adapted to full sun exposure. Its unique morphology and drought tolerance make it a distinctive component of desert flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon echinus var. glaberrimum is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal scrub and grassland habitats. This variety thrives in sandy or gravelly soils and is adapted to Mediterranean climates. It is often seen in areas with mild, wet winters and dry summers. Due to its specific habitat requirements, it is considered a rare and localized species.",
    "distribution_introduced_art_desc": "Acantholimon echinus var. glaberrimum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed sites such as roadsides, gravelly slopes, and sandy soils. This plant is often used in xeriscaping due to its low water requirements and ornamental value. It has been reported in several states across the western United States, including California, Nevada, and Utah. However, its introduction has raised concerns about its potential to become invasive in certain ecological contexts."
}
