{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum alexandrae",
    "plant_slug": "acanthophyllum-alexandrae",
    "plant_name_scientific": "acanthophyllum alexandrae",
    "intro": "Acanthophyllum alexandrae, commonly known as the Alexandra's thorn, is a flowering plant native to the arid regions of Central Asia. It is a low-growing shrub characterized by its dense, spiny foliage and small, yellowish flowers. The plant is adapted to survive in harsh, dry environments with minimal water availability. Its spines serve as a defense mechanism against herbivores and also help reduce water loss through transpiration. Acanthophyllum alexandrae plays a role in stabilizing sandy soils and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum alexandrae is primarily native to the arid and semi-arid regions of central Asia, particularly in countries such as Mongolia, Kazakhstan, and parts of northern China. It thrives in sandy and gravelly soils, often found in steppes and deserts where water is scarce. This plant is well adapted to extreme environmental conditions, including high temperatures and strong winds. It plays an important ecological role in stabilizing soil and providing habitat for small desert animals. Due to its limited distribution and specific habitat requirements, it is considered a rare and vulnerable species.",
    "distribution_introduced_art_desc": "Acanthophyllum alexandrae was mainly introduced to the arid and semi-arid regions of the Middle East and Central Asia. It is commonly found in sandy and gravelly soils, often in areas with low precipitation. This plant is well adapted to harsh environmental conditions, including high temperatures and limited water availability. It plays a role in stabilizing dunes and preventing soil erosion in its native habitat. Its introduction has been noted in ecological studies focusing on plant adaptation and desertification control."
}
