{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanos spina",
    "plant_slug": "acanos-spina",
    "plant_name_scientific": "acanos spina",
    "intro": "Acanos spina, commonly known as the spiny acanthus, is a perennial herbaceous plant native to southern Africa. It features upright, branched stems that are often covered in stiff, spiny hairs. The plant produces large, palmate leaves with serrated edges, and its flowers are typically arranged in dense, spiky clusters. Acanos spina thrives in well-drained soils and full sun, making it a hardy plant in Mediterranean climates. It is often cultivated for its ornamental value and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanos spina is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky and arid environments, often found in coastal areas and mountainous regions. This plant is well adapted to dry climates and can survive in poor soil conditions. It is commonly seen in countries such as Spain, Italy, and Greece. Its distribution is closely linked to the historical and geographical spread of the Mediterranean basin.",
    "distribution_introduced_art_desc": "Acanos spina was mainly introduced to areas with disturbed soils and open habitats, such as roadsides and abandoned fields. It thrives in environments with full sun and moderate to poor soil conditions. The plant is known for its rapid growth and ability to spread through both seeds and rhizomes. It has been reported in several regions where it competes with native vegetation. Due to its invasive nature, it is often considered a weed in agricultural and natural areas."
}
