{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon stenorhaphium",
    "plant_slug": "acantholimon-stenorhaphium",
    "plant_name_scientific": "acantholimon stenorhaphium",
    "intro": "Acantholimon stenorhaphium, commonly known as the narrow-leafed stonecrop, is a member of the Plumbagaceae family. It is a low-growing, evergreen perennial shrub native to southern Europe, particularly the Iberian Peninsula. The plant features succulent, fleshy leaves that are typically narrow and arranged in a rosette pattern. It produces small, blue or purple flowers during the summer months, which are clustered in dense inflorescences. This species is well adapted to rocky and arid environments, making it a hardy plant suitable for xeriscaping and rock gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon stenorhaphium"
    },
    "taxonomy_art_desc": "Acantholimon stenorhaphium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group of vascular plants that includes ferns, horsetails, and their relatives, known for their ancient lineage and specialized reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary adaptations. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon stenorhaphium, a specific plant within the genus Acantholimon, characterized by its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon stenorhaphium is primarily native to Afghanistan. This plant is found in the mountainous regions of the country, particularly in the eastern and central parts. It thrives in rocky and arid environments, often growing at higher elevations. The species is adapted to the harsh climate and limited soil conditions of its native habitat. It plays an important ecological role in the local flora of Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon stenorhaphium was mainly introduced to areas with rocky or gravelly soils, often in dry, open habitats such as slopes and coastal dunes. It thrives in regions with low precipitation and high sunlight exposure, making it well-suited for arid and semi-arid environments. The plant is commonly found in the Mediterranean region, particularly in southern Europe and parts of North Africa. Its introduction has been primarily through natural dispersal via wind or water, although human activities have also played a role in its spread. Due to its hardy nature, it has become an invasive species in some areas where it outcompetes native vegetation."
}
