{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum pachycephalum",
    "plant_slug": "acanthophyllum-pachycephalum",
    "plant_name_scientific": "acanthophyllum pachycephalum",
    "intro": "Acanthophyllum pachycephalum, commonly known as the thick-headed spiny bush, is a shrub native to arid and semi-arid regions of Central Asia. It is characterized by its dense, spiny foliage and compact growth form, which helps it conserve water in harsh environments. The plant has small, pale green leaves that are adapted to reduce water loss through transpiration. Its flowering stems bear clusters of small, yellowish flowers that bloom in summer. Acanthophyllum pachycephalum is often used in traditional medicine and is valued for its hardy nature and ability to stabilize soil in degraded landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum pachycephalum"
    },
    "taxonomy_art_desc": "Acanthophyllum pachycephalum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their spore-based reproduction and often having vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often have a unique arrangement of vascular tissues. Its family is Caryophyllaceae, commonly known as the carnation family, which includes plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their succulent stems and spiny leaves. Its species is Acanthophyllum pachycephalum, a specific plant within the genus known for its thick, fleshy stems and is native to certain arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum pachycephalum is primarily native to Iran. It is commonly found in arid and semi-arid regions of the country. This plant thrives in sandy or gravelly soils and is adapted to harsh environmental conditions. It is often seen in desert and steppe ecosystems across Iran. Its distribution is closely tied to the specific climatic and geological features of the region.",
    "distribution_introduced_art_desc": "Acanthophyllum pachycephalum was mainly introduced to arid and semi-arid regions of central Asia, including parts of Kazakhstan, Mongolia, and China. It is commonly found in sandy soils and steppes, where it forms dense, low-growing vegetation. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has also raised concerns about its potential impact on native plant communities."
}
