{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon diapensioides var. longifolia",
    "plant_slug": "acantholimon-diapensioides-var-longifolia",
    "plant_name_scientific": "acantholimon diapensioides var. longifolia",
    "intro": "Acantholimon diapensioides var. longifolia, commonly known as the longleaf acantholimon, is a flowering plant native to the mountainous regions of Central Asia. It is a perennial herb that typically grows in rocky or gravelly soils, often in alpine or subalpine environments. The plant features narrow, linear leaves and produces small, white or pale pink flowers in racemose inflorescences. It is characterized by its robust root system and ability to thrive in harsh, arid conditions. This variety is noted for its ornamental value and is sometimes cultivated in gardens for its hardy nature and visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon diapensioides var. longifolia is primarily native to the western United States, particularly California. It is found in coastal and inland regions, including the Channel Islands and the Transverse Ranges. This plant thrives in rocky soils and open habitats such as coastal bluffs and grasslands. It is commonly associated with Mediterranean climates characterized by dry summers and mild, wet winters. Its distribution is limited to specific ecological zones where it can receive adequate sunlight and moisture.",
    "distribution_introduced_art_desc": "Acantholimon diapensioides var. longifolia was mainly introduced to areas with well-drained soils and full to partial sunlight, typically in coastal or inland regions with a Mediterranean climate. It thrives in rocky or gravelly soils and is often found in disturbed areas such as roadsides and open woodlands. This plant is known for its delicate, blue to purple flowers that bloom in early spring. It is commonly used in xeriscaping due to its low water requirements and ability to tolerate poor soil conditions. However, it can become invasive in certain regions if not managed properly."
}
