{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium serrulatum",
    "plant_slug": "acanthodium-serrulatum",
    "plant_name_scientific": "acanthodium serrulatum",
    "intro": "Acanthodium serrulatum, commonly known as the serrated acanthodium, is a flowering plant native to South Africa. It belongs to the family Asteraceae, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant features narrow, grass-like leaves and produces small, yellowish flowers that bloom in spring. It is often found in rocky or sandy soils and is adapted to arid environments. Due to its unique appearance and limited distribution, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium serrulatum is primarily native to the eastern and southern regions of South Africa, including countries such as South Africa, Lesotho, and Eswatini. It is commonly found in rocky outcrops, grasslands, and mountainous areas where the climate is temperate to semi-arid. This plant thrives in well-drained soils and is often associated with limestone or sandstone formations. It is a hardy species that can tolerate periods of drought and is well adapted to the local environmental conditions. Its distribution is largely confined to these specific geographic regions within southern Africa.",
    "distribution_introduced_art_desc": "Acanthodium serrulatum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and abandoned agricultural lands. It thrives in temperate climates with well-drained soils and full sun exposure. The plant spreads primarily through its seed dispersal mechanism, which allows it to colonize new areas quickly. Due to its adaptability, it has become a common weed in regions where it has been introduced. Its presence often indicates soil disturbance and can outcompete native vegetation if left unchecked."
}
