{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium dispermum",
    "plant_slug": "acanthodium-dispermum",
    "plant_name_scientific": "acanthodium dispermum",
    "intro": "Acanthodium dispermum, commonly known as the two-seeded thornplant, is a perennial herbaceous plant native to arid and semi-arid regions of southern Africa. It is characterized by its spiny, branched stems and small, greenish-white flowers that bloom in late spring. The plant produces two seeds per fruit, which are enclosed in a fleshy, red or orange capsule that splits open when mature. Acanthodium dispermum is adapted to survive in harsh environments, with deep root systems and waxy leaves to reduce water loss. It plays a role in local ecosystems by providing food and shelter for various insects and small animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium dispermum is primarily native to the eastern United States, specifically the southeastern region. It is commonly found in the Carolinas, Georgia, and Florida. This plant thrives in moist, sandy soils along the edges of wetlands and in pine flatwood habitats. It is often associated with areas that have periodic flooding and high humidity. Its distribution is limited to a relatively small geographic range within the southeastern coastal plain.",
    "distribution_introduced_art_desc": "Acanthodium dispermum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and waste areas. It thrives in regions with moderate to high sunlight exposure and well-drained soils. The plant is commonly found in temperate climates, particularly in regions with mild winters and warm summers. Its introduction has been associated with human activity, including land development and transportation corridors. Due to its adaptability, it has become a common weed in many parts of its introduced range."
}
