{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium unguiculatum",
    "plant_slug": "acanthophippium-unguiculatum",
    "plant_name_scientific": "acanthophippium unguiculatum",
    "intro": "Acanthophippium unguiculatum, commonly known as the horned cup, is a species of flowering plant in the family Apocynaceae. It is native to southern Africa, particularly South Africa, where it thrives in rocky and sandy soils. The plant is characterized by its distinctive, spiny stems and clusters of small, tubular flowers that range in color from yellow to orange. It is often found in coastal and mountainous regions, adapting well to arid and semi-arid conditions. The horned cup is also valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium unguiculatum is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal areas and along the Pacific coast, growing in sandy or gravelly soils. This plant thrives in sunny, well-drained environments and is often associated with dune ecosystems. It is also present in parts of Baja California, Mexico, where it occupies similar habitats. Due to its limited range, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acanthophippium unguiculatum was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed soils and urban environments where it can thrive in poor soil conditions. This plant has been reported in several regions outside its native range, including parts of Europe and North America. Its spread is often associated with intentional planting or accidental introduction through contaminated soil or plant materials. Due to its adaptability, it has become a potential invasive species in some areas."
}
