{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kokandense",
    "plant_slug": "acantholimon-kokandense",
    "plant_name_scientific": "acantholimon kokandense",
    "intro": "Acantholimon kokandense, commonly known as the Kokandian thornweed, is a flowering plant native to Central Asia. It belongs to the family Caryophyllaceae and is characterized by its succulent, branched stems and small, fleshy leaves. The plant produces clusters of pink or purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in arid and semi-arid environments, often found in rocky soils and mountainous regions. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon kokandense"
    },
    "taxonomy_art_desc": "Acantholimon kokandense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex reproductive structures and vascular systems. Its class is Equisetopsida, a group that includes ferns and their allies, known for their spore-based reproduction and often primitive vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a variety of floral structures. Its order is Caryophyllales, a group of flowering plants that includes many succulent and halophytic species, often with distinctive flower structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, known for their spiny or thorny leaves and showy flowers. Its species is Acantholimon kokandense, a specific plant species native to Central Asia, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan",
        "Xinjiang"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kokandense is primarily native to Kirgizstan and Xinjiang. This plant is found in the mountainous regions of these areas, where it thrives in arid and semi-arid environments. It is commonly associated with rocky soils and elevations ranging from 1,500 to 3,000 meters. The species is part of the Caryophyllaceae family and is known for its resilience to harsh climatic conditions. Its native distribution is limited to specific ecological niches in Central Asia.",
    "distribution_introduced_art_desc": "Acantholimon kokandense was mainly introduced to areas with dry, rocky soils and low precipitation, typically found in mountainous regions. It is commonly found in Central Asia, particularly in countries like Uzbekistan and Tajikistan. This plant thrives in well-drained soils and can tolerate harsh environmental conditions. It is often seen growing in alpine and subalpine habitats. Its introduction to these regions has been largely due to its natural range expansion and adaptation to local climates."
}
