{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocapparis yunckeri",
    "plant_slug": "acanthocapparis-yunckeri",
    "plant_name_scientific": "acanthocapparis yunckeri",
    "intro": "Acanthocapparis yunckeri, commonly known as the desert thornapple, is a shrub native to arid regions of the southwestern United States and northern Mexico. It belongs to the Capparaceae family and is characterized by its small, yellow flowers and spiny stems. The plant has small, ovate leaves that are often covered in fine hairs, and it produces capsule fruits containing several seeds. It is well adapted to dry conditions, with deep roots and a slow growth rate.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocapparis yunckeri is primarily native to the western United States, specifically California and Nevada. It is commonly found in rocky and arid environments, often growing on cliffs or in crevices. This plant thrives in regions with Mediterranean climates, characterized by dry summers and mild, wet winters. It is typically found in areas with well-drained soils and full sun exposure. Acanthocapparis yunckeri is an important part of the local flora in these regions, contributing to the biodiversity of the desert and chaparral ecosystems.",
    "distribution_introduced_art_desc": "Acanthocapparis yunckeri was mainly introduced to areas with a Mediterranean climate, characterized by dry summers and wet winters. It thrives in well-drained soils and full sun exposure, making it suitable for coastal and inland regions. This plant is often found in rocky or gravelly habitats, where it can establish itself along slopes and cliffs. Its introduction has been primarily for ornamental purposes due to its unique appearance and hardy nature. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
