{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus maderaspatensis",
    "plant_slug": "acanthus-maderaspatensis",
    "plant_name_scientific": "acanthus maderaspatensis",
    "intro": "Acanthus maderaspatensis, commonly known as the African horse-hair fern, is a striking plant native to southern Africa. It is characterized by its long, narrow, and often hairy fronds that can reach several meters in length. The plant has a robust rhizome system that allows it to thrive in a variety of soil types. It prefers full sun to partial shade and is drought-tolerant once established. Its unique appearance makes it a popular choice for ornamental gardening and landscape design.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus maderaspatensis is primarily native to the tropical regions of South America, specifically Brazil. It is found in the states of Bahia, Pernambuco, and Piauí, where it thrives in humid, shaded environments. This plant is commonly associated with tropical rainforests and is often found growing near streams or in moist, well-drained soils. It is also present in parts of northern Argentina and Paraguay, though its distribution is more limited in these areas. Due to its ornamental value, it has been introduced to other regions but remains most abundant in its native range.",
    "distribution_introduced_art_desc": "Acanthus maderaspatensis was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and architectural appearance. It is commonly used in gardens and as a decorative plant in urban settings. The plant has been introduced to several regions outside its native habitat, including parts of Europe and North America. Its introduction has raised concerns about its potential invasiveness in non-native environments. Despite its aesthetic value, careful management is recommended to prevent ecological disruption."
}
