{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon tibeticum",
    "plant_slug": "acantholimon-tibeticum",
    "plant_name_scientific": "acantholimon tibeticum",
    "intro": "Acantholimon tibeticum, commonly known as the Tibetan thornweed, is a flowering plant native to the high-altitude regions of the Tibetan Plateau. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy leaves and clusters of small, blue or violet flowers. The plant is adapted to cold, arid environments and often grows in rocky or gravelly soils. It has a low-growing habit and is often found in alpine meadows and mountainous areas. Due to its unique ecological niche, it plays a role in stabilizing soil and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon tibeticum is primarily native to the Tibetan Plateau and adjacent regions of western China. It is found in high-altitude environments such as alpine meadows and rocky slopes. This plant thrives in arid and semi-arid conditions with limited soil moisture. It is commonly distributed in areas with cold climates and strong solar radiation. Its native range extends into parts of Nepal and Bhutan as well.",
    "distribution_introduced_art_desc": "Acantholimon tibeticum was mainly introduced to areas with high altitude and cold climates, particularly in the Tibetan Plateau and surrounding regions. It thrives in well-drained, rocky or gravelly soils and is often found in alpine meadows and steppe habitats. This plant is adapted to harsh environmental conditions, including low temperatures and strong winds. It plays a role in stabilizing soil and providing habitat for local wildlife. Its distribution is limited to specific ecological niches, making it a rare and specialized species."
}
