{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon vedicum",
    "plant_slug": "acantholimon-vedicum",
    "plant_name_scientific": "acantholimon vedicum",
    "intro": "Acantholimon vedicum, commonly known as the Vedda thistle, is a flowering plant native to the mountainous regions of southern India. It belongs to the family Plumbaginaceae and is characterized by its spiny, woolly stems and small, blue to purple flowers. The plant typically grows in rocky and arid environments, showcasing adaptations to harsh climatic conditions. Its leaves are often covered in a dense layer of fine hairs, which helps reduce water loss. Acantholimon vedicum is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon vedicum"
    },
    "taxonomy_art_desc": "Acantholimon vedicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, often exhibiting complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a diverse range of floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral morphology and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon vedicum, a specific plant within the genus Acantholimon, native to certain regions and characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon vedicum is primarily native to the Transcaucasus and Turkey. It is found in regions that include parts of eastern Turkey and the mountainous areas of the Transcaucasus. This plant typically grows in rocky or gravelly soils in alpine and subalpine habitats. It is commonly found in areas with a Mediterranean climate characterized by dry summers and wet winters. Its distribution is limited to specific microhabitats within these regions.",
    "distribution_introduced_art_desc": "Acantholimon vedicum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is commonly found in disturbed sites such as roadsides, waste areas, and gravelly slopes. This plant has become established in several regions outside its native range due to its adaptability and tolerance to various environmental conditions. Its introduction has been noted in parts of Europe, particularly in southern France and Spain. However, its spread is limited by its preference for specific soil types and climatic conditions."
}
