{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon spirizianum var. multiflorum",
    "plant_slug": "acantholimon-spirizianum-var-multiflorum",
    "plant_name_scientific": "acantholimon spirizianum var. multiflorum",
    "intro": "Acantholimon spirizianum var. multiflorum, commonly known as the multi-flowered thornsteppe, is a perennial flowering plant native to the arid regions of Central Asia. It belongs to the Plumbagaceae family and is characterized by its succulent, fleshy leaves adapted to conserve water. The plant produces small, blue to violet flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and is often found in rocky or gravelly habitats. Due to its limited distribution and specific ecological requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon spirizianum var. multiflorum is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, Lebanon, and Israel. It is commonly found in rocky and limestone soils in mountainous areas. This plant thrives in dry, sunny environments and is often seen in open woodlands and grasslands. It is well adapted to the climate of the region, with its succulent leaves helping it retain moisture. Due to its limited distribution, it is considered a rare and endemic species in some areas.",
    "distribution_introduced_art_desc": "Acantholimon spirizianum var. multiflorum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in disturbed sites such as roadsides, fields, and along streambanks. This plant thrives in regions with low to moderate rainfall and can tolerate drought conditions. Its introduction has been documented in several western states of the United States. It is considered a non-native species that has become established in these new habitats."
}
