{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon bonesseae",
    "plant_slug": "acantholimon-bonesseae",
    "plant_name_scientific": "acantholimon bonesseae",
    "intro": "Acantholimon bonesseae, commonly known as the Bonessean thornweed, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many flowering plants adapted to dry environments. The plant is characterized by its succulent leaves and small, showy flowers that typically bloom in the spring. It thrives in rocky soils and is often found in mountainous areas with limited water availability. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon bonesseae"
    },
    "taxonomy_art_desc": "Acantholimon bonesseae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle that includes both a gametophytic and sporophytic stage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose and magnolia families. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon bonesseae, a specific plant species within the genus Acantholimon, native to certain regions and distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon bonesseae is primarily native to Iran. It is found in the arid and semi-arid regions of the country, particularly in the central and eastern parts. This plant is adapted to rocky and sandy soils, often growing in mountainous areas. It is part of the Caryophyllaceae family and is known for its small, often blue or purple flowers. Its distribution is limited to specific microhabitats within Iran, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Acantholimon bonesseae was mainly introduced to areas with well-drained soils and full sun exposure, typically in rocky or gravelly habitats. It is commonly found in Mediterranean climates where it thrives in dry, warm conditions. This plant has been introduced to several regions outside its native range, including parts of California and the Mediterranean Basin. It is often cultivated as an ornamental due to its attractive, silvery foliage and showy flowers. However, it can become invasive in some environments if not managed properly."
}
