{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis trispina",
    "plant_slug": "acanthopsis-trispina",
    "plant_name_scientific": "acanthopsis trispina",
    "intro": "Acanthopsis trispina, commonly known as the three-spined acanthus, is a flowering plant belonging to the Acanthaceae family. It is characterized by its distinctive spiny calyx and showy, tubular flowers that typically bloom in shades of red or purple. Native to tropical and subtropical regions, this plant thrives in well-drained soil and full sunlight. Its foliage consists of opposite, ovate leaves with a rough texture. The plant is often cultivated for its ornamental value and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis trispina is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, thriving in environments with low rainfall and high temperatures. This plant is adapted to withstand extreme drought conditions, making it a resilient species in its native habitat. It is often seen growing in open grasslands and along the edges of shrublands. Its distribution is closely linked to the availability of well-drained soil and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acanthopsis trispina was mainly introduced to New Zealand. It was first recorded in the 1980s and has since spread throughout the North Island. The plant is commonly found in coastal areas and disturbed soils. It is considered a weed due to its ability to outcompete native vegetation. Its distribution is primarily limited by climate and soil conditions."
}
