{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax spinosus var. inermis",
    "plant_slug": "acanthopanax-spinosus-var-inermis",
    "plant_name_scientific": "acanthopanax spinosus var. inermis",
    "intro": "Acanthopanax spinosus var. inermis, commonly known as the smooth devil's ivy, is a variant of the devil's ivy plant characterized by its lack of thorns. It is a climbing shrub native to East Asia, particularly China, and thrives in temperate climates. The plant features compound leaves with elongated, serrated leaflets that give it a distinctive appearance. It produces small, yellowish-green flowers followed by red berries, which are edible for some bird species. Due to its adaptability and ornamental value, it is often cultivated as a decorative plant in gardens and indoor settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax spinosus var. inermis is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in forested areas, particularly in the mountainous regions of these countries. This variant is known for its lack of thorns, distinguishing it from the typical form of Acanthopanax spinosus. It thrives in temperate climates with well-drained soils. The plant is often associated with secondary growth forests and is occasionally cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Acanthopanax spinosus var. inermis was mainly introduced to regions with temperate climates and well-drained soils, where it thrives in open woodlands and shrublands. It is often found in areas with moderate rainfall and partial sunlight, making it adaptable to a variety of ecological conditions. This plant is commonly used in horticulture for its ornamental value, particularly its attractive foliage and unique growth habit. It has been introduced to parts of North America and Europe as a decorative shrub. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
