{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon procumbens",
    "plant_slug": "acantholimon-procumbens",
    "plant_name_scientific": "acantholimon procumbens",
    "intro": "Acantholimon procumbens, commonly known as the creeping sandthrift, is a low-growing perennial plant native to the western United States and parts of Canada. It is characterized by its prostrate growth habit, with slender stems that often root at the nodes. The plant produces small, clustered flowers that are typically pink or purple, blooming in late spring to early summer. Its leaves are linear and covered in fine hairs, adapted to reduce water loss in arid environments. Acantholimon procumbens thrives in sandy or gravelly soils and is often found in coastal dunes and dry slopes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon procumbens"
    },
    "taxonomy_art_desc": "Acantholimon procumbens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging lineages, often with primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes many species with specialized adaptations, such as salt tolerance and unique floral morphology. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their often striking blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid environments, characterized by their succulent leaves and showy flowers. Its species is Acantholimon procumbens, a specific plant within the genus Acantholimon, known for its low-growing habit and distinctive floral features adapted to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon procumbens is primarily native to Turkmenistan. This plant is commonly found in the arid and semi-arid regions of the country. It thrives in sandy or gravelly soils, often in open habitats such as dunes and plains. The species is adapted to the harsh climate conditions typical of Central Asia. It plays a role in stabilizing soil and supporting local biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acantholimon procumbens was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dunes. It thrives in environments with low moisture and full sun exposure. This plant is commonly found in disturbed sites such as roadsides, fields, and along the edges of shrublands. Its introduction has been noted in several regions of the western United States. However, it is considered a non-native species and may compete with native flora in certain ecosystems."
}
