{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax baoxinensis",
    "plant_slug": "acanthopanax-baoxinensis",
    "plant_name_scientific": "acanthopanax baoxinensis",
    "intro": "Acanthopanax baoxinensis, commonly known as the Baoxinensis Chinese dogwood, is a rare shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves and small, clustered flowers. The plant typically grows in mountainous regions with moist, well-drained soil. It is valued for its ornamental qualities and has been studied for its potential medicinal properties. Due to habitat loss, it is considered an endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax baoxinensis is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Guizhou. This species thrives in humid, subtropical climates at elevations ranging from 1,500 to 3,000 meters above sea level. It is commonly found in dense forests and secondary growth areas within these regions. The plant is well adapted to the shady and moist conditions typical of its native habitat. Due to its restricted distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthopanax baoxinensis was mainly introduced to the tropical and subtropical regions of Southeast Asia, particularly in countries like Vietnam, Indonesia, and the Philippines. It thrives in moist, shaded environments such as mountainous forests and understorey habitats. The plant is valued for its medicinal properties, including potential anti-inflammatory and antioxidant effects. Its distribution has been expanding due to increased cultivation for traditional medicine and ornamental purposes. However, its introduction has raised concerns about potential ecological impacts on native flora."
}
