{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthobotrya sericea",
    "plant_slug": "acanthobotrya-sericea",
    "plant_name_scientific": "acanthobotrya sericea",
    "intro": "Acanthobotrya sericea, commonly known as the silky acanthobotrya, is a flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its distinctive, hairy foliage and showy, tubular flowers. The plant typically grows in rocky or sandy soils and thrives in full sun. Its flowers, which range in color from white to pink, bloom during the summer months. Acanthobotrya sericea is valued for its ornamental appeal and is often cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthobotrya sericea is primarily native to South Africa. It is found in the coastal regions of the country, particularly in the Western and Northern Cape provinces. This plant thrives in sandy soils and is commonly found in coastal dunes and maritime forests. It is well adapted to the harsh coastal climate, including high salinity and strong winds. Acanthobotrya sericea is an important component of the local flora and is often used in ecological restoration projects.",
    "distribution_introduced_art_desc": "Acanthobotrya sericea was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste areas, and agricultural fields. It thrives in environments with full sun and well-drained soil, making it a common weed in disturbed landscapes. The plant is native to South Africa but has been introduced to several regions around the world, including parts of Australia and the Mediterranean. Its rapid growth and ability to spread through seeds contribute to its invasive potential in new environments. However, it is not considered highly invasive in all regions and is often managed through mechanical removal or herbicides."
}
