{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum schugnanicum",
    "plant_slug": "acanthophyllum-schugnanicum",
    "plant_name_scientific": "acanthophyllum schugnanicum",
    "intro": "Acanthophyllum schugnanicum, commonly known as the Schugnan cushion plant, is a low-growing, mat-forming shrub native to Central Asia. It is characterized by its dense, succulent foliage and spiny stems, which help it survive in harsh, arid environments. The plant produces small, pale yellow flowers during the summer months, typically in clusters at the ends of its stems. It thrives in rocky, well-drained soils and is adapted to withstand extreme temperature fluctuations. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum schugnanicum"
    },
    "taxonomy_art_desc": "Acanthophyllum schugnanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes herbs and shrubs with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum schugnanicum, a specific type of plant native to Central Asia, known for its hardy nature and adaptation to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum schugnanicum is primarily native to Afghanistan and Tajikistan. It is typically found in arid and semi-arid regions, often in rocky or gravelly soils. This plant is adapted to harsh environmental conditions, including high altitudes and low precipitation. It plays a role in stabilizing soil and supporting local ecosystems. Its distribution is limited to specific habitats within these two countries.",
    "distribution_introduced_art_desc": "Acanthophyllum schugnanicum was mainly introduced to areas with arid and semi-arid climates, particularly in Central Asia. It thrives in sandy and gravelly soils, often found in steppes and deserts. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. Its introduction has been documented in regions such as Kazakhstan, Uzbekistan, and parts of China. It plays a role in stabilizing soil and preventing erosion in these ecosystems."
}
