{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon karatavicum",
    "plant_slug": "acantholimon-karatavicum",
    "plant_name_scientific": "acantholimon karatavicum",
    "intro": "Acantholimon karatavicum, commonly known as the Karatavicum thrift, is a perennial flowering plant native to Central Asia. It belongs to the family Plumbagaceae and is characterized by its compact, low-growing habit with dense clusters of small, blue to purple flowers. The plant features needle-like leaves that are often covered in a fine layer of white wax, which helps reduce water loss in its arid habitat. It thrives in well-drained soils and is adapted to harsh, semi-desert environments. Acantholimon karatavicum is often used in rock gardens and as an ornamental plant due to its hardiness and attractive blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon karatavicum"
    },
    "taxonomy_art_desc": "Acantholimon karatavicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes species like carnations and beets, often characterized by their distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species with showy flowers and often toxic properties. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon karatavicum, a specific plant species native to Central Asia, known for its unique adaptations to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kazakhstan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon karatavicum is primarily native to Kazakhstan. It is found in the central and southern regions of the country. This plant typically grows in arid and semi-arid environments. It is commonly associated with rocky slopes and dry grasslands. Its distribution is limited to specific ecological zones within Kazakhstan.",
    "distribution_introduced_art_desc": "Acantholimon karatavicum was mainly introduced to areas with dry, rocky soils and semi-arid climates, where it thrives in well-drained environments. It is commonly found in regions with low precipitation and high sunlight exposure, making it suitable for xerophytic habitats. This plant is often used in landscaping for its drought tolerance and ornamental value. It has been introduced to parts of the United States, particularly in the western states, as a hardy ornamental species. Its distribution is primarily limited to regions with similar ecological conditions to its native habitat in Central Asia."
}
