{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis incahuasina",
    "plant_slug": "acanthorhipsalis-incahuasina",
    "plant_name_scientific": "acanthorhipsalis incahuasina",
    "intro": "Acanthorhipsalis incahuasina, commonly known as the Incahuasina cactus, is a species of flowering plant native to the Andean regions of South America. It belongs to the Cactaceae family and is characterized by its spiny stems and clusters of small, vibrant flowers. The plant typically grows in rocky or arid environments, showcasing adaptations to survive in harsh, dry climates. Its foliage is often reduced to spines, with photosynthesis occurring primarily through its green stems. This unique botanical structure makes it an interesting subject for both ecological study and horticultural appreciation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis incahuasina is primarily native to the Andean regions of South America, specifically in Peru and Bolivia. It is found in the high-altitude areas of the Andes, typically in rocky or mountainous terrain. This plant thrives in cooler, temperate climates with well-drained soil. It is commonly associated with cloud forests and high-altitude grasslands. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthorhipsalis incahuasina was mainly introduced to new environments as an ornamental plant due to its unique appearance and low maintenance requirements. It is commonly found in regions with warm climates, where it thrives in well-drained soil and full sunlight. This species has been cultivated in various parts of the world, including parts of the United States and Australia, for its aesthetic value. However, its introduction has raised concerns about its potential to become invasive in non-native habitats. Despite its popularity, further research is needed to understand its ecological impact."
}
