{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosperma littorale",
    "plant_slug": "acanthosperma-littorale",
    "plant_name_scientific": "acanthosperma littorale",
    "intro": "Acanthosperma littorale, commonly known as the coastal wattle, is a shrub native to southern Australia. It is characterized by its slender, often spiny stems and small, yellow flowers that appear in late summer. The plant has compound leaves with linear leaflets and is well adapted to coastal environments. It thrives in sandy soils and is tolerant of salt spray and wind. Acanthosperma littorale plays an important role in stabilizing dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosperma littorale is primarily native to southeastern Australia, including parts of New South Wales and Victoria. It is commonly found in coastal areas, particularly on sandy soils along the shoreline. This plant thrives in maritime climates and is often associated with dune ecosystems. It is well adapted to salt spray and wind exposure, making it a characteristic species of coastal habitats. Its distribution is limited to specific regions where it can tolerate the harsh conditions of the coastal environment.",
    "distribution_introduced_art_desc": "Acanthosperma littorale was mainly introduced to stabilize coastal dunes and prevent erosion along sandy shores. It is commonly found in regions with a temperate climate and well-drained soils. This plant has been introduced to several coastal areas in Australia, including New South Wales and South Australia. Its dense root system helps bind the soil, making it an effective pioneer species in disturbed or degraded habitats. However, it is considered a potential weed in some areas due to its rapid growth and ability to spread vegetatively."
}
