{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium capense var. leucographus",
    "plant_slug": "acanthodium-capense-var-leucographus",
    "plant_name_scientific": "acanthodium capense var. leucographus",
    "intro": "Acanthodium capense var. leucographus, commonly known as the white-stippled acanthodium, is a unique variant of the acanthodium plant native to southern Africa. It is characterized by its distinctive white stippling on the leaves, which sets it apart from other varieties of the species. The plant typically grows in rocky, well-drained soils and is often found in arid or semi-arid regions. Its leaves are narrow and linear, with a slightly succulent texture, and it produces small, pale yellow flowers during the warmer months. This variant is valued for its ornamental appeal and is sometimes cultivated in gardens for its visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium capense var. leucographus is primarily native to the Western Cape Province of South Africa. It is commonly found in rocky outcrops and mountainous regions within this area. This plant thrives in well-drained soils and is often associated with fynbos vegetation. Its distribution is limited to specific microhabitats in the region. It is not found outside of its native range in South Africa.",
    "distribution_introduced_art_desc": "Acanthodium capense var. leucographus was mainly introduced to areas with sandy soils and coastal environments, particularly in southern Africa. It thrives in regions with high sunlight exposure and well-drained soil conditions. This plant is often found in dune ecosystems and along the edges of coastal forests. Its introduction has been associated with human activity, including landscaping and erosion control efforts. However, it is considered a potential invasive species in some regions due to its rapid growth and ability to outcompete native vegetation."
}
