{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus colombianus",
    "plant_slug": "acanthocereus-colombianus",
    "plant_name_scientific": "acanthocereus colombianus",
    "intro": "Acanthocereus colombianus, commonly known as the Colombian cactus, is a species of cactus native to the Andes Mountains of Colombia. It is characterized by its spiny stems and is adapted to the arid and high-altitude environments of its native habitat. The plant produces yellow flowers during the rainy season, which attract pollinators such as bees and bats. It has a slow growth rate and is often used in horticulture for its ornamental value. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus colombianus is primarily native to the Andean regions of Colombia, particularly in the departments of Cauca, Nariño, and Putumayo. It is commonly found in dry to semi-arid environments, growing in rocky soils and mountainous areas. This cactus species thrives in high-altitude zones, often in open grasslands and shrublands. It is well adapted to the tropical and subtropical climates of its native habitat. Due to its specific ecological requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acanthocereus colombianus was mainly introduced to the southwestern United States, particularly in Arizona and New Mexico, as an ornamental plant due to its unique appearance and adaptability to arid environments. It is often cultivated in xeriscapes and desert gardens for its striking, spiny stems and occasional flowering. Despite its ornamental value, it has the potential to become invasive in certain regions if not managed properly. The plant's introduction has raised concerns among ecologists due to its ability to spread rapidly in disturbed soils. However, it is not considered a widespread invasive species in its introduced range."
}
