{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon longiflorum",
    "plant_slug": "acantholimon-longiflorum",
    "plant_name_scientific": "acantholimon longiflorum",
    "intro": "Acantholimon longiflorum, commonly known as the long-flowered acantholimon, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae, which includes carnations and other flowering plants with showy blooms. The plant is characterized by its upright growth habit and clusters of delicate, pink or purple flowers that bloom in late spring to early summer. Its leaves are typically lance-shaped and covered in fine hairs, which help reduce water loss in its arid habitat. Acantholimon longiflorum is often found in rocky soils and is adapted to withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon longiflorum"
    },
    "taxonomy_art_desc": "Acantholimon longiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes both herbaceous and shrub species. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon longiflorum, a specific plant within the genus known for its long, showy flowers and is typically found in rocky or sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran",
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon longiflorum is primarily native to Afghanistan, Iran, and Pakistan. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in rocky or gravelly soils, often in mountainous or coastal areas. The species is adapted to dry climates and can withstand periods of drought. Its distribution is closely tied to specific ecological zones in the region.",
    "distribution_introduced_art_desc": "Acantholimon longiflorum was mainly introduced to areas with well-drained soils and full sun exposure, often found in coastal regions and rocky slopes. It is commonly cultivated in gardens and landscapes for its ornamental value and drought tolerance. This plant thrives in temperate climates and is particularly suited for xeriscaping due to its low water requirements. It is also valued for its long, showy flowers that bloom in late spring to early summer. However, it is important to note that it can become invasive in certain environments if not properly managed."
}
