{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon davisii",
    "plant_slug": "acantholimon-davisii",
    "plant_name_scientific": "acantholimon davisii",
    "intro": "Acantholimon davisii, commonly known as Davis' thornweed, is a flowering plant native to the western United States. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant is characterized by its upright growth habit, narrow leaves, and clusters of small, pinkish-white flowers. It thrives in rocky or sandy soils and is often found in arid or semi-arid environments. Due to its specific habitat requirements, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon davisii"
    },
    "taxonomy_art_desc": "Acantholimon davisii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses ferns, horsetails, and related plants, known for their vascular systems and often retaining primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms, often with primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive flowers and often a preference for arid or saline environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and a variety of habitats. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky environments, known for their spiny leaves and showy flowers. Its species is Acantholimon davisii, a specific plant within the genus Acantholimon, native to certain regions and distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon davisii is primarily native to Turkey. It is found in specific regions within the country, particularly in the southeastern area. This plant typically grows in rocky or gravelly soils in mountainous regions. It is adapted to the arid and semi-arid climates of its native habitat. Its distribution is limited to certain localities in Turkey, where it thrives in dry, sunny conditions.",
    "distribution_introduced_art_desc": "Acantholimon davisii was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is often found in sandy or gravelly soils, preferring areas that are not overly moist. This plant is commonly used in xeriscaping due to its drought tolerance and low maintenance requirements. It has become naturalized in several regions beyond its native range, particularly in California and parts of the southwestern United States. Its introduction has been largely driven by its ornamental value and adaptability to various environmental conditions."
}
