{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum kermanense",
    "plant_slug": "acanthophyllum-kermanense",
    "plant_name_scientific": "acanthophyllum kermanense",
    "intro": "Acanthophyllum kermanense, commonly known as the Kerman sandmat, is a low-growing, perennial shrub native to arid regions of Iran. It belongs to the Amaranthaceae family and is characterized by its dense, spiny foliage and compact growth habit. The plant thrives in sandy and saline soils, making it well adapted to harsh desert environments. Its small, greenish-yellow flowers appear in clusters and are pollinated by wind and insects. Acanthophyllum kermanense plays a role in stabilizing dunes and preventing soil erosion in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum kermanense"
    },
    "taxonomy_art_desc": "Acanthophyllum kermanense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinctive structure and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contains species adapted to arid environments. Its family is Caryophyllaceae, known as the carnation family, which includes plants with simple leaves and flowers with five petals. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum kermanense, a specific type of flowering plant native to certain regions of Iran, known for its adaptations to dry and harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum kermanense is primarily native to Afghanistan and Iran. It is commonly found in arid and semi-arid regions of these countries. This plant typically grows in sandy or rocky soils, often in desert or steppe environments. It is well adapted to the harsh climatic conditions of its native range. Its distribution is closely associated with specific ecological niches in the Iranian Plateau and surrounding areas.",
    "distribution_introduced_art_desc": "Acanthophyllum kermanense was mainly introduced to arid and semi-arid regions of Iran, particularly in the Kerman province. It is adapted to harsh environmental conditions, including high temperatures and low precipitation. This plant thrives in sandy and rocky soils, making it a valuable component of desert ecosystems. It plays a role in stabilizing soil and preventing erosion in its native habitat. Its introduction to these areas has contributed to the ecological balance and biodiversity of the region."
}
