{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ilicifolius subsp. orientalis",
    "plant_slug": "acanthus-ilicifolius-subsp-orientalis",
    "plant_name_scientific": "acanthus ilicifolius subsp. orientalis",
    "intro": "Acanthus ilicifolius subsp. orientalis, commonly known as the oriental acanthus, is a perennial herbaceous plant native to the Mediterranean region. It features distinctive, palmate leaves with a leathery texture and a silvery-white underside. The plant produces spiny, bract-like structures that surround its showy, spathaceous flowers. It thrives in well-drained soils and full sun, making it suitable for rock gardens and borders. Its ornamental value is enhanced by its architectural form and long-lasting foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ilicifolius subsp. orientalis is primarily native to the eastern Mediterranean region, including parts of Turkey, Cyprus, and the Levant. It is commonly found in rocky habitats, such as cliffs, slopes, and coastal areas. This subspecies thrives in well-drained soils and is often associated with dry, sunny environments. Its distribution extends into southern Europe, particularly in Greece and the Balkans. It is a hardy plant that is well adapted to the Mediterranean climate.",
    "distribution_introduced_art_desc": "Acanthus ilicifolius subsp. orientalis was mainly introduced to ornamental horticulture and garden design due to its striking foliage and architectural form. It is often cultivated in temperate climates for its aesthetic value and ability to thrive in well-drained soils. This subspecies is particularly favored for its silver-green leaves and tall, spiky flower clusters that add visual interest to landscapes. It has been successfully integrated into both formal and informal garden settings across Europe and parts of North America. However, its introduction has raised concerns about potential invasiveness in non-native regions."
}
