{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthobotrya sessilifolia",
    "plant_slug": "acanthobotrya-sessilifolia",
    "plant_name_scientific": "acanthobotrya sessilifolia",
    "intro": "Acanthobotrya sessilifolia, commonly known as the narrow-leaved acanthobotrya, is a succulent plant native to southern Africa. It features fleshy, spiny stems and small, narrow leaves that are often covered in a powdery coating. The plant produces yellow flowers that bloom in summer, adding ornamental value to its appearance. It is well adapted to arid environments and requires minimal water once established. Due to its unique morphology and resilience, it is a popular choice for rock gardens and xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthobotrya sessilifolia is primarily native to the eastern and southern regions of South Africa, including the Cape Province and parts of the Eastern Cape. It is commonly found in rocky outcrops, sandstone formations, and coastal areas. This species thrives in dry, well-drained soils and is often associated with fynbos vegetation. It is adapted to the Mediterranean climate of the region, characterized by wet winters and dry summers. Due to its limited distribution, it is considered a rare and endemic plant in its native habitat.",
    "distribution_introduced_art_desc": "Acanthobotrya sessilifolia was mainly introduced to areas with suitable climate conditions, particularly regions with warm temperatures and well-drained soils. It is commonly found in coastal and inland areas where it thrives in sandy or gravelly soils. This plant is often introduced for its ornamental value due to its unique foliage and ability to withstand harsh environmental conditions. It has been reported in several countries in the Mediterranean region and parts of southern Africa. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
