{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon androsaceum var. creticum",
    "plant_slug": "acantholimon-androsaceum-var-creticum",
    "plant_name_scientific": "acantholimon androsaceum var. creticum",
    "intro": "Acantholimon androsaceum var. creticum, commonly known as the Cretan sea holly, is a low-growing perennial plant native to the Mediterranean region. It features succulent, fleshy leaves that are typically bluish-green in color, adapted to arid conditions. The plant produces small, blue or violet flowers arranged in clusters, which bloom in early summer. It thrives in well-drained soils and full sun, making it suitable for rock gardens and coastal landscapes. Due to its limited distribution, it is considered a rare and endangered species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon androsaceum var. creticum is primarily native to the eastern Mediterranean region, including parts of Greece, Turkey, and Cyprus. It is commonly found in rocky and limestone areas, often growing in dry, sunny habitats. This variety is particularly associated with the island of Crete, where it thrives in coastal and mountainous environments. It is adapted to the harsh climatic conditions of the region, including high temperatures and limited rainfall. Due to its specific habitat requirements, it is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Acantholimon androsaceum var. creticum was mainly introduced to areas with well-drained sandy or gravelly soils, typically found in coastal and inland dunes. It thrives in full sun and is adapted to arid or semi-arid climates. This plant is often found in disturbed sites such as roadsides, abandoned fields, and coastal scrub. It is considered an invasive species in some regions due to its rapid spread and ability to outcompete native vegetation. Its distribution is largely limited by its intolerance to waterlogged conditions."
}
