{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon leucacanthum",
    "plant_slug": "acantholimon-leucacanthum",
    "plant_name_scientific": "acantholimon leucacanthum",
    "intro": "Acantholimon leucacanthum, commonly known as the white-capped sand-verbena, is a flowering plant native to the arid regions of southern California and northern Baja California. It is a perennial herb that typically grows in sandy or gravelly soils, often in coastal or inland desert environments. The plant produces small, white or pale blue flowers that bloom in late spring to early summer. Its leaves are usually narrow and gray-green, adapted to reduce water loss in hot, dry conditions. Acantholimon leucacanthum is valued for its ecological role in stabilizing dunes and providing nectar for pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon leucacanthum"
    },
    "taxonomy_art_desc": "Acantholimon leucacanthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms, often with primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral morphology and often found in arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their small flowers and often containing alkaloids. Its genus is Acantholimon, a genus of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon leucacanthum, a specific plant within the genus Acantholimon, distinguished by its white flowers and adapted to grow in harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon leucacanthum is primarily native to Iran. It is found in the arid and semi-arid regions of the country. This plant thrives in rocky and sandy soils, often in mountainous areas. It is well adapted to the harsh climate conditions of its native habitat. Its distribution is limited to specific ecological zones within Iran.",
    "distribution_introduced_art_desc": "Acantholimon leucacanthum was mainly introduced to areas with well-drained soils and moderate climates, often found in coastal and inland regions. It is commonly established in disturbed habitats such as roadsides, pastures, and sandy soils. The plant thrives in full sun to partial shade conditions and is adapted to arid and semi-arid environments. Its introduction has been primarily associated with human activities, including landscaping and accidental seed dispersal. Due to its hardy nature, it can become invasive in certain regions if not managed properly."
}
