{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthomintha obovata subsp. duttonii",
    "plant_slug": "acanthomintha-obovata-subsp-duttonii",
    "plant_name_scientific": "acanthomintha obovata subsp. duttonii",
    "intro": "Acanthomintha obovata subsp. duttonii, commonly known as the Dutton's acanthomintha, is a flowering plant native to the western United States. It is characterized by its small, obovate leaves and clusters of pink to purple flowers that bloom in the spring. The plant typically grows in rocky or gravelly soils, often in open habitats such as slopes and meadows. It is a perennial species with a compact growth habit, and its foliage is often covered in fine hairs. The subspecies is distinguished by its slightly different leaf shape and floral structure compared to the main species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthomintha obovata subsp. duttonii is primarily native to the coastal regions of southern California and northern Baja California, Mexico. It thrives in sandy or gravelly soils along the coastline, often in areas with mild, Mediterranean-type climates. This subspecies is commonly found in dunes, scrublands, and rocky outcrops near the Pacific Ocean. It is well adapted to salt spray and periodic drought conditions. Its distribution is limited to a relatively small geographic range, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Acanthomintha obovata subsp. duttonii was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is commonly found in disturbed soils, such as along roadsides, in open woodlands, and in rocky outcrops. This subspecies is known for its compact growth habit and its ability to thrive in nutrient-poor environments. It is often used in landscaping for its ornamental value and drought tolerance. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
