{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium catamarcense",
    "plant_slug": "acanthocalycium-catamarcense",
    "plant_name_scientific": "acanthocalycium catamarcense",
    "intro": "Acanthocalycium catamarcense, commonly known as the Catamarca cactus, is a species of flowering cactus native to Argentina. It belongs to the Cactaceae family and is characterized by its spineless stems and vibrant yellow flowers. The plant typically grows in arid and semi-arid environments, adapting to harsh desert conditions. It has a compact growth habit with ribbed stems that store water, allowing it to survive in low-rainfall areas. Due to its unique appearance and habitat, it is of interest to botanists and cactus enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium catamarcense is primarily native to Argentina. It is found in the province of Catamarca, which is located in the northwest part of the country. This cactus thrives in arid and semi-arid environments, typically in rocky or sandy soils. It is adapted to the dry climate and can survive in regions with low rainfall. The plant is part of the Cactaceae family and is known for its unique morphology and ecological significance in its native habitat.",
    "distribution_introduced_art_desc": "Acanthocalycium catamarcense was mainly introduced to regions with arid and semi-arid climates, where it thrives in well-drained soils. It is commonly found in rocky and sandy habitats, often growing in crevices or on slopes. This species is native to Argentina and has been introduced to other parts of the world for horticultural purposes. Its introduction has been documented in several countries, including the United States and parts of Europe. Due to its ornamental value, it has become a popular choice for succulent enthusiasts and collectors."
}
