{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hypochaerum",
    "plant_slug": "acantholimon-hypochaerum",
    "plant_name_scientific": "acantholimon hypochaerum",
    "intro": "Acantholimon hypochaerum, commonly known as the desert flax, is a flowering plant native to arid regions of the southwestern United States and northern Mexico. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit with silver-gray foliage. The plant produces small, blue or purple flowers that bloom in the spring, attracting pollinators such as bees and butterflies. It is well adapted to harsh environments, with deep root systems and a high tolerance for drought and poor soil conditions. Its ornamental value and resilience make it a popular choice for xeriscaping in desert landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hypochaerum"
    },
    "taxonomy_art_desc": "Acantholimon hypochaerum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their specialized pigments and structures. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with distinctive flowers and often toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon hypochaerum, a specific type of plant within the genus Acantholimon, known for its adaptations to harsh environments and unique floral structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hypochaerum is primarily native to Turkey. This species is found in various regions across the country, particularly in the central and eastern parts. It thrives in rocky and arid environments, often growing on slopes and in open habitats. The plant is well adapted to the local climate and soil conditions of Turkey. Its distribution is largely confined to specific ecological niches within the country.",
    "distribution_introduced_art_desc": "Acantholimon hypochaerum was mainly introduced to areas with sandy or gravelly soils, often in dry, open habitats such as coastal dunes, rocky slopes, and disturbed sites. It thrives in regions with low rainfall and high solar exposure, making it well-suited for arid and semi-arid environments. This plant is commonly found in Mediterranean climates and has been introduced to parts of California and other western United States regions. Its introduction has sometimes led to it becoming invasive in non-native areas, outcompeting native vegetation. Due to its hardy nature, it is often used in restoration projects and as a ornamental plant in dry landscapes."
}
