{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum versicolor",
    "plant_slug": "acanthophyllum-versicolor",
    "plant_name_scientific": "acanthophyllum versicolor",
    "intro": "Acanthophyllum versicolor, commonly known as the variable acanthophyllum, is a perennial shrub native to arid and semi-arid regions of Central Asia. It is characterized by its spiny stems and small, often hairy leaves adapted to reduce water loss. The plant produces yellow to reddish flowers during the summer months, which are clustered in dense inflorescences. Its root system is extensive, allowing it to survive in nutrient-poor, sandy soils. Acanthophyllum versicolor plays a role in stabilizing dunes and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum versicolor"
    },
    "taxonomy_art_desc": "Acanthophyllum versicolor belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex life cycles and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often show adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid or semi-arid regions, characterized by their small, often spiny leaves. Its species is Acanthophyllum versicolor, a specific type of plant within this genus known for its variable coloration and ability to thrive in harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Transcaucasus"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum versicolor is primarily native to Iran and the Transcaucasus. This plant is typically found in arid and semi-arid regions within these areas. It thrives in sandy or gravelly soils, often in open habitats such as steppes and deserts. Its distribution is closely linked to the environmental conditions of these regions. The plant is well adapted to the harsh climate and limited water availability in its native range.",
    "distribution_introduced_art_desc": "Acanthophyllum versicolor was mainly introduced to areas with arid or semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions with low precipitation and high solar exposure, such as parts of the southwestern United States and northern Mexico. This plant is often used for soil stabilization due to its deep root system and ability to withstand drought conditions. Its introduction has sometimes led to concerns about its potential to become invasive in certain ecosystems. However, it is generally considered a hardy, low-maintenance species for landscaping and restoration projects."
}
