{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus mucronatus",
    "plant_slug": "acanthus-mucronatus",
    "plant_name_scientific": "acanthus mucronatus",
    "intro": "Acanthus mucronatus, commonly known as the narrow-leaved acanthus, is a perennial herb native to southern Europe and western Asia. It is characterized by its tall, upright growth habit and large, palmately lobed leaves that are often covered in fine, soft hairs. The plant produces spikes of small, pale blue to violet flowers in the summer months. Its foliage is popular in horticulture for its ornamental value and ability to thrive in well-drained soils. Acanthus mucronatus is also valued for its historical use in classical art and architecture as a decorative motif.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus mucronatus is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and parts of KwaZulu-Natal. This plant typically grows in coastal areas, rocky outcrops, and sandy soils. It is well adapted to the Mediterranean climate of the region, characterized by dry summers and mild, wet winters. Due to its ornamental value, it is sometimes cultivated outside its native range.",
    "distribution_introduced_art_desc": "Acanthus mucronatus was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and floral display. However, it has since become invasive, outcompeting native species in various habitats. The plant spreads through its seeds, which are dispersed by wind and water. Its rapid growth and ability to thrive in diverse conditions have led to its classification as a noxious weed in several regions."
}
