{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza argentea",
    "plant_slug": "acanthorhiza-argentea",
    "plant_name_scientific": "acanthorhiza argentea",
    "intro": "Acanthorhiza argentea, commonly known as silver root, is a perennial herbaceous plant native to the eastern United States. It features a distinctive silver-gray foliage due to a dense covering of fine, white hairs. The plant produces small, yellowish flowers arranged in clusters, which bloom in early spring. Its root system is notable for being tuberous and often used in traditional medicine. Acanthorhiza argentea thrives in moist, shaded environments such as woodlands and stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza argentea is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is also found in Florida, United States, and along the Atlantic coast of South America. This plant thrives in coastal areas, often growing in sandy or rocky soils near the shoreline. It is commonly associated with mangrove ecosystems and salt marshes, where it can tolerate brackish water conditions. Acanthorhiza argentea is an important component of the coastal flora in these regions.",
    "distribution_introduced_art_desc": "Acanthorhiza argentea was mainly introduced to the southeastern United States, particularly in coastal regions of Florida and the Gulf Coast. It is commonly found in disturbed habitats such as roadsides, dunes, and areas with sandy soils. This plant thrives in sunny environments and is often associated with maritime ecosystems. Its introduction has been linked to human activity, including the movement of soil and vegetation along coastlines. Due to its adaptability, it has become a common invasive species in some areas, outcompeting native flora."
}
