{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholippia deserticola",
    "plant_slug": "acantholippia-deserticola",
    "plant_name_scientific": "acantholippia deserticola",
    "intro": "Acantholippia deserticola, commonly known as the desert lippia, is a small shrub native to the arid regions of the southwestern United States and northern Mexico. It is characterized by its compact growth habit, narrow leaves, and small, showy yellow flowers that bloom in the spring. The plant is well adapted to dry, sandy soils and can tolerate high temperatures and low precipitation. It has a deep root system that allows it to access water from deeper underground, making it resilient in harsh desert environments. Acantholippia deserticola plays a role in stabilizing soil and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholippia deserticola is primarily native to the western United States, particularly in areas of California, Nevada, and Utah. It thrives in arid and semi-arid environments, often found in rocky soils and sagebrush steppe. This plant is adapted to withstand extreme temperatures and low precipitation, making it a resilient component of desert ecosystems. It is commonly found in the Great Basin and surrounding regions. Its distribution is closely tied to specific habitat conditions that support its growth and survival.",
    "distribution_introduced_art_desc": "Acantholippia deserticola was mainly introduced to arid and semi-arid regions of North America, particularly in the southwestern United States and northern Mexico. It thrives in sandy or gravelly soils and is often found in desert scrub and creosote bush communities. This plant is adapted to extreme temperatures and low precipitation, making it a resilient species in harsh environments. It plays a role in stabilizing soil and providing habitat for small desert animals. However, its introduction has raised concerns about its potential impact on native plant species and ecosystem balance."
}
