{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophoenix grandis",
    "plant_slug": "acanthophoenix-grandis",
    "plant_name_scientific": "acanthophoenix grandis",
    "intro": "Acanthophoenix grandis, commonly known as the giant date palm, is a striking palm native to the Arabian Peninsula. It is characterized by its tall, slender trunk and large, fan-shaped leaves that can reach up to 3 meters in diameter. The plant produces small, yellowish flowers followed by edible dates, which are a significant agricultural product in its native region. It thrives in arid and semi-arid climates, requiring well-drained soil and full sun exposure. Due to its ornamental value and economic importance, it is widely cultivated in tropical and subtropical regions around the world.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophoenix grandis is primarily native to the island of Madagascar. It is found in the eastern part of the island, particularly in the northeastern region. This plant thrives in dry to semi-arid environments, often growing in rocky or sandy soils. It is commonly found in coastal areas and lowland forests. Its distribution is limited to Madagascar, where it plays an important ecological role in local ecosystems.",
    "distribution_introduced_art_desc": "Acanthophoenix grandis was mainly introduced to ornamental horticulture and tropical landscaping due to its striking appearance and adaptability. It is commonly cultivated in regions with warm climates, such as parts of southern Florida, the Caribbean, and Southeast Asia. The plant is valued for its palm-like foliage and ability to thrive in a variety of soil types. However, it has also been reported as an invasive species in some areas where it outcompetes native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
