{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosyris glabrata",
    "plant_slug": "acanthosyris-glabrata",
    "plant_name_scientific": "acanthosyris glabrata",
    "intro": "Acanthosyris glabrata, commonly known as the smooth acanthosyris, is a flowering plant native to South Africa. It belongs to the Asteraceae family and is characterized by its compact, shrub-like growth habit. The plant produces small, daisy-like flowers that are typically yellow or white in color. Its leaves are usually narrow and covered in a fine, powdery coating. Acanthosyris glabrata is adapted to arid environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Santalales",
        "family": "Santalaceae",
        "genus": "Acanthosyris",
        "species": "Acanthosyris glabrata"
    },
    "taxonomy_art_desc": "Acanthosyris glabrata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and diverse growth forms. Its order is Santalales, a group of plants that includes parasitic and hemiparasitic species, often with reduced leaves and specialized root systems. Its family is Santalaceae, commonly known as the sandalwood family, which includes both parasitic and non-parasitic species with distinctive floral structures. Its genus is Acanthosyris, a group of shrubs or trees that are typically found in arid or semi-arid regions, characterized by their spiny or thorny structures. Its species is Acanthosyris glabrata, a specific plant within this genus known for its smooth, hairless surfaces and adapted to grow in harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosyris glabrata is primarily native to Colombia, Ecuador, and Peru. This plant is found in the Andean regions of these countries, where it thrives in high-altitude environments. It is commonly associated with rocky soils and mountainous landscapes. The species is part of the Fabaceae family and is known for its hardy nature. Its native distribution is limited to these three South American nations.",
    "distribution_introduced_art_desc": "Acanthosyris glabrata was mainly introduced to areas with specific soil and climate conditions that mimic its native habitat. It thrives in well-drained soils and prefers a Mediterranean climate with mild, wet winters and hot, dry summers. The plant is often found in coastal regions and rocky outcrops where it can establish itself easily. Its introduction has been documented in several regions outside its native range, including parts of California and the Mediterranean. However, its spread is limited due to its specific ecological requirements."
}
