{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis incachacana",
    "plant_slug": "acanthorhipsalis-incachacana",
    "plant_name_scientific": "acanthorhipsalis incachacana",
    "intro": "Acanthorhipsalis incachacana, commonly known as the mountain nightshade, is a flowering plant native to South America, particularly in regions of Peru and Ecuador. It belongs to the Solanaceae family, which includes other well-known plants like tomatoes and peppers. The plant is characterized by its erect growth habit, hairy stems, and small, bell-shaped flowers that typically bloom at night. Its leaves are opposite, ovate, and often covered in fine pubescence, contributing to its distinctive appearance. This species is adapted to high-altitude environments and thrives in temperate climates with well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis incachacana is primarily native to the tropical regions of South America, specifically in countries such as Brazil, Colombia, Ecuador, Peru, and Venezuela. It is commonly found in humid lowland forests and cloud forests, where it thrives in the shaded understory. This plant is often associated with rocky outcrops and limestone formations, which provide the well-drained soil it prefers. It plays an important ecological role in its native habitat by contributing to the biodiversity of the forest floor. Due to its specific habitat requirements, it is considered a rare and endangered species in many parts of its range.",
    "distribution_introduced_art_desc": "Acanthorhipsalis incachacana was mainly introduced to the Pacific Islands, particularly in regions with tropical and subtropical climates. It is commonly found in coastal areas and disturbed habitats due to its adaptability to various soil types. This plant has been reported in countries such as Hawaii, Guam, and parts of the Philippines. Its introduction is often associated with ornamental horticulture and accidental spread through human activities. However, its ecological impact remains under study due to limited long-term data."
}
