{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus montanus",
    "plant_slug": "acanthus-montanus",
    "plant_name_scientific": "acanthus montanus",
    "intro": "Acanthus montanus, commonly known as the mountain acanthus, is a perennial herb native to the mountainous regions of southern Europe and western Asia. It is characterized by its striking, palmate leaves with serrated edges and its tall, spire-like inflorescences that bear small, clustered flowers. The plant typically grows in rocky or limestone soils and thrives in full sun to partial shade. Its ornamental value has made it a popular choice in horticulture, though it is often cultivated in controlled environments due to its specific habitat requirements. Acanthus montanus is also noted for its historical use in classical art and architecture, where its foliage was frequently depicted in decorative motifs.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus montanus"
    },
    "taxonomy_art_desc": "Acanthus montanus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide variety of floral structures. Its order is Lamiales, which includes plants with showy flowers, often with bilateral symmetry, and includes many economically important species. Its family is Acanthaceae, a family of flowering plants known for their distinctive bracts and often colorful flowers, commonly found in tropical regions. Its genus is Acanthus, which includes species known for their spiky, ornamental leaves and showy inflorescences, often used in horticulture. Its species is Acanthus montanus, a specific plant within the Acanthus genus, characterized by its unique morphology and habitat preferences in its native region.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Benin",
        "Burundi",
        "Cameroon",
        "Central African Republic",
        "Chad",
        "Congo",
        "DR Congo",
        "Gabon",
        "Gulf of Guinea Is.",
        "Nigeria",
        "Rwanda",
        "Sierra Leone",
        "Zambia"
    ],
    "distribution_introduced": [
        "Costa Rica",
        "Mauritius"
    ],
    "distribution_native_art_desc": "Acanthus montanus is primarily native to Angola, Benin, Burundi, Cameroon, Central African Republic, Chad, Congo, DR Congo, Gabon, Gulf of Guinea Is., Nigeria, Rwanda, Sierra Leone, and Zambia. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in moist, shaded environments, often growing in forest understories or along riverbanks. Acanthus montanus is an important species in local ecosystems, contributing to biodiversity and supporting various wildlife. Its native range reflects its adaptation to the humid and diverse habitats of Central and West Africa.",
    "distribution_introduced_art_desc": "Acanthus montanus was mainly introduced to Costa Rica and Mauritius. It is a species of flowering plant belonging to the Acanthaceae family. The introduction of Acanthus montanus to these regions is likely due to horticultural or ornamental purposes. It has adapted well to the local climates in both countries. However, its impact on native ecosystems is still being studied."
}
