{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon virens",
    "plant_slug": "acantholimon-virens",
    "plant_name_scientific": "acantholimon virens",
    "intro": "Acantholimon virens, commonly known as the green sandwort, is a flowering plant native to the arid regions of southern Europe and western Asia. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features succulent, fleshy leaves that help it retain moisture in dry environments. Its small, greenish-yellow flowers are typically clustered in dense inflorescences. Acantholimon virens is adapted to rocky and sandy soils, making it a resilient species in challenging habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon virens"
    },
    "taxonomy_art_desc": "Acantholimon virens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often having a distinctive morphology. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants such as cacti and carnations, often with specialized adaptations to various environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species with distinctive blue or violet flowers. Its genus is Acantholimon, a genus of flowering plants native to arid and semi-arid regions, typically characterized by their spiny leaves and small flowers. Its species is Acantholimon virens, a specific plant within the genus Acantholimon, known for its greenish or yellowish flowers and its ability to thrive in harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Tadzhikistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon virens is primarily native to Afghanistan, Tadzhikistan, and Uzbekistan. This plant is commonly found in arid and semi-arid regions within these countries. It typically grows in rocky or gravelly soils, often in mountainous or desert environments. The species is adapted to withstand harsh climatic conditions, including high temperatures and low precipitation. Its distribution is largely confined to the Central Asian region, where it thrives in specific ecological niches.",
    "distribution_introduced_art_desc": "Acantholimon virens was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dunes. It thrives in well-drained environments and is commonly found in regions with a Mediterranean climate. This plant is typically introduced as a ornamental or for erosion control due to its hardy nature. It has become naturalized in several regions outside its native range. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
