{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon scabrellum",
    "plant_slug": "acantholimon-scabrellum",
    "plant_name_scientific": "acantholimon scabrellum",
    "intro": "Acantholimon scabrellum, commonly known as the roughleaf sandthrift, is a perennial flowering plant native to the arid and semi-arid regions of western North America. It belongs to the family Caryophyllaceae, which includes many flowering plants adapted to dry environments. The plant is characterized by its gray-green, hairy foliage and small, pink or white flowers that bloom in early spring. It typically grows in sandy or gravelly soils and is well-suited to harsh, low-nutrient conditions. Acantholimon scabrellum plays an important ecological role in stabilizing soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon scabrellum"
    },
    "taxonomy_art_desc": "Acantholimon scabrellum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants known for their often showy flowers and some species containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or coastal regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon scabrellum, a specific type within the genus known for its distinctive appearance and ecological adaptations to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon scabrellum is primarily native to Iran and Iraq. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in rocky and sandy soils, often growing in mountainous or coastal areas. The species is well adapted to the harsh climatic conditions of its native range. Its distribution is limited to specific ecological niches in the Middle East.",
    "distribution_introduced_art_desc": "Acantholimon scabrellum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed soils such as roadsides, fields, and along fence lines. This plant is often used for erosion control due to its hardy nature and ability to thrive in harsh conditions. It has a low-growing, mat-forming habit that makes it suitable for ground cover. However, it is considered a potential invasive species in some regions where it can outcompete native vegetation."
}
