{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon distichum",
    "plant_slug": "acantholimon-distichum",
    "plant_name_scientific": "acantholimon distichum",
    "intro": "Acantholimon distichum, commonly known as the two-rowed sandmat, is a flowering plant native to the western United States and northern Mexico. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant is characterized by its low-growing, mat-forming habit and has linear, grass-like leaves that are often covered in fine hairs. Its flowers are small, typically pink or purple, and are arranged in clusters at the ends of the stems. Acantholimon distichum thrives in arid and semi-arid environments, often found in sandy or gravelly soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon distichum"
    },
    "taxonomy_art_desc": "Acantholimon distichum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and roses. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with medicinal properties. Its genus is Acantholimon, a genus of flowering plants native to the Mediterranean region, typically characterized by their succulent leaves and showy flowers. Its species is Acantholimon distichum, a specific type within the genus known for its two-rowed leaves and is often found in rocky or coastal habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon distichum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central parts. This plant thrives in high-altitude environments, often growing in rocky or gravelly soils. It is adapted to the cold and arid conditions typical of Afghanistan's mountainous terrain. Acantholimon distichum is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acantholimon distichum was mainly introduced to stabilize soil and prevent erosion in areas with poor soil quality. It is commonly used in restoration projects due to its ability to thrive in harsh environmental conditions. This plant is particularly suited for arid and semi-arid regions where other vegetation may struggle to grow. Its introduction has helped in reclaiming degraded lands and improving land stability. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
