{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon turcicum",
    "plant_slug": "acantholimon-turcicum",
    "plant_name_scientific": "acantholimon turcicum",
    "intro": "Acantholimon turcicum, commonly known as the Turkish thimbleweed, is a flowering plant native to Turkey and parts of the Middle East. It belongs to the family Montiaceae and is characterized by its small, basal rosettes of blue-gray, woolly leaves. The plant produces clusters of tiny, white to pale blue flowers during the spring and summer months. It thrives in arid and semi-arid environments, often growing in rocky or sandy soils. Acantholimon turcicum is valued for its ornamental appeal and is sometimes cultivated in gardens for its drought tolerance and unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon turcicum"
    },
    "taxonomy_art_desc": "Acantholimon turcicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with showy flowers and often contains toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny or hairy structures. Its species is Acantholimon turcicum, a specific plant within this genus native to Turkey, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon turcicum is primarily native to Turkey. It is commonly found in the central and eastern regions of the country. This plant typically grows in rocky and arid environments. It is well adapted to the dry and sunny conditions of its native habitat. Its distribution is largely confined to specific areas within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon turcicum was mainly introduced to areas with specific soil and climate conditions that support its growth, such as well-drained soils and temperate climates. It is commonly found in regions with low to moderate rainfall. This plant has been introduced to several parts of the world, including Europe and North America. Its introduction is often associated with human activities like gardening and landscaping. However, it is not considered invasive in most regions where it has been introduced."
}
