{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum yasamin-nassehiae",
    "plant_slug": "acanthophyllum-yasamin-nassehiae",
    "plant_name_scientific": "acanthophyllum yasamin-nassehiae",
    "intro": "Acanthophyllum yasamin-nassehiae, commonly known as the Yasamin-Nassehia's spiny sage, is a low-growing shrub native to the arid regions of Central Asia. It is characterized by its dense, compact growth habit and small, needle-like leaves that help reduce water loss in its harsh environment. The plant produces small, greenish-yellow flowers during the summer months, which are adapted for pollination by wind and insects. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its unique morphology and limited distribution, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum yasamin-nassehiae"
    },
    "taxonomy_art_desc": "Acanthophyllum yasamin-nassehiae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their allies, known for their unique reproductive structures and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often contain alkaloids. Its family is Caryophyllaceae, commonly known as the carnation family, which includes plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum yasamin-nassehiae, a specific type of plant native to certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum yasamin-nassehiae is primarily native to Iran. This plant is found in the arid and semi-arid regions of the country. It thrives in sandy and rocky soils, often in desert or steppe environments. The species is adapted to withstand high temperatures and low precipitation. Its distribution is limited to specific ecological niches within Iran's central and eastern regions.",
    "distribution_introduced_art_desc": "Acanthophyllum yasamin-nassehiae was mainly introduced to arid and semi-arid regions of central Asia, particularly in the Iranian plateau and surrounding areas. It thrives in sandy and gravelly soils with low precipitation. This plant has been documented in regions with extreme temperature fluctuations and minimal water availability. Its introduction is associated with efforts to stabilize dunes and prevent soil erosion. It is now considered a valuable species for ecological restoration in degraded landscapes."
}
