{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpus rupestris",
    "plant_slug": "acanthocarpus-rupestris",
    "plant_name_scientific": "acanthocarpus rupestris",
    "intro": "Acanthocarpus rupestris, commonly known as the rock thistle, is a flowering plant native to southern Africa. It is a perennial shrub characterized by its spiny stems and leaves, which are often covered in fine hairs. The plant produces small, yellow flowers that bloom in summer, typically arranged in dense clusters. It thrives in rocky, well-drained soils and is often found in arid or semi-arid environments. Due to its hardy nature, it is sometimes used in erosion control and as a forage plant for livestock.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Asparagaceae",
        "genus": "Acanthocarpus",
        "species": "Acanthocarpus rupestris"
    },
    "taxonomy_art_desc": "Acanthocarpus rupestris belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Asparagales, a large group of flowering plants that includes plants like asparagus, orchids, and grasses. Its family is Asparagaceae, a family of flowering plants that includes many ornamental and economically valuable species. Its genus is Acanthocarpus, a group of flowering plants typically characterized by their spiny fruits and often found in arid regions. Its species is Acanthocarpus rupestris, a specific type of plant known for its succulent stems and spiny fruits, commonly found in rocky or arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpus rupestris is primarily native to Western Australia. It is commonly found in the sandy and rocky soils of the coastal and inland regions of the state. This plant thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the hot and dry climate typical of Western Australia. Its distribution is largely confined to the southern and southwestern parts of the region.",
    "distribution_introduced_art_desc": "Acanthocarpus rupestris was mainly introduced to New Zealand. It was brought there as a potential forage plant due to its ability to thrive in various soil conditions. However, it has since become invasive, outcompeting native vegetation in grasslands and shrublands. Its rapid growth and seed dispersal have led to its spread across much of the country. Despite its benefits for livestock, its ecological impact has raised concerns among conservationists."
}
