{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon petraeum",
    "plant_slug": "acantholimon-petraeum",
    "plant_name_scientific": "acantholimon petraeum",
    "intro": "Acantholimon petraeum, commonly known as the rock spurge, is a flowering plant belonging to the family Montiaceae. It is native to the rocky and arid regions of southern Europe and western Asia. This perennial herb typically grows in crevices and on slopes, adapting to harsh, dry environments. Its small, yellowish flowers appear in late spring, and it has succulent leaves that help it retain moisture. The plant is often found in alpine and coastal habitats, where it thrives in well-drained soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon petraeum"
    },
    "taxonomy_art_desc": "Acantholimon petraeum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, which consists of flowering plants often with distinctive flowers and includes families like the cacti and amaranths. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often adapted to arid environments. Its genus is Acantholimon, a group of flowering plants typically found in dry and rocky habitats, characterized by their spiny or hairy leaves. Its species is Acantholimon petraeum, a specific plant species within the genus Acantholimon, known for its adaptations to rocky and arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iraq",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon petraeum is primarily native to Iraq and Turkey. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky and limestone soils, often in mountainous areas. Its distribution is limited to specific ecological niches in the region. The species is adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon petraeum was mainly introduced to areas with rocky or gravelly soils, often in arid or semi-arid environments. It thrives in well-drained soils and is commonly found in mountainous regions. This plant is typically associated with open habitats such as slopes, cliffs, and disturbed areas. It is well adapted to withstand drought and temperature extremes. Due to its hardy nature, it is sometimes used in restoration projects in degraded landscapes."
}
