{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus cuixmalensis",
    "plant_slug": "acanthocereus-cuixmalensis",
    "plant_name_scientific": "acanthocereus cuixmalensis",
    "intro": "Acanthocereus cuixmalensis, commonly known as the Mexican night-blooming cactus, is a species native to Mexico. It is a columnar cactus characterized by its ribbed stems and spiny areoles. The plant produces large, fragrant white flowers that open at night, attracting nocturnal pollinators. It is adapted to arid environments and requires minimal water once established. Its unique appearance and nocturnal blooming make it a striking addition to desert gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus cuixmalensis"
    },
    "taxonomy_art_desc": "Acanthocereus cuixmalensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group of vascular plants that includes horsetails and some fern allies, known for their unique vascular structures. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and beets, often characterized by their specialized adaptations to arid environments. Its family is Cactaceae, commonly known as cacti, which are succulent plants typically found in arid regions and are known for their spines and ability to store water. Its genus is Acanthocereus, a group of cacti native to Mexico and the southwestern United States, characterized by their columnar stems and flowers. Its species is Acanthocereus cuixmalensis, a specific type of cactus found in Mexico, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus cuixmalensis is primarily native to Mexico Southwest. This species is found in the arid and semi-arid regions of the country. It thrives in rocky soils and is often associated with desert scrub habitats. The plant is adapted to the harsh climate of the region. Its distribution is limited to specific areas within the southwestern part of Mexico.",
    "distribution_introduced_art_desc": "Acanthocereus cuixmalensis was mainly introduced to regions with arid or semi-arid climates, particularly in the southwestern United States and parts of Mexico. It thrives in well-drained soils and full sunlight, making it suitable for desert gardens and xeriscaping. This plant is valued for its ornamental appearance, featuring spiny stems and vibrant flowers. It has been cultivated for both its aesthetic appeal and its ability to withstand extreme temperatures. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
