{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon riyatguelii",
    "plant_slug": "acantholimon-riyatguelii",
    "plant_name_scientific": "acantholimon riyatguelii",
    "intro": "Acantholimon riyatguelii, commonly known as the Riyatgueli's sea holly, is a flowering plant native to the coastal regions of the Middle East. It is a member of the Plumbagaceae family and is characterized by its distinctive blue or purple flowers and spiny, succulent leaves. The plant thrives in saline and sandy soils, often growing in dunes or along the coastlines. It is adapted to withstand harsh coastal conditions, including high salinity and strong winds. Due to its unique appearance and ecological significance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon riyatguelii"
    },
    "taxonomy_art_desc": "Acantholimon riyatguelii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, which comprises plants with a wide range of forms, including cacti and spinach, often featuring distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, known for their spiny stems and showy flowers. Its species is Acantholimon riyatguelii, a specific plant within this genus, native to certain regions of the Middle East, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon riyatguelii is primarily native to Iran. This plant is found in specific regions of Iran, particularly in the northern and central parts of the country. It thrives in rocky and arid environments, often growing on slopes and in mountainous areas. The species is adapted to the dry and harsh climatic conditions of its native habitat. Its distribution is limited to certain ecological niches within Iran, making it a regionally significant plant.",
    "distribution_introduced_art_desc": "Acantholimon riyatguelii was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in rocky or gravelly habitats, often growing along slopes or in disturbed soils. This plant is adapted to low moisture conditions and can thrive in environments with limited rainfall. It is often used in xeriscaping due to its drought tolerance and ornamental value. Its distribution has been expanded through horticultural interest and ecological restoration projects."
}
