{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthoxanthium spinosum",
    "plant_slug": "acanthoxanthium-spinosum",
    "plant_name_scientific": "acanthoxanthium spinosum",
    "intro": "Acanthoxanthium spinosum, commonly known as the spiny goldenweed, is a flowering plant native to arid and semi-arid regions of North America. It belongs to the Asteraceae family, characterized by its composite flower heads that resemble single blooms. The plant features spiny, hairy stems and leaves with a rough, textured surface, which aid in reducing water loss. Its yellow flowers bloom in late summer, attracting pollinators such as bees and butterflies. Acanthoxanthium spinosum is adapted to thrive in sandy or rocky soils with low moisture availability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthoxanthium spinosum is primarily native to southern Africa, specifically South Africa. It is commonly found in the region around the Eastern Cape and the Western Cape provinces. This plant thrives in sandy or rocky soils and is often seen in open, sunny habitats. It is well adapted to the Mediterranean climate of the area, with dry summers and wet winters. Due to its specific ecological requirements, it is not found outside of its native range.",
    "distribution_introduced_art_desc": "Acanthoxanthium spinosum was mainly introduced to new habitats through human activities such as landscaping and accidental seed dispersal. It thrives in disturbed soils and can quickly colonize open areas, making it a common invader in urban and agricultural settings. This plant's spiny structure and rapid growth rate contribute to its competitive advantage over native species. It is particularly problematic in regions with warm climates and low rainfall. Due to its invasive nature, it is often classified as a noxious weed in several countries."
}
