{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus albicaulis",
    "plant_slug": "acanthocereus-albicaulis",
    "plant_name_scientific": "acanthocereus albicaulis",
    "intro": "Acanthocereus albicaulis, commonly known as the white-stemmed cactus, is a species native to the deserts of northern Mexico and the southwestern United States. It is a columnar cactus characterized by its smooth, pale green stems that often have a bluish tinge. The plant produces white to pale yellow flowers during the spring and summer months, which are typically nocturnal in bloom. It has spines that are typically white or pale in color, providing camouflage in its arid environment. This cactus is adapted to survive in harsh, dry conditions with minimal water requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus albicaulis is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Sonora and Sinaloa. This cactus thrives in arid and semi-arid environments, often growing in rocky soils and desert landscapes. It is commonly associated with scrublands and canyons where it receives minimal rainfall. Due to its hardy nature, it is well adapted to the harsh conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acanthocereus albicaulis was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in desert environments, particularly in areas with well-drained soils. This cactus is often cultivated for its ornamental value due to its striking white flowers. It thrives in full sun and requires minimal water, making it well-suited for arid climates. However, it can become invasive in some regions if not managed properly."
}
