{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum heterophyllum",
    "plant_slug": "acanthophyllum-heterophyllum",
    "plant_name_scientific": "acanthophyllum heterophyllum",
    "intro": "Acanthophyllum heterophyllum, commonly known as the sandmat, is a flowering plant native to arid and semi-arid regions of Central Asia. It is characterized by its low, cushion-like growth form, which helps it conserve water in harsh environments. The plant produces small, yellow flowers arranged in dense clusters, typically blooming in late spring or early summer. Its leaves are usually reduced to spines, which minimize water loss and deter herbivores. Acanthophyllum heterophyllum plays a crucial role in stabilizing sandy soils and supporting local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum heterophyllum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Turkmenistan, and Uzbekistan. It is commonly found in sandy and rocky desert environments, often growing in areas with low precipitation and extreme temperature fluctuations. This plant is well adapted to harsh conditions, with its succulent stems and small, spiny leaves helping it conserve water. It plays an important role in stabilizing dunes and preventing soil erosion in these ecosystems. Due to its specialized habitat, it is considered a rare and vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Acanthophyllum heterophyllum was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. This plant is often used for soil stabilization due to its extensive root system and ability to tolerate extreme environmental conditions. Its introduction has been associated with both ecological restoration projects and unintentional spread through human activities. However, it is not typically considered an invasive species in most of its range."
}
