{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthoscyphus parishii var. goodmaniana",
    "plant_slug": "acanthoscyphus-parishii-var-goodmaniana",
    "plant_name_scientific": "acanthoscyphus parishii var. goodmaniana",
    "intro": "Acanthoscyphus parishii var. goodmaniana, commonly known as the Goodman's rock cress, is a flowering plant native to the mountainous regions of southern Africa. It belongs to the Brassicaceae family, which includes many species of mustard and cress plants. The plant is characterized by its compact growth habit, with small, basal leaves and clusters of tiny, white or pale yellow flowers. It thrives in rocky, well-drained soils and is often found in alpine or subalpine habitats. Due to its limited distribution and specific ecological requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Polygonaceae",
        "genus": "Acanthoscyphus",
        "species": "Acanthoscyphus parishii"
    },
    "taxonomy_art_desc": "Acanthoscyphus parishii var. goodmaniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and some primitive vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes species like carnations and beets, often characterized by their distinctive floral structures. Its family is Polygonaceae, commonly known as the buckwheat family, which includes plants with distinctive bracteate inflorescences and often have a bitter taste. Its genus is Acanthoscyphus, a group of flowering plants that are typically found in arid or rocky habitats and are known for their spiny or thorny structures. Its species is Acanthoscyphus parishii, a specific plant within the genus that is known for its unique morphological features and is often found in specific geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthoscyphus parishii var. goodmaniana is primarily native to California. This variant of the species is found in specific regions within the state, particularly in the coastal and inland areas. It thrives in rocky soils and dry habitats, often growing in chaparral and coastal scrub environments. The plant is adapted to the Mediterranean climate of California, characterized by dry summers and mild, wet winters. Its native distribution is limited to certain parts of California, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acanthoscyphus parishii var. goodmaniana was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in forested regions. It thrives in temperate climates and is often found in the understory of native forests. This plant is commonly cultivated in botanical gardens and conservation areas for its ornamental value. It has been introduced to several regions outside its native range, including parts of North America and Europe. However, its introduction has raised concerns about potential ecological impacts in non-native habitats."
}
