{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon arundoscapum",
    "plant_slug": "acantholimon-arundoscapum",
    "plant_name_scientific": "acantholimon arundoscapum",
    "intro": "Acantholimon arundoscapum, commonly known as the slenderleaf flaxflower, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Plumbaginaceae and is characterized by its upright, herbaceous growth habit. The plant produces small, blue to violet flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its leaves are narrow and linear, often covered in fine hairs, and it thrives in well-drained, sandy or rocky soils. Acantholimon arundoscapum is often found in alpine meadows and is adapted to cold, arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon arundoscapum"
    },
    "taxonomy_art_desc": "Acantholimon arundoscapum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex structures. Its class is Equisetopsida, which comprises vascular plants with a wide variety of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often have specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with showy flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon arundoscapum, a specific plant within the genus Acantholimon, known for its unique morphology and adapted to grow in specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon arundoscapum is primarily native to Iran. It is found in the arid and semi-arid regions of the country. This plant typically grows in rocky and sandy soils. It is commonly observed in mountainous and coastal areas. Its distribution is limited to specific ecological zones within Iran.",
    "distribution_introduced_art_desc": "Acantholimon arundoscapum was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dune environments. It thrives in well-drained, nutrient-poor conditions and is commonly found in regions with a Mediterranean or semi-arid climate. This plant is typically distributed along the western coast of North America, particularly in California and Oregon. Its introduction has been associated with human activities such as landscaping and habitat modification. It is considered an invasive species in some areas where it outcompetes native vegetation."
}
