{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon alatavicum var. typicum",
    "plant_slug": "acantholimon-alatavicum-var-typicum",
    "plant_name_scientific": "acantholimon alatavicum var. typicum",
    "intro": "Acantholimon alatavicum var. typicum, commonly known as the Alatav Valley thornweed, is a perennial flowering plant native to Central Asia. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit. The plant features narrow, blue-green leaves and produces small, pinkish-white flowers in summer. It thrives in rocky or sandy soils and is adapted to arid and semi-arid environments. Due to its limited distribution, it is considered a rare and ecologically significant species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon alatavicum var. typicum is primarily native to the arid and semi-arid regions of Central Asia, particularly in the mountainous areas of Kazakhstan and Kyrgyzstan. It thrives in rocky and gravelly soils, often found in steppe and alpine environments. This plant is well adapted to the harsh climate, with its succulent leaves helping it retain moisture. It is commonly found in areas with limited precipitation and high solar exposure. Its distribution is closely tied to the specific ecological conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon alatavicum var. typicum was mainly introduced to areas with well-drained soils and moderate to high elevations, typically found in mountainous or semi-arid regions. It thrives in environments with full sun exposure and is commonly found in rocky or gravelly soils. This plant is often cultivated in gardens and landscapes for its ornamental value due to its attractive, spiny foliage and flowering stems. It is particularly suited to regions with cold winters and warm, dry summers. However, it requires careful management to prevent it from becoming invasive in natural habitats."
}
