{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon scabiosum var. nudicalyx",
    "plant_slug": "acantholimon-scabiosum-var-nudicalyx",
    "plant_name_scientific": "acantholimon scabiosum var. nudicalyx",
    "intro": "Acantholimon scabiosum var. nudicalyx, commonly known as the naked calyx stonecrop, is a perennial succulent native to the arid regions of western North America. It features a rosette of fleshy, gray-green leaves that are covered in a fine, powdery bloom, which helps reduce water loss. The plant produces clusters of small, pink or purple flowers during the summer months. It thrives in well-drained soil and full sun, making it suitable for rock gardens and xeriscaping. Its unique appearance and drought tolerance make it a valuable addition to arid landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon scabiosum var. nudicalyx is primarily native to the western United States, specifically California and Oregon. This plant is commonly found in coastal and inland areas with sandy or gravelly soils. It thrives in dry, open habitats such as dunes, coastal bluffs, and disturbed sites. The variety is adapted to the Mediterranean climate of these regions, characterized by mild, wet winters and warm, dry summers. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acantholimon scabiosum var. nudicalyx was mainly introduced to areas with well-drained sandy or gravelly soils, typically in arid or semi-arid environments. It thrives in regions with low to moderate rainfall and full sun exposure. This plant is commonly found in coastal dunes, inland deserts, and rocky outcrops. Its introduction has been associated with both natural dispersal and human activities such as landscaping and restoration projects. Due to its hardy nature, it has become established in several regions outside its native range."
}
