{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum korshinskyi",
    "plant_slug": "acanthophyllum-korshinskyi",
    "plant_name_scientific": "acanthophyllum korshinskyi",
    "intro": "Acanthophyllum korshinskyi, commonly known as the Korshinsky's jointweed, is a flowering plant native to Central Asia. It is a perennial shrub characterized by its dense, compact growth and spiny stems. The plant produces small, yellowish flowers that bloom in summer, typically in clusters at the ends of its branches. It thrives in arid and semi-arid environments, often found in sandy or rocky soils. Acanthophyllum korshinskyi is adapted to withstand drought and extreme temperature fluctuations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum korshinskyi"
    },
    "taxonomy_art_desc": "Acanthophyllum korshinskyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert plants, often with specialized adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes flowering plants with showy flowers and often hairy leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum korshinskyi, a specific type of flowering plant native to certain regions of Central Asia, known for its adaptations to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran",
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum korshinskyi is primarily native to Afghanistan, Iran, and Turkmenistan. This plant is typically found in arid and semi-arid regions within these countries. It thrives in sandy or gravelly soils, often in desert or steppe environments. The species is well adapted to the harsh climatic conditions of its native range. Its distribution is limited to specific ecological niches within these geographic areas.",
    "distribution_introduced_art_desc": "Acanthophyllum korshinskyi was mainly introduced to arid and semi-arid regions of Central Asia, including parts of Mongolia, Kazakhstan, and China. It is commonly found in sandy and gravelly soils, often in steppes and desert environments. This plant is well adapted to harsh climatic conditions, with its succulent leaves and deep root system allowing it to survive in low-water environments. It plays a vital role in stabilizing dunes and preventing soil erosion in these regions. Due to its resilience, it has been used in ecological restoration projects in areas affected by desertification."
}
