{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon physostegium",
    "plant_slug": "acantholimon-physostegium",
    "plant_name_scientific": "acantholimon physostegium",
    "intro": "Acantholimon physostegium, commonly known as the broad-leaved sandthrift, is a flowering plant native to the Mediterranean region. It is a perennial herb characterized by its succulent, fleshy leaves and spikes of blue to purple flowers. The plant thrives in well-drained soils and is often found in rocky or sandy habitats. It belongs to the family Caryophyllaceae, which includes other flowering plants with similar structural features. Acantholimon physostegium is valued for its ornamental appeal and ecological role in supporting pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon physostegium"
    },
    "taxonomy_art_desc": "Acantholimon physostegium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive organs. Its order is Caryophyllales, which includes plants with showy flowers and often has a distinctive arrangement of petals. Its family is Plumbaginaceae, a family of flowering plants known for their often blue or purple flowers and some species containing toxic compounds. Its genus is Acantholimon, a group of flowering plants commonly found in arid and coastal regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon physostegium, a specific plant within the genus Acantholimon, known for its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon physostegium is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant thrives in rocky and arid environments, often growing at higher elevations. It is adapted to the harsh climatic conditions of the region, including cold winters and hot, dry summers. Due to its limited distribution, it is considered a rare and endemic species in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon physostegium was mainly introduced to stabilize soil and prevent erosion in coastal and arid regions. It is commonly found in disturbed soils and sandy habitats where it forms dense mats. This plant is known for its ability to thrive in harsh environmental conditions, making it a popular choice for restoration projects. However, its invasive nature has led to concerns about its impact on native plant communities. Due to its rapid spread, it is often classified as a noxious weed in several regions."
}
