{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza kalbreyeri",
    "plant_slug": "acanthorhiza-kalbreyeri",
    "plant_name_scientific": "acanthorhiza kalbreyeri",
    "intro": "Acanthorhiza kalbreyeri, commonly known as the Kalbreyer's thornroot, is a rare and delicate flowering plant native to the southeastern United States. It belongs to the family Polemoniaceae and is characterized by its hairy stems and small, showy flowers that bloom in late spring. The plant typically grows in moist, well-drained soils in shaded to partially shaded environments. Its leaves are opposite and oval-shaped, with a slightly serrated edge. Due to its limited distribution and habitat specificity, it is considered a threatened species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza kalbreyeri is primarily native to the eastern United States, specifically found in the coastal regions of North and South Carolina. This plant thrives in sandy, well-drained soils along the Atlantic coast. It is commonly found in dune habitats and coastal plain areas where it can tolerate salt spray and sandy conditions. Acanthorhiza kalbreyeri is an important component of the coastal flora in these regions. Its distribution is limited to specific ecological niches along the southeastern U.S. coastline.",
    "distribution_introduced_art_desc": "Acanthorhiza kalbreyeri was mainly introduced to new habitats through human activities such as horticulture and accidental transport. It has been found growing in disturbed soils and along roadsides in regions where it is not native. The plant's ability to thrive in a variety of environmental conditions has contributed to its spread. It is considered an invasive species in some areas due to its competitive growth habits. Conservation efforts are ongoing to manage its distribution and prevent further ecological impact."
}
