{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthobotrya microphylla",
    "plant_slug": "acanthobotrya-microphylla",
    "plant_name_scientific": "acanthobotrya microphylla",
    "intro": "Acanthobotrya microphylla, commonly known as the small-leaved acanthobotrya, is a species of flowering plant in the family Rhamnaceae. It is native to southern Africa, particularly South Africa, where it thrives in rocky and sandy soils. The plant is characterized by its small, elliptical leaves and clusters of yellowish-green flowers that bloom in spring. It is often found in coastal and mountainous regions, adapting well to arid and semi-arid conditions. Due to its unique morphology and habitat, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthobotrya microphylla is primarily native to South Africa, specifically the Western Cape province. It is commonly found in the fynbos biome, which is known for its rich biodiversity and unique plant species. This plant typically grows in rocky outcrops and sandy soils, often in coastal and mountainous regions. It is well adapted to the Mediterranean climate of the area, characterized by wet winters and dry summers. Due to its specific habitat requirements, it is considered a rare and endemic species within its native range.",
    "distribution_introduced_art_desc": "Acanthobotrya microphylla was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in coastal and lowland environments, spreading rapidly along the coastline. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
