{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum donii",
    "plant_slug": "acanthospermum-donii",
    "plant_name_scientific": "acanthospermum donii",
    "intro": "Acanthospermum donii, commonly known as the Mexican thornweed, is a flowering plant native to Central America and northern South America. It is a member of the Asteraceae family, characterized by its composite flower heads and opposite leaf arrangement. The plant typically grows in dry, open habitats such as grasslands and disturbed soils. Its leaves are often hairy and have a serrated edge, while its flowers are small and yellow, arranged in clusters. Acanthospermum donii is known for its adaptability to arid conditions and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum donii is primarily native to the Indian subcontinent, particularly India and Nepal. It is commonly found in regions with tropical and subtropical climates. This plant thrives in open grasslands, disturbed soils, and along roadsides. It is often associated with dry and semi-arid environments. Its native range also extends to parts of Southeast Asia, including Bangladesh and Sri Lanka.",
    "distribution_introduced_art_desc": "Acanthospermum donii was mainly introduced to new habitats through human activities such as landscaping and gardening. It has established itself in regions with warm climates and well-drained soils. The plant's rapid growth and ability to thrive in disturbed areas contribute to its spread. It is often found in coastal dunes, roadsides, and other open areas. Due to its invasive potential, it is considered a threat to native plant communities in some regions."
}
