{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus raddei",
    "plant_slug": "acanthus-raddei",
    "plant_name_scientific": "acanthus raddei",
    "intro": "Acanthus raddei, commonly known as the Cape acanthus, is a perennial herb native to South Africa. It belongs to the Acanthaceae family and is characterized by its striking, spiny leaves and showy, tubular flowers. The plant typically grows in rocky or sandy soils and thrives in full sun. Its foliage is often used in horticultural designs due to its ornamental value. Acanthus raddei is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus raddei is primarily native to southern Africa, specifically South Africa. It is found in the eastern and western regions of the country. This plant thrives in coastal areas and sandy soils. It is commonly associated with the fynbos biome, which is known for its unique biodiversity. Acanthus raddei is an important component of the local flora and is adapted to the region's climate and soil conditions.",
    "distribution_introduced_art_desc": "Acanthus raddei was mainly introduced to regions with temperate climates, particularly in parts of Europe and North America. It is commonly found in disturbed soils and along roadsides, where it thrives in sunny, well-drained environments. This plant has been introduced as an ornamental due to its striking foliage and unique flower structure. However, it is considered invasive in some areas, outcompeting native species for resources. Its distribution has expanded rapidly since its introduction, raising concerns about its ecological impact."
}
