{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale tetrasperma",
    "plant_slug": "acanthopale-tetrasperma",
    "plant_name_scientific": "acanthopale tetrasperma",
    "intro": "Acanthopale tetrasperma, commonly known as the four-seeded acanthus, is a flowering plant belonging to the family Malvaceae. It is native to tropical Africa and thrives in moist, shaded environments. The plant features palmate leaves with lobed margins and produces small, clustered flowers with five petals. Its fruit is a capsule that splits open to release four seeds, giving it its common name. It is often found in forest understories and is valued for its ornamental foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale tetrasperma is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and the Democratic Republic of the Congo. It is commonly found in moist, lowland forests and along riverbanks. This plant thrives in humid climates with well-drained soil. It is often used in traditional medicine for its various therapeutic properties. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acanthopale tetrasperma was mainly introduced to new habitats through human activities such as trade and accidental transport. It has been found in regions with tropical and subtropical climates, often thriving in disturbed soils and along roadsides. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to concerns about ecological impact and biodiversity loss in affected regions. Efforts are being made to monitor and control its spread to mitigate environmental damage."
}
