{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium sinuatum",
    "plant_slug": "acanthodium-sinuatum",
    "plant_name_scientific": "acanthodium sinuatum",
    "intro": "Acanthodium sinuatum, commonly known as the sinuous acanthodium, is a flowering plant native to certain regions of South America. It belongs to the family Asteraceae, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant features narrow, sinuous leaves that give it its common name, and its small yellow flowers are typically arranged in a dense cluster. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments. Due to its ornamental value, it is occasionally cultivated in gardens, though it is not widely known.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium sinuatum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky, and coastal environments, often found in disturbed soils and along cliffs. This plant is commonly associated with xerophytic habitats and is well adapted to arid and semi-arid climates. It is also known to occur in the Canary Islands and parts of the Iberian Peninsula. Its distribution is closely linked to areas with low rainfall and high solar exposure.",
    "distribution_introduced_art_desc": "Acanthodium sinuatum was mainly introduced to new habitats through human activities such as trade and horticultural practices. It is commonly found in disturbed soils and along roadsides, where it thrives in sunny, well-drained environments. This plant has shown rapid growth and spread, making it a potential invasive species in certain regions. Its introduction has raised concerns among ecologists due to its ability to outcompete native flora. Despite its ornamental appeal, careful management is necessary to prevent its uncontrolled proliferation."
}
