{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon festucaceum",
    "plant_slug": "acantholimon-festucaceum",
    "plant_name_scientific": "acantholimon festucaceum",
    "intro": "Acantholimon festucaceum, commonly known as the silvergrass or silverweed, is a perennial flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae and is characterized by its low-growing, mat-forming habit with dense clusters of small, white or pale pink flowers. The plant has silvery-gray leaves that are covered in fine hairs, which help reduce water loss in arid environments. It thrives in well-drained soils and is often found in alpine and rocky habitats. Acantholimon festucaceum is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardy nature and aesthetic qualities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon festucaceum"
    },
    "taxonomy_art_desc": "Acantholimon festucaceum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in dry habitats, known for their often blue or purple flowers and toxic alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and small, often clustered flowers. Its species is Acantholimon festucaceum, a specific plant within the genus Acantholimon, known for its grass-like appearance and adaptation to rocky or sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Transcaucasus"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon festucaceum is primarily native to Iran and the Transcaucasus. This plant is commonly found in rocky and mountainous regions within these areas. It thrives in arid and semi-arid environments, often growing on slopes and in dry meadows. The species is well adapted to the harsh climatic conditions of its native range. It plays an important role in the local flora and is a characteristic component of steppe and shrubland ecosystems.",
    "distribution_introduced_art_desc": "Acantholimon festucaceum was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dunes. It thrives in environments with low moisture and full sun exposure. This plant is commonly found in regions with a Mediterranean climate, such as parts of California and the western United States. It has been reported in disturbed sites and can spread rapidly in open, dry habitats. Its introduction has led to concerns about its potential to outcompete native vegetation in certain ecosystems."
}
