{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon korovinii",
    "plant_slug": "acantholimon-korovinii",
    "plant_name_scientific": "acantholimon korovinii",
    "intro": "Acantholimon korovinii, commonly known as the Korovin's sea holly, is a flowering plant native to the arctic and alpine regions of Eurasia. It is characterized by its succulent, fleshy leaves that are often covered in a waxy cuticle to reduce water loss in harsh environments. The plant produces small, blue to purple flowers arranged in a dense, spike-like inflorescence. It thrives in rocky, well-drained soils and is adapted to cold climates with low precipitation. Acantholimon korovinii is often found in mountainous areas and is a member of the Plumbagaceae family.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon korovinii"
    },
    "taxonomy_art_desc": "Acantholimon korovinii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with medicinal properties and often found in dry habitats. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their small, often blue or purple flowers. Its species is Acantholimon korovinii, a specific plant within the genus Acantholimon, native to certain regions of Russia and known for its hardy and drought-resistant characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon korovinii is primarily native to Turkmenistan. This plant is typically found in arid and semi-arid regions within the country. It thrives in sandy or rocky soils, often in dry grasslands and steppe environments. The species is adapted to the harsh climatic conditions of Central Asia. Its distribution is limited to specific areas within Turkmenistan where the ecological conditions match its requirements.",
    "distribution_introduced_art_desc": "Acantholimon korovinii was mainly introduced to New Zealand. It was brought there as part of an ornamental plant collection. The plant is now found in several regions across the country, including the North Island. It thrives in coastal and semi-arid environments. However, it is considered a potential weed in some areas due to its rapid growth and ability to spread."
}
