{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum lamondiae",
    "plant_slug": "acanthophyllum-lamondiae",
    "plant_name_scientific": "acanthophyllum lamondiae",
    "intro": "Acanthophyllum lamondiae, commonly known as the Lamond's spiny bush, is a flowering plant native to the arid regions of central Australia. It is a shrub characterized by its dense, spiny foliage and small, yellowish-green flowers that bloom during the cooler months. The plant is well adapted to harsh, dry environments, with small leaves that reduce water loss and deep roots that access underground moisture. It plays an important ecological role in stabilizing sandy soils and providing habitat for native wildlife. Due to its limited distribution and sensitivity to environmental changes, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum lamondiae"
    },
    "taxonomy_art_desc": "Acanthophyllum lamondiae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that typically have primitive floral structures and are often found in diverse habitats. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert-adapted species, often with specialized water storage mechanisms. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often hairy leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum lamondiae, a specific type of plant within this genus, known for its adaptations to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum lamondiae is primarily native to Afghanistan. It is found in the arid and semi-arid regions of the country, particularly in the eastern and southern provinces. This plant thrives in sandy and rocky soils, often in areas with low precipitation. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is largely restricted to specific ecological niches within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum lamondiae was mainly introduced to stabilize sand dunes and prevent soil erosion in arid and semi-arid regions. It is commonly found in coastal and inland desert environments where it forms dense, low-growing vegetation. This plant is well adapted to harsh conditions, including high salinity, extreme temperatures, and limited water availability. Its introduction has helped in restoring degraded lands and supporting local biodiversity. However, it is important to monitor its spread to avoid potential impacts on native plant communities."
}
