{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon bracteatum",
    "plant_slug": "acantholimon-bracteatum",
    "plant_name_scientific": "acantholimon bracteatum",
    "intro": "Acantholimon bracteatum, commonly known as the bracteate thistleweed, is a perennial flowering plant native to the western United States. It belongs to the family Plumbagaceae and is characterized by its spiny leaves and showy blue or purple flowers. The plant typically grows in rocky or sandy soils, often in arid or semi-arid environments. Its flowers are tubular and attract pollinators such as bees and butterflies. Acantholimon bracteatum is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon bracteatum"
    },
    "taxonomy_art_desc": "Acantholimon bracteatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in rocky or coastal areas, characterized by their succulent leaves and showy flowers. Its species is Acantholimon bracteatum, a specific plant within the genus Acantholimon, known for its bract-like leaves and its ability to thrive in harsh, coastal environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq",
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon bracteatum is primarily native to Iran, Iraq, Transcaucasus, and Turkey. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in rocky and gravelly soils, often in mountainous or coastal areas. Its distribution is largely confined to the southwestern part of the Caspian Sea region. The species is well adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon bracteatum was mainly introduced to areas with well-drained sandy or gravelly soils, often in dry to moist environments. It thrives in regions with moderate to high levels of sunlight, making it suitable for open habitats such as coastal dunes, grasslands, and disturbed soils. This plant is commonly found in the western United States, particularly in states like California, Oregon, and Washington. It is often associated with coastal and inland desert margins, where it can tolerate both salt spray and arid conditions. Due to its hardy nature, it has been introduced to various ecological regions beyond its native range."
}
