{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon avanosicum",
    "plant_slug": "acantholimon-avanosicum",
    "plant_name_scientific": "acantholimon avanosicum",
    "intro": "Acantholimon avanosicum, commonly known as the Armenian sandthorn, is a flowering plant native to the high-altitude regions of Armenia and Turkey. It belongs to the family Caryophyllaceae and is characterized by its succulent, spiny stems and small, pale pink to white flowers. The plant thrives in arid and semi-arid environments, often found on rocky slopes and in sandy soils. It has adapted to survive in harsh conditions with its deep root system and water-storing tissues. Due to its limited distribution and ecological significance, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon avanosicum"
    },
    "taxonomy_art_desc": "Acantholimon avanosicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species adapted to arid environments. Its genus is Acantholimon, a genus of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon avanosicum, a specific plant species within the genus Acantholimon, native to certain regions of the Middle East, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon avanosicum is primarily native to Turkey. It is found in specific regions within the country, particularly in the central and southern areas. This plant typically grows in rocky or stony soils, often in dry and semi-arid environments. It is adapted to the local climate and is part of the native flora of Turkey's diverse ecosystems. Its distribution is limited to certain habitats where it can thrive under local environmental conditions.",
    "distribution_introduced_art_desc": "Acantholimon avanosicum was mainly introduced to the Mediterranean region as an ornamental plant due to its striking silver foliage and resilience to drought. It is commonly found in gardens and landscaped areas in countries such as Spain, Italy, and southern France. Although it is not native to these regions, it has been widely cultivated for its aesthetic value and low maintenance requirements. Its introduction has led to its establishment in some natural habitats, raising concerns about its potential impact on local ecosystems. Despite its popularity, it is not considered invasive in most areas where it is grown."
}
