{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax spinifolius",
    "plant_slug": "acanthopanax-spinifolius",
    "plant_name_scientific": "acanthopanax spinifolius",
    "intro": "Acanthopanax spinifolius, commonly known as the Chinese skullcap or five-leaf aralia, is a deciduous shrub native to East Asia. It features compound leaves with five to seven leaflets, often with serrated edges and a rough texture. The plant produces small, yellowish-green flowers in umbel-like clusters, followed by dark blue berries that are edible but have a bitter taste. It thrives in shaded, moist environments and is often found in mountainous regions. Acanthopanax spinifolius is valued for its medicinal properties in traditional Chinese medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax spinifolius is primarily native to East Asia, including regions such as China, Korea, and Japan. It is commonly found in mountainous areas and forested regions, particularly in temperate climates. This plant thrives in moist, well-drained soils and is often associated with mixed deciduous and evergreen forests. Its natural range extends into parts of Russia and Southeast Asia as well. It is an important species in traditional medicine and ecological studies in its native habitats.",
    "distribution_introduced_art_desc": "Acanthopanax spinifolius was mainly introduced to areas with temperate climates, where it thrives in well-drained soils and full sunlight. It has been commonly found in regions of Asia, including China, Korea, and Japan, where it is used in traditional medicine. The plant is often cultivated for its medicinal properties, particularly the roots, which are believed to have various health benefits. Due to its adaptability, it has also been introduced to other parts of the world, including North America and Europe, as an ornamental and medicinal plant. However, in some regions, it has become invasive, outcompeting native species and altering local ecosystems."
}
