{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus volubilis",
    "plant_slug": "acanthus-volubilis",
    "plant_name_scientific": "acanthus volubilis",
    "intro": "Acanthus volubilis, commonly known as the creeping candleplant, is a flowering plant native to southern Africa. It is a herbaceous perennial that produces clusters of small, white to pale yellow flowers. The plant has a trailing growth habit, with slender stems that root at the nodes, allowing it to spread along the ground. Its leaves are lance-shaped and often have a soft, hairy texture. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and containers.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus volubilis"
    },
    "taxonomy_art_desc": "Acanthus volubilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with diverse morphological features. Its order is Lamiales, a group of flowering plants that includes many economically important species, such as mint and snapdragons, and is characterized by specific floral structures. Its family is Acanthaceae, commonly known as the acanthus family, which includes a wide range of flowering plants with showy flowers and often hairy leaves. Its genus is Acanthus, a group of flowering plants known for their distinctive, spiny leaves and showy, often purple or red flowers. Its species is Acanthus volubilis, a climbing plant native to southern Europe and western Asia, characterized by its trailing stems and ornamental foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Bangladesh",
        "Malaya",
        "Myanmar",
        "Nicobar Is.",
        "Thailand"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus volubilis is primarily native to the Andaman Is., Bangladesh, Malaya, Myanmar, Nicobar Is., and Thailand. This plant is commonly found in coastal and tropical regions within these areas. It thrives in sandy or rocky soils near the shoreline. The species is often seen growing along the edges of forests or in open habitats. Its distribution is closely associated with the humid and warm climates of these regions.",
    "distribution_introduced_art_desc": "Acanthus volubilis was mainly introduced to gardens and ornamental landscapes due to its striking, palmate leaves and showy, spire-like flowers. It is commonly cultivated in temperate regions for its aesthetic value and ability to thrive in a variety of soil conditions. However, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and spreading habit make it a challenge for gardeners and land managers. Despite its ornamental appeal, its ecological impact has raised concerns about its use in certain environments."
}
