{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthobotrya armata",
    "plant_slug": "acanthobotrya-armata",
    "plant_name_scientific": "acanthobotrya armata",
    "intro": "Acanthobotrya armata, commonly known as the African milk tree, is a flowering plant native to southern Africa. It belongs to the family Apocynaceae and is characterized by its distinctive, fleshy, spiny stems that store water, adapting it to arid environments. The plant produces small, fragrant flowers that are typically white or pink, which attract pollinators such as bees and butterflies. Its latex sap is toxic and has been used traditionally for various purposes, including as a remedy for skin conditions. The plant's unique morphology and ecological adaptations make it an important species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthobotrya armata is primarily native to the coastal regions of southern Africa, particularly along the southern coast of South Africa. It is commonly found in the Eastern Cape and Western Cape provinces. This plant thrives in sandy or gravelly soils near the shoreline. It is often associated with dune environments and can tolerate salt spray from the ocean. Its distribution is limited to these specific coastal habitats due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Acanthobotrya armata was mainly introduced to urban and suburban areas where it thrives in disturbed soils and along roadsides. It has been observed spreading into natural habitats, posing a threat to native plant communities. The plant's rapid growth and ability to form dense stands make it an invasive species in many regions. It is often found in areas with moderate to high sunlight and well-drained soils. Due to its aggressive nature, it requires careful management to prevent further spread."
}
