{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon koeiei",
    "plant_slug": "acantholimon-koeiei",
    "plant_name_scientific": "acantholimon koeiei",
    "intro": "Acantholimon koeiei, commonly known as the Koei's thorned candytuft, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Brassicaceae, which includes many species of mustard and related plants. The plant is characterized by its compact growth habit, with dense clusters of small, white or pale pink flowers that bloom in early summer. Its leaves are linear and often covered in fine hairs, and it produces small, capsule-like fruits that contain several seeds. Acantholimon koeiei is adapted to rocky and arid environments, making it a hardy species suitable for xerophytic gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon koeiei"
    },
    "taxonomy_art_desc": "Acantholimon koeiei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to photosynthesize. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their medicinal properties and distinctive flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon koeiei, a specific plant within the genus Acantholimon, native to certain regions of Asia, known for its unique floral structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon koeiei is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central parts. This plant thrives in rocky and arid environments, often growing at high elevations. It is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific areas within Afghanistan due to its ecological requirements.",
    "distribution_introduced_art_desc": "Acantholimon koeiei was mainly introduced to areas with well-drained soils and full sun exposure, often found in rocky or gravelly habitats. It is commonly cultivated in gardens and landscapes for its ornamental value and drought tolerance. This plant is particularly suited for xeriscaping and can thrive in regions with mild winters and hot, dry summers. It requires minimal water once established and is relatively resistant to pests and diseases. Due to its hardy nature, it has been introduced to various parts of the United States, especially in the western states."
}
