{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon bromifolium var. ilamicum",
    "plant_slug": "acantholimon-bromifolium-var-ilamicum",
    "plant_name_scientific": "acantholimon bromifolium var. ilamicum",
    "intro": "Acantholimon bromifolium var. ilamicum, commonly known as the Ilamicum thimbleweed, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features narrow, succulent leaves that are often covered in a fine layer of white wax, which helps reduce water loss in its harsh environment. Its small, blue to purple flowers appear in dense clusters during the summer months. This variety is well adapted to sandy and rocky soils, making it a resilient species in dry, coastal areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon bromifolium"
    },
    "taxonomy_art_desc": "Acantholimon bromifolium var. ilamicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a genus of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon bromifolium, a specific type within the genus known for its unique foliage and ecological adaptations to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon bromifolium var. ilamicum is primarily native to Iran. This plant is found in specific regions within Iran, particularly in the arid and semi-arid areas. It thrives in rocky and gravelly soils, often in mountainous or coastal regions. The distribution of this variety is limited to certain ecological zones within the country. It is an endemic species, meaning it is not found naturally anywhere else in the world.",
    "distribution_introduced_art_desc": "Acantholimon bromifolium var. ilamicum was mainly introduced to areas with well-drained sandy or gravelly soils, typically found in arid or semi-arid regions. It thrives in environments with low rainfall and high solar exposure, making it well-suited for coastal and inland dune habitats. This plant is often found growing in open vegetation types, such as scrublands and grasslands, where it can compete effectively with native species. Its introduction has been noted in several regions of the Mediterranean, particularly in southern Europe and parts of North Africa. Due to its hardy nature, it has become a common sight in disturbed or degraded landscapes."
}
