{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholippia trifida",
    "plant_slug": "acantholippia-trifida",
    "plant_name_scientific": "acantholippia trifida",
    "intro": "Acantholippia trifida, commonly known as the three-lobed flax or desert flax, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Apiaceae family, which includes carrots and parsley, and is characterized by its aromatic, compound leaves. The plant produces small, white to yellowish flowers arranged in umbels, which are typical of the family. It thrives in arid and semi-arid environments, often found in rocky soils and along dry streambeds. Acantholippia trifida is also valued for its historical use by indigenous peoples for medicinal and practical purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholippia trifida is primarily native to the western United States and parts of northern Mexico. It is commonly found in arid and semi-arid regions, particularly in California, Nevada, Utah, and Arizona. This plant thrives in rocky soils and is often associated with chaparral and desert scrub habitats. It is well adapted to drought conditions and can survive in areas with low precipitation. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acantholippia trifida was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, forest edges, and disturbed agricultural lands. It thrives in regions with moderate to high levels of sunlight and well-drained soils. This plant has shown invasive tendencies in some regions, outcompeting native vegetation due to its rapid growth and prolific seed production. Its introduction has led to ecological concerns in parts of North America where it has established itself in natural ecosystems. Management efforts often focus on controlling its spread through mechanical removal and herbicide application."
}
