{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon schemachense",
    "plant_slug": "acantholimon-schemachense",
    "plant_name_scientific": "acantholimon schemachense",
    "intro": "Acantholimon schemachense, commonly known as the Schemach's thornscale, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many species of flowering plants adapted to dry environments. The plant is characterized by its upright growth habit, with narrow, grass-like leaves and spikes of small, pinkish flowers. It is well-suited to rocky and sandy soils, often found in mountainous areas. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon schemachense"
    },
    "taxonomy_art_desc": "Acantholimon schemachense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex life cycles and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures and vascular systems. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their complex flower structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often featuring specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with showy flowers and often contains compounds with medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon schemachense, a specific plant species native to certain regions, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "North Caucasus",
        "Transcaucasus"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon schemachense is primarily native to the North Caucasus and Transcaucasus region. This plant is typically found in rocky and mountainous areas within these regions. It thrives in arid and semi-arid environments, often growing on slopes and in crevices. The species is adapted to the harsh climatic conditions of the area, including high altitude and low precipitation. Its distribution is limited to specific habitats in this geographic range.",
    "distribution_introduced_art_desc": "Acantholimon schemachense was mainly introduced to the Mediterranean Basin and parts of southern Europe. It is commonly found in rocky and gravelly soils, often in mountainous regions. This plant has been reported in countries such as Spain, Italy, and Greece. It thrives in dry, sunny environments with well-drained soil. Its introduction is likely due to its ornamental value and adaptability to various climates."
}
