{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum consobrinum",
    "plant_slug": "acanthospermum-consobrinum",
    "plant_name_scientific": "acanthospermum consobrinum",
    "intro": "Acanthospermum consobrinum, commonly known as the velvetleaf, is a flowering plant native to tropical and subtropical regions. It belongs to the family Asteraceae, characterized by its composite flower heads. The plant is known for its hairy, velvety leaves that give it its common name. It produces small, yellowish flowers that are clustered in dense heads. Acanthospermum consobrinum is often found in disturbed soils and can be invasive in certain areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acanthospermum",
        "species": "Acanthospermum consobrinum"
    },
    "taxonomy_art_desc": "Acanthospermum consobrinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group that includes many flowering plants with a wide variety of morphological features and reproductive structures. Its order is Asterales, which consists of flowering plants that typically have composite flowers and are often found in diverse habitats. Its family is Asteraceae, commonly known as the sunflower family, characterized by their unique flower heads composed of many small flowers. Its genus is Acanthospermum, a group of flowering plants typically found in tropical and subtropical regions, often with spiny or thorny structures. Its species is Acanthospermum consobrinum, a specific plant within this genus known for its distinctive morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Paraguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum consobrinum is primarily native to Paraguay. It is commonly found in the grasslands and open habitats of the region. This plant thrives in dry and semi-arid environments. It is often seen growing along roadsides and in disturbed areas. Its native distribution is largely confined to the southern part of Paraguay.",
    "distribution_introduced_art_desc": "Acanthospermum consobrinum was mainly introduced to the United States as an ornamental plant due to its attractive foliage and growth habit. It is commonly found in the southern regions, particularly in Texas and Florida, where it thrives in warm, sunny environments. This plant has also been reported in parts of California and the Gulf Coast states. Its introduction has led to its establishment in some natural areas, raising concerns about its potential invasive behavior. Despite its ornamental appeal, it is important to monitor its spread to prevent ecological disruption."
}
