{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon poliochlorum",
    "plant_slug": "acantholimon-poliochlorum",
    "plant_name_scientific": "acantholimon poliochlorum",
    "intro": "Acantholimon poliochlorum, commonly known as the pale-green flaxgrass, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Amaranthaceae and is characterized by its erect, hairy stems and narrow, grass-like leaves. The plant produces small, clustered flowers that are typically greenish or reddish in color. It is adapted to thrive in dry, saline environments, making it a resilient species in harsh climates. Due to its unique morphology and ecological niche, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon poliochlorum"
    },
    "taxonomy_art_desc": "Acantholimon poliochlorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which consists of vascular plants that include ferns, horsetails, and their relatives, known for their primitive vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse flower structures and reproductive systems. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, known for their distinctive flower morphology and often having betalain pigments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes herbs and shrubs with distinctive blue or violet flowers and often containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or coastal regions, characterized by their spiny or prickly stems and small, clustered flowers. Its species is Acantholimon poliochlorum, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon poliochlorum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central highlands. This plant thrives in rocky and arid environments, often growing at higher elevations. It is adapted to the harsh climate and limited soil conditions typical of its native habitat. Due to its restricted distribution, it is considered a rare and endemic species in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon poliochlorum was mainly introduced to the Mediterranean region, particularly in areas with rocky and coastal habitats. It has been reported in countries such as Spain, Italy, and Greece, where it thrives in dry, sunny conditions. This plant is often found in disturbed soils and can colonize areas with low nutrient availability. Its introduction has raised concerns due to its potential to outcompete native species in certain environments. However, it is not considered highly invasive and is more of a casual weed in these regions."
}
