{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon khorassanicum",
    "plant_slug": "acantholimon-khorassanicum",
    "plant_name_scientific": "acantholimon khorassanicum",
    "intro": "Acantholimon khorassanicum, commonly known as the Khorasan thornweed, is a flowering plant native to Central Asia, particularly found in regions of Kazakhstan and Uzbekistan. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy flowers. The plant is characterized by its succulent, fleshy leaves and clusters of small, pinkish-white flowers that bloom in late spring to early summer. It thrives in arid and semi-arid environments, often growing in rocky or sandy soils. Due to its limited distribution and specific habitat requirements, it is considered a rare and endemic species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon khorassanicum is primarily native to Central Asia, specifically regions such as Kazakhstan, Uzbekistan, and western Turkmenistan. It is commonly found in arid and semi-arid environments, including rocky slopes and gravelly soils. This plant thrives in areas with low precipitation and high solar exposure. It is often associated with steppe and desert steppe biomes. Due to its specific habitat requirements, it is considered a rare and localized species in its native range.",
    "distribution_introduced_art_desc": "Acantholimon khorassanicum was mainly introduced to areas with arid or semi-arid climates, particularly in regions with well-drained soils. It thrives in environments with low precipitation and high sunlight exposure, making it suitable for xerophytic landscapes. This plant is often found in rocky or gravelly soils, where it can establish itself without requiring frequent watering. Its introduction has been noted in parts of Central Asia and the Middle East, where it has adapted to the local ecological conditions. Due to its hardy nature, it is sometimes used in landscaping and restoration projects in dry regions."
}
