{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ilicifolius var. xiamenensis",
    "plant_slug": "acanthus-ilicifolius-var-xiamenensis",
    "plant_name_scientific": "acanthus ilicifolius var. xiamenensis",
    "intro": "Acanthus ilicifolius var. xiamenensis, commonly known as the Xiamen acanthus, is a rare variant of the acanthus plant native to southern China. It is characterized by its distinctive, palmate leaves that are often covered in a dense layer of soft, fuzzy hair. The plant produces spiny, egg-shaped fruits that contain seeds, which are dispersed by wind. It thrives in moist, shaded environments, typically along rocky stream banks or in forest understories. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ilicifolius var. xiamenensis is primarily native to southern China, particularly the coastal regions of Fujian Province. This variety is commonly found in rocky coastal areas and cliffs along the southern coast. It thrives in humid, subtropical climates with well-drained soil. The plant is often associated with maritime environments and is sometimes found in tidal zones. Due to its limited distribution, it is considered a rare and endemic species in this region.",
    "distribution_introduced_art_desc": "Acanthus ilicifolius var. xiamenensis was mainly introduced to coastal areas of southern China, particularly in the city of Xiamen. It thrives in sandy or rocky soils and is often found near the shoreline. This variety is valued for its ornamental foliage and is commonly cultivated in gardens and public spaces. It has also been introduced to other parts of Southeast Asia due to its adaptability and aesthetic appeal. However, its spread is limited by its preference for specific environmental conditions."
}
