{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum krascheninnikovii",
    "plant_slug": "acanthophyllum-krascheninnikovii",
    "plant_name_scientific": "acanthophyllum krascheninnikovii",
    "intro": "Acanthophyllum krascheninnikovii, commonly known as the Krascheninnikov's thornsteppe, is a flowering plant native to the arid regions of Central Asia. It belongs to the Amaranthaceae family and is characterized by its low-growing, succulent appearance with dense clusters of spiny leaves. The plant produces small, greenish flowers that are typically clustered in dense inflorescences. It is well adapted to harsh environments, with deep root systems and thick, waxy leaves that help conserve water. This species plays an important ecological role in stabilizing sandy soils and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum krascheninnikovii"
    },
    "taxonomy_art_desc": "Acanthophyllum krascheninnikovii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which includes vascular plants with a diverse range of forms, including ferns and some primitive seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Caryophyllales, which consists of flowering plants often with distinctive floral morphology and includes families such as Cactaceae and Amaranthaceae. Its family is Caryophyllaceae, commonly known as the carnation family, which includes herbaceous plants with showy flowers and is often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum krascheninnikovii, a specific type of flowering plant native to Central Asia, known for its adaptations to harsh, dry conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Turkmenistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum krascheninnikovii is primarily native to Turkmenistan and Uzbekistan. It is commonly found in arid and semi-arid regions, particularly in sandy and gravelly soils. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays an important role in stabilizing soil and preventing erosion in its native habitat. Its distribution is largely restricted to the central and southern parts of these countries.",
    "distribution_introduced_art_desc": "Acanthophyllum krascheninnikovii was mainly introduced to arid and semi-arid regions of Central Asia, particularly in countries like Kazakhstan, Mongolia, and China. It is commonly found in sandy and gravelly soils, often growing in dunes and along riverbanks. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a crucial role in stabilizing sand dunes and preventing soil erosion. Its distribution is largely influenced by its ability to thrive in nutrient-poor environments."
}
