{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthonychia polycnemoides",
    "plant_slug": "acanthonychia-polycnemoides",
    "plant_name_scientific": "acanthonychia polycnemoides",
    "intro": "Acanthonychia polycnemoides, commonly known as the smoothleaf acanthonychia, is a species of flowering plant native to the southwestern United States and northern Mexico. It belongs to the Apiaceae family, which includes carrots and parsley, and is characterized by its finely divided, feathery leaves. The plant produces small, yellowish flowers arranged in umbels, typical of the family. It thrives in dry, rocky soils and is often found in desert or semi-arid environments. Its botanical features make it an interesting subject for study in arid ecosystem botany.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthonychia polycnemoides is primarily native to the southern United States, particularly Texas and New Mexico. It is also found in parts of northern Mexico, including the states of Chihuahua and Coahuila. This plant typically grows in arid or semi-arid environments, such as grasslands and rocky soils. It is often associated with disturbed or open habitats where it can receive adequate sunlight. Due to its limited range, it is considered a rare and localized species within its native distribution.",
    "distribution_introduced_art_desc": "Acanthonychia polycnemoides was mainly introduced to new habitats through human activities such as horticulture and accidental transport. It has established itself in disturbed soils and open areas, often outcompeting native vegetation. The plant thrives in regions with moderate temperatures and well-drained soils. Its spread has been documented in several countries, particularly in areas with similar climatic conditions to its native range. Due to its invasive potential, it is now considered a threat to local ecosystems in some regions."
}
