{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum bracteatum",
    "plant_slug": "acanthophyllum-bracteatum",
    "plant_name_scientific": "acanthophyllum bracteatum",
    "intro": "Acanthophyllum bracteatum, commonly known as the desert sandmat, is a flowering plant native to arid regions of Central Asia. It is a low-growing shrub characterized by its dense, spiny foliage and small, yellow flowers that bloom in summer. The plant has adapted to harsh environments through its succulent stems and reduced leaves, which help minimize water loss. Its root system is extensive, allowing it to access deep groundwater in sandy soils. This species plays an important ecological role in stabilizing dunes and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum bracteatum"
    },
    "taxonomy_art_desc": "Acanthophyllum bracteatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often hairy leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum bracteatum, a specific plant within this genus known for its unique adaptations to harsh environments and its role in local ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq",
        "Pakistan",
        "Saudi Arabia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum bracteatum is primarily native to Iran, Iraq, Pakistan, and Saudi Arabia. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in sandy or gravelly soils and is adapted to the harsh climatic conditions of the Middle East. The species is often seen in coastal dunes and inland deserts. Its distribution is closely linked to the ecological zones of these regions.",
    "distribution_introduced_art_desc": "Acanthophyllum bracteatum was mainly introduced to arid and semi-arid regions of the Middle East and Central Asia. It is commonly found in sandy and gravelly soils, often in desert steppe and shrubland ecosystems. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has raised concerns about its potential impact on native flora in invaded areas."
}
