{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon oopodum",
    "plant_slug": "acantholimon-oopodum",
    "plant_name_scientific": "acantholimon oopodum",
    "intro": "Acantholimon oopodum, commonly known as the narrowleaf sandthrift, is a flowering plant native to the arid regions of western North America. It is a member of the Plumbagaceae family and is characterized by its low-growing, mat-forming structure with gray-green, lance-shaped leaves. The plant produces small, blue to purple flowers that bloom in late spring to early summer. It is adapted to sandy and rocky soils, thriving in environments with full sun and minimal water. Acantholimon oopodum is often found in desert scrub and coastal dunes, playing a role in stabilizing soil and supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon oopodum is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal areas and along the Pacific coast, where it thrives in sandy or gravelly soils. This plant is often associated with dunes and maritime scrub habitats, where it is adapted to salty and windy conditions. It plays an important ecological role in stabilizing coastal dunes and providing habitat for local wildlife. Due to its limited range, it is considered a rare and endangered species in some regions.",
    "distribution_introduced_art_desc": "Acantholimon oopodum was mainly introduced to new environments through human activities such as gardening and landscaping. It is commonly found in disturbed soils and areas with poor drainage, making it adaptable to a variety of conditions. This plant has spread to regions outside its native range, including parts of North America and Europe. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental appeal, careful management is necessary to prevent its spread into natural habitats."
}
