{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon szovitzii",
    "plant_slug": "acantholimon-szovitzii",
    "plant_name_scientific": "acantholimon szovitzii",
    "intro": "Acantholimon szovitzii, commonly known as the Szovitz's thornstep, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its erect, branched stems and small, blue to purple flowers. The plant typically grows in rocky or sandy soils and thrives in arid or semi-arid environments. Its leaves are usually linear and covered in a fine layer of white wax, which helps reduce water loss. Acantholimon szovitzii is often found in high-altitude habitats, where it plays a role in stabilizing soil and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon szovitzii is primarily native to the high mountain regions of the Eastern Carpathians, specifically in Hungary and northern Serbia. It is found in rocky and limestone habitats at elevations ranging from 1,200 to 2,200 meters. This species is endemic to this region, meaning it is not found anywhere else in the world. It thrives in well-drained soils and is often associated with alpine meadows and grasslands. Due to its limited distribution, it is considered a rare and vulnerable plant species.",
    "distribution_introduced_art_desc": "Acantholimon szovitzii was mainly introduced to areas with rocky or gravelly soils, particularly in arid and semi-arid regions. It thrives in environments with low moisture and high sunlight exposure, making it common in mountainous and coastal areas. This plant is often found in disturbed soils, such as those near roadsides or in abandoned fields. Its introduction has been noted in several regions of Europe, including parts of Spain and Italy. However, its spread is limited by its specific ecological requirements and climate constraints."
}
