{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax evodiifolius var. gracilis",
    "plant_slug": "acanthopanax-evodiifolius-var-gracilis",
    "plant_name_scientific": "acanthopanax evodiifolius var. gracilis",
    "intro": "Acanthopanax evodiifolius var. gracilis, commonly known as the slender five-leaf ginseng, is a variant of the five-leaf ginseng species native to East Asia. It is characterized by its slender stems and trifoliate or five-leaf compound leaves, which are often used in traditional medicine. The plant produces small, greenish-yellow flowers followed by red berries, which are edible and used in herbal remedies. It thrives in shaded, moist environments and is often found in forest understories. Its botanical features make it a valuable plant in both ecological and medicinal contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax evodiifolius var. gracilis is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It thrives in temperate climates and is commonly found in forested areas at moderate elevations. This variant is particularly associated with the Korean Peninsula and parts of northeastern China. It prefers well-drained soils and is often seen in mixed hardwood forests. The plant is valued for its medicinal properties and is sometimes used in traditional herbal remedies.",
    "distribution_introduced_art_desc": "Acanthopanax evodiifolius var. gracilis was mainly introduced to areas with temperate climates and well-drained soils, often found in forested regions. It thrives in regions with moderate rainfall and partial to full sunlight. This variety is commonly found in the northern parts of its native range, including parts of East Asia. It has been introduced to several regions outside its native habitat for ornamental or medicinal purposes. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
