{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum caespitosum",
    "plant_slug": "acanthophyllum-caespitosum",
    "plant_name_scientific": "acanthophyllum caespitosum",
    "intro": "Acanthophyllum caespitosum, commonly known as the sandmat, is a flowering plant native to arid and semi-arid regions of central Asia. It is a shrub-like plant characterized by its dense, compact growth habit and spiny leaves. The plant produces small, yellowish flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its adaptations include deep root systems and reduced leaf surface to minimize water loss in harsh environments. Acanthophyllum caespitosum plays a vital role in stabilizing sandy soils and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum caespitosum"
    },
    "taxonomy_art_desc": "Acanthophyllum caespitosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a large group of flowering plants characterized by diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes many economically important species such as beets and cacti. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments with spiny leaves. Its species is Acanthophyllum caespitosum, a specific type of plant known for its dense, spiny growth and adaptation to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum caespitosum is primarily native to Iran and Iraq. It is commonly found in arid and semi-arid regions of these countries. This plant thrives in sandy or gravelly soils and is well adapted to the harsh climate of its native habitat. It plays an important role in stabilizing dunes and preventing soil erosion. Its distribution is closely linked to the ecological conditions of the Middle East.",
    "distribution_introduced_art_desc": "Acanthophyllum caespitosum was mainly introduced to areas with arid and semi-arid climates, particularly in regions with well-drained soils. It is commonly found in sandy or gravelly soils, often in desert or steppe environments. This plant is adapted to withstand high temperatures and low precipitation, making it a resilient species in harsh conditions. It plays a role in stabilizing soil and preventing erosion in these ecosystems. Its introduction has been noted in parts of North America, including the southwestern United States and northern Mexico."
}
