{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax cissifolius var. scandens",
    "plant_slug": "acanthopanax-cissifolius-var-scandens",
    "plant_name_scientific": "acanthopanax cissifolius var. scandens",
    "intro": "Acanthopanax cissifolius var. scandens, commonly known as the climbing devil's ivy, is a variant of the species native to East Asia. It is a woody vine characterized by its climbing habit and distinctive, elongated leaves. The plant features small, greenish-white flowers that appear in clusters, followed by red berries that are edible for birds. Its adaptability to various soil types and tolerance to shade make it a common ornamental plant. However, it can become invasive in certain regions if not properly managed.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax cissifolius var. scandens is primarily native to Southeast Asia, including countries such as China, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in forested areas and mountainous regions. This plant thrives in humid climates with well-drained soil and partial to full shade. It is often encountered in secondary forests and along riverbanks. Its distribution is also extended to parts of India and the Pacific Islands.",
    "distribution_introduced_art_desc": "Acanthopanax cissifolius var. scandens was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions of eastern Asia. It thrives in forested environments and is often found growing along stream banks and in shaded understories. This plant is known for its climbing habit and is commonly used in traditional medicine for its purported health benefits. Its introduction has led to its establishment in some non-native regions, where it can sometimes become invasive. Due to its adaptability, it is often cultivated for ornamental purposes in gardens and landscapes."
}
