{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hamadannicum",
    "plant_slug": "acantholimon-hamadannicum",
    "plant_name_scientific": "acantholimon hamadannicum",
    "intro": "Acantholimon hamadannicum, commonly known as the Persian stonecrop, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy leaves that help it retain moisture in dry environments. The plant produces small, clustered flowers that are typically pink or purple, blooming in the summer months. It is well adapted to rocky and sandy soils, making it a resilient species in harsh climates. Due to its ornamental value and hardy nature, it is sometimes cultivated in gardens in regions with similar climatic conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hamadannicum"
    },
    "taxonomy_art_desc": "Acantholimon hamadannicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle with a dominant sporophyte stage. Its class is Equisetopsida, which encompasses ferns and their allies, characterized by vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often aromatic. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often produce betalain pigments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon hamadannicum, a specific plant within the genus Acantholimon, native to certain regions of the Middle East and characterized by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hamadannicum is primarily native to Iran. This plant is found in the arid and semi-arid regions of the country. It thrives in rocky and sandy soils, often in mountainous areas. Its distribution is limited to specific habitats within Iran's central and eastern regions. It is a member of the Plumbagaceae family and is adapted to the harsh climate of its native environment.",
    "distribution_introduced_art_desc": "Acantholimon hamadannicum was mainly introduced to areas with specific ecological conditions, such as well-drained soils and moderate climates. It is often found in rocky or gravelly habitats, typically in regions with a Mediterranean climate. This plant has been introduced to several parts of the world, including parts of Europe and North America, where it has established itself in disturbed or semi-natural environments. Its introduction is largely due to human activities, such as horticultural trade and accidental dispersal. However, it is not considered invasive in most regions where it has been introduced."
}
