{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax yui var. parvispinosus",
    "plant_slug": "acanthopanax-yui-var-parvispinosus",
    "plant_name_scientific": "acanthopanax yui var. parvispinosus",
    "intro": "Acanthopanax yui var. parvispinosus, commonly known as the small-spined Chinese angel's trumpet, is a climbing shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves and clusters of small, fragrant flowers. The plant produces red berries that are edible but often have a bitter taste. It thrives in shaded to semi-shaded environments and is often found in forested areas. Its ornamental value makes it a popular choice for horticultural use in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax yui var. parvispinosus is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Sichuan. This variant thrives in temperate to subtropical climates, often found in dense forests and rocky hillsides. It is commonly associated with areas of high biodiversity and is well adapted to the region's moist, cool conditions. The plant is also occasionally found in adjacent regions of northern Vietnam. Its distribution is limited to these specific ecological niches, reflecting its preference for particular soil and climate conditions.",
    "distribution_introduced_art_desc": "Acanthopanax yui var. parvispinosus was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions of East Asia. It thrives in forested environments and is commonly found in mountainous regions of China. This plant is often cultivated for its ornamental value due to its unique foliage and growth habit. It has also been introduced to other parts of the world as a horticultural specimen. However, its spread is limited due to specific environmental requirements and potential ecological constraints."
}
