{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium leucanthum",
    "plant_slug": "acanthocalycium-leucanthum",
    "plant_name_scientific": "acanthocalycium leucanthum",
    "intro": "Acanthocalycium leucanthum, commonly known as the White-flowered Prickly Pear, is a species of cactus native to the southwestern United States and northern Mexico. It is characterized by its rounded, ribbed stems that are covered in white to pale blue spines. The plant produces showy, white or pale yellow flowers during the summer months. It thrives in well-drained soil and full sun, making it well-suited for arid and semi-arid environments. Its compact size and ornamental flowers make it a popular choice for rock gardens and xeriscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocalycium",
        "species": "Acanthocalycium leucanthum"
    },
    "taxonomy_art_desc": "Acanthocalycium leucanthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and beets, known for their diverse morphologies and adaptations. Its family is Cactaceae, commonly known as the cactus family, which includes succulent plants adapted to arid environments. Its genus is Acanthocalycium, a group of cacti characterized by their spiny stems and flowers, typically found in South America. Its species is Acanthocalycium leucanthum, a specific type of cactus known for its distinctive features and habitat preferences in the Andes region.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium leucanthum is primarily native to Argentina Northwest. This species is found in the arid and semi-arid regions of the northwest part of Argentina. It typically grows in rocky soils and is adapted to the harsh climate of the region. The plant is part of the Cactaceae family and is known for its distinctive appearance. Its natural habitat includes areas with limited rainfall and high solar exposure.",
    "distribution_introduced_art_desc": "Acanthocalycium leucanthum was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of North America, particularly in the southwestern United States and northern Mexico. This plant is often cultivated in rock gardens and as a decorative succulent due to its unique appearance. It requires minimal water and full sun exposure to flourish. Its introduction has been largely limited to horticultural and ornamental purposes."
}
