{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza arborea",
    "plant_slug": "acanthorhiza-arborea",
    "plant_name_scientific": "acanthorhiza arborea",
    "intro": "Acanthorhiza arborea, commonly known as the tree hibiscus, is a flowering plant native to tropical regions of Africa. It is a shrub or small tree that typically grows up to 5 meters in height. The plant has woody stems with thick, leathery leaves that are often lobed or serrated. Its flowers are showy, with five petals and a prominent central column, and it produces capsule fruits containing numerous seeds. Acanthorhiza arborea is valued for its ornamental appeal and has traditional uses in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza arborea is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in wetland environments such as swamps, marshes, and along the edges of ponds. This plant is commonly found in areas with saturated soils and high humidity. It plays an important role in the ecological balance of these wetland habitats. Due to its specific habitat requirements, it is often considered a indicator species for healthy wetland ecosystems.",
    "distribution_introduced_art_desc": "Acanthorhiza arborea was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed soils and areas with moderate moisture levels. This plant has adapted well to various climates, allowing it to spread beyond its native range. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. However, it is currently considered a non-native species with limited ecological impact in most regions."
}
