{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum glabratum",
    "plant_slug": "acanthospermum-glabratum",
    "plant_name_scientific": "acanthospermum glabratum",
    "intro": "Acanthospermum glabratum, commonly known as the hairy sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Acanthaceae family and is characterized by its erect, branched stems and opposite, lance-shaped leaves. The plant produces small, tubular flowers that are typically pink or purple, arranged in dense clusters at the ends of the branches. It thrives in sandy or gravelly soils and is often found in arid or semi-arid environments. Due to its drought tolerance and ornamental value, it is occasionally cultivated in gardens in suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acanthospermum",
        "species": "Acanthospermum glabratum"
    },
    "taxonomy_art_desc": "Acanthospermum glabratum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a distinctive morphology, including horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and modern species with a wide range of morphological diversity. Its order is Asterales, which consists of flowering plants known for their showy flowers and includes families such as the sunflowers and daisies. Its family is Asteraceae, commonly known as the aster family, which is characterized by composite flower heads and includes a vast number of species. Its genus is Acanthospermum, a group of flowering plants typically found in tropical and subtropical regions, often with spiny or thorny structures. Its species is Acanthospermum glabratum, a specific plant within this genus known for its smooth surfaces and adapted to grow in specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [
        "Botswana",
        "Cape Provinces",
        "DR Congo",
        "Free State",
        "Kenya",
        "KwaZulu-Natal",
        "Lesotho",
        "Mozambique",
        "Northern Provinces",
        "Réunion",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acanthospermum glabratum is primarily native to Brazil Southeast. It is commonly found in the coastal regions of this area. This plant thrives in sandy soils and is often seen in dune environments. It is an important part of the local flora in these regions. Its distribution is largely restricted to the southeastern part of Brazil.",
    "distribution_introduced_art_desc": "Acanthospermum glabratum was mainly introduced to Botswana, Cape Provinces, DR Congo, Free State, Kenya, KwaZulu-Natal, Lesotho, Mozambique, Northern Provinces, Réunion, and Zimbabwe. It is commonly found in various habitats across these regions, including grasslands and disturbed areas. The plant is known for its adaptability to different environmental conditions. Its introduction has been associated with human activities such as agriculture and land clearing. It has become naturalized in many of these areas, contributing to local biodiversity."
}
