{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus tepalcatepecanus",
    "plant_slug": "acanthocereus-tepalcatepecanus",
    "plant_name_scientific": "acanthocereus tepalcatepecanus",
    "intro": "Acanthocereus tepalcatepecanus, commonly known as the Tepalcatepec cactus, is a species of flowering cactus native to Mexico. It is characterized by its cylindrical stem and clusters of white to pale yellow flowers. The plant typically grows in rocky or sandy soils and is adapted to arid environments. It belongs to the Cactaceae family and is known for its ability to store water in its stem. Due to its limited distribution, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus tepalcatepecanus"
    },
    "taxonomy_art_desc": "Acanthocereus tepalcatepecanus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Caryophyllales, which comprises flowering plants with a diverse range of forms, including cacti and carnations. Its family is Cactaceae, commonly known as cacti, which are characterized by their succulent stems and spines. Its genus is Acanthocereus, a group of cacti typically found in arid regions, known for their cylindrical stems and nocturnal blooming. Its species is Acanthocereus tepalcatepecanus, a specific type of cactus native to Mexico, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus tepalcatepecanus is primarily native to Mexico Southwest. This cactus species is found in the arid and semi-arid regions of this area. It thrives in rocky soils and is commonly found in desert environments. The plant is well adapted to the harsh climate of the region. Its distribution is limited to specific locations within Mexico's southwestern states.",
    "distribution_introduced_art_desc": "Acanthocereus tepalcatepecanus was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for xerophytic environments. This plant is often cultivated in gardens and landscapes as an ornamental species due to its unique appearance. Its introduction has been primarily for horticultural purposes rather than for ecological or agricultural reasons. However, its spread in non-native regions requires monitoring to prevent potential ecological impacts."
}
