{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium capense var. inermis",
    "plant_slug": "acanthodium-capense-var-inermis",
    "plant_name_scientific": "acanthodium capense var. inermis",
    "intro": "Acanthodium capense var. inermis, commonly known as the smooth acanthodium, is a succulent plant native to South Africa. It belongs to the Aizoaceae family, characterized by its fleshy, often hairy leaves and showy flowers. The plant features cylindrical, branching stems covered in small, spineless tubercles. Its flowers are typically yellow or orange, appearing in clusters during the warmer months. It thrives in well-drained, sandy soils and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium capense var. inermis is primarily native to the coastal regions of southern Africa, particularly Namibia and southwestern Angola. It thrives in sandy or gravelly soils along the Atlantic coastline. This plant is commonly found in dune environments and coastal grasslands. It is well adapted to the arid and semi-arid conditions of its native habitat. Its distribution is limited to specific areas where the climate and soil conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Acanthodium capense var. inermis was mainly introduced to South Africa, particularly in the Western Cape region. It is commonly found in coastal areas and sandy soils, often growing in disturbed or open habitats. This plant is known for its distinctive, spiny leaves and is adapted to the Mediterranean climate of the region. It has been observed in both natural and cultivated settings, contributing to local biodiversity. However, its introduction status remains unclear, as it may be either native or non-native to certain areas."
}
