{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon revolutum",
    "plant_slug": "acantholimon-revolutum",
    "plant_name_scientific": "acantholimon revolutum",
    "intro": "Acantholimon revolutum, commonly known as the curled sandthorn, is a flowering plant native to the arid regions of Central Asia and the Middle East. It belongs to the family Caryophyllaceae and is characterized by its erect, branched stems and small, scale-like leaves that help reduce water loss in its harsh environment. The plant produces clusters of small, pale pink to white flowers that bloom in late spring to early summer. It is well adapted to sandy and rocky soils, often found in dry steppe and desert habitats. Due to its low-growing form and drought tolerance, it is sometimes used in xeriscaping and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon revolutum"
    },
    "taxonomy_art_desc": "Acantholimon revolutum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and chlorophyll-based photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and their allies, known for their ancient lineage and diverse morphological forms. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with distinctive flower structures and sometimes specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes species with showy flowers and some containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and often showy flowers. Its species is Acantholimon revolutum, a specific plant within the genus Acantholimon, known for its distinctive morphology and ecological adaptations to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon revolutum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant thrives in arid and semi-arid environments, often growing in rocky or gravelly soils. It is commonly associated with high-altitude grasslands and shrublands. Due to its limited distribution, it is considered a rare and endemic species in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon revolutum was mainly introduced to areas with well-drained soils and full sun exposure, often found in coastal and inland dunes. It is commonly established in disturbed sites such as roadsides, gravelly slopes, and sandy soils. This plant is typically found in regions with a Mediterranean climate, characterized by dry summers and wet winters. It has been reported in several states along the western United States, including California, Oregon, and Nevada. Due to its adaptability, it can spread rapidly in areas where it is not native."
}
