{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum heratense",
    "plant_slug": "acanthophyllum-heratense",
    "plant_name_scientific": "acanthophyllum heratense",
    "intro": "Acanthophyllum heratense, commonly known as the Herat spiny gram, is a flowering plant native to Afghanistan and Pakistan. It belongs to the Amaranthaceae family and is characterized by its succulent, spiny stems and small, clustered leaves. The plant is adapted to arid and semi-arid environments, exhibiting drought resistance through its thick, fleshy stems that store water. It produces small, inconspicuous flowers that are typically green or yellowish in color. This species is of interest for its potential in ecological restoration and as a source of forage in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum heratense is primarily native to the mountainous regions of central Asia, particularly in Afghanistan and parts of northern Pakistan. It is commonly found in arid and semi-arid environments, growing in rocky and gravelly soils. This plant thrives in high-altitude areas, often in steppe and desert steppe ecosystems. It is well adapted to harsh climatic conditions, including low precipitation and extreme temperature fluctuations. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthophyllum heratense was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Afghanistan and parts of Pakistan. It is adapted to harsh environmental conditions, including high temperatures and low precipitation. This plant is often found in rocky and sandy soils, thriving in areas with minimal water availability. Its introduction has been noted in ecological studies focusing on drought-resistant flora. It plays a role in stabilizing soil and preventing erosion in its native habitat."
}
