{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon haussknechtii",
    "plant_slug": "acantholimon-haussknechtii",
    "plant_name_scientific": "acantholimon haussknechtii",
    "intro": "Acantholimon haussknechtii, commonly known as the Hausseckner's thornsteppe, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming structure with succulent leaves. The plant produces small, blue to purple flowers during the summer months, which attract pollinators such as bees and butterflies. It is adapted to harsh environments, with thick leaves that store water and reduce transpiration. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon haussknechtii"
    },
    "taxonomy_art_desc": "Acantholimon haussknechtii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their showy flowers and complex reproductive mechanisms. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often have specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with small, showy flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon haussknechtii, a specific type of plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iraq",
        "Lebanon-Syria",
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon haussknechtii is primarily native to Iraq, Lebanon-Syria, Transcaucasus, and Turkey. This plant is typically found in arid and semi-arid regions within these areas. It thrives in rocky and gravelly soils, often in mountainous or coastal habitats. The species is adapted to the Mediterranean climate characterized by hot, dry summers and mild, wet winters. Its distribution reflects its preference for well-drained soils and limited water availability.",
    "distribution_introduced_art_desc": "Acantholimon haussknechtii was mainly introduced to areas with well-drained soils and moderate to high elevations, typically found in mountainous regions. It thrives in environments with full sun exposure and is often found in rocky or gravelly habitats. This plant is particularly adapted to arid and semi-arid climates, making it a common species in regions with low precipitation. Its distribution is largely limited to the Mediterranean climate zones of southern Europe and parts of North Africa. Due to its specific ecological requirements, it is not commonly found in areas with high humidity or poor drainage."
}
