{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalyx alba",
    "plant_slug": "acanthocalyx-alba",
    "plant_name_scientific": "acanthocalyx alba",
    "intro": "Acanthocalyx alba, commonly known as white acanthocalyx, is a flowering plant native to tropical regions of Africa. It belongs to the Rubiaceae family, which includes coffee and gardenias. The plant is characterized by its simple, opposite leaves and small, white or pale yellow flowers that bloom in clusters. It is often found in moist, shaded environments such as forest understories. The species is valued for its ornamental appeal and has some traditional medicinal uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalyx alba is primarily native to tropical and subtropical regions of Asia, including countries such as India, Sri Lanka, and parts of Southeast Asia. It is commonly found in forested areas, particularly in the understory of moist evergreen and semi-evergreen forests. The plant thrives in humid climates with well-drained soil, often growing along riverbanks or in shaded, moist environments. It is also present in some regions of Africa, though its distribution there is less widespread. Due to its ornamental value, it has been introduced to other parts of the world, but it remains most closely associated with its native Asian habitats.",
    "distribution_introduced_art_desc": "Acanthocalyx alba was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in tropical and subtropical regions. It thrives in environments with high humidity and warm temperatures, making it suitable for cultivation in regions such as Southeast Asia, parts of Africa, and the Caribbean. This plant is often found near water sources like rivers, streams, and wetlands, where it can establish itself readily. Its introduction has been noted in several ecological studies due to its rapid growth and ability to colonize disturbed sites. However, it is important to monitor its spread to prevent potential ecological impacts in non-native habitats."
}
