{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocladus colombianus",
    "plant_slug": "acanthocladus-colombianus",
    "plant_name_scientific": "acanthocladus colombianus",
    "intro": "Acanthocladus colombianus, commonly known as the Colombian acanthocladus, is a rare flowering plant native to the Andean region of Colombia. It belongs to the family Acanthocladaceae and is characterized by its small, clustered inflorescences and narrow, lance-shaped leaves. The plant typically grows in high-altitude cloud forests, where it thrives in moist, shaded environments. Its flowers are usually white or pale yellow, and it produces small, capsule-like fruits. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from habitat loss and climate change.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Polygalaceae",
        "genus": "Acanthocladus",
        "species": "Acanthocladus colombianus"
    },
    "taxonomy_art_desc": "Acanthocladus colombianus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall and complex vascular systems. Its class is Equisetopsida, which comprises ferns and their allies, known for having true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have legume-like fruits and are often associated with nitrogen-fixing bacteria. Its family is Polygalaceae, a family of flowering plants commonly known as milkvetches, characterized by their distinctive flowers and often woody or herbaceous growth forms. Its genus is Acanthocladus, a group of flowering plants typically found in tropical and subtropical regions, known for their unique floral structures and ecological adaptations. Its species is Acanthocladus colombianus, a specific plant species native to Colombia, distinguished by its morphological traits and ecological niche within its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocladus colombianus is primarily native to Colombia. It is found in the tropical and subtropical regions of the country. This plant typically grows in humid, shaded environments within the Andean foothills and lowland forests. It is an important component of the local flora in these ecosystems. Its distribution is largely restricted to specific microhabitats in Colombia.",
    "distribution_introduced_art_desc": "Acanthocladus colombianus was mainly introduced to areas with high humidity and well-drained soils, typically found in tropical and subtropical regions. It thrives in environments with ample sunlight and moderate temperatures, making it suitable for cultivation in warm climates. This plant is often used in ornamental landscaping due to its attractive foliage and hardy nature. Its introduction has been primarily for horticultural purposes, enhancing the aesthetic value of gardens and public spaces. However, it is important to monitor its spread to prevent potential ecological impacts in non-native habitats."
}
