{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosyris falcata",
    "plant_slug": "acanthosyris-falcata",
    "plant_name_scientific": "acanthosyris falcata",
    "intro": "Acanthosyris falcata, commonly known as the narrow-leaved acanthosyris, is a shrub native to the arid regions of South Africa. It belongs to the Asteraceae family and is characterized by its narrow, lance-shaped leaves that are often covered in fine hairs. The plant produces yellow flowers arranged in clusters, which bloom during the summer months. It is adapted to survive in dry conditions with deep roots and minimal water requirements. Acanthosyris falcata is often found in rocky or sandy soils and is valued for its ornamental appeal and ecological importance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Santalales",
        "family": "Santalaceae",
        "genus": "Acanthosyris",
        "species": "Acanthosyris falcata"
    },
    "taxonomy_art_desc": "Acanthosyris falcata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their jointed stems and retention of primitive plant features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by diverse floral structures. Its order is Santalales, a group of flowering plants that includes parasitic and semi-parasitic species, often with reduced leaves and specialized root systems. Its family is Santalaceae, a family of flowering plants that includes both parasitic and non-parasitic species, often with small flowers and specialized symbiotic relationships. Its genus is Acanthosyris, a genus of flowering plants in the family Santalaceae, characterized by its woody structure and specific morphological traits. Its species is Acanthosyris falcata, a specific plant within the genus Acanthosyris, distinguished by its unique leaf shape and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Paraguay",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosyris falcata is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Paraguay, and Uruguay. This plant is commonly found in the arid and semi-arid regions of these areas. It thrives in dry, rocky, and often sunny environments. The species is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in the local flora of these regions.",
    "distribution_introduced_art_desc": "Acanthosyris falcata was mainly introduced to areas with dry, rocky soils and steep slopes, particularly in regions with a Mediterranean climate. It is commonly found in southern California, parts of Baja California, and the Channel Islands. This plant thrives in well-drained soils and is often seen growing on coastal bluffs and inland canyons. Due to its hardy nature, it has become naturalized in several areas outside its native range. Its introduction has raised concerns about its potential impact on local ecosystems."
}
