{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon lycaonicum subsp. lycaonicum",
    "plant_slug": "acantholimon-lycaonicum-subsp-lycaonicum",
    "plant_name_scientific": "acantholimon lycaonicum subsp. lycaonicum",
    "intro": "Acantholimon lycaonicum subsp. lycaonicum, commonly known as the Lycaonicum thrift, is a low-growing perennial plant native to the Mediterranean region. It belongs to the Plumbagaceae family and is characterized by its dense clusters of blue or purple flowers. The plant features succulent, fleshy leaves that help it retain moisture in arid environments. It thrives in well-drained soils and is often found in rocky or gravelly habitats. Its ornamental value makes it a popular choice for rock gardens and xeriscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon lycaonicum"
    },
    "taxonomy_art_desc": "Acantholimon lycaonicum subsp. lycaonicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often found in arid environments. Its family is Plumbaginaceae, a family of flowering plants known for their often striking flowers and some containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon lycaonicum, a specific plant within the genus Acantholimon, native to certain regions of the Mediterranean, known for its specific morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon lycaonicum subsp. lycaonicum is primarily native to Turkey. This subspecies is found in specific regions of Turkey, particularly in the eastern and central parts of the country. It thrives in rocky and semi-arid environments, often growing on slopes and in mountainous areas. The plant is adapted to the local climate and soil conditions of its native habitat. Its distribution is limited to these specific areas within Turkey, reflecting its ecological preferences.",
    "distribution_introduced_art_desc": "Acantholimon lycaonicum subsp. lycaonicum was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It is commonly found in rocky soils and dry habitats, often growing on slopes and cliffs. This subspecies is well adapted to arid and semi-arid environments, making it a resilient plant in such conditions. Its introduction has been associated with both natural dispersal and human activities, including horticultural use. However, it is not considered invasive and is generally limited to its native range."
}
