{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum turcomanicum",
    "plant_slug": "acanthophyllum-turcomanicum",
    "plant_name_scientific": "acanthophyllum turcomanicum",
    "intro": "Acanthophyllum turcomanicum, commonly known as the Turkestan thorned grass, is a perennial shrub native to arid and semi-arid regions of Central Asia. It is characterized by its dense, spiny foliage and compact growth habit, which helps it conserve water in harsh environments. The plant produces small, pale green or yellow flowers that bloom in summer, contributing to its role in local ecosystems. It is adapted to sandy soils and can thrive in areas with low precipitation. Due to its hardy nature, it is often used for stabilizing dunes and preventing soil erosion.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum turcomanicum is primarily native to the Central Asian region, including parts of Kazakhstan, Uzbekistan, Turkmenistan, and western China. It thrives in arid and semi-arid environments, particularly in sandy or gravelly soils. This plant is commonly found in desert steppes and dunes, where it plays a role in stabilizing the soil and preventing erosion. It is well adapted to extreme temperatures and low precipitation, making it a resilient species in its native habitat. Its distribution is closely tied to the ecological conditions of the Central Asian deserts and steppes.",
    "distribution_introduced_art_desc": "Acanthophyllum turcomanicum was mainly introduced to arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in sandy and saline soils, making it a common component of steppe and desert ecosystems. This plant is well adapted to harsh environmental conditions, with its succulent stems and spiny leaves helping it retain water and deter herbivores. It plays a significant role in stabilizing dunes and preventing soil erosion in these regions. Due to its hardiness, it has been cultivated in some areas for its potential in land rehabilitation and as a source of forage."
}
