{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kjurendaghi",
    "plant_slug": "acantholimon-kjurendaghi",
    "plant_name_scientific": "acantholimon kjurendaghi",
    "intro": "Acantholimon kjurendaghi, commonly known as the Kjurendaghi's thornweed, is a flowering plant native to the high-altitude regions of the Andes. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy leaves adapted to arid conditions. The plant produces small, blue or purple flowers that bloom in late summer, attracting pollinators such as bees and butterflies. It thrives in rocky soils and is often found in alpine meadows at elevations above 3,000 meters. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon kjurendaghi"
    },
    "taxonomy_art_desc": "Acantholimon kjurendaghi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with distinctive blue or purple flowers and often contains toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon kjurendaghi, a specific plant within the genus Acantholimon, native to certain regions and distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kjurendaghi is primarily native to Turkmenistan. This species is found in the arid and semi-arid regions of the country. It typically grows in rocky or sandy soils, often in mountainous or desert landscapes. The plant is adapted to the harsh climate conditions of Turkmenistan. Its distribution is limited to specific ecological niches within the region.",
    "distribution_introduced_art_desc": "Acantholimon kjurendaghi was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive silvery foliage and showy flowers. It is commonly found in gardens and landscaped areas, particularly in southern Europe and parts of North Africa. The plant thrives in well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. However, it has shown invasive tendencies in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
