{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon antilibanoticum",
    "plant_slug": "acantholimon-antilibanoticum",
    "plant_name_scientific": "acantholimon antilibanoticum",
    "intro": "Acantholimon antilibanoticum, commonly known as the Libanotis thyme, is a perennial herb native to the eastern Mediterranean region. It belongs to the family Caryophyllaceae, which includes many flowering plants known for their showy blooms. The plant is characterized by its compact growth habit, with small, gray-green leaves and clusters of pink or purple flowers. It thrives in well-drained soils and is often found in rocky or dry habitats. Due to its ornamental value and ecological significance, it is sometimes cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon antilibanoticum"
    },
    "taxonomy_art_desc": "Acantholimon antilibanoticum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their diverse morphological features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and a wide range of habitats. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often found in arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon antilibanoticum, a specific plant within the genus Acantholimon, native to certain regions of the Middle East, characterized by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lebanon-Syria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon antilibanoticum is primarily native to Lebanon-Syria. This plant is typically found in the mountainous regions of these countries. It thrives in rocky and arid environments, often growing on slopes and cliffs. The species is adapted to the Mediterranean climate characterized by hot, dry summers and mild, wet winters. It is an important part of the local flora and is often found in areas with well-drained soils.",
    "distribution_introduced_art_desc": "Acantholimon antilibanoticum was mainly introduced to areas with rocky or gravelly soils, typically in arid or semi-arid environments. It thrives in regions with low precipitation and high sunlight exposure, making it well-suited for dry, coastal or mountainous habitats. This plant is often found in disturbed or marginal lands, such as roadsides, wastelands, and degraded soils. Its introduction has been primarily due to its hardiness and ability to colonize harsh environments. However, it is considered a non-native species in many regions where it has become established."
}
