{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon acerosum var. brachystachyum",
    "plant_slug": "acantholimon-acerosum-var-brachystachyum",
    "plant_name_scientific": "acantholimon acerosum var. brachystachyum",
    "intro": "Acantholimon acerosum var. brachystachyum, commonly known as the short-stemmed thornweed, is a perennial flowering plant native to the arid regions of central Asia. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy stems and leaves adapted to conserve water. The plant produces small, blue to purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and is often found in rocky or sandy habitats. Its unique morphology and ecological role make it an important species in its native environment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon acerosum var. brachystachyum is primarily native to the western United States, particularly in California and Nevada. It is commonly found in rocky and sandy soils within coastal and inland desert regions. This plant thrives in arid and semi-arid environments, often growing in open areas with good drainage. It is adapted to withstand high temperatures and low precipitation. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acantholimon acerosum var. brachystachyum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in rocky or gravelly habitats, often growing on slopes or along dry streambeds. This plant has been introduced to several regions outside its native range, including parts of the western United States and northern Mexico. Its introduction is often associated with landscaping or restoration projects due to its drought tolerance and ornamental value. However, it is considered a potential invasive species in some areas where it can outcompete native vegetation."
}
