{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus rubens",
    "plant_slug": "acanthus-rubens",
    "plant_name_scientific": "acanthus rubens",
    "intro": "Acanthus rubens, commonly known as the red hakea, is a flowering plant native to Australia. It belongs to the Proteaceae family and is characterized by its striking red flowers that bloom in spring. The plant has narrow, linear leaves and produces woody, branched stems. It is often cultivated for its ornamental value in gardens due to its vibrant color and unique foliage. Acanthus rubens prefers well-drained soil and full sun, making it suitable for coastal and Mediterranean climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus rubens is primarily native to tropical and subtropical regions of Africa, including countries such as South Africa, Madagascar, and parts of East Africa. It is also found in some areas of the Arabian Peninsula and the Indian subcontinent. This plant typically grows in coastal areas, rocky outcrops, and along sandy shores where it can thrive in well-drained soils. It is commonly associated with maritime climates and is often found in dune ecosystems. Due to its hardy nature, it has been introduced to other regions outside its native range in some parts of the world.",
    "distribution_introduced_art_desc": "Acanthus rubens was mainly introduced to the southeastern United States, particularly in coastal regions and along waterways. It is commonly found in wetland areas, marshes, and along the edges of ponds and streams. This plant has become naturalized in many parts of its introduced range, often forming dense stands in disturbed or saturated soils. Its rapid growth and adaptability have led to its classification as an invasive species in some areas. Despite its ecological impact, Acanthus rubens is valued for its ornamental foliage and historical use in horticulture."
}
