{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum lilacinum",
    "plant_slug": "acanthophyllum-lilacinum",
    "plant_name_scientific": "acanthophyllum lilacinum",
    "intro": "Acanthophyllum lilacinum, commonly known as the lilac spurgebrush, is a flowering plant native to the arid regions of the southwestern United States and northern Mexico. It is a shrub characterized by its gray-green foliage and spiny, branched stems. The plant produces small, yellowish flowers that bloom in late spring, attracting pollinators such as bees and butterflies. It is well adapted to dry, sandy soils and can thrive in harsh desert conditions. Acanthophyllum lilacinum plays an important ecological role in stabilizing soil and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum lilacinum"
    },
    "taxonomy_art_desc": "Acanthophyllum lilacinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their complex vascular systems and often primitive reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their showy flowers and diverse growth forms. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often succulent or salt-tolerant species. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many herbaceous plants with showy flowers and often hairy stems. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum lilacinum, a specific type of plant known for its pinkish-purple flowers and adapted to grow in dry, rocky environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran",
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum lilacinum is primarily native to Afghanistan, Iran, and Turkmenistan. This plant is commonly found in arid and semi-arid regions within these countries. It typically grows in sandy or gravelly soils, often in steppes and deserts. The species is adapted to withstand harsh environmental conditions, including high temperatures and limited water availability. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthophyllum lilacinum was mainly introduced to areas with arid or semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions of central Asia, including parts of Kazakhstan, Mongolia, and western China. This plant is well adapted to extreme temperatures and low precipitation, making it a hardy species in harsh environments. Its introduction has been primarily for ecological restoration and as a potential forage plant for livestock. However, it is not widely cultivated and remains a rare species in many regions."
}
