{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon pinardii",
    "plant_slug": "acantholimon-pinardii",
    "plant_name_scientific": "acantholimon pinardii",
    "intro": "Acantholimon pinardii, commonly known as the Pinard's thornstep, is a perennial flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae and is characterized by its succulent, hairy stems and small, clustered flowers. The plant typically grows in rocky or gravelly soils at high elevations, where it is adapted to cold and arid conditions. Its leaves are usually fleshy and arranged in a rosette, helping to conserve moisture. The species is of interest to botanists due to its unique adaptations and limited distribution.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon pinardii is primarily native to the Mediterranean Basin, particularly in regions of southern France, Italy, and Spain. It is also found in parts of North Africa, including Morocco and Algeria. This plant thrives in rocky and limestone soils, often in coastal or mountainous areas. It is commonly associated with Mediterranean scrublands and maquis vegetation. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acantholimon pinardii was mainly introduced to disturbed soils and rocky habitats in the western United States. It is commonly found in areas with low precipitation and well-drained soils. This plant has been documented in California, Nevada, and Utah. It thrives in open, sunny environments and is often seen along roadsides and in gravelly areas. Its introduction has had minimal impact on native plant communities in these regions."
}
