{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus tetragonus",
    "plant_slug": "acanthus-tetragonus",
    "plant_name_scientific": "acanthus tetragonus",
    "intro": "Acanthus tetragonus, commonly known as the four-angled acanthus, is a perennial herbaceous plant native to southern Europe and parts of North Africa. It features rosettes of lance-shaped, gray-green leaves with prominent veins and a distinctive, waxy texture. The plant produces spikes of small, pale blue to violet flowers in the summer months. It is often cultivated for its ornamental value in gardens and is well-suited to dry, rocky soils. Acanthus tetragonus is also valued in horticulture for its ability to thrive in coastal and Mediterranean climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus tetragonus is primarily native to southern Europe, including countries such as Spain, Portugal, and Italy. It is also found in parts of North Africa, including Morocco and Algeria. This plant typically grows in rocky or coastal areas, often in sunny and well-drained soils. It is commonly associated with Mediterranean climates and can be found in regions with mild, wet winters and hot, dry summers. Due to its ornamental value, it has been introduced to other parts of the world, but it remains most prevalent in its native range.",
    "distribution_introduced_art_desc": "Acanthus tetragonus was mainly introduced to ornamental horticulture and landscaping due to its attractive, palmate leaves and showy, spiny flowers. It is commonly found in gardens and cultivated areas where it is valued for its aesthetic appeal. However, it has also become invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its spread is often facilitated by its ability to thrive in disturbed soils and its prolific seed production. Despite its ornamental use, management efforts are necessary to control its spread and mitigate ecological impacts."
}
