{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon capitatum subsp. capitatum",
    "plant_slug": "acantholimon-capitatum-subsp-capitatum",
    "plant_name_scientific": "acantholimon capitatum subsp. capitatum",
    "intro": "Acantholimon capitatum subsp. capitatum, commonly known as the narrowleaf jointvetch, is a flowering plant native to the Mediterranean region. It is a low-growing perennial herb characterized by its slender, erect stems and small, blue to purple flowers. The plant has narrow, linear leaves and produces small, capsule-like fruits. It thrives in well-drained soils and is often found in rocky or gravelly habitats. This species is valued for its ornamental appeal and ecological importance in supporting local insect populations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon capitatum"
    },
    "taxonomy_art_desc": "Acantholimon capitatum subsp. capitatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, known for their distinctive spiny leaves. Its species is Acantholimon capitatum, a specific plant within the genus Acantholimon, characterized by its compact growth form and clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon capitatum subsp. capitatum is primarily native to Turkey. This subspecies is found in the eastern and southern regions of the country. It typically grows in rocky and arid environments. The plant is well adapted to the dry and harsh conditions of its native habitat. It is often seen in mountainous areas and along rocky slopes.",
    "distribution_introduced_art_desc": "Acantholimon capitatum subsp. capitatum was mainly introduced to areas with well-drained sandy or gravelly soils, often in coastal or inland dune environments. It thrives in full sun and is commonly found in regions with a Mediterranean climate. This subspecies is known for its compact growth habit and showy blue to purple flowers that bloom in the spring. It is often used in xeriscaping and as an ornamental plant due to its drought tolerance and aesthetic appeal. However, it can become invasive in some regions if not managed properly."
}
