{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale macrocarpa",
    "plant_slug": "acanthopale-macrocarpa",
    "plant_name_scientific": "acanthopale macrocarpa",
    "intro": "Acanthopale macrocarpa, commonly known as the large-fruited acanthopale, is a flowering plant native to southern Africa. It belongs to the family Fabaceae, which includes legumes, and is characterized by its compound leaves and pod-like fruits. The plant typically grows in sandy or rocky soils and is often found in coastal areas. Its flowers are usually small and clustered, with a distinctive yellow or orange coloration. The species is notable for its ability to thrive in arid conditions, making it an important component of its native ecosystem.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopale",
        "species": "Acanthopale macrocarpa"
    },
    "taxonomy_art_desc": "Acanthopale macrocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels, characterized by their primitive floral structures. Its order is Lamiales, a group of flowering plants that includes many aromatic species, such as mint and snapdragons, often with showy flowers and opposite leaf arrangements. Its family is Acanthaceae, commonly known as the spurred gentians, which are characterized by their distinctive spurred flowers and often showy, colorful blooms. Its genus is Acanthopale, a group of flowering plants typically found in tropical regions, known for their ornamental value and specific morphological features. Its species is Acanthopale macrocarpa, a specific plant within the genus Acanthopale, distinguished by its large, fleshy fruits and its ecological and ornamental significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kenya",
        "Rwanda",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale macrocarpa is primarily native to Kenya, Rwanda, and Uganda. This plant is commonly found in the montane and forested regions of these East African countries. It thrives in humid, shaded environments, often growing in the understorey of tropical forests. The species is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in the local ecosystems where it is found.",
    "distribution_introduced_art_desc": "Acanthopale macrocarpa was mainly introduced to areas with warm, tropical climates where it can thrive in well-drained soils. It is commonly found in regions of Southeast Asia, including parts of Indonesia and the Philippines. This plant is often cultivated for its ornamental value due to its attractive, waxy leaves. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
