{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosicyos horridus",
    "plant_slug": "acanthosicyos-horridus",
    "plant_name_scientific": "acanthosicyos horridus",
    "intro": "Acanthosicyos horridus, commonly known as the desert date or wild date, is a flowering plant native to the arid regions of southern Africa. It is a shrub or small tree characterized by its thick, waxy leaves and spiny stems, which help reduce water loss in its harsh environment. The plant produces yellowish-white flowers that bloom in clusters, followed by edible, fleshy fruits similar to dates. Its deep root system allows it to access groundwater, making it highly drought-tolerant. Acanthosicyos horridus plays an important ecological role in desert ecosystems by providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Cucurbitales",
        "family": "Cucurbitaceae",
        "genus": "Acanthosicyos",
        "species": "Acanthosicyos horridus"
    },
    "taxonomy_art_desc": "Acanthosicyos horridus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and often spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose family. Its order is Cucurbitales, which includes plants like cucumbers and pumpkins, characterized by their distinctive flowers and often trailing growth habits. Its family is Cucurbitaceae, commonly known as the gourd family, which includes various edible and ornamental plants with tendrils and瓠-shaped fruits. Its genus is Acanthosicyos, a group of flowering plants native to Africa, typically characterized by their spiny stems and edible fruits. Its species is Acanthosicyos horridus, a specific plant within this genus known for its rough, spiny appearance and is commonly found in arid regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Cape Provinces",
        "Namibia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosicyos horridus is primarily native to Angola, Cape Provinces, and Namibia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or gravelly soils and is often associated with coastal or inland desert environments. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthosicyos horridus was mainly introduced to South Africa, where it has become a problematic invasive species. It was likely introduced through human activity, possibly as an ornamental plant or for other agricultural purposes. The plant thrives in disturbed environments and can outcompete native vegetation, leading to ecological imbalances. Its rapid growth and ability to spread through seeds make it particularly challenging to control. Efforts to manage its spread include mechanical removal and the use of herbicides in affected areas."
}
