{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium chrysoglossum",
    "plant_slug": "acanthophippium-chrysoglossum",
    "plant_name_scientific": "acanthophippium chrysoglossum",
    "intro": "Acanthophippium chrysoglossum, commonly known as the golden-leafed acanthophippium, is a flowering plant belonging to the family Acanthaceae. It is native to tropical regions of South America, particularly Brazil, and thrives in moist, shaded environments. The plant is characterized by its striking, lance-shaped leaves that are often covered in a waxy coating, giving them a shiny appearance. Its flowers are small and clustered, typically in whorls, and are usually pink or purple in color. Acanthophippium chrysoglossum is valued for its ornamental appeal and is sometimes cultivated in botanical gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium chrysoglossum"
    },
    "taxonomy_art_desc": "Acanthophippium chrysoglossum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes horsetails and some extinct species, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Asparagales, a large group of flowering plants that includes asparagus, orchids, and related species, known for their varied growth forms and ecological adaptations. Its family is Orchidaceae, commonly known as the orchid family, which consists of over 25,000 species known for their intricate flowers and specialized pollination mechanisms. Its genus is Acanthophippium, a group of flowering plants within the Orchidaceae family, characterized by their unique morphological features and specific habitat preferences. Its species is Acanthophippium chrysoglossum, a specific type of orchid known for its distinctive appearance and ecological role in its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Sumatera"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium chrysoglossum is primarily native to Sumatera. It is found in the tropical rainforests of this Indonesian island. The plant thrives in humid and shaded environments within these ecosystems. It is commonly associated with primary forest habitats. Its distribution is limited to specific regions within Sumatera due to its ecological requirements.",
    "distribution_introduced_art_desc": "Acanthophippium chrysoglossum was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed soils and areas with disturbed vegetation, often thriving in urban and suburban environments. This plant has shown adaptability to a variety of soil types and climatic conditions, which contributes to its spread. Its introduction has led to concerns about its potential to become invasive in certain regions. However, it is currently considered a non-native species with limited ecological impact in most areas."
}
