{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon horridum",
    "plant_slug": "acantholimon-horridum",
    "plant_name_scientific": "acantholimon horridum",
    "intro": "Acantholimon horridum, commonly known as the rough hawksbeard, is a flowering plant native to the western United States. It is a member of the Montiaceae family and is characterized by its dense, spiny foliage and yellow flowers. The plant typically grows in arid or semi-arid environments, such as rocky soils and dry slopes. Its leaves are usually covered in fine hairs, giving it a rough texture, and its flowers bloom in late spring to early summer. Acantholimon horridum is adapted to withstand drought and high temperatures, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon horridum"
    },
    "taxonomy_art_desc": "Acantholimon horridum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their algae relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often possessing true leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contain secondary compounds. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers and specialized seed structures. Its genus is Acantholimon, a genus of flowering plants typically found in arid and rocky habitats, known for their spiny or hairy stems and small, often blue or purple flowers. Its species is Acantholimon horridum, a specific plant species within the genus Acantholimon, characterized by its distinctive appearance and adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon horridum is primarily native to Iran. It is found in the arid and semi-arid regions of the country. This plant typically grows in rocky or sandy soils. It is commonly seen in mountainous areas and dry plains. Its distribution is limited to specific ecological zones within Iran.",
    "distribution_introduced_art_desc": "Acantholimon horridum was mainly introduced to areas with disturbed soils and rocky habitats, often as a result of human activity or accidental transport. It thrives in arid and semi-arid environments, preferring well-drained soils and full sun exposure. This plant is known for its spiny leaves and showy purple flowers, which make it an attractive but potentially invasive species. Its introduction has been documented in several regions outside its native range, including parts of the western United States. Due to its hardy nature, it can outcompete native vegetation, leading to ecological concerns in some areas."
}
