{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis brevispina",
    "plant_slug": "acanthorhipsalis-brevispina",
    "plant_name_scientific": "acanthorhipsalis brevispina",
    "intro": "Acanthorhipsalis brevispina, commonly known as the short-spined hedgehog cactus, is a species of cactus native to southern Africa. It is characterized by its compact, spiny stems that are typically green in color. The plant produces small, white flowers during the summer months, which are often followed by red fruits. It is a drought-tolerant species, making it well-suited for arid environments. The plant's structure and appearance make it a popular choice for rock gardens and xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis brevispina is primarily native to southern Africa, specifically South Africa. It is found in regions with arid and semi-arid climates, particularly in the western and northern parts of the country. This plant thrives in rocky outcrops and sandy soils, often growing in coastal or inland areas with low rainfall. It is commonly found in the Western Cape and Northern Cape provinces. Its distribution is limited to specific ecological niches that provide the dry, well-drained conditions it requires.",
    "distribution_introduced_art_desc": "Acanthorhipsalis brevispina was mainly introduced to new environments through human activity, such as horticultural trade and accidental transport. It is commonly found in regions with warm, dry climates where it can thrive in well-drained soils. This plant has shown adaptability to different soil types and can tolerate periods of drought. Its introduction has led to concerns about its potential to become invasive in certain ecosystems. Due to its rapid growth and ability to spread vegetatively, it requires careful management in areas where it is not native."
}
