{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax rehderianus var. longipedunculatus",
    "plant_slug": "acanthopanax-rehderianus-var-longipedunculatus",
    "plant_name_scientific": "acanthopanax rehderianus var. longipedunculatus",
    "intro": "Acanthopanax rehderianus var. longipedunculatus, commonly known as the long-pedunculate Chinese skullcap, is a climbing shrub native to China. It belongs to the Araliaceae family and is characterized by its compound leaves and small, clustered flowers. The plant produces berries that are typically red when mature, and it is often found in mountainous regions. Its botanical features make it a subject of interest in both traditional medicine and botanical research.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax rehderianus var. longipedunculatus is primarily native to the mountainous regions of southern China, particularly in Yunnan Province. This species thrives in temperate to subtropical climates, often found in forested areas with well-drained soil. It is commonly associated with secondary growth habitats and is adapted to the region's humid and mild conditions. The plant is also occasionally found in neighboring regions of northern Vietnam and northern Myanmar. Due to its specific ecological requirements, its distribution is relatively limited to these geographic areas.",
    "distribution_introduced_art_desc": "Acanthopanax rehderianus var. longipedunculatus was mainly introduced to regions with temperate climates and well-drained soils, often as an ornamental plant due to its attractive foliage and unique growth habit. It is commonly found in gardens and landscaped areas in parts of North America and Europe. The plant prefers full sun to partial shade and is relatively drought-tolerant once established. Its introduction has been associated with horticultural trade and landscape design practices. However, it is not considered invasive in most regions where it is cultivated."
}
