{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum paniculatum var. gypsophiloides",
    "plant_slug": "acanthophyllum-paniculatum-var-gypsophiloides",
    "plant_name_scientific": "acanthophyllum paniculatum var. gypsophiloides",
    "intro": "Acanthophyllum paniculatum var. gypsophiloides, commonly known as the gypsum bush, is a perennial shrub native to arid and semi-arid regions of the Middle East and Central Asia. It is characterized by its compact growth habit, with small, spiny leaves that help reduce water loss in harsh environments. The plant produces yellow or greenish flowers in panicle-like clusters, which bloom during the warmer months. It thrives in well-drained soils, often found on rocky or sandy substrates. Due to its resilience, it is sometimes used in xeriscaping and for erosion control in dry landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum paniculatum var. gypsophiloides is primarily native to the arid and semi-arid regions of central and western Asia, including parts of Kazakhstan, Mongolia, and northern China. This plant thrives in sandy or gravelly soils and is commonly found in steppe and desert environments. It is well adapted to harsh climatic conditions, with deep root systems that allow it to survive in low-water environments. The species is also present in some areas of the Russian Federation and southern Siberia. Due to its ecological significance, it plays a vital role in stabilizing desert ecosystems and preventing soil erosion.",
    "distribution_introduced_art_desc": "Acanthophyllum paniculatum var. gypsophiloides was mainly introduced to areas with sandy or gravelly soils, typically in arid and semi-arid regions. It thrives in environments with low precipitation and high sunlight exposure. This plant is often found in dunes, salt marshes, and coastal areas where it helps stabilize soil and prevent erosion. Its introduction has been noted in parts of North America and Europe as an ornamental and for its ability to colonize disturbed sites. However, it can become invasive in certain ecosystems if not managed properly."
}
