{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthobotrya disticha",
    "plant_slug": "acanthobotrya-disticha",
    "plant_name_scientific": "acanthobotrya disticha",
    "intro": "Acanthobotrya disticha, commonly known as the silverleaf tree, is a member of the Rutaceae family and is native to southern Africa. It is a small to medium-sized evergreen tree with smooth, greyish bark and elliptical leaves that are typically covered in a fine layer of white wax. The plant produces small, fragrant flowers that are usually white or pale yellow, followed by small, round fruits containing a single seed. It is often cultivated for its ornamental value and is also valued for its ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthobotrya disticha is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Western Cape, Eastern Cape, and parts of KwaZulu-Natal. This plant thrives in coastal and sandy soils, often growing in shrubland and coastal dunes. It is commonly associated with the fynbos biome, which is known for its unique biodiversity. Acanthobotrya disticha is well adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters.",
    "distribution_introduced_art_desc": "Acanthobotrya disticha was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain regions, particularly in the North Island. It thrives in moist, shaded environments and is commonly found in forested areas. However, it is considered a potential weed in some parts of its range."
}
