{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium formosum var. albispinum",
    "plant_slug": "acanthocalycium-formosum-var-albispinum",
    "plant_name_scientific": "acanthocalycium formosum var. albispinum",
    "intro": "Acanthocalycium formosum var. albispinum, commonly known as the White-spined Hedgehog Cactus, is a species native to Mexico. It is a succulent cactus characterized by its cylindrical stems covered in white, bristly spines. The plant produces yellow flowers during the spring and summer months. It thrives in well-drained soil and requires full sun to partial shade. Due to its unique appearance and slow growth, it is a popular choice for rock gardens and xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium formosum var. albispinum is primarily native to the western United States, specifically in Arizona and New Mexico. This cactus variant thrives in arid and semi-arid environments, often found in rocky soils and desert landscapes. It is commonly associated with areas that have low rainfall and high temperatures, typical of the Sonoran and Chihuahuan Deserts. The plant is well adapted to harsh desert conditions, with its spiny structure providing protection from herbivores and reducing water loss. Due to its limited range, it is considered a rare and specialized species within its native habitat.",
    "distribution_introduced_art_desc": "Acanthocalycium formosum var. albispinum was mainly introduced to the southwestern United States, particularly in Texas and New Mexico. It thrives in arid and semi-arid environments with well-drained soils. This cactus is often found in rocky habitats and is adapted to full sun exposure. Its introduction has been largely due to horticultural interest and its unique appearance. However, it is considered a non-native species in these regions and is sometimes found in cultivated gardens."
}
