{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax bodinieri",
    "plant_slug": "acanthopanax-bodinieri",
    "plant_name_scientific": "acanthopanax bodinieri",
    "intro": "Acanthopanax bodinieri, commonly known as the Bodinier aralia, is a flowering plant native to Southeast Asia. It belongs to the family Araliaceae and is characterized by its compound leaves and spiny stems. The plant typically grows in tropical and subtropical regions, often in forested areas. It produces small, greenish-yellow flowers that are clustered in umbels, followed by small, berry-like fruits. Due to its ornamental value and medicinal properties, it is sometimes cultivated in gardens and traditional herbal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax bodinieri is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Cambodia. It is commonly found in tropical and subtropical regions, particularly in lowland and hill forest areas. This plant thrives in humid environments with well-drained soil, often growing along riverbanks or in shaded undergrowth. It is a climbing shrub that can reach significant heights, making it a notable component of the local flora. Due to its adaptability, it is also occasionally found in adjacent regions like southern China and parts of Indonesia.",
    "distribution_introduced_art_desc": "Acanthopanax bodinieri was mainly introduced to the Pacific Northwest region of the United States. It was brought there for its ornamental value due to its attractive foliage and growth habit. The plant has been found growing in moist, shaded areas along forest edges and stream banks. It has shown some invasive tendencies in certain areas, outcompeting native vegetation. Due to its rapid spread, it is now considered a potential threat to local ecosystems."
}
