{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus eminens",
    "plant_slug": "acanthus-eminens",
    "plant_name_scientific": "acanthus eminens",
    "intro": "Acanthus eminens, commonly known as the giant acanthus, is a striking perennial plant native to southern Africa. It is characterized by its large, palmate leaves that can grow up to 1 meter in length, giving it a dramatic, tropical appearance. The plant produces showy, spires of violet-blue flowers in late spring to early summer. It thrives in full sun to partial shade and requires well-drained soil to prevent root rot. Due to its ornamental value, it is often cultivated in gardens and landscapes for its lush foliage and vibrant blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus eminens"
    },
    "taxonomy_art_desc": "Acanthus eminens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive characteristics and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Lamiales, which consists of flowering plants with bilaterally symmetric flowers and often includes plants with aromatic properties. Its family is Acanthaceae, commonly known as the spurred orchid family, characterized by their showy flowers and often hairy leaves. Its genus is Acanthus, which includes several species of flowering plants known for their ornamental value and distinctive, spiny leaves. Its species is Acanthus eminens, a specific variety within the Acanthus genus known for its tall, showy inflorescences and is often cultivated for its ornamental beauty.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ethiopia",
        "Kenya",
        "Sudan-South Sudan",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus eminens is primarily native to Ethiopia, Kenya, Sudan-South Sudan, and Uganda. This plant is commonly found in regions with tropical and subtropical climates within these countries. It thrives in open areas, grasslands, and along riverbanks. The species is well adapted to the variable environmental conditions of its native range. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthus eminens was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as stream banks and forest floors. This plant is considered an invasive species in some areas due to its rapid growth and competitive nature. It spreads through underground rhizomes, making it difficult to control. Its presence can alter native plant communities and reduce biodiversity in affected ecosystems."
}
