{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpus humilis",
    "plant_slug": "acanthocarpus-humilis",
    "plant_name_scientific": "acanthocarpus humilis",
    "intro": "Acanthocarpus humilis, commonly known as the dwarf acanthocarp, is a small, perennial shrub native to southern Africa. It is characterized by its compact growth habit, with small, rounded leaves and clusters of tiny, yellowish flowers. The plant produces small, indehiscent fruits that contain minute seeds, typical of the Leguminosae family. It thrives in dry, sandy soils and is often found in savanna and rocky habitats. Due to its hardy nature, it is sometimes used in restoration projects in arid regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Asparagaceae",
        "genus": "Acanthocarpus",
        "species": "Acanthocarpus humilis"
    },
    "taxonomy_art_desc": "Acanthocarpus humilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Asparagales, a large group of flowering plants that includes grasses, lilies, and asparagus, known for their diverse morphological adaptations. Its family is Asparagaceae, a family of flowering plants that includes many ornamental and edible plants, such as orchids and asparagus. Its genus is Acanthocarpus, a group of flowering plants typically found in arid regions, characterized by their spiny fruits and grass-like leaves. Its species is Acanthocarpus humilis, a low-growing plant native to Africa, known for its small, spiny fruits and its ability to thrive in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpus humilis is primarily native to Western Australia. It is commonly found in the region's coastal and inland areas, particularly in sandy soils. This plant thrives in arid and semi-arid environments, often growing in open woodlands and grasslands. It is well adapted to the local climate and is an important component of the native vegetation. Its distribution is largely restricted to the southwestern and central parts of Western Australia.",
    "distribution_introduced_art_desc": "Acanthocarpus humilis was mainly introduced to areas where it can thrive in disturbed soils and open habitats. It is commonly found in regions with warm climates and moderate rainfall. This plant is often used for soil stabilization and erosion control due to its hardy nature. Its introduction has been reported in several countries, particularly in the Pacific Islands and parts of Southeast Asia. However, it is considered a potential invasive species in some regions where it can outcompete native flora."
}
