{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpus serra",
    "plant_slug": "acanthocarpus-serra",
    "plant_name_scientific": "acanthocarpus serra",
    "intro": "Acanthocarpus serra, commonly known as the serrated acanthocarpus, is a perennial shrub native to southern Africa. It belongs to the family Fabaceae, also known as the legume or pea family, and is characterized by its compound leaves and small, pea-like flowers. The plant produces distinctive seed pods that are often covered in stiff, bristly hairs, which aid in seed dispersal. It is well adapted to arid and semi-arid environments, making it a common sight in savannas and rocky habitats. Due to its hardy nature, it is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpus serra is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in grassland and savanna habitats, often growing in well-drained soils. This plant is also present in parts of eastern and southern tropical Africa, extending into regions like Kenya and Tanzania. It thrives in open areas with moderate to high rainfall. Its distribution is closely associated with the African savanna ecosystem.",
    "distribution_introduced_art_desc": "Acanthocarpus serra was mainly introduced to South Africa, where it has become an invasive species. It was likely introduced through human activity, such as accidental transport via contaminated soil or machinery. The plant thrives in disturbed areas and can outcompete native vegetation. Its rapid growth and ability to form dense stands make it a significant ecological threat. Efforts are being made to control its spread through mechanical removal and herbicide application."
}
