{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon flabellum",
    "plant_slug": "acantholimon-flabellum",
    "plant_name_scientific": "acantholimon flabellum",
    "intro": "Acantholimon flabellum, commonly known as the flabellate thistle, is a flowering plant native to the arid regions of the western United States. It is a member of the Caryophyllaceae family and is characterized by its distinctive, spiny leaves and showy, pink to purple flowers. The plant typically grows in rocky or sandy soils and is adapted to survive in harsh, dry environments. Its flowers are arranged in a flat, fan-like structure, which gives it its common name. Acantholimon flabellum is often found in desert scrub and chaparral habitats, where it plays a role in stabilizing soil and providing nectar for pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon flabellum"
    },
    "taxonomy_art_desc": "Acantholimon flabellum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and modern species with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes shrubs and herbs with often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny or thorny structures. Its species is Acantholimon flabellum, a specific plant within the genus Acantholimon, known for its unique leaf morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon flabellum is primarily native to Iran and Turkmenistan. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in sandy or gravelly soils, often in areas with low precipitation. The species is adapted to the harsh climatic conditions of its native habitat. Its distribution is largely restricted to specific ecological zones in Iran and Turkmenistan.",
    "distribution_introduced_art_desc": "Acantholimon flabellum was mainly introduced to areas with well-drained soils and full sun exposure, often found in coastal and inland dunes. It is commonly found in regions with Mediterranean climates, such as California and parts of Chile. This plant thrives in sandy or gravelly soils and is adapted to withstand drought conditions. It is often used in restoration projects due to its ability to stabilize dunes and prevent erosion. However, its introduction has raised concerns about its potential to invade native plant communities in certain regions."
}
