{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ebracteatus subsp. ebarbatus",
    "plant_slug": "acanthus-ebracteatus-subsp-ebarbatus",
    "plant_name_scientific": "acanthus ebracteatus subsp. ebarbatus",
    "intro": "Acanthus ebracteatus subsp. ebarbatus, commonly known as the narrow-leaved acanthus, is a perennial herb native to southern Africa. It features lanceolate, often hairy leaves that are typically shorter than those of the broader-leaved varieties. The plant produces spiny, spire-like inflorescences that bear small, pale yellow to green flowers. It thrives in well-drained soils and full sun, making it a popular choice for rock gardens and dry landscapes. Its ornamental value is enhanced by its architectural form and long-lasting foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus ebracteatus"
    },
    "taxonomy_art_desc": "Acanthus ebracteatus subsp. ebarbatus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Lamiales, a group of flowering plants that includes many aromatic plants and is characterized by distinct floral morphology and often showy flowers. Its family is Acanthaceae, a family of flowering plants known for their showy flowers and often hairy leaves, commonly found in tropical and subtropical regions. Its genus is Acanthus, a group of flowering plants known for their distinctive spiny leaves and showy flowers, often used in ornamental horticulture. Its species is Acanthus ebracteatus, a plant characterized by its lack of bracts and its specific subspecies, subsp. ebarbatus, which may exhibit unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ebracteatus subsp. ebarbatus is primarily native to Northern Territory, Queensland, and Western Australia. This subspecies is commonly found in arid and semi-arid regions within these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acanthus ebracteatus subsp. ebarbatus was mainly introduced to the Mediterranean region as an ornamental plant due to its striking foliage and floral display. It has since been reported in parts of southern Europe, including Spain, Italy, and Greece, where it thrives in coastal and semi-arid environments. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have led to its establishment in some natural habitats. Despite its ornamental value, it is considered a potential invasive species in certain areas due to its competitive nature. Efforts are being made to monitor its spread and assess its impact on native flora."
}
