{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax yui var. longipedunculatus",
    "plant_slug": "acanthopanax-yui-var-longipedunculatus",
    "plant_name_scientific": "acanthopanax yui var. longipedunculatus",
    "intro": "Acanthopanax yui var. longipedunculatus, commonly known as the long pedunculate Chinese angel's trumpet, is a woody shrub native to China. It is characterized by its compound leaves with opposite arrangement and serrated margins. The plant produces clusters of small, fragrant, yellowish-green flowers that bloom in the summer. Its fruit is a red, fleshy drupe that contains several seeds. This species is valued for its ornamental qualities and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax yui var. longipedunculatus is primarily native to the mountainous regions of central and southern China, particularly in the provinces of Yunnan, Sichuan, and Guizhou. It thrives in temperate to subtropical climates at elevations ranging from 1,500 to 3,000 meters above sea level. This variant is commonly found in forests with well-drained soil and partial shade. It is often associated with mixed evergreen and deciduous forests. The plant is well adapted to the humid and cool conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acanthopanax yui var. longipedunculatus was mainly introduced to areas with temperate climates and well-drained soils, particularly in the mountainous regions of East Asia. It thrives in regions with moderate rainfall and partial to full sunlight. This plant is commonly found in forest understories and along stream banks. Its introduction has been noted in several regions beyond its native range, including parts of North America and Europe. It is valued for its ornamental qualities and potential medicinal uses."
}
