{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon taschkurganicum",
    "plant_slug": "acantholimon-taschkurganicum",
    "plant_name_scientific": "acantholimon taschkurganicum",
    "intro": "Acantholimon taschkurganicum, commonly known as the Taschkurgan stonecrop, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Crassulaceae and is characterized by its succulent, fleshy leaves that store water, adapting it to arid environments. The plant produces small, star-shaped flowers in shades of white and pink, typically blooming in late summer. It thrives in rocky soils and is often found in alpine or subalpine habitats. Due to its limited distribution and specific ecological requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon taschkurganicum"
    },
    "taxonomy_art_desc": "Acantholimon taschkurganicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and some modern gymnosperms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias, known for their primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive floral morphology and sometimes by a unique type of salt tolerance. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species adapted to arid and saline environments. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon taschkurganicum, a specific plant within the genus Acantholimon, native to certain regions of Central Asia, known for its unique adaptations to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon taschkurganicum is primarily native to Uzbekistan. This plant is found in the mountainous regions of the country, particularly in the western and southern areas. It thrives in rocky and arid environments, often growing in alpine and subalpine zones. The species is adapted to the harsh climate and limited soil conditions of its native habitat. It plays an important role in the local flora and ecosystem of Uzbekistan.",
    "distribution_introduced_art_desc": "Acantholimon taschkurganicum was mainly introduced to the Central Asian region, particularly in countries such as Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in dry steppes and semi-desert areas where it thrives in well-drained soils. This plant is adapted to arid and semi-arid climates, making it a resilient species in these environments. It plays a role in stabilizing soil and preventing erosion in its native habitat. However, its introduction to new areas has raised concerns about its potential impact on local ecosystems."
}
