{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthobotrya cinerea",
    "plant_slug": "acanthobotrya-cinerea",
    "plant_name_scientific": "acanthobotrya cinerea",
    "intro": "Acanthobotrya cinerea, commonly known as the silverleaf acanthobotrya, is a species of flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its silver-gray foliage and showy, tubular flowers. The plant typically grows in rocky or sandy soils and thrives in full sun. Its leaves are covered in fine, white hairs, giving it a distinctive appearance. It is often cultivated as an ornamental plant due to its attractive foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthobotrya cinerea is primarily native to southern Africa, specifically South Africa. It is commonly found in the eastern and western regions of the country. This plant typically grows in coastal areas and on sandy soils. It is often associated with fynbos vegetation, which is characteristic of the Cape Floristic Region. Its distribution is limited to a relatively small geographic area within South Africa.",
    "distribution_introduced_art_desc": "Acanthobotrya cinerea was mainly introduced to coastal areas with sandy or gravelly soils, particularly in regions with a temperate climate. It thrives in well-drained environments and is commonly found along shorelines and dunes. This plant is often associated with disturbed habitats and can spread rapidly in such areas. Its introduction has been linked to human activities, including coastal development and landscaping. However, it is considered a non-native species in many parts of the world where it has established itself."
}
