{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax leucorrhizus var. axillaritomentosus",
    "plant_slug": "acanthopanax-leucorrhizus-var-axillaritomentosus",
    "plant_name_scientific": "acanthopanax leucorrhizus var. axillaritomentosus",
    "intro": "Acanthopanax leucorrhizus var. axillaritomentosus, commonly known as the hairy-axil Acanthopanax, is a shrub native to eastern Asia. It is characterized by its compound leaves with serrated margins and hairy glands along the leaf axils. The plant produces small, yellowish-green flowers arranged in umbels, followed by red berries that are edible for birds and small mammals. It thrives in moist, shaded environments such as mountain forests. Its botanical features make it a valuable species for ecological studies and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax leucorrhizus var. axillaritomentosus is primarily native to the mountainous regions of northeastern India, particularly in the states of Arunachal Pradesh, Assam, and Sikkim. It is also found in parts of northern Myanmar and western Yunnan Province in China. This plant typically grows in temperate forests at elevations ranging from 1,500 to 3,000 meters. It thrives in areas with moist, well-drained soil and partial to full shade. The species is often associated with secondary forests and is sometimes found in disturbed habitats.",
    "distribution_introduced_art_desc": "Acanthopanax leucorrhizus var. axillaritomentosus was mainly introduced to China, where it has been cultivated for its medicinal properties. It is commonly found in the mountainous regions of Yunnan and Sichuan provinces. The plant is valued for its roots, which are used in traditional Chinese medicine to treat various ailments. Its introduction has been driven by both local demand and scientific research into its bioactive compounds. However, its spread has raised concerns about potential ecological impacts in native habitats."
}
