{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus macer",
    "plant_slug": "acanthus-macer",
    "plant_name_scientific": "acanthus macer",
    "intro": "Acanthus macer, commonly known as the narrow-leaved acanthus, is a species of flowering plant in the family Acanthaceae. It is native to tropical and subtropical regions of Africa, Asia, and the Pacific Islands. The plant is characterized by its striking, spiny leaves and showy, clustered flowers that range in color from white to purple. It thrives in moist, well-drained soils and is often found in shaded to semi-shaded environments. Acanthus macer is valued in horticulture for its ornamental foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus macer is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in coastal areas and rocky habitats, often growing on cliffs or in sandy soils. This plant is commonly found along the shores of countries such as Spain, Italy, and Greece. It is well adapted to the warm, dry climates typical of its native range. Due to its ornamental value, it has been introduced to other parts of the world, but it remains most closely associated with its Mediterranean origins.",
    "distribution_introduced_art_desc": "Acanthus macer was mainly introduced to the Mediterranean region as an ornamental plant due to its striking foliage and floral display. It has since been cultivated in various parts of Europe and North America for its aesthetic value in gardens and landscaping. The plant thrives in well-drained soil and full sunlight, making it adaptable to a range of climates. However, it can become invasive in some areas if not managed properly. Its introduction has raised concerns about its potential impact on native plant species in non-native habitats."
}
