{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum crassinodum",
    "plant_slug": "acanthophyllum-crassinodum",
    "plant_name_scientific": "acanthophyllum crassinodum",
    "intro": "Acanthophyllum crassinodum, commonly known as the broad-noded acanthophyllum, is a flowering plant native to arid regions of Central Asia. It belongs to the Amaranthaceae family and is characterized by its succulent, spiny stems and small, clustered flowers. The plant is well adapted to harsh, dry environments, with thick leaves that store water and reduce transpiration. It typically grows in sandy or gravelly soils and is often found in steppes and semi-desert areas. Due to its resilience, it plays a role in stabilizing soil and providing habitat for small desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum crassinodum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. It thrives in sandy and gravelly soils, often found in steppes and desert environments. This plant is well adapted to harsh climatic conditions, including extreme temperatures and limited precipitation. It is commonly found in the Taklamakan and Gobi Deserts, where it plays a role in stabilizing sand dunes. Due to its resilience, it is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acanthophyllum crassinodum was mainly introduced to areas with arid and semi-arid climates, where it thrives in well-drained sandy or gravelly soils. It is commonly found in regions with low precipitation and high solar exposure, such as deserts and coastal dunes. This plant is well adapted to harsh environmental conditions, making it a resilient species in disturbed or degraded habitats. Its introduction has been noted in several parts of the Middle East and North Africa, where it has established itself in native ecosystems. However, its presence is often limited to specific microhabitats that match its ecological requirements."
}
