{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax pentaphyllus",
    "plant_slug": "acanthopanax-pentaphyllus",
    "plant_name_scientific": "acanthopanax pentaphyllus",
    "intro": "Acanthopanax pentaphyllus, commonly known as the five-leafed Chinese hawthorn, is a deciduous shrub native to East Asia. It belongs to the family Olacaceae and is characterized by its compound leaves with five leaflets. The plant produces small, yellowish-green flowers followed by red, fleshy berries. It is often found in forested areas and is valued for its ornamental qualities. Its botanical features make it a subject of interest in both horticulture and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax pentaphyllus is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in forested areas, particularly in temperate regions with moist, well-drained soils. This plant thrives in mountainous habitats and is often associated with mixed deciduous and evergreen forests. It is also known to grow in regions with a humid climate and partial shade. The species is valued for its medicinal properties and is sometimes used in traditional herbal remedies.",
    "distribution_introduced_art_desc": "Acanthopanax pentaphyllus was mainly introduced to areas with suitable climatic conditions for its growth, including temperate and subtropical regions. It is commonly found in forests and shrublands where it can thrive in partial to full sunlight. The plant has been introduced to several countries as an ornamental species due to its attractive foliage and hardy nature. However, it has also been reported as an invasive species in some regions, outcompeting native vegetation. Its distribution is influenced by human activities such as landscaping and accidental seed dispersal."
}
