{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium javanicum",
    "plant_slug": "acanthophippium-javanicum",
    "plant_name_scientific": "acanthophippium javanicum",
    "intro": "Acanthophippium javanicum, commonly known as the Java acanthophippium, is a climbing shrub native to Southeast Asia. It belongs to the family Rubiaceae and is characterized by its woody stems and opposite, ovate leaves. The plant produces small, white to pale yellow flowers that are clustered in inflorescences. Its fruits are fleshy berries that contain several seeds. Acanthophippium javanicum is often found in forested areas and is valued for its ornamental potential.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium javanicum"
    },
    "taxonomy_art_desc": "Acanthophippium javanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their closest algal relatives, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a distinctive morphology, including the presence of jointed stems and specialized reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures and evolutionary adaptations. Its order is Asparagales, a large group of flowering plants that includes familiar species like orchids, grasses, and asparagus, characterized by their varied growth forms and ecological roles. Its family is Orchidaceae, commonly known as orchids, which are a diverse group of flowering plants known for their complex and often showy flowers. Its genus is Acanthophippium, a group of flowering plants within the Orchidaceae family, typically characterized by their unique floral morphology and specific habitat preferences. Its species is Acanthophippium javanicum, a specific type of orchid native to certain regions of Southeast Asia, distinguished by its particular morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo",
        "Jawa",
        "Lesser Sunda Is.",
        "Malaya",
        "Sumatera"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium javanicum is primarily native to Borneo, Jawa, Lesser Sunda Is., Malaya, and Sumatera. This plant is commonly found in tropical rainforest environments across these regions. It thrives in humid and shaded conditions, often growing along riverbanks or in dense undergrowth. The species is well adapted to the diverse ecosystems of Southeast Asia. Its natural range reflects its ecological significance in the local flora.",
    "distribution_introduced_art_desc": "Acanthophippium javanicum was mainly introduced to new habitats in Southeast Asia, particularly in regions with tropical and subtropical climates. It has been observed in countries such as Indonesia, Malaysia, and the Philippines. The plant is often found in disturbed areas, including roadsides and agricultural fields. Its introduction is likely due to human activities, such as accidental transport through trade or intentional planting for ornamental purposes. However, its ecological impact remains under study due to limited data on its spread and interactions with native flora."
}
