{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthomintha ilicifolia",
    "plant_slug": "acanthomintha-ilicifolia",
    "plant_name_scientific": "acanthomintha ilicifolia",
    "intro": "Acanthomintha ilicifolia, commonly known as the narrowleaf thimbleweed, is a flowering plant native to the western United States. It belongs to the family Geraniaceae and is characterized by its small, clustered flowers and woody stems. The plant typically grows in moist, shaded environments such as stream banks and forest floors. Its leaves are usually narrow and have a leathery texture, while its flowers are pink to purple in color. Acanthomintha ilicifolia is often found in California and Oregon, where it thrives in cool, humid climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Lamiaceae",
        "genus": "Acanthomintha",
        "species": "Acanthomintha ilicifolia"
    },
    "taxonomy_art_desc": "Acanthomintha ilicifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by its diverse floral structures. Its order is Lamiales, a group of flowering plants that includes many aromatic herbs and shrubs, often with distinctive floral morphology. Its family is Lamiaceae, commonly known as the mint family, characterized by square stems, opposite leaves, and fragrant flowers. Its genus is Acanthomintha, a small group of flowering plants native to the western United States, known for their spiny or prickly leaves. Its species is Acanthomintha ilicifolia, a specific plant within the genus known for its holly-like leaves and is commonly found in rocky habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthomintha ilicifolia is primarily native to California, Mexico Northwest. This plant is commonly found in coastal areas and valleys throughout its native range. It thrives in sandy or gravelly soils and is often associated with chaparral and coastal scrub habitats. The species is known for its aromatic foliage and small, tubular flowers. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native regions.",
    "distribution_introduced_art_desc": "Acanthomintha ilicifolia was mainly introduced to the western United States, particularly in California. It is commonly found in coastal scrub and chaparral habitats. This plant is often associated with disturbed soils and can thrive in areas with moderate to full sunlight. It is considered an invasive species in some regions due to its rapid growth and competitive nature. Its introduction has led to concerns about its impact on native plant communities."
}
