{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium lilacinum",
    "plant_slug": "acanthophippium-lilacinum",
    "plant_name_scientific": "acanthophippium lilacinum",
    "intro": "Acanthophippium lilacinum, commonly known as the lilac-flowered acanthophippium, is a flowering plant native to the arid regions of the southwestern United States and northern Mexico. It belongs to the family Acanthaceae and is characterized by its showy, lilac-colored bracts that surround small, tubular flowers. The plant typically grows as a shrub or subshrub, with woody stems and narrow, lance-shaped leaves. It thrives in well-drained soils and is adapted to full sun, making it a hardy species in desert environments. The flowers bloom in late spring to early summer, attracting pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium lilacinum"
    },
    "taxonomy_art_desc": "Acanthophippium lilacinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of specialized structures like stomata and vascular tissue. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of morphological adaptations, including some that retain primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Asparagales, a large group of monocot flowering plants that includes many ornamental and horticultural species. Its family is Orchidaceae, commonly known as the orchid family, which is renowned for its diverse and often showy flowers. Its genus is Acanthophippium, a group of flowering plants within the Orchidaceae family, characterized by specific morphological traits. Its species is Acanthophippium lilacinum, a particular orchid species known for its distinctive lilac-colored flowers and unique ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium lilacinum is primarily native to Borneo. This plant is found in the tropical rainforests of the island, particularly in lowland and hill forest areas. It thrives in humid and shaded environments, often growing on the forest floor or as an understory plant. The species is known for its striking lilac-colored flowers, which attract various pollinators. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Acanthophippium lilacinum was mainly introduced to the Pacific Northwest region of the United States. It was introduced as an ornamental plant due to its attractive, showy flowers. However, it has since become invasive in some areas, outcompeting native vegetation. Its spread is often facilitated by its ability to thrive in disturbed soils and its prolific seed production. Conservation efforts are now focused on controlling its spread and protecting local ecosystems."
}
