{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium hirtum",
    "plant_slug": "acanthodium-hirtum",
    "plant_name_scientific": "acanthodium hirtum",
    "intro": "Acanthodium hirtum, commonly known as the hairy acanthodium, is a flowering plant native to southern Africa. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant features narrow, hairy leaves and produces small, yellowish flowers that bloom in spring. It thrives in well-drained soils and is often found in grasslands and rocky areas. Due to its ornamental value, it is occasionally cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium hirtum is primarily native to the southeastern United States, particularly in Florida and parts of Georgia. It thrives in wetland environments such as marshes, swamps, and along the edges of ponds and streams. This plant is commonly found in areas with moist, sandy or clay soils. It plays an important role in supporting local ecosystems by providing habitat and food for various wildlife species. Due to its specific habitat requirements, it is often considered a wetland indicator species.",
    "distribution_introduced_art_desc": "Acanthodium hirtum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and disturbed forests. It thrives in environments with full sun exposure and well-drained soil. This plant is often found in regions with temperate climates and seasonal rainfall patterns. Its introduction has been associated with human activities like agriculture and land development. Due to its adaptability, it has become a common weed in many parts of the world."
}
