{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ulicinum var. ulicinum",
    "plant_slug": "acantholimon-ulicinum-var-ulicinum",
    "plant_name_scientific": "acantholimon ulicinum var. ulicinum",
    "intro": "Acantholimon ulicinum var. ulicinum, commonly known as the coastal sand verbena, is a flowering plant native to the western coast of North America. It is a low-growing perennial with narrow, linear leaves and small, clustered flowers that range in color from white to pink. The plant thrives in sandy or gravelly soils and is often found in coastal dunes and maritime chaparral habitats. It is adapted to salt spray and strong winds, making it a hardy species in harsh coastal environments. Its flowers bloom in late spring to early summer, attracting pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ulicinum"
    },
    "taxonomy_art_desc": "Acantholimon ulicinum var. ulicinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often retaining primitive features. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Caryophyllales, which consists of flowering plants with distinctive floral morphology and often includes plants with specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their showy flowers and often containing alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and coastal regions, known for their succulent leaves and showy flowers. Its species is Acantholimon ulicinum, a specific plant within this genus that is adapted to harsh environments and is known for its unique morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lebanon-Syria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ulicinum var. ulicinum is primarily native to Lebanon-Syria. This plant is commonly found in the mountainous regions of these areas. It thrives in rocky and arid environments, often growing in limestone soils. The species is adapted to the Mediterranean climate of the region. It is an important part of the local flora and is often found in open habitats.",
    "distribution_introduced_art_desc": "Acantholimon ulicinum var. ulicinum was mainly introduced to areas with well-drained sandy or gravelly soils, often in coastal or inland dune environments. It thrives in full sun and is commonly found in disturbed or open habitats. This plant is typically spread through wind-dispersed seeds, allowing it to colonize new areas rapidly. It is often considered an invasive species in regions where it is not native. Its distribution is closely linked to human activities such as land development and transportation corridors."
}
