{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosyris platensis",
    "plant_slug": "acanthosyris-platensis",
    "plant_name_scientific": "acanthosyris platensis",
    "intro": "Acanthosyris platensis, commonly known as the desert hibiscus, is a flowering plant native to the arid regions of South America. It is characterized by its woody stems and broad, lance-shaped leaves that are adapted to conserve water. The plant produces showy, trumpet-shaped flowers in shades of yellow and orange, which bloom during the cooler months. It thrives in well-drained soils and is drought-tolerant, making it well-suited for xeriscaping. Its unique morphology and ability to withstand harsh environmental conditions make it an important species in its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosyris platensis is primarily native to the island of Socotra, located in the Arabian Sea. This unique plant is found in the arid and mountainous regions of Socotra, where it thrives in rocky and limestone soils. It is a member of the Asteraceae family and is known for its distinctive appearance and ecological significance. The species is adapted to the harsh environmental conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic plant of Socotra.",
    "distribution_introduced_art_desc": "Acanthosyris platensis was mainly introduced to South Africa. It was brought there as an ornamental plant due to its unique appearance and hardy nature. However, it has since become invasive, spreading rapidly in certain regions. The plant thrives in disturbed soils and can outcompete native vegetation. Its distribution is now a concern for local ecosystems due to its aggressive growth."
}
