{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus maculatus",
    "plant_slug": "acanthocereus-maculatus",
    "plant_name_scientific": "acanthocereus maculatus",
    "intro": "Acanthocereus maculatus, commonly known as the night blooming cereus, is a cactus species native to Mexico and parts of Central America. It is characterized by its tall, spiny stems and is known for its striking white flowers that open at night. The plant produces small, edible fruits that are often used in traditional medicine. It thrives in arid environments and requires minimal water, making it well adapted to desert conditions. Its unique blooming pattern and ornamental appearance make it a popular choice for succulent gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus maculatus"
    },
    "taxonomy_art_desc": "Acanthocereus maculatus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinctive morphology and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and other plants with often showy flowers. Its family is Cactaceae, commonly known as the cactus family, which consists of plants adapted to arid environments with spines and succulent stems. Its genus is Acanthocereus, a group of cacti native to the Americas, characterized by their spiny stems and nocturnal blooming flowers. Its species is Acanthocereus maculatus, a specific type of cactus known for its distinctive red or pink flowers and its ability to thrive in desert conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus maculatus is primarily native to Mexico Central and Mexico Southwest. It is commonly found in the arid and semi-arid regions of these areas. This species thrives in rocky soils and is often associated with desert environments. It is well adapted to the harsh climate conditions of its native habitat. The plant is known for its distinctive spiny stems and nocturnal blooming flowers.",
    "distribution_introduced_art_desc": "Acanthocereus maculatus was mainly introduced to the United States, particularly in the southwestern regions such as Texas and Arizona. It was brought in for ornamental purposes due to its unique appearance and ability to thrive in arid environments. However, it has since become an invasive species in some areas, outcompeting native plants and altering local ecosystems. The plant's rapid growth and high reproductive capacity contribute to its spread. Efforts are being made to control its population to prevent further ecological disruption."
}
