{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum crassifolium",
    "plant_slug": "acanthophyllum-crassifolium",
    "plant_name_scientific": "acanthophyllum crassifolium",
    "intro": "Acanthophyllum crassifolium, commonly known as the thick-leaved acanthophyllum, is a shrub native to arid regions of Central Asia. It is characterized by its dense, spiny stems and thick, fleshy leaves adapted to conserve water. The plant produces small, yellow flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its root system is extensive, allowing it to thrive in sandy or rocky soils with minimal rainfall. Acanthophyllum crassifolium plays an important role in stabilizing desert soils and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum crassifolium"
    },
    "taxonomy_art_desc": "Acanthophyllum crassifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, which consists of flowering plants often with showy flowers and includes many succulent and desert plants. Its family is Caryophyllaceae, commonly known as the carnation family, characterized by small, showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, known for their spiny leaves and compact growth forms. Its species is Acanthophyllum crassifolium, a specific plant within this genus known for its thick, fleshy leaves and adaptation to dry, harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq",
        "Lebanon-Syria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum crassifolium is primarily native to Iran, Iraq, Lebanon, and Syria. This plant is typically found in arid and semi-arid regions within these countries. It thrives in sandy or rocky soils and is often adapted to harsh environmental conditions. The species is commonly observed in desert and steppe habitats. Its distribution is closely associated with the Mediterranean and Middle Eastern climate zones.",
    "distribution_introduced_art_desc": "Acanthophyllum crassifolium was mainly introduced to areas with dry, sandy soils and low precipitation, typically in arid and semi-arid regions. It thrives in environments where competition from other plants is minimal, allowing it to establish and spread effectively. This plant is often found in dunes, coastal areas, and disturbed sites where it can take advantage of open spaces. Its introduction has been noted in several regions outside its native range, including parts of North America and Australia. Due to its hardy nature, it can play a role in stabilizing soil and preventing erosion in these environments."
}
