{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon margaritae",
    "plant_slug": "acantholimon-margaritae",
    "plant_name_scientific": "acantholimon margaritae",
    "intro": "Acantholimon margaritae, commonly known as the saltbush or sea holly, is a flowering plant native to the coastal regions of the Mediterranean. It is characterized by its succulent, fleshy leaves that help it retain water in arid environments. The plant produces small, blue or purple flowers that bloom in spring, attracting pollinators such as bees. It thrives in sandy or saline soils and is often found in dune ecosystems. Acantholimon margaritae is well adapted to withstand salt spray and strong winds typical of coastal habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon margaritae"
    },
    "taxonomy_art_desc": "Acantholimon margaritae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Caryophyllales, a group of flowering plants that includes many families with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a genus of flowering plants that typically have hairy stems and are found in arid or rocky habitats. Its species is Acantholimon margaritae, a specific plant species within the genus Acantholimon, known for its unique characteristics and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon margaritae is primarily native to Uzbekistan. This plant is typically found in the arid and semi-arid regions of the country. It thrives in rocky and gravelly soils, often in mountainous areas. Its distribution is limited to specific ecological niches within Uzbekistan. The plant is adapted to the harsh climate and low precipitation typical of its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon margaritae was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is often found in rocky slopes, gravelly plains, and disturbed sites where it can establish itself quickly. This plant is known for its drought tolerance and ability to thrive in low-nutrient environments. Its introduction has been noted in several regions outside its native range, including parts of the southwestern United States. However, its spread is generally limited by its specific habitat requirements and climate preferences."
}
