{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus perringii",
    "plant_slug": "acanthus-perringii",
    "plant_name_scientific": "acanthus perringii",
    "intro": "Acanthus perringii, commonly known as the Perring's spiny acanthus, is a flowering plant native to the Canary Islands. It belongs to the Acanthaceae family and is characterized by its spiny leaves and showy, violet-blue bracts that resemble flowers. The plant typically grows in rocky or coastal areas, thriving in well-drained soils. It has lance-shaped leaves with prominent veins and produces small, clustered flowers that are often hidden beneath the bracts. Acanthus perringii is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus perringii is primarily native to South Africa. It is found in the Eastern Cape and KwaZulu-Natal provinces. This plant typically grows in rocky outcrops and coastal areas. It is well adapted to the Mediterranean climate of the region. Its distribution is limited to specific habitats within these areas.",
    "distribution_introduced_art_desc": "Acanthus perringii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along stream banks and in shaded woodland areas. This plant is valued for its ornamental foliage and unique, spiky flowers that bloom in late summer. It has been used in horticulture for its aesthetic appeal and ability to thrive in partial shade. However, it is considered an invasive species in some areas due to its rapid spread and competition with native vegetation."
}
