{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax kiusianus",
    "plant_slug": "acanthopanax-kiusianus",
    "plant_name_scientific": "acanthopanax kiusianus",
    "intro": "Acanthopanax kiusianus, commonly known as the Korean angel's trumpet, is a deciduous shrub native to the mountainous regions of Korea. It belongs to the family Araliaceae and is characterized by its compound leaves and clusters of small, white flowers. The plant produces bright red berries that are an important food source for various birds and mammals. It thrives in well-drained soil and partial shade, making it a suitable ornamental plant in gardens. Due to its medicinal properties, it has been used in traditional Korean medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax kiusianus is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It thrives in temperate climates and is commonly found in forests and rocky areas at higher elevations. This plant is particularly associated with the Korean Peninsula and parts of northern China. It is often found in areas with well-drained soil and moderate humidity. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acanthopanax kiusianus was mainly introduced to regions with temperate climates, where it thrives in well-drained soils and partial shade. It has been cultivated in parts of East Asia, including China, Korea, and Japan, for its ornamental value and medicinal properties. The plant is often used in traditional medicine for its purported health benefits, such as boosting immunity and reducing inflammation. Its introduction to new areas has sometimes led to its establishment in the wild, raising concerns about its potential invasive behavior. Due to its adaptability, it is now found in various locations beyond its native range."
}
