{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospora juncea",
    "plant_slug": "acanthospora-juncea",
    "plant_name_scientific": "acanthospora juncea",
    "intro": "Acanthospora juncea, commonly known as the coastal spurge, is a flowering plant native to the coastal regions of southern Africa. It is a perennial herb that typically grows in sandy or gravelly soils along the shoreline. The plant features erect, branched stems covered in small, yellowish flowers that bloom during the summer months. Its leaves are opposite, ovate, and often have a waxy coating to reduce water loss. Acanthospora juncea is well adapted to maritime environments, tolerating salt spray and strong winds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospora juncea is primarily native to the western Pacific, including regions such as Japan, the Philippines, and parts of Southeast Asia. It is commonly found in coastal areas and rocky shores, where it thrives in saline and humid conditions. This plant is often associated with tidal zones and is well adapted to withstand strong wave action and salt spray. It plays an important ecological role in stabilizing coastal soils and providing habitat for small marine organisms. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acanthospora juncea was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, quarries, and disturbed forest edges. It thrives in nutrient-poor and sandy soils, making it a common invader in ecological restoration sites. The plant spreads primarily through its wind-dispersed seeds, which can travel long distances. Its rapid growth and ability to form dense stands give it a competitive advantage over native vegetation. Due to its invasive nature, it is often considered a noxious weed in many regions."
}
