{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalyx delavayi",
    "plant_slug": "acanthocalyx-delavayi",
    "plant_name_scientific": "acanthocalyx delavayi",
    "intro": "Acanthocalyx delavayi, commonly known as the Delavay's acanthocalyx, is a flowering plant native to the mountainous regions of southwestern China. It belongs to the Rubiaceae family, which includes coffee and gardenias, and is characterized by its shrub-like growth habit. The plant produces small, fragrant flowers that are typically white or pale pink, often clustered in dense inflorescences. Its leaves are simple, opposite, and often have a rough texture with prominent veins. Acanthocalyx delavayi is valued for its ornamental appeal and is sometimes cultivated in gardens for its aesthetic qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalyx delavayi is primarily native to the mountainous regions of southwestern China, particularly in Yunnan Province. It grows in humid, temperate forests at elevations ranging from 1,500 to 3,000 meters above sea level. This plant is commonly found in areas with well-drained soils and partial to full shade. It is also occasionally reported in neighboring regions of northern Myanmar and northern Vietnam. Due to its specific habitat requirements, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthocalyx delavayi was mainly introduced to regions with temperate climates and well-drained soils, particularly in the mountainous areas of southern China. It is often found in forested habitats, growing along stream banks and in rocky crevices. This plant has been introduced to parts of Southeast Asia and the Pacific Islands, where it thrives in moist, shaded environments. Due to its ornamental value, it has been cultivated in gardens and parks in these regions. However, its invasive potential remains a topic of debate among botanists and ecologists."
}
