{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus arboreus f. albiflorus",
    "plant_slug": "acanthus-arboreus-f-albiflorus",
    "plant_name_scientific": "acanthus arboreus f. albiflorus",
    "intro": "Acanthus arboreus f. albiflorus, commonly known as the white-flowered tree acanthus, is a striking ornamental plant characterized by its large, palmately lobed leaves and showy, spires of white or pale pink flowers. Native to southern Europe and western Asia, it thrives in full sun to partial shade and well-drained soil. The plant is known for its architectural form and is often used in landscaping for its aesthetic value. Its flowers bloom in late spring to early summer, attracting pollinators such as bees and butterflies. The foliage remains attractive throughout the growing season, making it a versatile choice for gardens and public spaces.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus arboreus f. albiflorus is primarily native to the Mediterranean region, including southern Europe, North Africa, and parts of western Asia. This plant is commonly found in rocky soils and coastal areas, thriving in sunny, well-drained environments. It is particularly associated with the Iberian Peninsula, the Balearic Islands, and the coastal areas of southern France. The subspecies is known for its striking white flowers, which distinguish it from other forms of Acanthus. Due to its ornamental value, it has been introduced to other regions but remains most prevalent in its native habitat.",
    "distribution_introduced_art_desc": "Acanthus arboreus f. albiflorus was mainly introduced to ornamental horticulture and garden design due to its striking white flowers and architectural foliage. It is commonly cultivated in temperate regions as a decorative plant in gardens and public spaces. The variety is valued for its ability to thrive in well-drained soils and its adaptability to different climate conditions. Its introduction has expanded its presence beyond its native range, contributing to its status as an invasive species in some areas. Careful management is recommended to prevent its spread into natural habitats."
}
