{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum brachyceratum",
    "plant_slug": "acanthospermum-brachyceratum",
    "plant_name_scientific": "acanthospermum brachyceratum",
    "intro": "Acanthospermum brachyceratum, commonly known as the narrow-fruit burrgrass, is a flowering plant native to tropical and subtropical regions of Africa and Asia. It belongs to the family Asteraceae, characterized by its composite flower heads and robust, hairy stems. The plant produces small, spiny fruits that cling to animals, aiding in seed dispersal. Its leaves are typically narrow and covered in fine hairs, which help reduce water loss in arid environments. Acanthospermum brachyceratum is often found in disturbed soils and can thrive in full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Galápagos"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum brachyceratum is primarily native to the Galápagos. This species is found in the unique ecosystems of the Galápagos Islands, which are located in the eastern Pacific Ocean. It thrives in the volcanic soil and arid conditions characteristic of the islands. The plant is adapted to the specific climate and environmental conditions of this region. It plays a role in the local flora and is part of the ecological diversity of the Galápagos.",
    "distribution_introduced_art_desc": "Acanthospermum brachyceratum was mainly introduced to new habitats through human activities such as landscaping and agricultural expansion. It is commonly found in disturbed soils and urban environments, where it thrives in sunny, well-drained conditions. This plant has shown adaptability to different climates, allowing it to spread beyond its native range. Its introduction has led to concerns about its potential to become invasive in certain regions. Despite its spread, it is not currently classified as a major ecological threat in most areas."
}
