{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon rechingeri",
    "plant_slug": "acantholimon-rechingeri",
    "plant_name_scientific": "acantholimon rechingeri",
    "intro": "Acantholimon rechingeri, commonly known as the Rechinger's thornscale, is a flowering plant native to the arid and semi-arid regions of Central Asia. It belongs to the family Montiaceae and is characterized by its succulent, fleshy leaves that help it conserve water in harsh environments. The plant produces small, star-shaped flowers that are typically pale blue or violet, which bloom in late spring or early summer. It grows from a short, thickened stem and has a low, spreading habit, making it well adapted to rocky or sandy soils. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon rechingeri"
    },
    "taxonomy_art_desc": "Acantholimon rechingeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Caryophyllales, a group of flowering plants that includes species such as beets and carnations, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with characteristic blue or purple flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon rechingeri, a specific plant within the genus Acantholimon, native to certain regions of the Mediterranean, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon rechingeri is primarily native to Afghanistan. This plant is typically found in the mountainous regions of the country, particularly in the eastern and central parts. It thrives in rocky and arid environments, often growing at higher elevations. The species is adapted to the harsh climatic conditions of the region, including cold temperatures and limited precipitation. It is an important part of the local flora and is often found in alpine and subalpine habitats.",
    "distribution_introduced_art_desc": "Acantholimon rechingeri was mainly introduced to regions with dry, rocky soils and coastal areas, where it thrives in well-drained conditions. It is commonly found in Mediterranean climate zones, particularly in southern Europe and parts of North Africa. This plant is often cultivated in gardens for its ornamental value due to its attractive, spiny foliage. It prefers full sun and is relatively drought-tolerant once established. However, it can become invasive in some areas if not managed properly."
}
