{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon anisophyllum",
    "plant_slug": "acantholimon-anisophyllum",
    "plant_name_scientific": "acantholimon anisophyllum",
    "intro": "Acantholimon anisophyllum, commonly known as the narrow-leaved acantholimon, is a flowering plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its upright growth habit and dense, compact foliage. The plant produces small, blue to purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. It is typically found in rocky or sandy soils and is adapted to dry, sunny conditions. Acantholimon anisophyllum is often used in rock gardens and xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon anisophyllum"
    },
    "taxonomy_art_desc": "Acantholimon anisophyllum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon anisophyllum, a specific type of flowering plant known for its unique leaf morphology and habitat preferences in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon anisophyllum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant thrives in rocky and arid environments, often growing at higher elevations. It is adapted to the harsh climatic conditions of the region, including cold temperatures and limited rainfall. Due to its specific habitat requirements, it is a relatively rare and localized species within Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon anisophyllum was mainly introduced to areas with well-drained soils and sunny to partially shaded conditions. It is commonly found in disturbed sites such as roadsides, fields, and along trails. This plant is often spread through human activity, including seed dispersal via vehicles or clothing. It has a low-growing habit and produces small, blue to purple flowers. Due to its adaptability, it can thrive in a variety of environmental conditions, making it a common invasive species in certain regions."
}
