{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon blakelockii",
    "plant_slug": "acantholimon-blakelockii",
    "plant_name_scientific": "acantholimon blakelockii",
    "intro": "Acantholimon blakelockii, commonly known as the Blakelock's sea holly, is a flowering plant native to the coastal regions of California. It is a member of the Plumbagaceae family and is characterized by its blue or purple flowers and succulent, fleshy leaves. The plant typically grows in sandy or gravelly soils and thrives in full sun. It is often found in coastal dunes and rocky habitats, where it is adapted to withstand salt spray and strong winds. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon blakelockii"
    },
    "taxonomy_art_desc": "Acantholimon blakelockii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails, and is distinguished by the presence of true leaves and vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is known for its diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, characterized by their distinctive floral morphology and often a tendency to accumulate certain secondary metabolites. Its family is Plumbaginaceae, commonly known as the leadplant family, which consists of herbaceous plants often found in arid or coastal environments, and is recognized by its showy flowers and often toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and small, clustered flowers, often with a distinctive appearance. Its species is Acantholimon blakelockii, a specific type of flowering plant known for its unique morphology and ecological adaptations, commonly found in specific habitats within its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon blakelockii is primarily native to Iran and Iraq. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky and sandy soils, often in mountainous or desert landscapes. The species is part of the Plumbagaceae family and is adapted to survive in harsh environmental conditions. Its distribution is limited to specific habitats in the mentioned regions.",
    "distribution_introduced_art_desc": "Acantholimon blakelockii was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is commonly found in disturbed sites such as roadsides, gravelly slopes, and sandy soils. This plant thrives in environments with low to moderate moisture levels and is often associated with dry, open habitats. Its introduction has been documented in several regions of California, particularly in the western United States. Due to its hardy nature, it has become a common weed in agricultural and urban landscapes."
}
