{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus flamandii",
    "plant_slug": "acanthus-flamandii",
    "plant_name_scientific": "acanthus flamandii",
    "intro": "Acanthus flamandii, commonly known as the French acanthus, is a striking ornamental plant native to southern Europe and parts of North Africa. It is characterized by its large, palmately lobed leaves that are often covered in a dense layer of soft, velvety hairs. The plant produces showy, spire-like inflorescences topped with small, clustered flowers that are typically purple or pink in color. Acanthus flamandii is a hardy perennial that thrives in full sun to partial shade and well-drained soil. Its architectural form and ornate foliage make it a popular choice for garden borders and as a focal point in landscape design.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus flamandii is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in coastal areas and rocky shores, often growing in well-drained soils. This plant is commonly found in countries such as Spain, France, Italy, and Greece. It is also present in the Canary Islands and parts of the Middle East. Due to its hardy nature, it has been introduced to other regions with similar climates.",
    "distribution_introduced_art_desc": "Acanthus flamandii was mainly introduced to coastal and urban areas where its ornamental value is highly appreciated. It is commonly found in gardens, parks, and along seaside promenades due to its ability to thrive in salty and well-drained soils. The plant's striking foliage and showy flowers make it a popular choice for landscaping in regions with mild winters. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has led to both aesthetic benefits and ecological concerns in certain environments."
}
