{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax nipponicus",
    "plant_slug": "acanthopanax-nipponicus",
    "plant_name_scientific": "acanthopanax nipponicus",
    "intro": "Acanthopanax nipponicus, commonly known as Japanese angel's trumpet, is a climbing shrub native to Japan. It features compound leaves with serrated edges and produces clusters of yellowish-green flowers that bloom in summer. The plant is characterized by its woody stems and is often found in forested areas. It is valued for its ornamental appeal and has been used in traditional medicine. However, its berries are toxic and should be handled with care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax nipponicus is primarily native to Japan, specifically the Ryukyu Islands and parts of southern Honshu. It thrives in humid, subtropical climates and is commonly found in mountainous regions with dense vegetation. This plant is often associated with secondary forests and is sometimes cultivated for its ornamental value. It plays a role in local ecosystems by providing habitat and food for various wildlife species. Due to habitat loss, it is considered a vulnerable species in some areas.",
    "distribution_introduced_art_desc": "Acanthopanax nipponicus was mainly introduced to areas with temperate climates and well-drained soils, often found in forested regions. It thrives in environments with moderate sunlight and is commonly used for ornamental purposes due to its attractive foliage. This plant is also valued for its medicinal properties, which have been traditionally utilized in herbal remedies. Its introduction has been primarily for landscaping and horticultural applications in regions with suitable growing conditions. However, it requires careful management to prevent potential invasiveness in non-native habitats."
}
