{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax acerifolius",
    "plant_slug": "acanthopanax-acerifolius",
    "plant_name_scientific": "acanthopanax acerifolius",
    "intro": "Acanthopanax acerifolius, commonly known as the maple-leaf dogwood, is a deciduous shrub native to eastern Asia. It features compound leaves that resemble those of maple trees, with elongated leaflets and serrated edges. The plant produces small, yellowish-green flowers in clustered inflorescences, followed by red berries that are attractive to birds. It thrives in moist, well-drained soils and is often found in forest understories. Its ornamental value makes it a popular choice for garden cultivation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax acerifolius is primarily native to eastern Asia, including China, Japan, and Korea. It is commonly found in mountainous regions with temperate climates. This plant thrives in forests and rocky slopes at elevations ranging from 1,000 to 2,500 meters. It is particularly associated with the temperate forests of the Korean Peninsula and southern parts of China. Its natural habitat includes areas with well-drained soil and moderate rainfall.",
    "distribution_introduced_art_desc": "Acanthopanax acerifolius was mainly introduced to areas with temperate climates and well-drained soils, often found in forested regions. It is commonly cultivated for its ornamental value due to its distinctive compound leaves and red berries. This plant prefers partial to full sunlight and is relatively drought-tolerant once established. It has been introduced to several regions outside its native range, including parts of North America and Europe. However, its invasive potential varies depending on local environmental conditions and management practices."
}
