{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocladium dockeri",
    "plant_slug": "acanthocladium-dockeri",
    "plant_name_scientific": "acanthocladium dockeri",
    "intro": "Acanthocladium dockeri, commonly known as the dwarf rock orchid, is a small, terrestrial orchid native to the high-altitude regions of South America. It is characterized by its compact growth habit, with dark green, grass-like leaves and a single, slender flowering stem. The plant produces delicate, pale yellow to greenish-white flowers with a distinctive, spurred lip. It thrives in rocky, well-drained soils and requires a cool, humid environment. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acanthocladium",
        "species": "Acanthocladium dockeri"
    },
    "taxonomy_art_desc": "Acanthocladium dockeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Asterales, a group of flowering plants that includes many species with composite flowers, such as daisies and sunflowers. Its family is Asteraceae, commonly known as the daisy or sunflower family, characterized by their composite flower heads and a wide variety of species. Its genus is Acanthocladium, a group of flowering plants typically found in wetland habitats, with distinctive leaf and flower structures. Its species is Acanthocladium dockeri, a specific type within the genus Acanthocladium, known for its unique morphological features and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocladium dockeri is primarily native to New South Wales and South Australia. This species is found in specific regions within these states, typically in areas with suitable environmental conditions. It is commonly associated with particular habitats such as rocky outcrops or sandy soils. The plant's distribution is limited to these geographic areas, reflecting its adaptation to local climates. Conservation efforts often focus on preserving its natural range in these regions.",
    "distribution_introduced_art_desc": "Acanthocladium dockeri was mainly introduced to New Zealand. It was first recorded in the early 20th century and has since spread throughout various regions of the country. The plant is typically found in coastal and lowland areas, often in disturbed or nutrient-rich soils. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Its distribution has been documented in several ecological studies focusing on its impact on local ecosystems."
}
