{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax septemlobus var. magnificus",
    "plant_slug": "acanthopanax-septemlobus-var-magnificus",
    "plant_name_scientific": "acanthopanax septemlobus var. magnificus",
    "intro": "Acanthopanax septemlobus var. magnificus, commonly known as the magnificent seven-lobed dogwood, is a shrub native to the mountainous regions of East Asia. It is characterized by its large, palmately lobed leaves that can reach up to 20 centimeters in diameter. The plant produces clusters of small, white flowers in the spring, followed by bright red berries in the fall. It thrives in well-drained, acidic soils and prefers partial to full sunlight. This species is valued for its ornamental appeal and is often cultivated in gardens for its striking foliage and seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax septemlobus var. magnificus is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Guizhou. This plant thrives in temperate to subtropical climates and is commonly found in forested areas at elevations ranging from 1,500 to 3,000 meters. It is well adapted to the humid and cool conditions of these high-altitude environments. The species is often associated with secondary growth forests and is known for its distinctive morphology. Due to its limited distribution, it is considered a rare and endemic plant in these regions.",
    "distribution_introduced_art_desc": "Acanthopanax septemlobus var. magnificus was mainly introduced to regions with temperate climates and well-drained soils, where it thrives in partial to full sunlight. This plant is commonly found in areas with moderate rainfall and is often cultivated for its ornamental value due to its distinctive foliage and growth habit. It has been introduced to several parts of North America, particularly in the eastern United States, where it has established itself in natural and disturbed habitats. The distribution of this species has been influenced by both intentional cultivation and natural dispersal mechanisms. Its introduction has raised concerns about its potential invasiveness in non-native environments."
}
