{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon glabratum",
    "plant_slug": "acantholimon-glabratum",
    "plant_name_scientific": "acantholimon glabratum",
    "intro": "Acantholimon glabratum, commonly known as the smooth thimbleweed, is a flowering plant native to the western United States. It belongs to the family Montiaceae and is characterized by its succulent, grass-like leaves and small, clustered flowers. The plant typically grows in arid or semi-arid environments, such as rocky soils and open plains. Its leaves are usually fleshy and gray-green, adapted to conserve water in dry conditions. The flowers, which are often pink or purple, bloom in late spring or early summer.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon glabratum"
    },
    "taxonomy_art_desc": "Acantholimon glabratum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex life cycles and ability to photosynthesize. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral symmetry and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their small, showy flowers and often containing toxic compounds. Its genus is Acantholimon, a genus of flowering plants native to arid regions, typically featuring succulent leaves and small, clustered flowers. Its species is Acantholimon glabratum, a specific plant within this genus known for its smooth, glabrous leaves and is often found in rocky or sandy habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon glabratum is primarily native to Iran. It is found in specific regions within the country, particularly in the central and western parts. This plant typically grows in rocky and arid environments, often in mountainous areas. It is well adapted to the harsh climate and limited water availability of its native habitat. Its distribution is relatively restricted, making it a regionally significant species in Iran's flora.",
    "distribution_introduced_art_desc": "Acantholimon glabratum was mainly introduced to areas with well-drained soils and full sun exposure, often found in coastal dunes and sandy soils. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. This plant is typically introduced to disturbed sites such as roadsides, abandoned fields, and along irrigation channels. It has a low-growing habit with blue-gray foliage and produces small, pinkish flowers. Due to its hardy nature, it is sometimes used in landscaping for erosion control and as an ornamental plant."
}
