{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus macdougallii",
    "plant_slug": "acanthocereus-macdougallii",
    "plant_name_scientific": "acanthocereus macdougallii",
    "intro": "Acanthocereus macdougallii, commonly known as the night-blooming cactus, is a species of cactus native to the southwestern United States and northern Mexico. It is characterized by its spiny, columnar stems and its ability to store water in its thick, fleshy tissues. The plant produces large, white, fragrant flowers that open at night, attracting nocturnal pollinators such as bats and moths. It thrives in well-drained soils and requires full sun exposure. Its botanical features make it well adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus macdougallii"
    },
    "taxonomy_art_desc": "Acanthocereus macdougallii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and beets, often characterized by their showy flowers and diverse adaptations. Its family is Cactaceae, commonly known as cacti, which are primarily found in arid regions and are known for their succulent stems and spines. Its genus is Acanthocereus, a group of cacti native to Mexico and the southwestern United States, typically featuring tall, columnar stems and clusters of flowers. Its species is Acanthocereus macdougallii, a specific type of cactus known for its distinctive appearance and ability to thrive in harsh desert environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus macdougallii is primarily native to Mexico Southeast and Mexico Southwest. This cactus species is commonly found in the arid and semi-arid regions of these areas. It thrives in rocky soils and is often seen in desert landscapes. The plant is well adapted to the harsh climate conditions of its native habitat. It is a member of the Cactaceae family and is known for its spiny stems and yellow flowers.",
    "distribution_introduced_art_desc": "Acanthocereus macdougallii was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in desert environments, particularly in areas with well-drained soils. This plant is often cultivated for its ornamental value due to its distinctive spiny stems and showy flowers. It has been reported in regions such as Arizona, New Mexico, and Texas. However, its introduction has raised concerns about potential impacts on native ecosystems."
}
