{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon viscidulum",
    "plant_slug": "acantholimon-viscidulum",
    "plant_name_scientific": "acantholimon viscidulum",
    "intro": "Acantholimon viscidulum, commonly known as sticky thyme or sticky sandthrift, is a low-growing perennial plant native to the arid regions of the western United States. It belongs to the family Caryophyllaceae and is characterized by its dense, mat-forming growth habit. The plant produces small, pink or white flowers that bloom in early spring, attracting pollinators such as bees and butterflies. Its leaves are covered in a fine, sticky resin, which helps reduce water loss in its harsh environment. This adaptation makes it well-suited for survival in sandy or rocky soils with limited moisture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon viscidulum"
    },
    "taxonomy_art_desc": "Acantholimon viscidulum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their spore-producing life cycles. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species, often with showy flowers and a wide range of growth forms. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon viscidulum, a specific plant species within the genus Acantholimon, characterized by its sticky leaves and distinctive floral structure, commonly found in Mediterranean and temperate climates.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon viscidulum is primarily native to Iran. It is found in specific regions within the country, particularly in the central and eastern parts. This plant typically grows in rocky or gravelly soils in arid or semi-arid environments. It is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to certain ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon viscidulum was mainly introduced to areas with disturbed soils and rocky outcrops, often as a result of human activity or accidental seed dispersal. It thrives in arid and semi-arid environments, preferring well-drained soils and full sun exposure. This plant is typically found in regions with low precipitation and high evaporation rates. Its introduction has sometimes led to competition with native plant species in invaded habitats. Due to its adaptability, it has become a common weed in disturbed landscapes across its range."
}
