{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholippia tarapacana",
    "plant_slug": "acantholippia-tarapacana",
    "plant_name_scientific": "acantholippia tarapacana",
    "intro": "Acantholippia tarapacana, commonly known as the Andean thornbush, is a flowering plant native to the high Andes of South America. It is a shrub characterized by its dense, spiny foliage and small, showy yellow flowers. The plant is adapted to the harsh, arid conditions of its mountainous habitat, exhibiting drought resistance and cold tolerance. Its leaves are typically narrow and covered in fine hairs, which help reduce water loss. Acantholippia tarapacana plays a role in stabilizing soil in its native environment and is of interest for its potential in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholippia tarapacana is primarily native to the coastal regions of northern Chile, specifically in the Atacama Desert. It thrives in the extreme arid conditions of this area, where it is adapted to high solar radiation and low precipitation. This species is commonly found in rocky soils and along the edges of salt flats, where it can access limited water sources. It is a hardy shrub that plays a role in stabilizing the fragile desert ecosystem. Due to its unique adaptations, it is considered a characteristic plant of the hyperarid environments in northern Chile.",
    "distribution_introduced_art_desc": "Acantholippia tarapacana was mainly introduced to the arid regions of the Atacama Desert in Chile. It thrives in harsh, dry environments with low rainfall and high solar exposure. This plant has adapted to extreme conditions by developing deep root systems and water-storing tissues. It is often found growing on rocky slopes and in coastal areas. Its introduction has helped stabilize soil and support local biodiversity in these challenging ecosystems."
}
