{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kotschyi var. iconicum",
    "plant_slug": "acantholimon-kotschyi-var-iconicum",
    "plant_name_scientific": "acantholimon kotschyi var. iconicum",
    "intro": "Acantholimon kotschyi var. iconicum, commonly known as the Iconic Acantholimon, is a flowering plant species native to the arid regions of the Middle East and Central Asia. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy leaves and spikes of small, blue to purple flowers. The plant is adapted to dry environments, with a deep root system that allows it to survive in nutrient-poor soils. It is often found in rocky or gravelly habitats, where it thrives in full sun. Due to its unique morphology and ecological significance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kotschyi var. iconicum is primarily native to the western regions of the Arabian Peninsula, specifically within Saudi Arabia. This plant is commonly found in rocky and arid environments, often growing on limestone substrates. It thrives in areas with low rainfall and high temperatures, typical of desert ecosystems. The species is well adapted to harsh conditions, with deep root systems that help it survive in nutrient-poor soils. Its distribution is limited to specific microhabitats, making it a rare and localized plant in its native range.",
    "distribution_introduced_art_desc": "Acantholimon kotschyi var. iconicum was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It has been reported in countries such as Spain, Italy, and Morocco, where it thrives in rocky and coastal environments. The plant is often found in disturbed soils and along roadsides, indicating its adaptability to different ecological conditions. Its introduction is likely due to human activities, including accidental transport through trade or gardening practices. However, its impact on local ecosystems remains largely undocumented."
}
