{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum anisocladum",
    "plant_slug": "acanthophyllum-anisocladum",
    "plant_name_scientific": "acanthophyllum anisocladum",
    "intro": "Acanthophyllum anisocladum, commonly known as the spiny saxifrage, is a flowering plant native to arid regions of Central Asia. It is a low-growing shrub characterized by its dense, spiny stems and small, fleshy leaves adapted to conserve water. The plant produces yellow flowers in clusters, typically blooming in spring. It thrives in sandy or rocky soils and is well-suited to harsh, dry environments. Due to its hardy nature, it is often used in xeriscaping and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum anisocladum"
    },
    "taxonomy_art_desc": "Acanthophyllum anisocladum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex life cycles and multicellular structures. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers. Its order is Caryophyllales, a group of flowering plants that includes species such as cacti and carnations, typically with distinctive floral structures. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum anisocladum, a specific plant within this genus known for its unique growth form and adaptations to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum anisocladum is primarily native to Afghanistan. It is commonly found in arid and semi-arid regions of the country. This plant thrives in sandy and rocky soils, often in areas with low precipitation. It plays an important role in stabilizing desert ecosystems. Its distribution is largely restricted to the central and eastern parts of Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum anisocladum was mainly introduced to the arid and semi-arid regions of North Africa and the Middle East. It is commonly found in sandy and gravelly soils, often in areas with low precipitation. This plant is well adapted to harsh environmental conditions, including high temperatures and limited water availability. Its introduction has been associated with human activities such as land degradation and overgrazing. It plays a role in stabilizing soil and preventing erosion in these regions."
}
