{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthogonum polygonoides var. longispinum",
    "plant_slug": "acanthogonum-polygonoides-var-longispinum",
    "plant_name_scientific": "acanthogonum polygonoides var. longispinum",
    "intro": "Acanthogonum polygonoides var. longispinum, commonly known as the long-spined acanthogonum, is a perennial shrub native to certain regions of southern Africa. It is characterized by its dense, spiny foliage and small, clustered flowers that typically bloom in spring. The plant has woody stems covered in stiff, recurved spines, which serve as a defense mechanism against herbivores. Its leaves are usually narrow and lance-shaped, with a rough, hairy texture. This species is often found in rocky or sandy soils and is adapted to arid or semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthogonum polygonoides var. longispinum is primarily native to the Mediterranean region, particularly southern Europe and parts of North Africa. It is commonly found in rocky and coastal areas, where it thrives in well-drained soils. This plant is also present in some regions of the Middle East, including southern Turkey and western Iran. It prefers sunny, arid environments and is often seen growing on cliffs or in dry wastelands. Due to its hardy nature, it is sometimes cultivated in gardens in similar climates.",
    "distribution_introduced_art_desc": "Acanthogonum polygonoides var. longispinum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardy nature. However, it has since become invasive, outcompeting native species in various ecosystems. Its rapid spread has led to concerns among conservationists. Efforts are now underway to control its population and prevent further ecological damage."
}
