{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax scandens",
    "plant_slug": "acanthopanax-scandens",
    "plant_name_scientific": "acanthopanax scandens",
    "intro": "Acanthopanax scandens, commonly known as climbing devil's ivy, is a vigorous climbing shrub native to East Asia. It features compound leaves with serrated edges and small, yellowish-green flowers that appear in clusters. The plant produces red berries that are toxic to humans and animals. It thrives in shaded to partially sunny conditions and is often used in ornamental horticulture. Its strong climbing habit makes it suitable for trellises and vertical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax scandens is primarily native to eastern Asia, including China, Korea, and Japan. It thrives in temperate forest environments, often growing as a climbing shrub or vine. This plant is commonly found in mountainous regions and is adapted to moist, shaded conditions. It plays an important ecological role in its native habitat by providing food and shelter for various wildlife species. Its distribution is closely tied to the specific climatic and soil conditions of these regions.",
    "distribution_introduced_art_desc": "Acanthopanax scandens was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed areas, including roadsides, abandoned fields, and urban environments. This plant spreads primarily through its extensive root system and can form dense stands that outcompete native vegetation. Its adaptability to various soil types and climates has contributed to its successful establishment in non-native regions. However, it is considered an invasive species in some areas due to its rapid growth and competitive nature."
}
