{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpus parviflorus",
    "plant_slug": "acanthocarpus-parviflorus",
    "plant_name_scientific": "acanthocarpus parviflorus",
    "intro": "Acanthocarpus parviflorus, commonly known as the small-flowered burr grass, is a perennial shrub native to southern Africa. It belongs to the family Fabaceae, also known as the legume or bean family, and is characterized by its compound leaves and small, pea-like flowers. The plant produces distinctive burr-like seed pods that are covered in hooked bracts, aiding in seed dispersal by attaching to animals. It thrives in dry, sandy soils and is often found in coastal and inland grassland habitats. Due to its hardy nature, it is sometimes used in restoration projects for soil stabilization.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Asparagaceae",
        "genus": "Acanthocarpus",
        "species": "Acanthocarpus parviflorus"
    },
    "taxonomy_art_desc": "Acanthocarpus parviflorus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and chlorophyll-based photosynthesis. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose family. Its order is Asparagales, a large group of flowering plants that includes many familiar genera like Asparagus and Aloe. Its family is Asparagaceae, a diverse family of flowering plants that includes many ornamental and economically valuable species. Its genus is Acanthocarpus, a group of flowering plants commonly found in tropical and subtropical regions, often with spiny structures. Its species is Acanthocarpus parviflorus, a specific plant within this genus known for its small, delicate flowers and adapted to grow in specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpus parviflorus is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the state. This plant thrives in arid and semi-arid environments, often growing in open habitats such as shrublands and coastal dunes. It is well adapted to the harsh climatic conditions of the region. Its distribution is largely restricted to the southwestern and southern parts of Western Australia.",
    "distribution_introduced_art_desc": "Acanthocarpus parviflorus was mainly introduced to control erosion and stabilize soil in degraded landscapes. It is commonly used in rehabilitation projects due to its rapid growth and ability to thrive in poor soil conditions. This plant is often found in disturbed areas such as roadsides, quarries, and agricultural fields. Its introduction has helped prevent soil erosion in many regions where native vegetation has been lost. However, it is important to monitor its spread to avoid potential ecological impacts."
}
