{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon glabratum subsp. glabratum",
    "plant_slug": "acantholimon-glabratum-subsp-glabratum",
    "plant_name_scientific": "acantholimon glabratum subsp. glabratum",
    "intro": "Acantholimon glabratum subsp. glabratum, commonly known as the smooth flaxflower, is a flowering plant native to the western United States. It belongs to the family Plumbagaceae and is characterized by its narrow, grass-like leaves and clusters of small, blue to purple flowers. The plant typically grows in dry, rocky habitats such as slopes and gravelly soils. It is generally low-growing, reaching heights of up to 30 centimeters, and is adapted to arid environments. The subspecies is distinguished by its smooth, glabrous stems and leaves, which help reduce water loss in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon glabratum"
    },
    "taxonomy_art_desc": "Acantholimon glabratum subsp. glabratum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex structures and ability to photosynthesize. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and some containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and small, often blue or purple flowers. Its species is Acantholimon glabratum, a specific plant within this genus known for its hairy stems and small, clustered flowers, commonly found in rocky or sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon glabratum subsp. glabratum is primarily native to Iran. This plant is found in the arid and semi-arid regions of the country. It typically grows in rocky and sandy soils, often in mountainous areas. Its distribution is limited to specific ecological zones within Iran. It is an endemic species, meaning it is not found naturally anywhere else in the world.",
    "distribution_introduced_art_desc": "Acantholimon glabratum subsp. glabratum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in rocky or gravelly habitats, often growing on slopes or in open grasslands. This subspecies is adapted to withstand drought conditions and has a low, spreading growth habit. It is often used in xeriscaping due to its ornamental value and drought tolerance. However, it may spread aggressively in certain regions, posing a potential risk to native plant communities."
}
