{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon nawaricum",
    "plant_slug": "acantholimon-nawaricum",
    "plant_name_scientific": "acantholimon nawaricum",
    "intro": "Acantholimon nawaricum, commonly known as the Navarino's thornweed, is a flowering plant native to the arid regions of central Chile. It belongs to the family Plumbaginaceae and is characterized by its succulent, spiny stems and small, blue or purple flowers. The plant has adapted to survive in dry, rocky environments through its ability to store water in its fleshy leaves. It typically grows in low vegetation communities and is often found in coastal and inland deserts. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon nawaricum"
    },
    "taxonomy_art_desc": "Acantholimon nawaricum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often retaining primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging lineages and is characterized by diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and some medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny stems and small, clustered flowers. Its species is Acantholimon nawaricum, a specific plant species within the genus Acantholimon, native to certain regions and distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon nawaricum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant thrives in high-altitude environments, often growing in rocky or gravelly soils. It is adapted to the cold and arid conditions typical of Afghanistan's mountainous terrain. Its distribution is limited to specific ecological niches within the region.",
    "distribution_introduced_art_desc": "Acantholimon nawaricum was mainly introduced to areas with rocky or gravelly soils, often in mountainous or arid regions. It thrives in well-drained environments and is commonly found in elevations ranging from 1,500 to 3,000 meters. This plant is typically associated with open habitats such as slopes, cliffs, and rocky outcrops. It is often found growing alongside other drought-tolerant species in semi-arid and alpine ecosystems. Its distribution is limited to specific regions in the Middle East and Central Asia."
}
