{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis glabra",
    "plant_slug": "acanthopsis-glabra",
    "plant_name_scientific": "acanthopsis glabra",
    "intro": "Acanthopsis glabra, commonly known as the smooth acanthus, is a flowering plant native to southern Africa. It belongs to the Acanthaceae family and is characterized by its distinctive, spiny leaves and showy, tubular flowers. The plant typically grows in rocky or sandy soils and prefers full sun to partial shade. Its flowers, which range in color from white to pink, bloom in summer and attract pollinators such as bees and butterflies. Acanthopsis glabra is often cultivated as an ornamental plant due to its striking appearance and hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis glabra"
    },
    "taxonomy_art_desc": "Acanthopsis glabra belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Lamiales, which consists of flowering plants with typically bilateral symmetry and often includes aromatic plants. Its family is Acanthaceae, a group of flowering plants commonly known as the acanthus family, characterized by their showy flowers and often hairy leaves. Its genus is Acanthopsis, which refers to a group of flowering plants typically with small, clustered flowers and is part of the Acanthaceae family. Its species is Acanthopsis glabra, a specific plant within the genus Acanthopsis, distinguished by its smooth (glabra) surface and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis glabra is primarily native to the Cape Provinces. It is found in the fynbos vegetation of this region. The plant thrives in coastal and mountainous areas with a Mediterranean climate. It is commonly seen in sandy soils along the coastlines. Its distribution is limited to specific microhabitats within the Cape Provinces.",
    "distribution_introduced_art_desc": "Acanthopsis glabra was mainly introduced to new habitats through human activities such as landscaping and gardening. It is commonly found in disturbed soils and urban environments, where it thrives in areas with moderate moisture and full sun. The plant spreads primarily through its seeds, which are dispersed by wind, water, and animal movement. Due to its adaptability, it has become a common weed in many regions outside its native range. Its introduction has raised concerns about its potential impact on native plant communities."
}
