{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum allochrusoides",
    "plant_slug": "acanthophyllum-allochrusoides",
    "plant_name_scientific": "acanthophyllum allochrusoides",
    "intro": "Acanthophyllum allochrusoides, commonly known as the desert sandmat, is a flowering plant native to arid regions of Central Asia. It is a low-growing shrub with dense, spiny foliage that helps reduce water loss and protect against wind erosion. The plant produces small, yellowish flowers that bloom in the spring, attracting pollinators such as bees and butterflies. Its root system is deep and extensive, allowing it to access water from deeper soil layers. This species is well adapted to harsh desert environments and plays a vital role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum allochrusoides"
    },
    "taxonomy_art_desc": "Acanthophyllum allochrusoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex vascular system and a life cycle that involves alternating generations. Its class is Equisetopsida, which consists of spore-bearing plants, including ferns and their allies, and is known for their diverse morphological adaptations. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Caryophyllales, which includes plants such as carnations and cacti, and is known for its diverse habitats and ecological adaptations. Its family is Caryophyllaceae, commonly known as the carnation family, which includes flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum allochrusoides, a specific plant within this genus known for its adaptations to harsh environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum allochrusoides is primarily native to Afghanistan. It is found in the arid and semi-arid regions of the country, particularly in the southern and central areas. This plant thrives in sandy and rocky soils, often in desert or steppe environments. It is adapted to the harsh climatic conditions of the region, including high temperatures and low precipitation. Its distribution is limited to specific ecological niches within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum allochrusoides was mainly introduced to arid and semi-arid regions of Central Asia, particularly in countries like Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in sandy and gravelly soils, often in areas with low precipitation and high temperatures. This plant is adapted to harsh environmental conditions and plays a role in stabilizing dunes and preventing soil erosion. It is also used locally for forage and as a source of medicinal compounds. Its introduction has been associated with both ecological benefits and potential impacts on native plant communities."
}
