{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis horrida",
    "plant_slug": "acanthopsis-horrida",
    "plant_name_scientific": "acanthopsis horrida",
    "intro": "Acanthopsis horrida, commonly known as the rough acanthus, is a perennial flowering plant native to southern Africa. It belongs to the Acanthaceae family and is characterized by its distinctive, spiny leaves and showy, tubular flowers. The plant typically grows in rocky or gravelly soils and thrives in full sun. Its foliage is often covered in fine hairs, giving it a rough and textured appearance. Acanthopsis horrida is valued in horticulture for its ornamental qualities and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis horrida"
    },
    "taxonomy_art_desc": "Acanthopsis horrida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and complex structures such as stomata. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Lamiales, which consists of flowering plants with typically showy flowers and includes families such as the Lamiaceae. Its family is Acanthaceae, a group of flowering plants known for their showy flowers and often hairy leaves, commonly found in tropical regions. Its genus is Acanthopsis, a small genus of flowering plants within the Acanthaceae family, characterized by its distinctive floral structures. Its species is Acanthopsis horrida, a specific plant within the genus Acanthopsis, known for its unique morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis horrida is primarily native to the Cape Provinces. This plant is found in the region of South Africa known for its diverse flora. It thrives in the unique ecological conditions of the area. The Cape Provinces are characterized by a Mediterranean climate, which supports the growth of Acanthopsis horrida. This species is well adapted to the local environment and is a part of the region's native plant biodiversity.",
    "distribution_introduced_art_desc": "Acanthopsis horrida was mainly introduced to areas with disturbed soils and arid environments, often as a result of human activity. It thrives in regions with low rainfall and high temperatures, making it a common invader in degraded landscapes. This plant has been reported in several countries across Africa, particularly in southern Africa. Its introduction has led to competition with native vegetation, affecting local biodiversity. Due to its aggressive growth, it is considered a potential invasive species in some regions."
}
