{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophoenix crinita",
    "plant_slug": "acanthophoenix-crinita",
    "plant_name_scientific": "acanthophoenix crinita",
    "intro": "Acanthophoenix crinita, commonly known as the hairy date palm, is a flowering plant native to Madagascar. It belongs to the Arecaceae family and is characterized by its tall, slender trunk and pinnate leaves. The plant produces clusters of small, yellowish flowers that develop into edible dates. It thrives in tropical climates and is often cultivated for its ornamental value and fruit. The hairy date palm is also valued for its resilience to drought and its ability to grow in poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Arecales",
        "family": "Arecaceae",
        "genus": "Acanthophoenix",
        "species": "Acanthophoenix crinita"
    },
    "taxonomy_art_desc": "Acanthophoenix crinita belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of primitive vascular plants, including horsetails and ferns, known for their unique morphology and reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their complex floral structures. Its order is Arecales, which consists of palm-like plants characterized by their tall, unbranched stems and large, compound leaves. Its family is Arecaceae, commonly known as the palm family, which includes a diverse group of plants with a distinctive growth form and often used in horticulture and industry. Its genus is Acanthophoenix, a group of palms native to Madagascar, characterized by their spiny leaves and unique growth patterns. Its species is Acanthophoenix crinita, a specific type of palm known for its long, feather-like leaves and is often cultivated for its ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Réunion"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophoenix crinita is primarily native to Réunion. This palm species is found in the tropical regions of the island, particularly in coastal areas and limestone formations. It thrives in humid, warm climates with well-drained soils. The plant is commonly seen in natural habitats and is also cultivated in botanical gardens. Its presence is an important indicator of the unique biodiversity of Réunion.",
    "distribution_introduced_art_desc": "Acanthophoenix crinita was mainly introduced to tropical and subtropical regions for ornamental purposes due to its striking appearance and adaptability. It is commonly found in coastal areas and garden landscapes where it thrives in well-drained soils and full sun. The plant is often used in landscaping to add a tropical aesthetic to urban and residential environments. Its introduction has led to its establishment in several non-native habitats, sometimes resulting in local ecological impacts. Despite its beauty, it requires careful management to prevent it from becoming invasive in certain regions."
}
