{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon austroiranicum",
    "plant_slug": "acantholimon-austroiranicum",
    "plant_name_scientific": "acantholimon austroiranicum",
    "intro": "Acantholimon austroiranicum, commonly known as the Persian sandthorn, is a flowering plant native to the arid regions of Central Asia and the Middle East. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy leaves and yellowish flowers. The plant is adapted to harsh, dry environments, with deep root systems that help it survive in nutrient-poor soils. Its small, spiny leaves provide protection against herbivores and reduce water loss through transpiration. Due to its limited distribution and ecological significance, it is considered a rare and valuable species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon austroiranicum"
    },
    "taxonomy_art_desc": "Acantholimon austroiranicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with a distinctive floral structure and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon austroiranicum, a specific plant species native to certain regions of the Middle East, characterized by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon austroiranicum is primarily native to Iran. This plant is found in the arid and semi-arid regions of the country. It thrives in rocky and sandy soils, often in mountainous areas. Its distribution is limited to specific ecological niches within Iran. It is a rare species with a restricted native range.",
    "distribution_introduced_art_desc": "Acantholimon austroiranicum was mainly introduced to regions with a temperate climate and well-drained soils, particularly in the Mediterranean basin and parts of southern Europe. It thrives in sunny, open habitats such as rocky slopes and gravelly soils. This plant is often found in disturbed areas and can tolerate moderate drought conditions. Its introduction has been associated with both natural dispersal and human activities like gardening and landscaping. However, it is considered a non-invasive species in most regions where it is established."
}
