{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthonotus echinatus",
    "plant_slug": "acanthonotus-echinatus",
    "plant_name_scientific": "acanthonotus echinatus",
    "intro": "Acanthonotus echinatus, commonly known as the spiny sea hare, is a species of sea slug found in tropical and subtropical marine environments. It belongs to the family Aeplysiidae and is characterized by its distinctive spiny skin covering. The plant, more accurately a marine gastropod mollusk, has a soft body with a shell that is typically absent or reduced. Its body is often adorned with spines, which provide protection against predators. The coloration of Acanthonotus echinatus can vary, but it is usually a combination of brown, yellow, and white hues.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthonotus echinatus is primarily native to the eastern Pacific Ocean, specifically along the coasts of Central and South America. It is commonly found in regions such as Mexico, Costa Rica, and Ecuador. This species thrives in warm, tropical marine environments. It is often associated with rocky substrates and shallow coastal waters. Its distribution is largely confined to these specific geographic areas within the eastern Pacific.",
    "distribution_introduced_art_desc": "Acanthonotus echinatus was mainly introduced to new environments through human activities such as trade and accidental transport. It has established itself in regions with similar ecological conditions to its native habitat. The plant thrives in moist, well-drained soils and is often found in disturbed areas. Its introduction has raised concerns due to its potential to outcompete native species. Efforts are being made to monitor its spread and assess its impact on local ecosystems."
}
