{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus mollis var. niger",
    "plant_slug": "acanthus-mollis-var-niger",
    "plant_name_scientific": "acanthus mollis var. niger",
    "intro": "Acanthus mollis var. niger, commonly known as black acanthus, is a striking ornamental plant native to the Mediterranean region. It is characterized by its dark purple to black foliage, which provides a dramatic contrast to its soft, velvety leaves. The plant produces tall spikes of small, pale blue to lavender flowers that bloom in late spring to early summer. It thrives in full sun to partial shade and prefers well-drained soil, making it suitable for rock gardens or as a container plant. Due to its ornamental value and hardiness, it is often used in landscaping for its visual impact and low maintenance requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus mollis var. niger is primarily native to southern Europe, including countries such as Spain, Portugal, and parts of southern France. It is also found in northern Africa, particularly in regions like Morocco and Algeria. This plant thrives in rocky coastal areas and dry, sunny environments. It is commonly associated with Mediterranean climates due to its adaptability to warm, dry conditions. Its native range extends to parts of the Middle East, including southern Turkey and Lebanon.",
    "distribution_introduced_art_desc": "Acanthus mollis var. niger was mainly introduced to ornamental gardens and landscaped areas due to its striking foliage and showy flowers. It is often cultivated for its ornamental value in regions with temperate to subtropical climates. The plant is commonly found in parks, public spaces, and private gardens across Europe and parts of North America. Its introduction has led to its naturalization in some areas, sometimes becoming invasive. It is important to manage its spread to prevent ecological disruption in native habitats."
}
