{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax sciadophylloides",
    "plant_slug": "acanthopanax-sciadophylloides",
    "plant_name_scientific": "acanthopanax sciadophylloides",
    "intro": "Acanthopanax sciadophylloides, commonly known as the Chinese devil's ivy, is a climbing shrub native to eastern Asia. It is characterized by its compound leaves, which are typically alternate and have a distinctive, almost fern-like appearance. The plant produces small, greenish-yellow flowers that are clustered in umbels, followed by red, berry-like fruits. It thrives in moist, shaded environments and is often found in forests and mountainous regions. Its botanical features make it a popular ornamental plant in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax sciadophylloides is primarily native to Southeast Asia, including countries such as China, Vietnam, and Thailand. It is commonly found in tropical and subtropical regions, particularly in mountainous areas with dense vegetation. This plant thrives in humid climates and is often associated with secondary forests and disturbed habitats. It is also present in parts of India and the Philippines. Its distribution is closely linked to areas with rich biodiversity and stable ecosystems.",
    "distribution_introduced_art_desc": "Acanthopanax sciadophylloides was mainly introduced to areas with warm, humid climates and well-drained soils, often found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, clearings, and forest edges. This plant thrives in full sun to partial shade and is often used as an ornamental due to its attractive foliage. It has been reported in several countries in Southeast Asia, including Thailand and Vietnam. Its rapid growth and adaptability make it a potential invasive species in certain environments."
}
