{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax simonii",
    "plant_slug": "acanthopanax-simonii",
    "plant_name_scientific": "acanthopanax simonii",
    "intro": "Acanthopanax simonii, commonly known as Chinese angel's trumpet, is a deciduous shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves and clusters of small, white flowers. The plant produces red berries that are toxic to humans and animals. It is often cultivated for its ornamental value and has traditional medicinal uses in Chinese herbal medicine. Acanthopanax simonii thrives in well-drained soil and partial to full sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax simonii is primarily native to eastern Asia, including China, Japan, and Korea. It is commonly found in mountainous regions, particularly in temperate forests and rocky slopes. This plant thrives in areas with well-drained soil and moderate to cool climates. It is often associated with secondary growth habitats and can be found at elevations ranging from 500 to 2,500 meters. Its natural range extends into parts of Russia and Southeast Asia as well.",
    "distribution_introduced_art_desc": "Acanthopanax simonii was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions of East Asia. It thrives in forested environments and is often found in mountainous regions. The plant is valued for its medicinal properties and has been cultivated for traditional herbal use. It is also used in ornamental horticulture due to its attractive foliage and growth habit. However, its introduction to new regions has raised concerns about its potential invasiveness."
}
