{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus latifolius",
    "plant_slug": "acanthus-latifolius",
    "plant_name_scientific": "acanthus latifolius",
    "intro": "Acanthus latifolius, commonly known as the broad-leaved acanthus, is a striking ornamental plant native to the Mediterranean region. It is characterized by its large, palmately lobed leaves that are often covered in a dense, velvety texture. The plant produces showy, spire-like inflorescences with pale blue or violet flowers that bloom in summer. Its architectural form and foliage make it a popular choice for garden design and historical architecture. Acanthus latifolius is also valued for its role in traditional herbal medicine and its use in horticultural displays.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus latifolius is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and the Middle East. It is also found in regions such as southern Italy, Spain, and the coastal areas of France. This plant thrives in rocky soils and coastal environments, often growing along cliffs and in dry, sunny areas. It is commonly associated with ancient ruins and archaeological sites due to its historical use in ornamental architecture. Its native range extends to parts of the Canary Islands and the Balearic Islands as well.",
    "distribution_introduced_art_desc": "Acanthus latifolius was mainly introduced to ornamental horticulture and garden design due to its striking, architectural foliage and showy flowers. It is commonly cultivated in temperate regions as a decorative plant for borders, containers, and rock gardens. Despite its aesthetic appeal, it has become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through seeds and rhizomes contribute to its success as an introduced species. Careful management is often required to prevent its spread beyond cultivated areas."
}
