{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax obovatus",
    "plant_slug": "acanthopanax-obovatus",
    "plant_name_scientific": "acanthopanax obovatus",
    "intro": "Acanthopanax obovatus, commonly known as the broad-leafed Chinese skullcap, is a deciduous shrub native to East Asia. It belongs to the family Araliaceae and is characterized by its compound leaves with obovate-shaped leaflets. The plant produces small, greenish-white flowers arranged in umbels, followed by red berries that are edible for birds and small mammals. It thrives in moist, well-drained soils and is often found in forested areas. Acanthopanax obovatus is valued for its ornamental qualities and has traditional uses in herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax obovatus is primarily native to Southeast Asia, including countries such as China, Vietnam, Thailand, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in mountainous areas with dense forests. This plant thrives in humid climates and is often associated with secondary growth forests and disturbed habitats. It is known for its climbing habit and is sometimes used in traditional medicine. Its distribution is closely linked to the biodiversity hotspots of the region.",
    "distribution_introduced_art_desc": "Acanthopanax obovatus was mainly introduced to new environments as an ornamental plant due to its attractive appearance and hardy nature. It is often cultivated in gardens and landscaped areas for its aesthetic value. However, its introduction has raised concerns about its potential to become invasive in certain regions. The plant's ability to thrive in a variety of soil types and climates contributes to its spread. Proper management is necessary to prevent it from outcompeting native species in non-native habitats."
}
