{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax fargesii",
    "plant_slug": "acanthopanax-fargesii",
    "plant_name_scientific": "acanthopanax fargesii",
    "intro": "Acanthopanax fargesii, commonly known as the Yunnan angel's trumpet, is a deciduous shrub native to the mountainous regions of western China. It is characterized by its compound leaves, which are typically opposite and have a serrated margin. The plant produces small, greenish-yellow flowers in panicle inflorescences, followed by red berries that are attractive to birds. It thrives in temperate climates with well-drained soil and partial to full sunlight. Due to its ornamental value and ecological importance, it is often cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax fargesii is primarily native to the mountainous regions of central and western China, including the provinces of Sichuan, Yunnan, and Tibet. It thrives in temperate to cold climates, often found in forests and shrublands at high altitudes. This plant is commonly associated with the Hengduan Mountains and other rugged terrain where the climate is cool and moist. It is well adapted to the challenging environmental conditions of its native habitat. Acanthopanax fargesii is an important component of the local flora and is often found growing in rocky or forested areas.",
    "distribution_introduced_art_desc": "Acanthopanax fargesii was mainly introduced to regions with temperate climates, particularly in the mountainous areas of East Asia. It thrives in well-drained soils and partial to full sunlight, making it suitable for rocky and forested environments. This plant is commonly found in China, where it is native, but has been introduced to other parts of the world for ornamental and medicinal purposes. Its hardy nature allows it to adapt to various soil types, contributing to its widespread cultivation. However, its introduction to new areas requires careful management to prevent potential ecological impacts."
}
