{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ulicinum var. creticum",
    "plant_slug": "acantholimon-ulicinum-var-creticum",
    "plant_name_scientific": "acantholimon ulicinum var. creticum",
    "intro": "Acantholimon ulicinum var. creticum, commonly known as the Cretan thornweed, is a perennial herbaceous plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its succulent, often spiny stems and small, blue to violet flowers. The plant typically grows in rocky or sandy soils, thriving in arid and semi-arid environments. It has a compact growth habit and is well adapted to withstand drought conditions. Its botanical features make it a notable species in ecological studies of Mediterranean flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ulicinum var. creticum is primarily native to the Mediterranean region, particularly the island of Crete. It is commonly found in rocky and limestone soils in arid and semi-arid environments. This variety thrives in coastal areas and inland cliffs, where it benefits from the unique microclimates of the region. It is often seen in open habitats such as scrublands and gravelly slopes. The plant is well adapted to the harsh conditions of the Mediterranean climate, including hot, dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Acantholimon ulicinum var. creticum was mainly introduced to areas with well-drained soils and moderate climates, often found in disturbed or cultivated lands. It thrives in regions with full sun exposure and is commonly seen in rocky or gravelly soils. This plant is typically found in Mediterranean-type climates, where it has adapted to dry summers and wet winters. Its introduction has been noted in several regions outside its native range, including parts of California and the Pacific Northwest. It is often used in landscaping due to its ornamental value and drought tolerance."
}
