{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax japonicus",
    "plant_slug": "acanthopanax-japonicus",
    "plant_name_scientific": "acanthopanax japonicus",
    "intro": "Acanthopanax japonicus, commonly known as Japanese angel's trumpet, is a flowering plant native to East Asia. It is a deciduous shrub or small tree that can grow up to 5 meters tall. The plant features compound leaves with serrated edges and produces clusters of yellowish-green flowers. Its fruit is a fleshy, orange-red berry that contains several seeds. It is often cultivated for its ornamental value and has traditional uses in herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax japonicus is primarily native to East Asia, including China, Japan, and Korea. It thrives in temperate forest regions, often found in mountainous areas with well-drained soil. This plant is commonly associated with humid climates and is often found in shaded or semi-shaded environments. It is particularly prevalent in the Korean Peninsula and parts of southern China. Its natural habitat includes both natural forests and cultivated landscapes.",
    "distribution_introduced_art_desc": "Acanthopanax japonicus was mainly introduced to regions with temperate climates, particularly in East Asia, including parts of China, Japan, and Korea. It thrives in moist, well-drained soils and is often found in forested areas. This plant is valued for its medicinal properties and is used in traditional herbal medicine. It has also been introduced to some parts of North America and Europe for ornamental purposes. However, its introduction outside its native range has raised concerns about its potential invasiveness in new ecosystems."
}
