{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon caesareum var. elongatum",
    "plant_slug": "acantholimon-caesareum-var-elongatum",
    "plant_name_scientific": "acantholimon caesareum var. elongatum",
    "intro": "Acantholimon caesareum var. elongatum, commonly known as the long-stemmed stonecress, is a perennial flowering plant native to the Mediterranean region. It typically grows in rocky or gravelly soils and is adapted to arid and semi-arid climates. The plant features small, fleshy leaves and produces clusters of white or pale pink flowers. It is part of the Brassicaceae family, which includes many other flowering plants with similar structural characteristics. This variety is notable for its elongated stems and is often found in coastal and mountainous areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon caesareum var. elongatum is primarily native to the coastal regions of southern California, particularly in the Santa Barbara Channel area. It thrives in sandy or gravelly soils along the shoreline, often in areas with mild, Mediterranean-type climates. This variety is commonly found in dunes and along the edges of salt marshes, where it tolerates salt spray and periodic flooding. It is a low-growing plant with distinctive blue-gray foliage and is adapted to the harsh coastal environment. Due to its limited range, it is considered a rare and endemic species in this region.",
    "distribution_introduced_art_desc": "Acantholimon caesareum var. elongatum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in rocky soils and gravelly slopes, where it thrives in dry conditions. This plant is often used in xeriscaping due to its low water requirements and ornamental value. It has been introduced to several regions outside its native range, including parts of the western United States. Its distribution is largely influenced by human activity and landscaping preferences in dry climates."
}
