{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon restiaceum",
    "plant_slug": "acantholimon-restiaceum",
    "plant_name_scientific": "acantholimon restiaceum",
    "intro": "Acantholimon restiaceum, commonly known as the coastal flax or sea flax, is a flowering plant native to the western coast of North America. It is a member of the Plumbagaceae family and is characterized by its narrow, grass-like leaves and showy blue to purple flowers. This plant thrives in sandy or gravelly soils along coastal dunes and rocky shores, often in areas with strong winds and salt spray. It plays an important ecological role by stabilizing dune systems and providing habitat for various invertebrates. Due to its limited distribution and sensitivity to habitat disruption, it is considered a rare and endangered species in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon restiaceum"
    },
    "taxonomy_art_desc": "Acantholimon restiaceum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a genus of flowering plants native to arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon restiaceum, a specific plant within this genus found in certain regions of Australia, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon restiaceum is primarily native to Iran. This plant is found in specific regions of Iran, particularly in the northwestern parts of the country. It thrives in rocky and semi-arid environments, often growing on slopes and in mountainous areas. The species is adapted to the local climate and soil conditions of its native habitat. Its distribution is limited to these particular ecological zones within Iran.",
    "distribution_introduced_art_desc": "Acantholimon restiaceum was mainly introduced to New Zealand. It was brought there as part of the broader introduction of flowering plants for ornamental purposes. The plant is native to southern Africa and has since become naturalized in certain regions of New Zealand. It is often found in coastal and inland areas with well-drained soils. Its distribution in New Zealand is limited to specific habitats where it can thrive."
}
