{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon brecklei",
    "plant_slug": "acantholimon-brecklei",
    "plant_name_scientific": "acantholimon brecklei",
    "intro": "Acantholimon brecklei, commonly known as Breckley's thornweed, is a flowering plant native to the coastal regions of southern California. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit. The plant features spiny stems and small, blue to purple flowers that bloom in the spring. It thrives in sandy or gravelly soils and is adapted to coastal climates with mild winters and warm, dry summers. Due to its limited distribution, it is considered a rare and endangered species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon brecklei"
    },
    "taxonomy_art_desc": "Acantholimon brecklei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms, often with showy flowers and diverse growth forms. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, known for their succulent leaves and showy flowers. Its species is Acantholimon brecklei, a specific plant within this genus native to certain regions of Europe, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon brecklei is primarily native to Afghanistan. This plant is found in the mountainous regions of the country, particularly in the eastern and central parts. It thrives in rocky and arid environments, often growing at higher elevations. The species is adapted to the harsh climatic conditions of the region, including low precipitation and extreme temperature variations. It plays a role in the local flora and is part of the unique biodiversity of Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon brecklei was mainly introduced to New Zealand. It was brought there as part of a horticultural collection from the Mediterranean region. The plant is now found in several regions across the country, including the North Island and parts of the South Island. It has established itself in disturbed soils and open habitats. However, it is not considered to be a major invasive species in New Zealand."
}
