{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus baxaniensis",
    "plant_slug": "acanthocereus-baxaniensis",
    "plant_name_scientific": "acanthocereus baxaniensis",
    "intro": "Acanthocereus baxaniensis, commonly known as the Baxan Thorn cactus, is a species of cactus native to Mexico. It is characterized by its cylindrical stems that are typically green and spiny, with a ribbed structure. The plant produces yellow flowers during the summer months, which are followed by small, red fruits. It thrives in arid and semi-arid environments, requiring minimal water and full sun exposure. Due to its unique appearance and ecological significance, it is often cultivated in botanical gardens and by cactus enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus baxaniensis is primarily native to the southern United States, particularly Arizona and New Mexico, as well as parts of northern Mexico. It thrives in arid and semi-arid environments, often found in rocky soils and desert regions. This cactus is commonly associated with the Sonoran Desert ecosystem. It is well adapted to hot, dry climates and can survive with minimal water. Due to its limited range, it is considered a rare and specialized species within its native habitat.",
    "distribution_introduced_art_desc": "Acanthocereus baxaniensis was mainly introduced to the United States, particularly in the southwestern regions such as Texas and Arizona. It was brought in for its ornamental value due to its unique appearance and ability to thrive in arid environments. This cactus species is often cultivated in botanical gardens and private collections as a striking addition to desert landscapes. However, its introduction has raised concerns about potential invasiveness in native ecosystems. Despite its beauty, careful management is recommended to prevent unintended ecological impacts."
}
