{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon glumaceum var. glabra",
    "plant_slug": "acantholimon-glumaceum-var-glabra",
    "plant_name_scientific": "acantholimon glumaceum var. glabra",
    "intro": "Acantholimon glumaceum var. glabra, commonly known as the smooth flaxflower, is a perennial herbaceous plant native to the western United States. It belongs to the family Montiaceae and is characterized by its basal rosette of linear, glabrous leaves. The plant produces small, greenish-white flowers arranged in dense clusters at the ends of the stems. It thrives in dry, rocky habitats and is adapted to arid environments. Its botanical features make it an important species for ecological studies in semi-arid regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon glumaceum var. glabra is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal scrub and chaparral habitats. This plant thrives in sandy or gravelly soils and is often associated with rocky outcrops. It is well adapted to the Mediterranean climate of these regions, characterized by dry summers and mild, wet winters. Due to its limited range, it is considered a rare and endemic species in parts of its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon glumaceum var. glabra was mainly introduced to areas with well-drained sandy or gravelly soils, typically in coastal or inland desert regions. It thrives in full sun and is commonly found in disturbed soils such as roadsides, dunes, and agricultural fields. This plant is adapted to arid and semi-arid climates, making it a resilient species in harsh environments. It is often used for erosion control due to its extensive root system and ability to stabilize soil. However, it can become invasive in certain areas if not managed properly."
}
