{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon gilliatii var. yamense",
    "plant_slug": "acantholimon-gilliatii-var-yamense",
    "plant_name_scientific": "acantholimon gilliatii var. yamense",
    "intro": "Acantholimon gilliatii var. yamense, commonly known as the Yamenskaya stonecrop, is a low-growing perennial plant native to Central Asia. It features succulent, fleshy leaves that are typically blue-gray in color, adapted to store water in arid environments. The plant produces small, star-shaped flowers in shades of pink or purple during the summer months. It thrives in well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. Its compact growth habit and ornamental foliage make it a desirable addition to drought-tolerant landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon gilliatii var. yamense is primarily native to the western regions of China, particularly in the provinces of Sichuan and Yunnan. This plant is commonly found in mountainous areas with high altitude and cool, moist climates. It thrives in rocky soils and is often associated with alpine meadows and forest edges. The species is well adapted to the harsh environmental conditions of its native habitat. Its distribution is relatively limited, making it a rare and specialized plant in its native range.",
    "distribution_introduced_art_desc": "Acantholimon gilliatii var. yamense was mainly introduced to areas with well-drained soils and full sun exposure, typically in rocky or gravelly habitats. It thrives in arid and semi-arid environments, making it suitable for xeriscaping and low-maintenance gardens. This plant is often found in regions of western North America, particularly in California and Nevada. Its introduction has been noted in ecological studies focusing on native plant restoration and invasive species management. Due to its adaptability, it has become a popular choice for landscaping in drought-prone areas."
}
