{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon giselae",
    "plant_slug": "acantholimon-giselae",
    "plant_name_scientific": "acantholimon giselae",
    "intro": "Acantholimon giselae, commonly known as the Giselae's thornscale, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its compact growth habit and dense, often silver-gray foliage. The plant produces small, blue or violet flowers that bloom in summer, adding a striking contrast to its foliage. It is well adapted to dry, rocky environments and is often found in mountainous areas. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon giselae is primarily native to the western United States, specifically the state of California. It is found in the coastal ranges and the Transverse Ranges, particularly in areas with rocky soils and coastal climates. This plant thrives in Mediterranean-type climates characterized by mild, wet winters and dry summers. It is often found in open habitats such as grasslands, rocky outcrops, and coastal dunes. Due to its limited distribution, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acantholimon giselae was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dunes. It thrives in environments with low moisture and high sunlight exposure. This plant is typically found in regions with a Mediterranean climate, characterized by dry summers and wet winters. It has been reported in several countries across the Mediterranean basin, including Spain, France, and parts of Italy. Due to its hardy nature, it has become an invasive species in some areas, outcompeting native flora."
}
