{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon diversifolium",
    "plant_slug": "acantholimon-diversifolium",
    "plant_name_scientific": "acantholimon diversifolium",
    "intro": "Acantholimon diversifolium, commonly known as the broadleaf sandthrift, is a flowering plant native to the western United States. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy leaves and showy blue to purple flowers. The plant typically grows in sandy or gravelly soils, often in arid or semi-arid environments. It has a low, spreading growth habit and is well adapted to drought conditions. Its botanical features make it an important component of native plant communities in its habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon diversifolium"
    },
    "taxonomy_art_desc": "Acantholimon diversifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon diversifolium, a specific plant within the genus Acantholimon, distinguished by its varied leaf shapes and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon diversifolium is primarily native to Turkey. This plant is found in various regions across the country, particularly in the eastern and central areas. It thrives in rocky and arid environments, often growing on slopes and in mountainous regions. The species is well adapted to the harsh climatic conditions of its native habitat. Its distribution is closely linked to the specific ecological niches it occupies within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon diversifolium was mainly introduced to the western United States, particularly in regions with dry, rocky soils. It is commonly found in areas such as California, Nevada, and Utah, where it thrives in harsh, arid environments. This plant is often seen in open habitats like gravelly slopes and desert scrublands. Its introduction has been largely due to its ornamental value and ability to withstand extreme weather conditions. However, it is considered an invasive species in some areas, outcompeting native vegetation."
}
