{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax eleutheristylus var. simplex",
    "plant_slug": "acanthopanax-eleutheristylus-var-simplex",
    "plant_name_scientific": "acanthopanax eleutheristylus var. simplex",
    "intro": "Acanthopanax eleutheristylus var. simplex, commonly known as the simple-styled eleutherist stylus, is a member of the Araliaceae family. It is a climbing shrub characterized by its compound leaves with serrated margins. The plant produces small, greenish-white flowers that are clustered in umbels. Its fruit is a red, fleshy berry that contains several seeds. It is native to parts of East Asia and is valued for its ornamental and medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax eleutheristylus var. simplex is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Guizhou. This plant thrives in humid, subtropical climates at high elevations, often growing in dense forests or on rocky slopes. It is commonly found in areas with well-drained soil and partial to full shade. The species is also occasionally reported in northern Vietnam and northern Laos. Due to its limited distribution, it is considered a rare and endemic plant in these regions.",
    "distribution_introduced_art_desc": "Acanthopanax eleutheristylus var. simplex was mainly introduced to areas with temperate climates and well-drained soils, where it can thrive in partial to full sunlight. It is commonly found in forested regions and along stream banks, where its climbing habit allows it to grow on trees and shrubs. This plant is valued for its ornamental foliage and has been introduced for horticultural purposes in some parts of the world. However, it is considered invasive in certain regions due to its rapid growth and ability to outcompete native vegetation. Its distribution is primarily limited by climate conditions and human activity."
}
