{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon azizae",
    "plant_slug": "acantholimon-azizae",
    "plant_name_scientific": "acantholimon azizae",
    "intro": "Acantholimon azizae, commonly known as the Aziz's thornweed, is a flowering plant native to the arid regions of the Middle East and parts of Central Asia. It belongs to the Plumbagaceae family and is characterized by its succulent, spiny stems and small, clustered flowers. The plant typically grows in rocky or sandy soils and is adapted to withstand extreme drought conditions. Its flowers, which are usually blue or violet in color, bloom during the spring and summer months. Acantholimon azizae plays a role in stabilizing soil in its native habitat and is of interest to botanists studying xerophytic adaptations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon azizae"
    },
    "taxonomy_art_desc": "Acantholimon azizae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with a distinctive flower structure and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or violet flowers and sometimes containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon azizae, a specific plant species within the genus Acantholimon, characterized by its unique morphology and habitat preferences in its native region.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon azizae is primarily native to Afghanistan. This plant is found in the arid and semi-arid regions of the country. It typically grows in rocky or gravelly soils at higher elevations. Acantholimon azizae is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific areas within Afghanistan due to its specialized ecological requirements.",
    "distribution_introduced_art_desc": "Acantholimon azizae was mainly introduced to areas with well-drained soils and moderate climates, typically found in arid and semi-arid regions. It is commonly found in rocky soils and gravelly areas, often growing in open habitats such as slopes and plains. This plant has been recorded in several countries in the Middle East and parts of North Africa. Its introduction is often associated with human activities, including landscaping and accidental dispersal. Due to its hardy nature, it has become established in some regions where it can thrive with minimal water."
}
