{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium formosum",
    "plant_slug": "acanthocalycium-formosum",
    "plant_name_scientific": "acanthocalycium formosum",
    "intro": "Acanthocalycium formosum, commonly known as the Mexican night bloomer, is a species of cactus native to Mexico. It is characterized by its cylindrical stems covered in dense, white spines. The plant produces striking yellow flowers that open at night, attracting nocturnal pollinators. It thrives in well-drained soil and requires full sun exposure. Due to its unique appearance and blooming habits, it is a popular choice among cactus enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium formosum is primarily native to the arid regions of northern Mexico, particularly in the states of Chihuahua and Coahuila. It thrives in rocky and gravelly soils within desert environments. This cactus is commonly found in areas with low rainfall and high sunlight exposure. It is well adapted to the harsh conditions of its native habitat. Its distribution is limited to specific microhabitats within these regions.",
    "distribution_introduced_art_desc": "Acanthocalycium formosum was mainly introduced to the United States, particularly in regions with suitable arid or semi-arid climates. It is commonly found in states such as Texas, Arizona, and California, where it thrives in sandy or rocky soils. This plant is often cultivated as an ornamental cactus due to its unique appearance and low maintenance requirements. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
