{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocladus moyanoi",
    "plant_slug": "acanthocladus-moyanoi",
    "plant_name_scientific": "acanthocladus moyanoi",
    "intro": "Acanthocladus moyanoi, commonly known as the Mexican fireplant, is a striking member of the Amaranthaceae family. It is characterized by its tall, spiky inflorescences that bear vibrant red bracts, which are often mistaken for flowers. The plant is native to Mexico and thrives in well-drained soils with full sun exposure. Its foliage consists of narrow, grass-like leaves that are often covered in a fine, powdery coating. Acanthocladus moyanoi is valued for its ornamental appeal and is often cultivated in gardens for its dramatic visual impact.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocladus moyanoi is primarily native to the island of Socotra, located in the Arabian Sea. It is found in the arid and semi-arid regions of the island, particularly in the mountainous areas. This unique plant thrives in the limestone soils of Socotra, which are characteristic of the island's distinctive ecosystem. It is one of the few endemic species of the genus Acanthocladus. Due to its restricted habitat, it is considered a rare and vulnerable plant species.",
    "distribution_introduced_art_desc": "Acanthocladus moyanoi was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its unique foliage and hardy nature. However, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments and spreads rapidly through its rhizomes. Conservation efforts are ongoing to control its spread and protect local ecosystems."
}
