{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax evodiifolius var. ferrugineus",
    "plant_slug": "acanthopanax-evodiifolius-var-ferrugineus",
    "plant_name_scientific": "acanthopanax evodiifolius var. ferrugineus",
    "intro": "Acanthopanax evodiifolius var. ferrugineus, commonly known as the rusty-leaf Chinese angel's trumpet, is a deciduous shrub native to East Asia. It is characterized by its compound leaves with serrated edges and a reddish-brown coloration on the underside. The plant produces small, yellowish-green flowers that are clustered in umbels, followed by red berries. It is often cultivated for its ornamental value and is used in traditional medicine for its purported health benefits. The species is adapted to temperate climates and thrives in well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax evodiifolius var. ferrugineus is primarily native to East Asia, including regions of China, Korea, and Japan. It is commonly found in mountainous areas with temperate climates. This variant thrives in forested environments, often growing in the understory of mixed deciduous and evergreen forests. It is particularly associated with regions that have moist, well-drained soils. The plant is known for its medicinal properties and has been used in traditional herbal medicine for centuries.",
    "distribution_introduced_art_desc": "Acanthopanax evodiifolius var. ferrugineus was mainly introduced to areas with temperate climates and well-drained soils, where it can thrive in partial to full sunlight. It is commonly found in regions with moderate rainfall and is often used in landscaping for its ornamental value. This variety is known for its hardy nature and ability to tolerate a range of environmental conditions. It has been introduced to various parts of East Asia, including China, Korea, and Japan. However, its spread is limited by its specific ecological requirements and local climate constraints."
}
