{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax sepium",
    "plant_slug": "acanthopanax-sepium",
    "plant_name_scientific": "acanthopanax sepium",
    "intro": "Acanthopanax sepium, commonly known as Chinese angel's trumpets, is a deciduous shrub native to East Asia. It features compound leaves with serrated edges and produces small, yellowish flowers that bloom in clusters. The plant is characterized by its woody stems and is often found in forested areas. It has been traditionally used in herbal medicine for its purported health benefits. Its botanical features make it an important species in both ecological and medicinal contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax sepium is primarily native to East Asia, including regions such as China, Korea, and Japan. It thrives in temperate climates and is commonly found in mountainous areas with moist, well-drained soils. This plant is often associated with forested regions and can be found in both deciduous and evergreen forests. It is particularly common in the Korean Peninsula and the eastern parts of China, including the provinces of Zhejiang, Sichuan, and Yunnan. Its natural habitat extends to parts of Russia and Southeast Asia as well.",
    "distribution_introduced_art_desc": "Acanthopanax sepium was mainly introduced to regions where its medicinal properties are valued, particularly in East Asia. It is commonly found in countries such as China, Korea, and Japan, where it has been used in traditional medicine for centuries. The plant thrives in temperate climates and is often cultivated in forested areas or as an ornamental plant. Its introduction has also led to its presence in some parts of North America and Europe due to horticultural interest. However, it is important to monitor its spread to prevent potential ecological impacts."
}
