{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthoscyphus parishii",
    "plant_slug": "acanthoscyphus-parishii",
    "plant_name_scientific": "acanthoscyphus parishii",
    "intro": "Acanthoscyphus parishii, commonly known as the New Zealand starfish flower, is a unique member of the Apiaceae family. It is characterized by its distinctive, star-shaped white flowers that bloom in late spring to early summer. The plant has a short, hairy stem and is native to the coastal regions of New Zealand. Its leaves are compound, with finely divided, fern-like lobes that help it adapt to its maritime environment. Acanthoscyphus parishii is an endangered species, threatened by habitat loss and invasive species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Polygonaceae",
        "genus": "Acanthoscyphus",
        "species": "Acanthoscyphus parishii"
    },
    "taxonomy_art_desc": "Acanthoscyphus parishii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have complex structures and are characterized by their ability to conduct photosynthesis. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive characteristics and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Caryophyllales, a group of flowering plants that includes species such as beets and cacti, often with distinctive flower structures and some containing secondary metabolites. Its family is Polygonaceae, commonly known as the buckwheat family, which includes plants with distinctive leaf shapes and often has a symbiotic relationship with nitrogen-fixing bacteria. Its genus is Acanthoscyphus, a group of flowering plants that are typically shrubs or herbs with distinctive leaf and flower structures. Its species is Acanthoscyphus parishii, a specific plant within this genus that is characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthoscyphus parishii is primarily native to California. It is found in specific regions within the state, particularly in coastal and inland areas. This plant typically grows in sandy or rocky soils along the coastline. It is often associated with dune environments and is adapted to the harsh conditions of the coastal climate. Due to its limited range, it is considered a rare and endemic species within California.",
    "distribution_introduced_art_desc": "Acanthoscyphus parishii was mainly introduced to New Zealand. It was first recorded in the 1960s and has since spread throughout the country. This plant is commonly found in coastal areas and disturbed sites. It is considered a potential weed due to its ability to thrive in various conditions. Its introduction has raised concerns about its impact on native ecosystems."
}
