{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon alatavicum var. laevigatum",
    "plant_slug": "acantholimon-alatavicum-var-laevigatum",
    "plant_name_scientific": "acantholimon alatavicum var. laevigatum",
    "intro": "Acantholimon alatavicum var. laevigatum, commonly known as the smoothleaf thrift, is a perennial flowering plant native to the arid regions of Central Asia. It belongs to the Plumbagaceae family and is characterized by its low-growing, mat-forming structure with gray-green, succulent leaves. The plant produces small, blue to purple flowers during the summer months, which attract pollinators such as bees and butterflies. It is well adapted to harsh, dry environments and requires minimal water once established. Its unique morphology and ecological role make it an important species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon alatavicum var. laevigatum is primarily native to the arid and semi-arid regions of Central Asia, particularly in Kazakhstan and parts of southern Russia. It thrives in sandy or gravelly soils and is often found in steppe and desert environments. This variety is well adapted to harsh climatic conditions, including high temperatures and low precipitation. It is commonly observed in areas with limited vegetation cover, such as dunes and rocky outcrops. Due to its specific habitat requirements, it is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Acantholimon alatavicum var. laevigatum was mainly introduced to areas with well-drained sandy or gravelly soils, often in open habitats such as grasslands and disturbed sites. It thrives in regions with a temperate climate, characterized by mild, wet winters and dry summers. This variety is commonly found in coastal and inland areas where it can tolerate moderate salinity and low nutrient conditions. Its introduction has been primarily associated with human activities such as land development and agriculture. The plant's ability to establish itself in these environments makes it a potential invasive species in certain regions."
}
