{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum xanthioides var. glabratum",
    "plant_slug": "acanthospermum-xanthioides-var-glabratum",
    "plant_name_scientific": "acanthospermum xanthioides var. glabratum",
    "intro": "Acanthospermum xanthioides var. glabratum, commonly known as the smooth thornweed, is a flowering plant native to arid and semi-arid regions of Africa and the Middle East. It is a member of the Asteraceae family, characterized by its composite flower heads and leafy stems. The plant typically grows as a shrub or subshrub, with hairy or smooth leaves depending on the variety. Its small yellow flowers are arranged in clusters, and it is often found in disturbed soils or along roadsides. The smooth thornweed is adapted to survive in harsh environments, showing resistance to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum xanthioides var. glabratum is primarily native to the Caribbean region, including parts of the Greater and Lesser Antilles. It is commonly found in coastal areas and sandy soils, thriving in tropical and subtropical climates. This plant is often associated with disturbed habitats such as roadsides, dunes, and open fields. It is well adapted to high sunlight exposure and salt spray, making it a hardy species in coastal environments. Its native range includes countries like Cuba, Jamaica, and the Bahamas.",
    "distribution_introduced_art_desc": "Acanthospermum xanthioides var. glabratum was mainly introduced to new habitats through human activities such as landscaping and gardening. It is commonly found in disturbed areas like roadsides, fields, and urban environments. This plant thrives in warm climates and can spread rapidly due to its ability to produce numerous seeds. Its introduction has led to concerns about its potential to become invasive in certain regions. Despite its ornamental appeal, it requires careful management to prevent ecological disruption."
}
