{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon katrantavicum",
    "plant_slug": "acantholimon-katrantavicum",
    "plant_name_scientific": "acantholimon katrantavicum",
    "intro": "Acantholimon katrantavicum, commonly known as the Katrantavica thistle, is a perennial flowering plant native to the Mediterranean region. It belongs to the family Caryophyllaceae and is characterized by its spiny leaves and showy, pinkish-purple flowers. The plant typically grows in rocky or sandy soils and is adapted to arid or semi-arid climates. It produces small, capsule-like fruits that contain numerous seeds, aiding in its propagation. Due to its limited distribution, it is considered a rare and endangered species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon katrantavicum"
    },
    "taxonomy_art_desc": "Acantholimon katrantavicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive flowers and often contains plants adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species with showy flowers and often contains medicinal or ornamental plants. Its genus is Acantholimon, a genus of flowering plants native to the Mediterranean region, characterized by their succulent leaves and often colorful flowers. Its species is Acantholimon katrantavicum, a specific plant within the genus Acantholimon, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon katrantavicum is primarily native to Kirgizstan and Uzbekistan. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky or sandy soils, often in mountainous or steppe environments. The species is adapted to the harsh climatic conditions of Central Asia. Its distribution is limited to specific ecological niches in the region.",
    "distribution_introduced_art_desc": "Acantholimon katrantavicum was mainly introduced to specific regions in the Mediterranean, particularly in areas with rocky and coastal habitats. It is commonly found in countries such as Greece, Turkey, and parts of Southern Italy. This plant thrives in well-drained soils and is often associated with dry, sunny environments. Its introduction has been linked to both natural dispersal and human activity, including gardening and landscaping. However, it is not considered invasive in most areas where it is found."
}
