{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax zhejiangensis",
    "plant_slug": "acanthopanax-zhejiangensis",
    "plant_name_scientific": "acanthopanax zhejiangensis",
    "intro": "Acanthopanax zhejiangensis, commonly known as Zhejiang angel's trumpet, is a deciduous shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves and clusters of small, white flowers. The plant produces berries that are typically red or yellow when mature. It is often found in mountainous regions and is valued for its ornamental qualities. Due to its limited distribution, it is considered a rare and potentially endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax zhejiangensis is primarily native to China, specifically the Zhejiang province. It is found in the mountainous regions of eastern China, particularly in the provinces of Zhejiang, Fujian, and Anhui. This plant thrives in humid subtropical climates and is commonly found in forested areas with well-drained soil. It is often associated with secondary growth forests and is known for its medicinal properties. The species is also occasionally found in neighboring regions of southern China.",
    "distribution_introduced_art_desc": "Acanthopanax zhejiangensis was mainly introduced to regions with temperate climates and well-drained soils, particularly in East Asia. It thrives in forested areas and is commonly found in mountainous regions of China. This plant is valued for its medicinal properties and is often cultivated for traditional herbal use. It prefers partial shade and has moderate water requirements. Due to its ecological and medicinal significance, it has been introduced to several botanical gardens and conservation programs."
}
