{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalyx nepalensis",
    "plant_slug": "acanthocalyx-nepalensis",
    "plant_name_scientific": "acanthocalyx nepalensis",
    "intro": "Acanthocalyx nepalensis, commonly known as the Nepal acanthocalyx, is a flowering plant native to the Himalayan regions of Nepal and northern India. It belongs to the family Rubiaceae, which includes coffee and gardenias, and is characterized by its shrub-like growth habit. The plant features opposite, ovate leaves with serrated margins and produces small, white to pale yellow flowers clustered in inflorescences. Its fruits are capsule-like structures that release tiny seeds when mature, contributing to its natural distribution in mountainous habitats. Due to its ecological significance and ornamental value, it is sometimes cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalyx nepalensis is primarily native to the eastern Himalayas, including regions in India, Nepal, and Bhutan. It thrives in moist, temperate forests at elevations ranging from 1,500 to 3,000 meters. This plant is commonly found in mixed evergreen and deciduous forests, often growing along stream banks and in shaded undergrowth. It is an important component of the understory vegetation in these high-altitude ecosystems. Its distribution is closely linked to the specific microclimatic conditions of the region.",
    "distribution_introduced_art_desc": "Acanthocalyx nepalensis was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically found in mountainous regions. It thrives in temperate climates and is often found in forest understories or along stream banks. This plant is known for its attractive, waxy leaves and clusters of small, fragrant flowers. It has been introduced to several regions outside its native habitat for ornamental purposes. However, its spread is limited due to specific environmental requirements and lack of aggressive growth habits."
}
