{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon calvertii",
    "plant_slug": "acantholimon-calvertii",
    "plant_name_scientific": "acantholimon calvertii",
    "intro": "Acantholimon calvertii, commonly known as Calvert's thornscale, is a flowering plant native to the western United States, particularly in California and Nevada. It is a member of the Plumbagaceae family and is characterized by its spiny, succulent stems and small, blue to purple flowers. The plant typically grows in rocky or gravelly soils, often in arid or semi-arid environments. It has a low, spreading growth habit and is adapted to withstand drought conditions. Due to its limited distribution and habitat specificity, it is considered a rare and sensitive species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon calvertii"
    },
    "taxonomy_art_desc": "Acantholimon calvertii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon calvertii, a specific plant species within the genus Acantholimon, native to certain regions of the southwestern United States, known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon calvertii is primarily native to Transcaucasus and Turkey. This species is found in the mountainous regions of these areas, where it thrives in rocky and dry habitats. It is commonly associated with steppe and semi-arid environments. The plant is well adapted to the climate and soil conditions of its native range. Its distribution is limited to specific regions within Transcaucasus and Turkey.",
    "distribution_introduced_art_desc": "Acantholimon calvertii was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in coastal sage scrub and chaparral habitats. This plant thrives in well-drained soils and full sun exposure. It is often seen growing along the edges of dunes and in disturbed areas. Due to its adaptability, it has become a common sight in these regions."
}
