{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum bungei",
    "plant_slug": "acanthophyllum-bungei",
    "plant_name_scientific": "acanthophyllum bungei",
    "intro": "Acanthophyllum bungei, commonly known as the desert holly, is a perennial shrub native to arid regions of Central Asia. It is characterized by its spiny, cylindrical stems and small, scale-like leaves that reduce water loss. The plant produces yellow or green flowers in late spring, which are clustered in dense, rounded inflorescences. It is well adapted to harsh, dry environments and is often found in sandy or rocky soils. Acanthophyllum bungei plays a role in stabilizing desert soils and providing habitat for small desert fauna.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum bungei"
    },
    "taxonomy_art_desc": "Acanthophyllum bungei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of complex structures like roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and some modern plants with a distinct life cycle. Its subclass is Magnoliidae, a group of flowering plants known for their diverse forms and the presence of vascular tissue. Its order is Caryophyllales, which includes flowering plants with a wide range of morphological features and often includes plants adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which consists of flowering plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically characterized by their spiny or thorny structures and often found in dry habitats. Its species is Acanthophyllum bungei, a specific plant within the genus known for its adaptations to arid environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Transcaucasus"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum bungei is primarily native to Iran and the Transcaucasus. This plant is typically found in arid and semi-arid regions, often in sandy or rocky soils. It is well adapted to the harsh environmental conditions of its native range. The species is part of the Amaranthaceae family and is known for its drought-resistant characteristics. It plays a role in stabilizing soil in its natural habitat.",
    "distribution_introduced_art_desc": "Acanthophyllum bungei was mainly introduced to the arid and semi-arid regions of Central Asia, particularly in countries like Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in sandy and gravelly soils, often in areas with low precipitation and high temperatures. This plant is well adapted to harsh environmental conditions, making it a resilient species in these ecosystems. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has raised concerns about its potential impact on native plant communities."
}
