{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon baltanense",
    "plant_slug": "acantholimon-baltanense",
    "plant_name_scientific": "acantholimon baltanense",
    "intro": "Acantholimon baltanense, commonly known as the Baltanese thimbleweed, is a perennial flowering plant native to the high-altitude regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit with woolly, gray-green foliage. The plant produces small, blue to purple flowers in clustered inflorescences, typically blooming in late spring to early summer. It thrives in rocky, well-drained soils and is adapted to cold, arid environments. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon baltanense is primarily native to the arid regions of northern Chile and southern Peru. It is commonly found in the Atacama Desert, one of the driest places on Earth. This species thrives in rocky and sandy soils, often growing in coastal and inland desert environments. It is well adapted to extreme conditions, including high salinity and intense solar radiation. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acantholimon baltanense was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland desert environments. It thrives in regions with low precipitation and high sunlight exposure, making it well-suited for arid and semi-arid climates. This plant is commonly found in disturbed soils, such as those near roadsides, dunes, or agricultural fields. Its introduction has been observed in several regions outside its native range, including parts of the Mediterranean and North America. Due to its hardy nature, it can become invasive in certain ecosystems if not managed properly."
}
