{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax sinensis",
    "plant_slug": "acanthopanax-sinensis",
    "plant_name_scientific": "acanthopanax sinensis",
    "intro": "Acanthopanax sinensis, commonly known as the Chinese angel's trumpet, is a deciduous shrub native to East Asia. It belongs to the family Araliaceae and is characterized by its compound leaves and clusters of small, white flowers. The plant produces red berries that are toxic to humans but serve as a food source for certain birds and animals. It is often cultivated for its ornamental value and has traditional uses in herbal medicine. Acanthopanax sinensis thrives in temperate climates and prefers well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax sinensis is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas, particularly in temperate climates. This plant thrives in regions with well-drained soil and moderate to cool temperatures. It is often associated with secondary forests and rocky slopes. Its natural range extends across several provinces in China, such as Yunnan, Sichuan, and Heilongjiang.",
    "distribution_introduced_art_desc": "Acanthopanax sinensis was mainly introduced to regions with temperate climates, particularly in East Asia, where it thrives in forested areas. It is commonly found in China, Korea, and Japan, where it grows in mountainous and shady environments. The plant is valued for its medicinal properties, including its use in traditional Chinese medicine. Its distribution has also been expanded through cultivation in other parts of the world due to its economic and therapeutic importance. However, it remains primarily associated with its native habitats in East Asia."
}
