{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium glaucum",
    "plant_slug": "acanthodium-glaucum",
    "plant_name_scientific": "acanthodium glaucum",
    "intro": "Acanthodium glaucum, commonly known as the blue glaucous acanthodium, is a rare and distinctive plant species belonging to the Apiaceae family. It is characterized by its small, clustered flowers that are typically blue or purple in color, giving it a striking visual appearance. The plant has finely divided, fern-like leaves that are often covered in a powdery blue coating, which helps to reduce water loss in arid conditions. It thrives in well-drained soils and is often found in rocky or gravelly habitats. Due to its limited distribution and specific ecological requirements, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium glaucum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is commonly found in rocky and coastal areas, often growing in dry, sunny environments. This plant thrives in well-drained soils and is adapted to withstand periods of drought. It is also present in some regions of the Middle East and along the western coast of the Iberian Peninsula. Due to its specific habitat requirements, it is not widely distributed beyond these areas.",
    "distribution_introduced_art_desc": "Acanthodium glaucum was mainly introduced to the southeastern United States, particularly in Florida and parts of Georgia. It thrives in disturbed soils and open habitats, often found along roadsides and in urban areas. This plant is known for its distinctive blue-gray foliage and is considered an invasive species in some regions. Its rapid growth and ability to spread through seeds make it a challenge for native plant communities. Despite its invasive nature, it is sometimes cultivated for ornamental purposes due to its unique appearance."
}
