{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon serotinum",
    "plant_slug": "acantholimon-serotinum",
    "plant_name_scientific": "acantholimon serotinum",
    "intro": "Acantholimon serotinum, commonly known as the late-flowering flax, is a perennial flowering plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its narrow, grass-like leaves and clusters of blue or violet flowers that bloom in late summer. The plant is typically found in rocky or sandy soils and is adapted to arid or semi-arid environments. It has a low-growing habit and is often used in rock gardens due to its ornamental value and drought tolerance. Its seeds are small and dispersed by wind, contributing to its ability to colonize open, disturbed areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon serotinum"
    },
    "taxonomy_art_desc": "Acantholimon serotinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of specialized structures such as stomata and vascular tissues. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group that includes many flowering plants with a wide variety of morphological adaptations. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive floral structures and often show adaptations to arid environments. Its family is Plumbaginaceae, known for its characteristic flowers and often containing plants with medicinal properties. Its genus is Acantholimon, which consists of flowering plants typically found in arid and semi-arid regions, often with spiny or hairy structures. Its species is Acantholimon serotinum, a specific plant within the genus known for its unique adaptations to harsh environments and its role in local ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon serotinum is primarily native to Iran. It is found in the arid and semi-arid regions of the country. This plant typically grows in rocky or sandy soils. It is commonly observed in mountainous areas and coastal regions. Its distribution is limited to specific ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon serotinum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland dune environments. It is commonly found in regions with a Mediterranean climate characterized by dry summers and wet winters. This plant thrives in sandy or gravelly soils and is often part of the vegetation in disturbed or open habitats. It has been introduced to several regions outside its native range, including parts of California and Oregon in the United States. Its distribution is largely limited to areas where it can receive adequate sunlight and has minimal competition from other plant species."
}
