{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthomintha duttonii",
    "plant_slug": "acanthomintha-duttonii",
    "plant_name_scientific": "acanthomintha duttonii",
    "intro": "Acanthomintha duttonii, commonly known as the desert honeysuckle, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing shrub characterized by its small, tubular flowers that range in color from white to yellow. The plant has aromatic, glandular leaves that are often covered in fine hairs, which help reduce water loss in arid environments. Its root system is deep and drought-tolerant, allowing it to thrive in sandy or rocky soils. Acanthomintha duttonii plays a role in supporting local pollinators and is adapted to withstand extreme temperature fluctuations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Lamiaceae",
        "genus": "Acanthomintha",
        "species": "Acanthomintha duttonii"
    },
    "taxonomy_art_desc": "Acanthomintha duttonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by diverse flower structures. Its order is Lamiales, a group of flowering plants that includes many aromatic herbs and shrubs, often with bilateral symmetry. Its family is Lamiaceae, commonly known as the mint family, which is recognized for its square stems, aromatic leaves, and showy flowers. Its genus is Acanthomintha, a small genus within the Lamiaceae family, characterized by its hairy leaves and small, clustered flowers. Its species is Acanthomintha duttonii, a specific plant within this genus, known for its distinctive appearance and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthomintha duttonii is primarily native to California. It is found in the coastal regions and inland valleys of the state. This plant thrives in sandy or gravelly soils along the coast. It is commonly seen in areas with mild, Mediterranean climates. Its distribution is limited to specific habitats within California, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Acanthomintha duttonii was mainly introduced to specific regions in California, particularly in the coastal and inland valleys. It was introduced as an ornamental plant due to its attractive, fragrant flowers and compact growth habit. However, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its spread has been facilitated by its ability to thrive in disturbed soils and its prolific seed production. Efforts are ongoing to control its spread and manage its impact on native plant communities."
}
