{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon saxifragifolium",
    "plant_slug": "acantholimon-saxifragifolium",
    "plant_name_scientific": "acantholimon saxifragifolium",
    "intro": "Acantholimon saxifragifolium, commonly known as the saxifrage-leaved thornweed, is a perennial herbaceous plant native to the rocky and arid regions of the western United States. It is characterized by its succulent, fleshy leaves that are often arranged in a basal rosette, which helps it conserve water in its harsh environment. The plant produces small, white or pale blue flowers in late spring to early summer, typically in clusters at the ends of its stems. Its leaves are covered in fine, soft hairs that provide additional protection against desiccation. Acantholimon saxifragifolium is adapted to grow in well-drained soils and is often found in crevices or on slopes where moisture is limited.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon saxifragifolium is primarily native to the coastal regions of southern California and northern Baja California, Mexico. It thrives in rocky coastal bluffs and sandy soils along the Pacific coast. This plant is commonly found in areas with mild, wet winters and dry summers. It is well adapted to the harsh maritime climate and salt spray. Its distribution is limited to a narrow geographic range along the western coast of North America.",
    "distribution_introduced_art_desc": "Acantholimon saxifragifolium was mainly introduced to areas with rocky or gravelly soils, often in dry, sunny environments. It is commonly found in regions with Mediterranean climates, where it thrives in well-drained conditions. This plant is typically associated with disturbed sites such as roadsides, open fields, and rocky outcrops. Its introduction has been noted in parts of California and other western United States states. It plays a role in stabilizing soil and providing habitat for small insects and animals."
}
