{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon minshelkense",
    "plant_slug": "acantholimon-minshelkense",
    "plant_name_scientific": "acantholimon minshelkense",
    "intro": "Acantholimon minshelkense, commonly known as the Minshelkene thornweed, is a flowering plant native to the arid regions of Central Asia. It belongs to the Plumbagaceae family and is characterized by its succulent, fleshy leaves adapted to conserve water. The plant produces small, blue or purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its limited distribution and specific environmental requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon minshelkense"
    },
    "taxonomy_art_desc": "Acantholimon minshelkense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert species, often with specialized adaptations for arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon minshelkense, a specific plant species native to certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kazakhstan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon minshelkense is primarily native to Kazakhstan. It is found in the arid and semi-arid regions of the country, particularly in the southern and central parts. This plant typically grows in sandy or gravelly soils along riverbanks and in steppe landscapes. It is well adapted to the harsh climatic conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic species within Kazakhstan.",
    "distribution_introduced_art_desc": "Acantholimon minshelkense was mainly introduced to areas with dry, rocky soils and arid climates, particularly in regions of the Mediterranean Basin. It is commonly found in open habitats such as slopes, cliffs, and disturbed ground. This plant has been documented in several countries including Spain, Portugal, and parts of southern France. Its introduction is often associated with human activities, such as road construction and gardening. Due to its hardy nature, it can sometimes become invasive in non-native environments."
}
