{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium bicolor",
    "plant_slug": "acanthophippium-bicolor",
    "plant_name_scientific": "acanthophippium bicolor",
    "intro": "Acanthophippium bicolor, commonly known as the two-colored spurge, is a flowering plant native to southern Africa. It is characterized by its succulent, fleshy leaves and vibrant, yellow-orange flowers that bloom in clusters. The plant belongs to the Euphorbiaceae family, which includes many species with milky sap. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. Its unique appearance and adaptability make it a notable species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium bicolor"
    },
    "taxonomy_art_desc": "Acanthophippium bicolor belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Asparagales, which includes plants such as orchids, grasses, and asparagus, characterized by their diverse floral structures and often aromatic flowers. Its family is Orchidaceae, commonly known as orchids, which are a large and diverse family of flowering plants known for their intricate and often colorful flowers. Its genus is Acanthophippium, a group of flowering plants within the orchid family, known for their unique floral morphology and specific ecological preferences. Its species is Acanthophippium bicolor, a particular orchid species distinguished by its two-colored flowers and specific habitat requirements.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India",
        "Sri Lanka"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium bicolor is primarily native to India and Sri Lanka. This plant is commonly found in the tropical and subtropical regions of these countries. It thrives in moist, shaded environments such as forests and shrublands. Its distribution is largely restricted to these geographic areas. The species is well adapted to the climatic conditions of South Asia.",
    "distribution_introduced_art_desc": "Acanthophippium bicolor was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and forest edges. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in the southeastern United States, particularly in states like Florida, Georgia, and South Carolina. Its introduction has been associated with human activity, including landscaping and accidental seed dispersal. Due to its adaptability, it has become a common weed in many disturbed environments."
}
