{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax senticosus var. brevistamineus",
    "plant_slug": "acanthopanax-senticosus-var-brevistamineus",
    "plant_name_scientific": "acanthopanax senticosus var. brevistamineus",
    "intro": "Acanthopanax senticosus var. brevistamineus, commonly known as the short-staminate angel's trumpet, is a climbing shrub native to China. It is characterized by its compound leaves with serrated margins and small, greenish-white flowers that appear in clusters. The plant produces small, fleshy berries that are typically red when mature. It is often found in forested areas at moderate elevations. Due to its medicinal properties, it is valued in traditional Chinese medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax senticosus var. brevistamineus is primarily native to the mountainous regions of China, particularly in the provinces of Yunnan, Sichuan, and Tibet. It thrives in temperate to cold climates, often growing at elevations between 2,000 and 4,000 meters. This variant is commonly found in forests and shrublands, where it adapts well to rocky and well-drained soils. It is part of the Araliaceae family and is known for its medicinal properties in traditional Chinese medicine. The plant's distribution is closely associated with the biodiversity-rich ecosystems of the Himalayas and the Tibetan Plateau.",
    "distribution_introduced_art_desc": "Acanthopanax senticosus var. brevistamineus was mainly introduced to traditional medicine practices in East Asia, particularly in China, Korea, and Japan. It is valued for its purported health benefits, including immune support and anti-inflammatory properties. The plant is often used in herbal remedies and is a key component in various traditional formulations. Due to its medicinal significance, it has been cultivated and distributed in regions where traditional medicine is practiced. Its introduction has also led to increased interest in its chemical composition and potential pharmacological applications."
}
