{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosphaera ulei",
    "plant_slug": "acanthosphaera-ulei",
    "plant_name_scientific": "acanthosphaera ulei",
    "intro": "Acanthosphaera ulei, commonly known as the horned sphere alga, is a type of marine algae belonging to the class Cyanobacteria. It is characterized by its unique spherical shape with prominent, spiky projections called acanthi. This organism is often found in coastal waters and is known for its ability to thrive in both freshwater and saltwater environments. Acanthosphaera ulei plays a role in marine ecosystems by contributing to primary production through photosynthesis. Its simple structure and reproductive mechanisms make it an interesting subject for studies in marine botany.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosphaera ulei is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is commonly found in wetland and swamp habitats, where it thrives in moist, nutrient-rich soils. This species is also present in parts of southern and eastern Africa, including Mozambique and Madagascar. It plays an important ecological role in these ecosystems by contributing to soil stabilization and providing habitat for various microorganisms. Due to its specific environmental requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acanthosphaera ulei was mainly introduced to freshwater ecosystems in North America, particularly in the Great Lakes region. It was first detected in Lake Ontario in the early 1990s and has since spread to other lakes in the region. This invasive species is known to outcompete native algae for nutrients, potentially altering the food web and water quality. Its rapid growth and ability to form dense blooms make it a significant ecological concern. Monitoring and management efforts are ongoing to control its spread and mitigate its impacts on local aquatic environments."
}
