{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium sinense",
    "plant_slug": "acanthophippium-sinense",
    "plant_name_scientific": "acanthophippium sinense",
    "intro": "Acanthophippium sinense, commonly known as the Chinese hibiscus, is a flowering plant native to China. It belongs to the Malvaceae family and is characterized by its showy, trumpet-shaped flowers that range in color from yellow to red. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are ovate with serrated edges, and it produces capsule fruits that contain numerous seeds. Acanthophippium sinense is often cultivated for its ornamental value and is also used in traditional Chinese medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium sinense is primarily native to China, specifically the provinces of Yunnan and Sichuan. It thrives in the mountainous regions of these areas, where the climate is temperate and the terrain is rugged. This plant is commonly found in forested areas and along rocky slopes at higher altitudes. It is well adapted to the moist and cool conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acanthophippium sinense was mainly introduced to the United States as an ornamental plant due to its attractive, spiny leaves and unique appearance. It is commonly found in gardens and greenhouses, particularly in regions with mild climates. Despite its aesthetic appeal, it has raised concerns due to its potential invasiveness in certain environments. The plant's introduction has led to discussions about its ecological impact and management. However, it remains a popular choice for horticultural use in many parts of the country."
}
