{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum elatius",
    "plant_slug": "acanthophyllum-elatius",
    "plant_name_scientific": "acanthophyllum elatius",
    "intro": "Acanthophyllum elatius, commonly known as the desert holly, is a shrub native to arid regions of central Asia. It is characterized by its spiny, evergreen leaves and small, yellowish flowers that bloom in summer. The plant is adapted to survive in harsh, dry environments with minimal water availability. Its root system is extensive, allowing it to access deep groundwater sources. Acanthophyllum elatius plays an important ecological role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum elatius"
    },
    "taxonomy_art_desc": "Acanthophyllum elatius belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, typically with showy flowers and diverse habitats. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert plants, often with specialized adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum elatius, a specific plant within this genus known for its adaptations to dry environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran",
        "Kazakhstan",
        "Tadzhikistan",
        "Turkmenistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum elatius is primarily native to Afghanistan, Iran, Kazakhstan, Tadzhikistan, Turkmenistan, and Uzbekistan. This plant is commonly found in arid and semi-arid regions across these countries. It thrives in sandy or gravelly soils and is often associated with steppe and desert ecosystems. The species is well adapted to the harsh environmental conditions of its native range. It plays an important role in stabilizing soil and supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthophyllum elatius was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Kazakhstan, Uzbekistan, and southern Russia. It is commonly found in sandy and gravelly soils, often in areas with low precipitation and high temperatures. This plant is well adapted to harsh environmental conditions, making it a resilient species in degraded landscapes. It is often used for soil stabilization and as a forage plant for livestock. Its distribution has expanded due to human activities and climate change, leading to its establishment in new habitats."
}
