{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon limbatum",
    "plant_slug": "acantholimon-limbatum",
    "plant_name_scientific": "acantholimon limbatum",
    "intro": "Acantholimon limbatum, commonly known as the narrowleaf flaxvetch, is a flowering plant native to the western United States. It belongs to the legume family, Fabaceae, and is characterized by its delicate, hairy stems and small, pea-like flowers. The plant typically grows in rocky or gravelly soils and is adapted to arid and semi-arid environments. Its leaves are narrow and often have a distinct, wavy margin, contributing to its unique botanical appearance. Acantholimon limbatum plays a role in stabilizing soils and providing habitat for small invertebrates in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon limbatum"
    },
    "taxonomy_art_desc": "Acantholimon limbatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a distinctive life cycle that includes both a gametophyte and a sporophyte stage. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with often blue or purple flowers and some containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their spiny or prickly stems. Its species is Acantholimon limbatum, a specific type within the genus Acantholimon, known for its distinctive leaf shape and habitat preferences in rocky or sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tadzhikistan",
        "Turkmenistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon limbatum is primarily native to Tadzhikistan, Turkmenistan, and Uzbekistan. This plant is commonly found in the arid and semi-arid regions of these Central Asian countries. It thrives in rocky soils and is often associated with steppe and desert environments. The species is well adapted to the harsh climatic conditions of the region. Its distribution is largely confined to the mountainous and lowland areas of these three nations.",
    "distribution_introduced_art_desc": "Acantholimon limbatum was mainly introduced to areas with well-drained soils and moderate to high elevations, often in rocky or gravelly habitats. It thrives in regions with a semi-arid to temperate climate, where it can receive adequate sunlight. This plant is commonly found in open slopes, crevices, and along streambanks in its introduced range. It has been documented in several western states in the United States, particularly in California and Nevada. Its introduction is often associated with natural dispersal or human-mediated spread in disturbed or marginal lands."
}
