{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon acerosum var. parvifolium",
    "plant_slug": "acantholimon-acerosum-var-parvifolium",
    "plant_name_scientific": "acantholimon acerosum var. parvifolium",
    "intro": "Acantholimon acerosum var. parvifolium, commonly known as the narrow-leaved thrift, is a perennial flowering plant native to the arid regions of western North America. It belongs to the family Caryophyllaceae and is characterized by its upright growth habit and dense clusters of small, pink to purplish flowers. The plant has hairy, lance-shaped leaves that are typically shorter and narrower than those of the typical variety. It thrives in well-drained soils and is adapted to drought conditions, making it a hardy species for rocky or sandy habitats. This variety is often found in coastal and inland desert environments, contributing to the ecological diversity of its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon acerosum"
    },
    "taxonomy_art_desc": "Acantholimon acerosum var. parvifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants known for their often showy flowers and some species containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon acerosum, a specific type within the genus Acantholimon, known for its hardy nature and adaptation to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon acerosum var. parvifolium is primarily native to Turkey. This plant is found in specific regions within Turkey, particularly in the eastern and central parts of the country. It thrives in rocky and arid environments, often growing on slopes and in mountainous areas. The species is adapted to the dry and semi-arid climates typical of these regions. Its distribution is limited to certain ecological niches within Turkey's diverse landscape.",
    "distribution_introduced_art_desc": "Acantholimon acerosum var. parvifolium was mainly introduced to areas with rocky or gravelly soils, often found in mountainous or coastal regions. It thrives in well-drained environments and is commonly found in disturbed or open habitats. This plant is typically associated with Mediterranean climates but has been introduced to other regions with similar conditions. It is known for its low-growing habit and small, narrow leaves. Due to its hardiness, it has become a common ornamental plant in some areas outside its native range."
}
