{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthostemma pictum",
    "plant_slug": "acanthostemma-pictum",
    "plant_name_scientific": "acanthostemma pictum",
    "intro": "Acanthostemma pictum, commonly known as the painted acanthostemma, is a flowering plant native to southern Africa. It belongs to the family Asteraceae and is characterized by its showy, daisy-like flowers that range in color from white to pink. The plant typically grows in grassy areas and has hairy stems and leaves. It produces small, cylindrical fruits that contain numerous seeds. Acanthostemma pictum is often cultivated for its ornamental value in gardens due to its attractive appearance and adaptability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthostemma pictum is primarily native to South Africa, specifically the Eastern Cape and KwaZulu-Natal provinces. It is commonly found in rocky outcrops and mountainous regions within these areas. The plant thrives in well-drained soils and is often associated with fynbos vegetation. It is known for its distinctive yellow flowers and is a member of the Asteraceae family. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acanthostemma pictum was mainly introduced to control invasive plant species in disturbed areas. It is commonly used in restoration projects due to its ability to thrive in poor soil conditions. The plant is native to Africa but has been introduced to various parts of the world, including the United States. It spreads through seeds dispersed by wind and animals, making it a persistent weed in agricultural and natural habitats. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
