{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax commixtus",
    "plant_slug": "acanthopanax-commixtus",
    "plant_name_scientific": "acanthopanax commixtus",
    "intro": "Acanthopanax commixtus, commonly known as the mixed-leaf Chinese dogwood, is a deciduous shrub native to East Asia. It is characterized by its compound leaves, which are typically alternate and have a serrated margin. The plant produces small, greenish-yellow flowers arranged in umbels, followed by red berries that are edible for some bird species. It thrives in moist, well-drained soils and is often found in forested areas. The plant has been used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax commixtus is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas within these countries. This plant thrives in temperate climates and is often associated with humid, shaded environments. It is particularly prevalent in the northeastern parts of China, such as the provinces of Heilongjiang, Jilin, and Liaoning. Due to its limited range, it is considered a rare and endemic species in certain regions.",
    "distribution_introduced_art_desc": "Acanthopanax commixtus was mainly introduced to areas with temperate climates, where it thrives in well-drained soils and partial shade. It is commonly found in forested regions, often growing along stream banks or in moist, shaded understories. This plant is valued for its medicinal properties, particularly in traditional herbal remedies. Its introduction has been documented in several Asian countries, including China, Korea, and Japan. However, it is considered invasive in some regions due to its rapid growth and ability to outcompete native vegetation."
}
