{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus hirsutus subsp. hirsutus",
    "plant_slug": "acanthus-hirsutus-subsp-hirsutus",
    "plant_name_scientific": "acanthus hirsutus subsp. hirsutus",
    "intro": "Acanthus hirsutus subsp. hirsutus, commonly known as the hairy acanthus, is a perennial herb native to the Mediterranean region. It features broad, heart-shaped leaves with a distinctive hairy texture on the underside. The plant produces spires of lavender-blue flowers in late summer, which are followed by bracts that resemble the leaves. It thrives in well-drained soil and full sun, often growing in rocky or coastal environments. This subspecies is valued for its ornamental appeal and historical use in classical garden designs.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus hirsutus"
    },
    "taxonomy_art_desc": "Acanthus hirsutus subsp. hirsutus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels. Its order is Lamiales, a group of flowering plants that includes many aromatic herbs and shrubs, such as mint and snapdragons. Its family is Acanthaceae, commonly known as the spurred gentians, which are characterized by their showy flowers and often include ornamental plants. Its genus is Acanthus, a group of flowering plants known for their distinctive, spiny leaves and showy bracts, often used in ornamental horticulture. Its species is Acanthus hirsutus, a specific variety within the genus Acanthus, characterized by its hairy foliage and is commonly found in various habitats across its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "East Aegean Is.",
        "Türkey",
        "Türkey-in-Europe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus hirsutus subsp. hirsutus is primarily native to the East Aegean Is., Turkey, and Turkey-in-Europe. This species is commonly found in rocky coastal areas and dry, sunny habitats. It thrives in Mediterranean climates with well-drained soils. The plant is often seen growing along cliffs and on rocky outcrops. Its native range includes parts of southern and central Turkey.",
    "distribution_introduced_art_desc": "Acanthus hirsutus subsp. hirsutus was mainly introduced to ornamental horticulture and landscaping due to its striking, architectural foliage and showy, spiny flowers. It is commonly cultivated in gardens and public spaces where its unique appearance adds visual interest. The plant thrives in well-drained soils and full sun, making it suitable for a variety of climates. However, it has also become invasive in some regions, outcompeting native vegetation. Its rapid growth and spread have led to management challenges in natural habitats."
}
