{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis pagodiformis",
    "plant_slug": "acanthopsis-pagodiformis",
    "plant_name_scientific": "acanthopsis pagodiformis",
    "intro": "Acanthopsis pagodiformis, commonly known as the pagoda lily, is a flowering plant native to tropical regions of Africa. It belongs to the Amaryllidaceae family and is characterized by its striking, bell-shaped flowers that bloom in clusters. The plant typically grows as a herbaceous perennial, reaching heights of up to 1 meter. Its foliage consists of broad, strap-like leaves that are arranged in a rosette pattern. The flowers, which are often white or pale blue, are adapted for pollination by insects and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis pagodiformis"
    },
    "taxonomy_art_desc": "Acanthopsis pagodiformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Lamiales, a group of flowering plants that includes plants like mint and snapdragons, known for their diverse floral structures. Its family is Acanthaceae, a family of flowering plants commonly known as the acanthus family, characterized by showy flowers and often used in ornamental horticulture. Its genus is Acanthopsis, which refers to a group of plants with distinctive features such as spiny or thorny structures, often found in tropical regions. Its species is Acanthopsis pagodiformis, a specific plant within the genus Acanthopsis, known for its unique pagoda-like form and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis pagodiformis is primarily native to the Cape Provinces. This plant is found in the fynbos biome, which is characterized by its unique biodiversity and Mediterranean climate. It typically grows in sandy or rocky soils in open, sunny areas. The species is adapted to the specific environmental conditions of this region, including seasonal rainfall patterns. Due to its limited distribution, it is considered a rare and endemic plant in the Cape Provinces.",
    "distribution_introduced_art_desc": "Acanthopsis pagodiformis was mainly introduced to the eastern coastal regions of the United States, particularly in Florida and along the Gulf Coast. It was introduced primarily as an ornamental plant due to its unique, pagoda-like growth form and attractive foliage. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, sandy soils and is often found in disturbed habitats such as dunes and tidal flats. Its rapid spread has raised concerns among conservationists and land managers."
}
