{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ararati",
    "plant_slug": "acantholimon-ararati",
    "plant_name_scientific": "acantholimon ararati",
    "intro": "Acantholimon ararati, commonly known as the Armenian thimbleweed, is a perennial herb native to the high-altitude regions of the Caucasus and Central Asia. It belongs to the family Montiaceae and is characterized by its succulent, fleshy leaves and small, inconspicuous flowers. The plant typically grows in rocky or gravelly soils, often in arid or semi-arid environments. Its leaves are often arranged in a rosette pattern, which helps conserve water in its harsh habitat. The species is noted for its ability to thrive in extreme conditions, making it an important component of alpine and steppe ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ararati is primarily native to the arid and semi-arid regions of Central Asia, particularly in countries such as Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in rocky and sandy soils, often found in steppe and desert environments. This plant is well adapted to harsh climatic conditions, including high temperatures and limited rainfall. It is commonly found in mountainous areas and along riverbanks in these regions. Its distribution is closely tied to the specific ecological niches it occupies in its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon ararati was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and agricultural fields. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in temperate climates, particularly in the Mediterranean region and parts of southern Europe. Its introduction has been associated with human activities, including land clearing and agricultural expansion. Due to its adaptability, it has become a common weed in many disturbed environments."
}
