{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosabal caespitosa",
    "plant_slug": "acanthosabal-caespitosa",
    "plant_name_scientific": "acanthosabal caespitosa",
    "intro": "Acanthosabal caespitosa, commonly known as the African daisy, is a flowering plant native to southern Africa. It is a herbaceous perennial that typically grows in grassland and rocky habitats. The plant features bright yellow flowers arranged in a dense, circular pattern, which bloom from late spring to early autumn. Its leaves are narrow and grass-like, often covered in fine hairs. Acanthosabal caespitosa is valued for its ornamental appeal and is cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosabal caespitosa is primarily native to the tropical regions of Africa, particularly in countries such as Nigeria, Ghana, and the Democratic Republic of the Congo. It thrives in humid, lowland areas with rich, well-drained soils. This plant is commonly found in forest understories and along riverbanks. It plays an important ecological role in its native habitat by providing shelter and food for various wildlife species. Due to its adaptability, it is sometimes cultivated in other parts of the world for ornamental purposes.",
    "distribution_introduced_art_desc": "Acanthosabal caespitosa was mainly introduced to control erosion and stabilize soil in degraded areas. It is commonly used in restoration projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its ornamental qualities, making it a popular choice for landscaping in tropical and subtropical regions. However, its invasive potential has raised concerns in some areas where it outcompetes native vegetation. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
