{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hissaricum",
    "plant_slug": "acantholimon-hissaricum",
    "plant_name_scientific": "acantholimon hissaricum",
    "intro": "Acantholimon hissaricum, commonly known as the Hissar's thornweed, is a perennial flowering plant native to Central Asia. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy stems and leaves. The plant produces small, blue or purple flowers that bloom in late spring to early summer. It thrives in arid and semi-arid environments, often found in rocky soils and steppe regions. Due to its hardy nature, it is adapted to withstand drought and temperature extremes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hissaricum"
    },
    "taxonomy_art_desc": "Acantholimon hissaricum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often contain secondary metabolites. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often showy flowers and specialized adaptations. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, known for their spiny or prickly leaves. Its species is Acantholimon hissaricum, a specific type of plant native to certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hissaricum is primarily native to Uzbekistan. This plant is found in the arid and semi-arid regions of the country, particularly in the southern and central areas. It thrives in sandy or rocky soils and is often associated with steppe and desert environments. The species is adapted to the harsh climate conditions of Central Asia. Its distribution is limited to specific ecological niches within Uzbekistan.",
    "distribution_introduced_art_desc": "Acantholimon hissaricum was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and drought tolerance. It is commonly found in gardens and landscaped areas where it thrives in well-drained soils and full sun. Despite its aesthetic appeal, it has shown potential to spread into native habitats, raising concerns about its invasiveness. The plant's ability to establish itself in disturbed soils makes it a potential threat to local ecosystems. Therefore, its distribution is closely monitored to assess its impact on native flora."
}
