{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax nodiflorus",
    "plant_slug": "acanthopanax-nodiflorus",
    "plant_name_scientific": "acanthopanax nodiflorus",
    "intro": "Acanthopanax nodiflorus, commonly known as the clustered five-lobed arrowhead, is a deciduous shrub native to eastern Asia. It is characterized by its compound leaves with five lobes and small, fragrant flowers that bloom in clusters. The plant produces small, red berries that are an important food source for birds and other wildlife. It thrives in moist, well-drained soils and is often found in forested areas. Its ornamental value makes it a popular choice for garden cultivation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax nodiflorus is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It thrives in temperate climates and is commonly found in forests and rocky areas at high altitudes. This plant is particularly associated with the Himalayan foothills and the northeastern parts of China. It is often seen growing in shaded, moist environments where it can receive adequate sunlight through the canopy. Due to its unique habitat requirements, it is not widely distributed beyond these specific regions.",
    "distribution_introduced_art_desc": "Acanthopanax nodiflorus was mainly introduced to regions with temperate climates where it can thrive in well-drained soils. It is commonly found in forested areas, often growing along stream banks or in moist, shaded environments. This plant is valued for its ornamental qualities and has been introduced for horticultural purposes in several countries. It can spread through seeds dispersed by wind or animals, making it a potential invasive species in non-native habitats. Proper management is necessary to prevent its unchecked growth in ecosystems where it is not native."
}
