{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus hesperius",
    "plant_slug": "acanthocereus-hesperius",
    "plant_name_scientific": "acanthocereus hesperius",
    "intro": "Acanthocereus hesperius, commonly known as the night-blooming cactus, is a species of cactus native to the southwestern United States and northern Mexico. It is characterized by its tall, cylindrical stems that are typically covered in spines and have a ribbed structure. The plant produces large, fragrant flowers that open at night, attracting nocturnal pollinators such as bats and moths. Its adaptations include a succulent structure for water storage and a nocturnal blooming cycle to conserve moisture. The plant thrives in arid environments and is well-suited for xeriscaping due to its low water requirements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus hesperius"
    },
    "taxonomy_art_desc": "Acanthocereus hesperius belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species such as roses and citrus. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and beets, known for their often showy flowers. Its family is Cactaceae, commonly known as the cactus family, which consists of succulent plants adapted to arid environments. Its genus is Acanthocereus, a group of cacti characterized by their spiny stems and nocturnal blooming flowers. Its species is Acanthocereus hesperius, a specific type of cactus native to Mexico, known for its distinctive appearance and ability to thrive in harsh desert conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus hesperius is primarily native to Mexico Southwest. This species is found in the arid and semi-arid regions of the country, particularly in the states of Sonora and Sinaloa. It thrives in rocky soils and is often associated with desert scrub and coastal dunes. The plant is well adapted to the harsh environmental conditions of its native habitat. It plays an important role in the local ecosystem, providing food and shelter for various desert wildlife.",
    "distribution_introduced_art_desc": "Acanthocereus hesperius was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in desert environments, particularly in areas with well-drained soils. This plant is often cultivated for its ornamental value due to its striking, spiny stems and vibrant flowers. It has been introduced to various regions as a drought-tolerant landscaping option. However, it is important to note that its spread can sometimes lead to ecological concerns in non-native habitats."
}
