{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus pungens",
    "plant_slug": "acanthus-pungens",
    "plant_name_scientific": "acanthus pungens",
    "intro": "Acanthus pungens, commonly known as the spiked acanthus, is a striking ornamental plant native to southern Africa. It is characterized by its large, palmate leaves with prominent, spiny margins that give it a distinctive appearance. The plant produces showy, spire-like inflorescences topped with small, pale yellow flowers. It thrives in full sun and well-drained soil, making it a popular choice for rock gardens and borders. Due to its architectural form and long-lasting foliage, it is often used in horticultural designs for its visual impact.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus pungens is primarily native to southern Africa, specifically South Africa. It is commonly found in the coastal regions and surrounding areas of the country. This plant thrives in sandy or rocky soils and is often seen growing in open, sunny habitats. It is a hardy species that can tolerate drought conditions. Acanthus pungens is also known for its distinctive, spiny leaves and showy flower heads.",
    "distribution_introduced_art_desc": "Acanthus pungens was mainly introduced to ornamental horticulture and garden landscapes due to its striking, architectural foliage and unique floral structures. It is commonly cultivated in regions with temperate climates where it can thrive in well-drained soils and full sun exposure. The plant's introduction has led to its presence in various garden settings, including rock gardens and borders. However, it is important to note that Acanthus pungens is not typically considered an invasive species in most regions. Its distribution remains largely controlled through intentional planting rather than natural spread."
}
