{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon assyriacum",
    "plant_slug": "acantholimon-assyriacum",
    "plant_name_scientific": "acantholimon assyriacum",
    "intro": "Acantholimon assyriacum, commonly known as Assyrian thimbleweed, is a flowering plant native to the mountainous regions of Turkey and northern Syria. It belongs to the family Plumbaginaceae and is characterized by its erect, herbaceous stems and small, clustered flowers. The plant typically grows in rocky or gravelly soils and thrives in dry, sunny environments. Its leaves are linear and often covered in fine hairs, while the flowers are usually blue or violet in color. Acantholimon assyriacum is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon assyriacum is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, Lebanon, and Israel. It is commonly found in rocky and arid environments, such as steppes and mountainous areas. This plant thrives in well-drained soils and is adapted to harsh, dry climates. It is often seen growing in open habitats with limited vegetation cover. Its distribution is closely associated with the ancient Assyrian region, hence its common name.",
    "distribution_introduced_art_desc": "Acantholimon assyriacum was mainly introduced to New Zealand. It was brought there as part of the early botanical collections and has since become naturalized in certain regions. The plant is typically found in coastal and subalpine areas, where it thrives in well-drained soils. Its introduction has raised concerns due to its potential to become invasive in native ecosystems. Despite its ornamental value, careful management is required to prevent its spread."
}
