{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ilicifolius var. integrifolius",
    "plant_slug": "acanthus-ilicifolius-var-integrifolius",
    "plant_name_scientific": "acanthus ilicifolius var. integrifolius",
    "intro": "Acanthus ilicifolius var. integrifolius, commonly known as the broad-leaved acanthus, is a striking ornamental plant native to the Mediterranean region. It features large, palmate leaves with a velvety texture and a distinctive, spiny margin. The plant produces showy, spire-like inflorescences with purple to pink flowers that bloom in summer. Its foliage is evergreen, making it a valuable addition to gardens for year-round interest. It thrives in well-drained soil and full sun, often used in landscaping for its architectural form and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus ilicifolius"
    },
    "taxonomy_art_desc": "Acanthus ilicifolius var. integrifolius belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Lamiales, a group of flowering plants that includes many aromatic plants, such as lavender and mint. Its family is Acanthaceae, known for its showy flowers and often used in ornamental gardening. Its genus is Acanthus, a group of flowering plants commonly known for their spiny leaves and ornate flower clusters. Its species is Acanthus ilicifolius, a specific type of acanthus plant that has a distinctive appearance and is often cultivated for its ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ilicifolius var. integrifolius is primarily native to the Andaman Islands. This variant of the acanthus species is found in the tropical regions of the Andaman Islands, which are part of the Indian Ocean. It typically grows in coastal areas and is adapted to the humid, tropical climate of the region. The plant is commonly found in rocky or sandy soils along the shoreline. Its distribution is limited to this specific geographic area, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Acanthus ilicifolius var. integrifolius was mainly introduced to enhance ornamental value in gardens and landscapes. It is valued for its striking foliage and unique floral structure. This plant is commonly found in coastal and sandy soils where it thrives in well-drained conditions. It has been introduced to various regions outside its native range, including parts of the Mediterranean and the United States. Due to its adaptability, it has become a popular choice for horticultural use in temperate climates."
}
