{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax villosulus",
    "plant_slug": "acanthopanax-villosulus",
    "plant_name_scientific": "acanthopanax villosulus",
    "intro": "Acanthopanax villosulus, commonly known as the hairy angel's trumpet, is a climbing shrub native to Southeast Asia. It features compound leaves with serrated edges and small, clustered white flowers that bloom in the summer. The plant produces bright red berries that are edible but should be consumed with caution. It thrives in humid, tropical environments and is often found in forest understories. Its ornamental value makes it a popular choice for gardens, though it requires careful management due to its vigorous growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax villosulus is primarily native to the mountainous regions of East Asia, including China, Korea, and Japan. It thrives in temperate climates and is commonly found in forested areas at elevations ranging from 1,000 to 3,000 meters. This plant is often associated with secondary growth habitats and can be found in both deciduous and evergreen forests. It is particularly prevalent in the northeastern parts of China, such as the provinces of Heilongjiang, Jilin, and Liaoning. Due to its unique ecological preferences, it plays an important role in the biodiversity of these regions.",
    "distribution_introduced_art_desc": "Acanthopanax villosulus was mainly introduced to regions with temperate climates and well-drained soils, where it can thrive in both full sun and partial shade. It is commonly found in forested areas, along stream banks, and in disturbed habitats such as roadsides and clearings. This plant is valued for its ornamental qualities, including its attractive foliage and unique compound leaves. It has been introduced to several countries in Asia, particularly in China, Korea, and Japan, where it is often used in horticulture and landscaping. However, its spread outside its native range is limited due to its specific environmental requirements."
}
