{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthonema diandrum",
    "plant_slug": "acanthonema-diandrum",
    "plant_name_scientific": "acanthonema diandrum",
    "intro": "Acanthonema diandrum, commonly known as the hard-stemmed starwort, is a flowering plant belonging to the family Apiaceae. It is characterized by its slender, branched stems and small, greenish-yellow flowers arranged in umbels. The plant typically grows in moist, shaded environments such as woodlands and stream banks. Its leaves are pinnately divided, with a rough texture and serrated edges. Acanthonema diandrum is valued for its ornamental appeal and is sometimes cultivated in gardens for its delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthonema diandrum is primarily native to the eastern and southern regions of South America, particularly Brazil, Argentina, and Paraguay. It thrives in moist, shaded environments such as forests and along riverbanks. This plant is commonly found in the Atlantic Forest biome, where it plays a role in the local ecosystem. It prefers nutrient-rich soils and is often associated with humid tropical climates. Due to its specific habitat requirements, it is not widely distributed outside of these regions.",
    "distribution_introduced_art_desc": "Acanthonema diandrum was mainly introduced to new environments through human activities such as horticulture and landscaping. It is commonly found in disturbed soils and urban areas, where it thrives in nutrient-rich conditions. The plant's rapid growth and ability to spread through seeds make it a potential invasive species in non-native regions. It has been reported in several countries, including parts of Europe and the United States. Due to its adaptability, it poses a risk to local ecosystems if left unchecked."
}
