{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium striatum",
    "plant_slug": "acanthophippium-striatum",
    "plant_name_scientific": "acanthophippium striatum",
    "intro": "Acanthophippium striatum, commonly known as the stripeleaf mallow, is a flowering plant native to South America. It belongs to the Malvaceae family and is characterized by its distinctive, striated leaves. The plant produces showy, pink to purple flowers that bloom in summer. It thrives in moist, well-drained soils and is often found in shaded to partially shaded environments. Acanthophippium striatum is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium striatum"
    },
    "taxonomy_art_desc": "Acanthophippium striatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Asparagales, a large group of flowering plants that includes grasses, lilies, and orchids, known for their specialized reproductive structures. Its family is Orchidaceae, commonly known as orchids, which are renowned for their complex and often showy flowers and diverse growth habits. Its genus is Acanthophippium, a group of flowering plants within the Orchidaceae family, characterized by their unique floral structures and habitat preferences. Its species is Acanthophippium striatum, a specific type of orchid known for its distinctive striated features and specific ecological requirements.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "India",
        "Japan",
        "Jawa",
        "Lesser Sunda Is.",
        "Malaya",
        "Myanmar",
        "Nansei-shoto",
        "Nepal",
        "Taiwan",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium striatum is primarily native to Assam, China South-Central, China Southeast, East Himalaya, India, Japan, Jawa, Lesser Sunda Is., Malaya, Myanmar, Nansei-shoto, Nepal, Taiwan, Thailand, and Vietnam. This plant is commonly found in tropical and subtropical regions across these areas. It thrives in moist, shaded environments such as forests and mountainous regions. The species is well-adapted to the diverse climates and soils of its native range. It plays an important ecological role in the ecosystems where it is found.",
    "distribution_introduced_art_desc": "Acanthophippium striatum was mainly introduced to new habitats through human activities such as horticulture and landscaping. It has been reported in several regions outside its native range, including parts of the United States and Europe. The plant's ability to thrive in disturbed soils and its rapid growth rate contribute to its spread. It is often found in urban and suburban areas where it can outcompete native vegetation. Due to its invasive potential, it is now considered a weed in some regions."
}
