{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon akaydinii",
    "plant_slug": "acantholimon-akaydinii",
    "plant_name_scientific": "acantholimon akaydinii",
    "intro": "Acantholimon akaydinii, commonly known as the Akaydin's thornstep, is a perennial flowering plant native to Turkey. It belongs to the family Plumbagaceae and is characterized by its compact, mat-forming growth habit. The plant produces small, blue to purple flowers during the summer months, which attract pollinators such as bees and butterflies. It thrives in rocky and well-drained soils, typically found in arid or semi-arid environments. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon akaydinii"
    },
    "taxonomy_art_desc": "Acantholimon akaydinii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the lead plant family, characterized by their often blue or purple flowers and specialized seed structures. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, characterized by their spiny leaves and showy flowers. Its species is Acantholimon akaydinii, a specific plant species native to Turkey, known for its unique morphology and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon akaydinii is primarily native to Turkey. This rare plant is found in specific regions of Turkey, particularly in the eastern part of the country. It thrives in rocky and arid environments, often in mountainous areas. The species is known for its unique adaptations to the harsh climate of its native habitat. Due to its limited distribution, it is considered a valuable and vulnerable plant species in Turkey.",
    "distribution_introduced_art_desc": "Acantholimon akaydinii was mainly introduced to areas with rocky or gravelly soils, typically in arid or semi-arid environments. It thrives in regions with low precipitation and high sunlight exposure. This plant is often found in mountainous or coastal areas where the climate is dry and the soil is well-drained. Its introduction has been noted in several regions of Turkey, particularly in the eastern and southeastern parts. Due to its hardy nature, it is sometimes used in landscaping for its ornamental value and drought tolerance."
}
