{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpus robustus",
    "plant_slug": "acanthocarpus-robustus",
    "plant_name_scientific": "acanthocarpus robustus",
    "intro": "Acanthocarpus robustus, commonly known as the African burr bush, is a perennial shrub native to southern Africa. It belongs to the family Fabaceae, also known as the legume or bean family, and is characterized by its compound leaves and distinctive pod-like fruits. The plant is notable for its ability to thrive in arid and semi-arid environments, making it a hardy species adapted to harsh conditions. Its seeds are encased in spiny, woody pods, which contribute to its common name and aid in seed dispersal. Acanthocarpus robustus is also valued for its potential in soil stabilization and as a forage plant for livestock.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Asparagaceae",
        "genus": "Acanthocarpus",
        "species": "Acanthocarpus robustus"
    },
    "taxonomy_art_desc": "Acanthocarpus robustus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Asparagales, a large group of flowering plants that includes plants like orchids, lilies, and asparagus. Its family is Asparagaceae, a family of flowering plants that includes many ornamental and economically significant species, such as lilies and asparagus. Its genus is Acanthocarpus, a group of flowering plants typically found in arid regions, characterized by their spiny fruits and succulent leaves. Its species is Acanthocarpus robustus, a specific plant within this genus known for its robust growth and adaptability to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpus robustus is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid areas. This plant thrives in sandy soils and is often seen in coastal and inland regions. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Its distribution is largely restricted to the western part of the country.",
    "distribution_introduced_art_desc": "Acanthocarpus robustus was mainly introduced to control erosion and forage production in degraded lands. It is commonly found in tropical and subtropical regions where it thrives in poor soils. This plant has been introduced to several countries in Africa, Asia, and the Pacific Islands. It is valued for its hardy nature and ability to withstand harsh environmental conditions. However, it can become invasive in some areas if not managed properly."
}
