{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ueleensis",
    "plant_slug": "acanthus-ueleensis",
    "plant_name_scientific": "acanthus ueleensis",
    "intro": "Acanthus ueleensis, commonly known as the Uele acanthus, is a striking ornamental plant native to the Democratic Republic of the Congo. It belongs to the Acanthaceae family and is characterized by its large, palmate leaves with prominent veins and its showy, spire-like inflorescences. The plant features vibrant, tubular flowers that range in color from purple to red, often attracting pollinators such as bees and butterflies. Its robust growth habit and ornamental value make it a popular choice for tropical gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus ueleensis"
    },
    "taxonomy_art_desc": "Acanthus ueleensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which encompasses a group of plants that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Lamiales, which includes a variety of flowering plants with showy flowers and often aromatic compounds. Its family is Acanthaceae, known for its ornamental plants with colorful flowers and often hairy leaves. Its genus is Acanthus, which consists of flowering plants commonly found in temperate and tropical regions, known for their distinctive spiny leaves and showy inflorescences. Its species is Acanthus ueleensis, a specific type of acanthus native to certain regions, characterized by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Burundi",
        "DR Congo",
        "Malawi",
        "Mozambique",
        "Rwanda",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ueleensis is primarily native to Burundi, DR Congo, Malawi, Mozambique, Rwanda, Sudan-South Sudan, Tanzania, and Uganda. This plant is found in the tropical and subtropical regions of these countries. It typically grows in moist, shaded environments such as forest floors or along riverbanks. The species is part of the Acanthaceae family and is known for its ornamental foliage. Its native distribution reflects its adaptation to the diverse ecosystems of East and Central Africa.",
    "distribution_introduced_art_desc": "Acanthus ueleensis was mainly introduced to regions with warm, humid climates and well-drained soils, often found in tropical and subtropical areas. It is typically cultivated in gardens and greenhouses for its ornamental value, particularly its striking foliage and spires of flowers. The plant thrives in full sun to partial shade and requires regular watering to maintain its vigor. Its introduction has been primarily for horticultural purposes, though it can sometimes escape into natural habitats. Due to its adaptability, it has been reported in several countries across Africa and parts of Southeast Asia."
}
