{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis paranganiensis",
    "plant_slug": "acanthorhipsalis-paranganiensis",
    "plant_name_scientific": "acanthorhipsalis paranganiensis",
    "intro": "Acanthorhipsalis paranganiensis, commonly known as the Paranganiensis Cactus, is a species of flowering plant native to South America. It belongs to the Cactaceae family and is characterized by its spiny stems and clusters of small, tubular flowers. The plant typically grows in arid or semi-arid environments, adapting to harsh conditions with its succulent structure. Its flowers, which can range in color from white to yellow, bloom during the warmer months, attracting pollinators such as bees and birds. This species is of interest to botanists due to its unique morphology and ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis paranganiensis is primarily native to the island of Socotra, located in the Arabian Sea. This unique plant is found in the arid and rocky environments of Socotra's interior regions. It thrives in the dry, limestone-based soils characteristic of the island's landscape. The species is endemic to Socotra, meaning it is not found anywhere else in the world. Due to its restricted habitat, it is considered a rare and vulnerable plant species.",
    "distribution_introduced_art_desc": "Acanthorhipsalis paranganiensis was mainly introduced to areas with warm, dry climates and well-drained soils, typically found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and urban areas. This plant thrives in environments with full sun exposure and minimal moisture. Its introduction has been associated with human activity, including landscaping and accidental transport. Due to its adaptability, it has become an invasive species in several regions outside its native range."
}
