{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon tenuiflorum",
    "plant_slug": "acantholimon-tenuiflorum",
    "plant_name_scientific": "acantholimon tenuiflorum",
    "intro": "Acantholimon tenuiflorum, commonly known as the narrow-flowered thrift, is a flowering plant native to the Mediterranean region. It is a low-growing perennial that thrives in rocky and arid environments, showcasing its adaptability to harsh conditions. The plant produces small, pink or white flowers during the spring and summer months, adding a delicate touch to its rugged habitat. Its foliage consists of narrow, fleshy leaves that help it conserve water, a characteristic typical of xerophytic plants. Acantholimon tenuiflorum is often found in coastal areas and is valued for its ornamental appeal and ecological resilience.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon tenuiflorum"
    },
    "taxonomy_art_desc": "Acantholimon tenuiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many early diverging lineages with diverse morphological features. Its order is Caryophyllales, a group of flowering plants known for their diverse forms and including many economically important species such as beets and cacti. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with distinctive flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their spiny leaves and showy flowers. Its species is Acantholimon tenuiflorum, a specific plant within the genus known for its slender flowers and adapted to grow in harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon tenuiflorum is primarily native to the Transcaucasus. It is found in regions that include parts of modern-day Georgia, Armenia, and Azerbaijan. This plant typically grows in rocky or mountainous areas with well-drained soils. It is adapted to the dry and semi-arid climates of its native habitat. Its distribution is limited to specific ecological niches within the Transcaucasus region.",
    "distribution_introduced_art_desc": "Acantholimon tenuiflorum was mainly introduced to regions with dry, rocky soils and a Mediterranean climate. It is commonly found in areas with low rainfall and high sun exposure. This plant is often used in xeriscaping due to its drought tolerance and ornamental value. It has been introduced to parts of California and the western United States. However, its spread is limited due to its specific environmental requirements."
}
