{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon oliganthum",
    "plant_slug": "acantholimon-oliganthum",
    "plant_name_scientific": "acantholimon oliganthum",
    "intro": "Acantholimon oliganthum, commonly known as the few-flowered acantholimon, is a member of the Plumbagaceae family. It is a perennial herbaceous plant native to the mountainous regions of central Asia, including parts of Mongolia and the Tibetan Plateau. The plant features basal rosettes of narrow, silver-gray leaves and produces small, blue or purple flowers in summer. It thrives in rocky, well-drained soils and is adapted to cold, arid climates. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon oliganthum"
    },
    "taxonomy_art_desc": "Acantholimon oliganthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Caryophyllales, which comprises plants with a wide range of morphological diversity, including succulents and some desert species. Its family is Plumbaginaceae, a group of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, known for their spiny leaves and showy flowers. Its species is Acantholimon oliganthum, a specific plant within the genus Acantholimon, characterized by its limited flower production and adapted to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon oliganthum is primarily native to Iran. It is found in the arid and semi-arid regions of the country, particularly in the central and eastern parts. This plant thrives in rocky and gravelly soils, often in mountainous areas. It is adapted to the harsh climate with low rainfall and high temperatures. Its distribution is limited to specific ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon oliganthum was mainly introduced to regions with temperate climates and well-drained soils, often found in coastal areas and rocky slopes. It is commonly associated with Mediterranean-type ecosystems, where it thrives in dry summers and mild, wet winters. This plant is typically found in open habitats such as grasslands, sand dunes, and disturbed soils. Its introduction has been documented in parts of California and Oregon in the United States. It is valued for its ornamental appeal and ability to withstand drought conditions."
}
