{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon libanoticum var. ulicinum",
    "plant_slug": "acantholimon-libanoticum-var-ulicinum",
    "plant_name_scientific": "acantholimon libanoticum var. ulicinum",
    "intro": "Acantholimon libanoticum var. ulicinum, commonly known as the Jordanian thornweed, is a flowering plant native to the Middle East and parts of North Africa. It belongs to the family Plumbaginaceae and is characterized by its spiny stems and small, blue or purple flowers. The plant typically grows in rocky or arid environments, showing a high degree of adaptability to harsh conditions. Its leaves are usually narrow and covered in fine hairs, helping to reduce water loss. This variety is of interest to botanists due to its unique morphology and ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon libanoticum var. ulicinum is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, Lebanon, and Israel. It is commonly found in rocky and limestone habitats, particularly in mountainous areas. This plant thrives in dry, well-drained soils and is often associated with open woodlands and scrublands. Its distribution is limited to specific ecological niches within these regions. It is a rare and endemic species, reflecting the unique environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acantholimon libanoticum var. ulicinum was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in restoration projects due to its ability to thrive in harsh environmental conditions. This plant is often planted in degraded landscapes to improve soil structure and promote ecological recovery. Its introduction has helped in reclaiming land that was previously affected by desertification. However, it is important to monitor its spread to avoid potential impacts on native flora."
}
