{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon agropyroideum",
    "plant_slug": "acantholimon-agropyroideum",
    "plant_name_scientific": "acantholimon agropyroideum",
    "intro": "Acantholimon agropyroideum, commonly known as the tufted sandverbena, is a flowering plant native to the western United States. It belongs to the family Caryophyllaceae and is characterized by its compact, mat-forming growth habit. The plant produces small, pink to purple flowers that bloom in late spring to early summer. It thrives in sandy or gravelly soils and is adapted to arid and semi-arid environments. Its leaves are typically gray-green and covered in fine hairs, which help reduce water loss.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon agropyroideum"
    },
    "taxonomy_art_desc": "Acantholimon agropyroideum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their allies, known for their complex vascular structures and often spore-bearing reproductive systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and sometimes toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, known for their succulent leaves and showy flowers. Its species is Acantholimon agropyroideum, a specific plant within the genus Acantholimon, characterized by its unique morphology and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lebanon-Syria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon agropyroideum is primarily native to Lebanon-Syria. This plant is typically found in arid and semi-arid regions within this geographic range. It thrives in rocky and gravelly soils, often in mountainous areas. The species is adapted to the Mediterranean climate characterized by hot, dry summers and mild, wet winters. It plays a role in the local flora and is part of the natural vegetation of the region.",
    "distribution_introduced_art_desc": "Acantholimon agropyroideum was mainly introduced to disturbed sites such as roadsides, construction areas, and gravelly soils. It is commonly found in arid and semi-arid regions where it can thrive in poor soil conditions. This plant is often seen in areas with low moisture and high sunlight exposure. Its introduction has been noted in several regions of the western United States. It is considered a non-native species that has established itself in these environments."
}
