{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis spathularis",
    "plant_slug": "acanthopsis-spathularis",
    "plant_name_scientific": "acanthopsis spathularis",
    "intro": "Acanthopsis spathularis, commonly known as the narrowleaf acanthus, is a member of the Acanthaceae family. It is characterized by its distinctive, spiny leaves and showy, tubular flowers that typically bloom in shades of red or purple. Native to tropical and subtropical regions, this plant thrives in warm, humid climates with well-drained soil. It is often cultivated as an ornamental plant due to its striking foliage and vibrant blooms. The plant's structure includes opposite leaves and bract-like calyces that surround the flowers, contributing to its visual appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis spathularis"
    },
    "taxonomy_art_desc": "Acanthopsis spathularis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often associated with a wide range of ecological adaptations. Its order is Lamiales, which includes plants with bilateral symmetry and often features aromatic compounds in their tissues. Its family is Acanthaceae, a group of flowering plants commonly known as the acanthus family, characterized by their showy flowers and often hairy leaves. Its genus is Acanthopsis, which refers to a group of flowering plants that typically have bract-like structures and are often found in tropical and subtropical regions. Its species is Acanthopsis spathularis, a specific plant within the genus Acanthopsis, distinguished by its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis spathularis is primarily native to the Cape Provinces of South Africa. This species is typically found in the fynbos biome, which is characterized by its unique vegetation and biodiversity. It thrives in sandy or rocky soils and is often associated with coastal and mountainous regions. The plant is well adapted to the Mediterranean climate of the area, with dry summers and wet winters. Due to its specific habitat requirements, it is not widely distributed beyond the Cape Provinces.",
    "distribution_introduced_art_desc": "Acanthopsis spathularis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and disturbed forests. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in temperate climates and has shown adaptability to various environmental conditions. Its introduction has been associated with human activities, including land development and accidental seed dispersal. Due to its aggressive growth, it can outcompete native vegetation in invaded areas."
}
