{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza wallisii",
    "plant_slug": "acanthorhiza-wallisii",
    "plant_name_scientific": "acanthorhiza wallisii",
    "intro": "Acanthorhiza wallisii, commonly known as the Wallis's thornroot, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the family Rubiaceae, which includes coffee and gardenias, and is characterized by its woody stems and opposite leaves. The plant produces small, white or yellowish flowers that are clustered in inflorescences, and its roots are often tuberous, contributing to its common name. It thrives in moist, shaded environments and is sometimes cultivated for ornamental purposes due to its attractive foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza wallisii is primarily native to the tropical regions of Southeast Asia, including parts of Malaysia, Indonesia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas where the climate is warm and humid. This plant typically grows in shaded understorey conditions, often near the base of trees or on rocky outcrops. It is also present in some islands of the Pacific, such as New Guinea and the Solomon Islands. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acanthorhiza wallisii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and forest edges. It thrives in temperate climates with moderate rainfall and well-drained soil conditions. The plant is often found in regions where human activity has altered the natural landscape. Its introduction has led to its establishment in several non-native regions, including parts of North America and Europe. Due to its rapid growth and adaptability, it can become invasive in certain environments."
}
