{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ulicinum var. purpurascens",
    "plant_slug": "acantholimon-ulicinum-var-purpurascens",
    "plant_name_scientific": "acantholimon ulicinum var. purpurascens",
    "intro": "Acantholimon ulicinum var. purpurascens, commonly known as the purple-flowered stonecress, is a flowering plant native to the arid regions of the western United States. It belongs to the family Brassicaceae, which includes many other flowering plants with small, cross-shaped flowers. The plant typically grows in rocky soils and is adapted to harsh, dry environments. Its leaves are usually fleshy and succulent, helping it retain moisture. The flowers are small, clustered, and often display a striking purple or pink hue, attracting various pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ulicinum"
    },
    "taxonomy_art_desc": "Acantholimon ulicinum var. purpurascens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, often with showy flowers and a wide range of habitats. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in dry regions, known for their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent stems and showy flowers. Its species is Acantholimon ulicinum, a specific plant within the genus Acantholimon, known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ulicinum var. purpurascens is primarily native to Turkey. This plant is found in specific regions of Turkey, particularly in the eastern and southeastern parts of the country. It typically grows in rocky or gravelly soils in mountainous areas. The species is adapted to the Mediterranean climate of Turkey, characterized by dry summers and wet winters. It is often found in open habitats such as slopes and steppes.",
    "distribution_introduced_art_desc": "Acantholimon ulicinum var. purpurascens was mainly introduced to areas with well-drained soils and full sun exposure, typically found in rocky or gravelly habitats. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. This plant has been introduced to parts of California and other western United States states. It is often cultivated in gardens for its ornamental value due to its striking purple flowers. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
