{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza aculeata",
    "plant_slug": "acanthorhiza-aculeata",
    "plant_name_scientific": "acanthorhiza aculeata",
    "intro": "Acanthorhiza aculeata, commonly known as the prickly root. It is a flowering plant native to the southeastern United States, characterized by its unique root system that forms a dense, cushion-like structure. The plant produces small, white or greenish flowers that are clustered in loose inflorescences. Its leaves are opposite, ovate, and often covered with fine hairs. The species is adapted to sandy or disturbed soils and is often found in open habitats such as roadsides and pine forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza aculeata is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and Alabama. It thrives in wetland habitats, particularly in marshes, swamps, and along the edges of ponds and lakes. This plant is commonly found in areas with saturated soil and is often associated with coastal and inland wetlands. It plays an important role in stabilizing soil and providing habitat for various aquatic and terrestrial organisms. Its distribution is largely restricted to the Atlantic and Gulf Coastal Plains.",
    "distribution_introduced_art_desc": "Acanthorhiza aculeata was mainly introduced to New Zealand. It was first recorded in the 19th century and has since become established in various regions of the country. The plant is commonly found in coastal and subantarctic environments, often growing on rocky substrates. It is considered an invasive species in some areas due to its rapid spread and ability to outcompete native vegetation. Its introduction is believed to have occurred through accidental transport via human activity."
}
