{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum ekbergii",
    "plant_slug": "acanthophyllum-ekbergii",
    "plant_name_scientific": "acanthophyllum ekbergii",
    "intro": "Acanthophyllum ekbergii, commonly known as the Ekberg's spiny saxifrage, is a low-growing shrub native to the arid regions of Central Asia. It is characterized by its dense, spiny foliage and compact growth habit, which helps it conserve water in harsh environments. The plant produces small, pink or purple flowers during the summer months, adding a splash of color to its rocky habitat. Its root system is deep and extensive, allowing it to access moisture from deeper soil layers. Acanthophyllum ekbergii plays a crucial role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum ekbergii"
    },
    "taxonomy_art_desc": "Acanthophyllum ekbergii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex structures such as vascular tissue. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features and often having a distinct morphology. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are characterized by their diverse and often complex reproductive structures. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive floral structures and often have a preference for arid or saline environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically characterized by their succulent stems and small, clustered flowers, often found in arid environments. Its species is Acanthophyllum ekbergii, a specific plant within the genus Acanthophyllum, known for its adaptations to harsh environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum ekbergii is primarily native to Afghanistan. It is found in the arid and semi-arid regions of the country, particularly in the southern and central parts. This plant thrives in sandy and gravelly soils, often in areas with low precipitation. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is limited to specific ecological niches within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum ekbergii was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Kazakhstan and Uzbekistan. It is commonly found in sandy and saline soils, where it forms dense shrublands. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a significant role in stabilizing soil and preventing desertification in these areas. Its introduction has been part of ecological restoration efforts in regions affected by land degradation."
}
