{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon nigricans",
    "plant_slug": "acantholimon-nigricans",
    "plant_name_scientific": "acantholimon nigricans",
    "intro": "Acantholimon nigricans, commonly known as the black-flowered flax, is a flowering plant native to the Mediterranean region. It is a member of the Plumbagaceae family and is characterized by its slender, upright growth habit. The plant produces small, dark purple to black flowers that bloom in late spring to early summer. Its leaves are typically narrow and slightly hairy, adapted to the dry, rocky environments it inhabits. Acantholimon nigricans is often found in coastal areas and is valued for its ornamental appeal and ecological importance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon nigricans"
    },
    "taxonomy_art_desc": "Acantholimon nigricans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contain secondary metabolites. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and coastal regions, known for their succulent leaves and showy flowers. Its species is Acantholimon nigricans, a specific type of plant within the genus Acantholimon, characterized by its dark-colored flowers and adaptability to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon nigricans is primarily native to Iran. This species is found in various regions of Iran, particularly in the western and central parts of the country. It thrives in arid and semi-arid environments, often growing in rocky or sandy soils. The plant is well adapted to the harsh climatic conditions of its native habitat. It is commonly found in areas with low rainfall and high temperatures.",
    "distribution_introduced_art_desc": "Acantholimon nigricans was mainly introduced to new environments through human activities such as gardening and landscaping. It is commonly found in disturbed soils and areas with moderate moisture. This plant has adapted well to a variety of soil types and can thrive in both full sun and partial shade. Its ability to spread through seeds and vegetative propagation has contributed to its establishment in non-native regions. However, it is considered a potential invasive species in some areas due to its competitive growth habit."
}
