{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhipsalis asperula",
    "plant_slug": "acanthorhipsalis-asperula",
    "plant_name_scientific": "acanthorhipsalis asperula",
    "intro": "Acanthorhipsalis asperula, commonly known as the rough-leaved stonecrop, is a succulent plant native to South Africa. It belongs to the family Crassulaceae and is characterized by its fleshy, upright stems and small, clustered leaves. The leaves are typically covered in a fine layer of white or grayish hair, giving them a rough texture. It produces clusters of tiny, star-shaped flowers in shades of pink or white during the summer months. This plant is well adapted to arid environments and requires minimal water and well-draining soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhipsalis asperula is primarily native to the Caribbean islands, particularly in regions such as Cuba, Hispaniola, and the Bahamas. It thrives in tropical and subtropical climates, often found in coastal areas and rocky outcrops. This plant is adapted to well-drained soils and full sun exposure, making it a common sight in coastal vegetation. It is also occasionally found in parts of southern Florida, where it has been introduced. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acanthorhipsalis asperula was mainly introduced to control invasive plant species in coastal areas. It was introduced to the United States, particularly in Florida and California, as a biological control agent. The plant was used to target and suppress the growth of invasive weeds like *Sida spinosa*. However, it has since become an invasive species itself, outcompeting native vegetation in some regions. Its introduction highlights the risks associated with using non-native plants for ecological management."
}
