{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum eglandulosum",
    "plant_slug": "acanthophyllum-eglandulosum",
    "plant_name_scientific": "acanthophyllum eglandulosum",
    "intro": "Acanthophyllum eglandulosum, commonly known as the smooth acanthophyllum, is a perennial shrub native to arid and semi-arid regions of Central Asia. It is characterized by its low-growing, woody stems and dense clusters of small, spine-tipped leaves. The plant produces yellow flowers in summer, which are typically clustered in panicles. It is well adapted to harsh environments, with deep roots and a succulent structure to store water. This species plays an important role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum eglandulosum"
    },
    "taxonomy_art_desc": "Acanthophyllum eglandulosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often adapted to arid environments. Its family is Caryophyllaceae, known as the carnation family, which includes many flowering plants with colorful, showy flowers. Its genus is Acanthophyllum, a group of flowering plants commonly found in arid and semi-arid regions, characterized by their spiny or bristly leaves. Its species is Acanthophyllum eglandulosum, a specific type of plant within the genus Acanthophyllum, known for its distinctive features and adaptation to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum eglandulosum is primarily native to Afghanistan. It is commonly found in arid and semi-arid regions of the country. This plant thrives in sandy or rocky soils and is adapted to the harsh climate of the region. It plays an important role in stabilizing soil and preventing erosion. Due to its resilience, it is often found in desert and steppe environments across Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum eglandulosum was mainly introduced to arid and semi-arid regions of North America, particularly in the western United States. It has been observed in states such as Nevada, Utah, and Arizona, where it thrives in sandy and gravelly soils. This plant is often found in disturbed areas, including roadsides and abandoned fields, due to its adaptability to harsh environmental conditions. Its introduction has raised concerns about its potential impact on native plant communities in these ecosystems. However, it is currently considered a minor invasive species with limited geographic spread."
}
