{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum flavum",
    "plant_slug": "acanthophyllum-flavum",
    "plant_name_scientific": "acanthophyllum flavum",
    "intro": "Acanthophyllum flavum, commonly known as the yellow sandmat, is a flowering plant native to arid regions of Central Asia. It belongs to the Amaranthaceae family and is characterized by its compact, mat-forming growth habit. The plant produces small, yellow flowers that bloom in late spring or early summer. Its leaves are typically hairy and adapted to reduce water loss in hot, dry environments. Acanthophyllum flavum is often found in sandy or gravelly soils and is well-suited to harsh, semi-desert conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum flavum"
    },
    "taxonomy_art_desc": "Acanthophyllum flavum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall and complex vascular systems. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive floral structures and often succulent leaves. Its family is Caryophyllaceae, commonly known as the carnation family, which includes plants with showy flowers and often hairy leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum flavum, a specific plant species within this genus, known for its yellow flowers and adaptation to harsh, dry habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum flavum is primarily native to Afghanistan. It is found in the arid and semi-arid regions of the country, particularly in the eastern and southern parts. This plant thrives in sandy and gravelly soils, often in areas with low rainfall. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is limited to specific ecological niches within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum flavum was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions with low precipitation and high temperatures, such as parts of the Middle East and Central Asia. This plant is often used for stabilizing dunes and preventing soil erosion due to its extensive root system. Its introduction has been both natural and human-assisted, particularly in areas where vegetation restoration is needed. However, it can sometimes become invasive, outcompeting native plant species in certain environments."
}
