{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus integrifolius",
    "plant_slug": "acanthus-integrifolius",
    "plant_name_scientific": "acanthus integrifolius",
    "intro": "Acanthus integrifolius, commonly known as the narrow-leaved acanthus, is a perennial herbaceous plant native to the Mediterranean region. It is characterized by its distinctive spiny leaves with a serrated margin and its showy, spire-like inflorescences. The plant typically grows to a height of 1 to 2 meters, with lance-shaped leaves that are often grayish-green in color. Its flowers are usually pink or purple and bloom in late summer. Acanthus integrifolius is often cultivated in gardens for its ornamental value and historical association with classical architecture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus integrifolius is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky coastal areas and along the shores of the Mediterranean Sea. This plant is commonly found in countries such as Greece, Turkey, Italy, and Morocco. It prefers well-drained soils and full sun exposure. Due to its hardy nature, it is often used in horticulture for its ornamental value.",
    "distribution_introduced_art_desc": "Acanthus integrifolius was mainly introduced to the Mediterranean region as an ornamental plant due to its striking foliage and floral displays. It has since spread to other areas, including parts of southern Europe and the Middle East, where it thrives in warm, sunny conditions. The plant is commonly found in gardens and along rocky coastlines, where it adapts well to coastal environments. Its introduction has led to its naturalization in several regions, sometimes becoming invasive in local ecosystems. Despite its ornamental value, it requires careful management to prevent overgrowth in natural habitats."
}
