{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon bracteatum var. capitatum",
    "plant_slug": "acantholimon-bracteatum-var-capitatum",
    "plant_name_scientific": "acantholimon bracteatum var. capitatum",
    "intro": "Acantholimon bracteatum var. capitatum, commonly known as the clustered sea holly, is a flowering plant native to coastal regions of the Mediterranean. It is characterized by its erect, spiny stems and clusters of blue to purple flowers that bloom in summer. The plant has narrow, leathery leaves that are adapted to tolerate saline and sandy soils. It is often found in dunes and rocky coastal habitats, where it thrives in full sun. Its unique appearance and hardy nature make it a distinctive component of coastal flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon bracteatum var. capitatum is primarily native to the western United States, particularly in California and Nevada. It is commonly found in rocky soils and open habitats such as coastal bluffs, slopes, and chaparral areas. This plant thrives in Mediterranean climates characterized by dry summers and wet winters. It is often associated with serpentine soils, which are rich in heavy metals and low in nutrients. Due to its limited range and specific habitat requirements, it is considered a rare and endangered species in some regions.",
    "distribution_introduced_art_desc": "Acantholimon bracteatum var. capitatum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is often found in disturbed soils, such as roadsides, fields, and waste areas. This plant thrives in environments with moderate temperatures and limited moisture, making it adaptable to various habitats. Its introduction has been associated with human activities, including landscaping and agricultural practices. Due to its hardy nature, it can sometimes become invasive in certain regions if not managed properly."
}
