{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon homophyllum",
    "plant_slug": "acantholimon-homophyllum",
    "plant_name_scientific": "acantholimon homophyllum",
    "intro": "Acantholimon homophyllum, commonly known as the smoothleaf desert sandwort, is a flowering plant native to the arid regions of western North America. It is a member of the Montiaceae family and is characterized by its low-growing, mat-forming habit. The plant features small, fleshy leaves and produces clusters of white or pale pink flowers during the summer months. It is adapted to harsh, dry environments and is often found in sandy or gravelly soils. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon homophyllum"
    },
    "taxonomy_art_desc": "Acantholimon homophyllum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their jointed stems and retention of primitive vascular features. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages and is distinguished by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and some medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent stems and flowers. Its species is Acantholimon homophyllum, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon homophyllum is primarily native to Afghanistan. This plant is commonly found in the mountainous regions of the country, particularly in the eastern and central areas. It thrives in rocky and arid environments, often growing at higher elevations. The species is adapted to the harsh climate and limited soil conditions of its native habitat. It plays an important ecological role in the local flora of Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon homophyllum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It thrives in environments where there is limited water availability, making it suitable for xeriscaping and low-maintenance gardens. This plant is often cultivated for its ornamental value, particularly its attractive, spiny foliage and flowering stems. It has been introduced to several regions outside its native range, including parts of California and the Pacific Northwest in the United States. Due to its hardy nature, it can sometimes become invasive in areas where it is not properly managed."
}
