{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum mucronatum",
    "plant_slug": "acanthophyllum-mucronatum",
    "plant_name_scientific": "acanthophyllum mucronatum",
    "intro": "Acanthophyllum mucronatum, commonly known as the spikeless jointfoot, is a flowering plant native to arid and semi-arid regions of central Asia. It belongs to the Amaranthaceae family and is characterized by its succulent, shrub-like growth form. The plant produces small, clustered flowers that are typically pink or red in color. It has adapted to survive in harsh environments with minimal water availability. Its structure and physiology make it well-suited for desert and steppe ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum mucronatum"
    },
    "taxonomy_art_desc": "Acanthophyllum mucronatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes vascular plants with a diverse range of forms, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and a wide distribution. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny or thorny stems. Its species is Acanthophyllum mucronatum, a specific plant within this genus known for its compact growth form and adaptation to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Transcaucasus",
        "Turkmenistan",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum mucronatum is primarily native to Iran, Transcaucasus, Turkmenistan, and Turkey. This plant is typically found in arid and semi-arid regions, often in sandy or rocky soils. It is well adapted to the harsh environmental conditions of its native range. The species is commonly associated with steppes and deserts in these areas. Its distribution reflects its ability to thrive in dry, continental climates.",
    "distribution_introduced_art_desc": "Acanthophyllum mucronatum was mainly introduced to arid and semi-arid regions of the Middle East and Central Asia. It is commonly found in sandy or gravelly soils where it forms dense, low-growing mats. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion in these areas. However, its introduction has raised concerns about its potential impact on native plant communities."
}
