{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium furcatum",
    "plant_slug": "acanthodium-furcatum",
    "plant_name_scientific": "acanthodium furcatum",
    "intro": "Acanthodium furcatum, commonly known as the forked acanthodium, is a rare and specialized plant species characterized by its unique botanical features. It belongs to the family Acanthaceae and is distinguished by its intricate, branched inflorescences that resemble delicate, feather-like structures. The plant typically grows in moist, shaded environments, such as tropical rainforests, where it thrives in high humidity and partial light conditions. Its leaves are opposite, ovate, and often covered in fine hairs, contributing to its distinctive appearance. Due to its limited distribution and specific habitat requirements, Acanthodium furcatum is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium furcatum is primarily native to the arid regions of central and southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in dry, sandy soils and is commonly found in grassland and shrubland habitats. This plant is well adapted to withstand long periods of drought due to its succulent leaves and deep root system. It plays an important ecological role by providing food and shelter for local wildlife. However, its distribution is limited and it is not commonly found outside of its native range.",
    "distribution_introduced_art_desc": "Acanthodium furcatum was mainly introduced to new habitats through human activities such as horticulture and landscaping. It has been reported in several regions outside its native range, including parts of Europe and North America. The plant's introduction is often linked to the trade of ornamental plants. It has shown adaptability to a variety of environmental conditions, which contributes to its spread. However, its impact on local ecosystems is still under study."
}
