{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax setchuenensis",
    "plant_slug": "acanthopanax-setchuenensis",
    "plant_name_scientific": "acanthopanax setchuenensis",
    "intro": "Acanthopanax setchuenensis, commonly known as the Sichuan elephant tree, is a deciduous shrub or small tree native to the mountainous regions of China. It is characterized by its compound leaves, which are typically opposite and have serrated edges. The plant produces small, greenish-yellow flowers followed by red berries that are edible for some bird species. It thrives in cool, humid climates and is often found in forested areas at high elevations. Due to its ornamental value and medicinal properties, it is sometimes cultivated in gardens and traditional herbal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax setchuenensis is primarily native to the mountainous regions of southwestern China, particularly in Sichuan and Yunnan provinces. It thrives in temperate to subtropical climates, often growing at elevations between 1,500 and 3,000 meters. This plant is commonly found in forests and rocky habitats, where it adapts well to the humid and cool conditions. It is also present in parts of northern Vietnam and eastern India. Due to its specific habitat requirements, it is considered a relatively rare and localized species.",
    "distribution_introduced_art_desc": "Acanthopanax setchuenensis was mainly introduced to the data as a rare and endemic species native to China. It is characterized by its distinctive compound leaves and climbing habit. The plant is often found in moist, shaded forest environments. Its introduction to the dataset highlights its ecological significance and potential for conservation efforts. Due to its limited distribution, further research is needed to understand its population dynamics and threats."
}
