{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocladus scleroxylon",
    "plant_slug": "acanthocladus-scleroxylon",
    "plant_name_scientific": "acanthocladus scleroxylon",
    "intro": "Acanthocladus scleroxylon, commonly known as the African sandthorn, is a flowering plant native to parts of Africa. It is a shrub or small tree that typically grows in arid and semi-arid regions. The plant has small, yellowish-green flowers that bloom in clusters, and its leaves are usually small and elliptical. It is adapted to withstand drought conditions, with a deep root system that helps it survive in poor soils. The plant is also known for its hard, woody bark, which provides some protection against environmental stress.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Polygalaceae",
        "genus": "Acanthocladus",
        "species": "Acanthocladus scleroxylon"
    },
    "taxonomy_art_desc": "Acanthocladus scleroxylon belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants such as legumes and vetches, often characterized by their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Polygalaceae, a family of flowering plants commonly known as milkvetches, which are often found in arid and semi-arid regions. Its genus is Acanthocladus, a group of flowering plants that are typically shrubs or small trees, often with distinctive leaf and flower structures. Its species is Acanthocladus scleroxylon, a specific type within the genus known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocladus scleroxylon is primarily native to Brazil North and Peru. This plant is found in the tropical regions of these countries. It typically grows in humid, forested areas with rich soil. The species is adapted to the warm and moist climate of the Amazon basin. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acanthocladus scleroxylon was mainly introduced to areas with specific ecological conditions that support its growth, such as well-drained soils and moderate climates. It is typically found in regions where it can establish itself in open or disturbed habitats. The plant's introduction has been documented in several parts of the world, including certain regions in Asia and the Pacific. Its distribution is often linked to human activities, such as horticulture or accidental transport. However, its natural range remains limited, and it is not widely established in the wild."
}
