{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus glaucus",
    "plant_slug": "acanthus-glaucus",
    "plant_name_scientific": "acanthus glaucus",
    "intro": "Acanthus glaucus, commonly known as the blue acanthus, is a perennial herb native to the Mediterranean region. It features striking, spiny leaves with a bluish-gray hue, and its flowers are typically pale blue or white. The plant grows up to 1.5 meters tall, with a robust stem and lance-shaped foliage. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and borders. The blue acanthus is valued for its ornamental appeal and historical use in classical architecture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus glaucus is primarily native to southern Europe, North Africa, and the Middle East. It is commonly found in regions such as Spain, Portugal, Italy, and parts of Greece. This plant thrives in coastal areas and limestone soils, often growing in rocky or sandy habitats. It is known for its striking silver-gray foliage and spires of blue or purple flowers. Acanthus glaucus is a hardy perennial that is well adapted to Mediterranean climates.",
    "distribution_introduced_art_desc": "Acanthus glaucus was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along streambanks and in woodland edges. This plant is often cultivated in gardens for its ornamental value due to its striking silver-green foliage and spires of blue flowers. It has become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. However, it is considered a non-native species and is not typically invasive in the regions where it is established."
}
