{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon schachimardanicum",
    "plant_slug": "acantholimon-schachimardanicum",
    "plant_name_scientific": "acantholimon schachimardanicum",
    "intro": "Acantholimon schachimardanicum, commonly known as the Schachimardan thornweed, is a flowering plant native to the mountainous regions of Turkey. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy stems and leaves. The plant produces small, blue or purple flowers that bloom in late spring to early summer. It thrives in rocky, well-drained soils and is adapted to arid or semi-arid environments. Due to its limited distribution and specific habitat requirements, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon schachimardanicum"
    },
    "taxonomy_art_desc": "Acantholimon schachimardanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Plumbaginaceae, known for its characteristic flowers and often containing plants with medicinal or ornamental value. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their spiny or thorny structures. Its species is Acantholimon schachimardanicum, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon schachimardanicum is primarily native to Kirgizstan and Uzbekistan. This plant is found in the mountainous regions of these countries. It typically grows in rocky and arid environments. The species is adapted to the harsh climatic conditions of Central Asia. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acantholimon schachimardanicum was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It is commonly found in rocky soils and dry habitats, often growing in coastal areas and along cliffs. This plant is adapted to arid and semi-arid conditions, making it a resilient species in these environments. It is often used in landscaping due to its hardy nature and ornamental value. However, its introduction has raised concerns about its potential impact on native plant communities."
}
