{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon demavendicum",
    "plant_slug": "acantholimon-demavendicum",
    "plant_name_scientific": "acantholimon demavendicum",
    "intro": "Acantholimon demavendicum, commonly known as the Demavend thornweed, is a flowering plant species native to the high-altitude regions of Iran. It belongs to the family Plumbagaceae and is characterized by its succulent, branched stems and small, blue to purple flowers. The plant typically grows in rocky and arid environments, showcasing its adaptation to harsh, dry conditions. It has small, needle-like leaves that help reduce water loss, and it produces seeds in small, capsule-like structures. Due to its limited distribution and specific habitat requirements, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon demavendicum"
    },
    "taxonomy_art_desc": "Acantholimon demavendicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex cellular structures and the presence of chloroplasts. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes many species with specialized adaptations to arid environments, such as succulence. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with distinctive blue or purple flowers and often found in rocky or sandy soils. Its genus is Acantholimon, a group of flowering plants typically characterized by their succulent stems and showy flowers, often adapted to harsh environments. Its species is Acantholimon demavendicum, a specific plant species native to certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon demavendicum is primarily native to Iran. It is found in specific regions of the country, particularly in the central and eastern areas. This plant typically grows in rocky and semi-arid environments. It is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to certain ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon demavendicum was mainly introduced to the Mediterranean Basin, particularly in regions with rocky and arid soils. It is commonly found in Turkey, Greece, and parts of southern Europe. This plant thrives in environments with low precipitation and high sunlight exposure. It is often seen growing on slopes and in dry, open habitats. Its introduction has been associated with both natural dispersal and human activities."
}
