{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocladus brasiliensis",
    "plant_slug": "acanthocladus-brasiliensis",
    "plant_name_scientific": "acanthocladus brasiliensis",
    "intro": "Acanthocladus brasiliensis, commonly known as the Brazilian acanthocladus, is a flowering plant native to Brazil. It belongs to the family Acanthocladaceae and is characterized by its woody stems and simple, alternate leaves. The plant produces small, greenish-white flowers that are clustered in inflorescences. It thrives in tropical and subtropical climates, often found in shaded, moist environments. Due to its ornamental value, it is occasionally cultivated in horticulture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Polygalaceae",
        "genus": "Acanthocladus",
        "species": "Acanthocladus brasiliensis"
    },
    "taxonomy_art_desc": "Acanthocladus brasiliensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of primitive vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that are often considered to be among the most primitive angiosperms. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities. Its family is Polygalaceae, a family of flowering plants commonly known as milkworts, which includes both herbaceous and shrub species. Its genus is Acanthocladus, a small genus of flowering plants native to South America, characterized by its distinctive floral structures. Its species is Acanthocladus brasiliensis, a specific plant species within the genus Acanthocladus, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Paraguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocladus brasiliensis is primarily native to Brazil South, Brazil Southeast, Brazil West-Central, and Paraguay. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in moist, shaded environments, often in forest understories. The species is well-adapted to the humid climate and rich soil conditions of its native range. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthocladus brasiliensis was mainly introduced to ornamental horticulture due to its unique and attractive foliage. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and landscaping. The plant is known for its dense, grass-like appearance and ability to thrive in moist, shaded environments. It has been widely distributed in countries with warm climates, including parts of the United States, Australia, and Southeast Asia. However, its introduction has raised concerns about potential ecological impacts in non-native regions."
}
