{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax gracilistylus var. villosulus",
    "plant_slug": "acanthopanax-gracilistylus-var-villosulus",
    "plant_name_scientific": "acanthopanax gracilistylus var. villosulus",
    "intro": "Acanthopanax gracilistylus var. villosulus, commonly known as the hairy-stemmed Chinese angel's trumpet, is a climbing shrub native to Southeast Asia. It is characterized by its long, slender stems covered in fine, hairy pubescence. The plant produces clusters of small, yellowish-green flowers followed by red, fleshy berries. It thrives in humid, tropical climates and is often found in forest understories. Its botanical features make it a subject of interest in both horticulture and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax gracilistylus var. villosulus is primarily native to the mountainous regions of China, particularly in the provinces of Yunnan and Sichuan. This species thrives in temperate to subtropical climates, often found in forests at elevations ranging from 1,500 to 3,000 meters. It is commonly associated with rocky slopes and shaded understory environments within these mountain ranges. The plant is part of the Araliaceae family and is known for its distinctive, hairy leaves and woody stems. Due to its limited geographic range, it is considered a rare and ecologically significant species in its native habitat.",
    "distribution_introduced_art_desc": "Acanthopanax gracilistylus var. villosulus was mainly introduced to regions with temperate to subtropical climates, particularly in East Asia. It thrives in well-drained soils and partial to full sunlight, making it suitable for gardens and landscapes. This plant is often cultivated for its ornamental value due to its attractive foliage and unique growth habit. It has been introduced to several countries outside its native range, including parts of North America and Europe. However, its introduction has raised concerns about potential invasiveness in non-native environments."
}
