{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon albocalycinum",
    "plant_slug": "acantholimon-albocalycinum",
    "plant_name_scientific": "acantholimon albocalycinum",
    "intro": "Acantholimon albocalycinum, commonly known as the white-flowered stonecrop, is a perennial plant native to the mountainous regions of Central Asia. It belongs to the family Crassulaceae and is characterized by its fleshy, succulent leaves and clusters of small, white flowers. The plant typically grows in rocky or gravelly soils and is adapted to arid or semi-arid environments. It produces a basal rosette of leaves and has a short, upright flowering stem. Acantholimon albocalycinum is valued for its ornamental appeal and is sometimes cultivated in rock gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon albocalycinum"
    },
    "taxonomy_art_desc": "Acantholimon albocalycinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon albocalycinum, a specific plant species within this genus, known for its unique floral characteristics and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon albocalycinum is primarily native to Iran. This plant is found in specific regions within Iran, particularly in the arid and semi-arid areas. It thrives in rocky and gravelly soils, often in mountainous or plateau regions. Its distribution is limited to certain ecological niches that provide the necessary conditions for its growth. Due to its restricted habitat, it is considered a rare and endemic species in the country.",
    "distribution_introduced_art_desc": "Acantholimon albocalycinum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed sites such as roadsides, gravelly slopes, and dry grasslands. This plant thrives in environments with low precipitation and high temperatures. It is often used in xeriscaping due to its drought tolerance and ornamental value. Its distribution has expanded in regions where human activity has altered natural habitats."
}
