{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocardamum erinaceum",
    "plant_slug": "acanthocardamum-erinaceum",
    "plant_name_scientific": "acanthocardamum erinaceum",
    "intro": "Acanthocardamum erinaceum, commonly known as the spiny cardamum, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the family Rubiaceae and is characterized by its compact, shrub-like growth habit. The plant features small, clustered flowers that are typically white or pale yellow, surrounded by glandular, hairy leaves. Its fruit is a capsule that splits open to release tiny, aromatic seeds. Due to its ornamental value and potential medicinal properties, it is sometimes cultivated in botanical gardens and traditional herbal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocardamum erinaceum is primarily native to the tropical regions of Southeast Asia, particularly countries such as Thailand, Malaysia, and Indonesia. It thrives in humid, lowland areas with rich soil and a warm climate. This plant is commonly found in rainforests and along riverbanks where it can access ample moisture. It plays a role in local ecosystems by providing habitat and food for various insects and small animals. Due to habitat loss, its distribution has become increasingly restricted in recent years.",
    "distribution_introduced_art_desc": "Acanthocardamum erinaceum was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and forest edges. This plant thrives in full sun to partial shade and is often seen in regions with seasonal rainfall. Its introduction has been noted in several countries in Southeast Asia and parts of Africa. Due to its rapid growth and adaptability, it can become invasive in certain ecosystems if not managed properly."
}
