{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum lindbergii",
    "plant_slug": "acanthophyllum-lindbergii",
    "plant_name_scientific": "acanthophyllum lindbergii",
    "intro": "Acanthophyllum lindbergii, commonly known as the Lindberg's thornbush, is a shrub native to the arid regions of Central Asia. It is characterized by its dense, spiny foliage and compact growth habit, which helps it conserve water in harsh environments. The plant produces small, yellowish flowers that bloom in late spring, attracting pollinators such as bees and butterflies. Its leaves are typically small and covered in a waxy cuticle to reduce water loss. Acanthophyllum lindbergii is well adapted to sandy soils and extreme temperature fluctuations, making it a resilient species in desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum lindbergii"
    },
    "taxonomy_art_desc": "Acanthophyllum lindbergii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, which includes plants with showy flowers and often contains species adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with distinctive petals and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum lindbergii, a specific plant within the genus known for its adaptations to harsh environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum lindbergii is primarily native to Afghanistan. It is found in the arid and semi-arid regions of the country, particularly in the eastern and southern parts. This plant thrives in sandy and rocky soils, often in areas with low precipitation. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is limited to specific ecological zones within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum lindbergii was mainly introduced to arid and semi-arid regions of central Asia, particularly in Kazakhstan, Mongolia, and parts of China. It is commonly found in sandy and gravelly soils, often in steppe and desert environments. This plant is well adapted to extreme temperatures and low precipitation, making it a resilient species in harsh climates. It plays a role in stabilizing soil and preventing erosion in these regions. However, its introduction has raised concerns about its potential impact on native plant communities."
}
