{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholoma spinosum",
    "plant_slug": "acantholoma-spinosum",
    "plant_name_scientific": "acantholoma spinosum",
    "intro": "Acantholoma spinosum, commonly known as the spiny acantholoma, is a small, herbaceous plant native to arid and semi-arid regions of southern Africa. It features a compact rosette of fleshy, spiny leaves that help it conserve water in its harsh environment. The plant produces small, yellowish flowers that bloom in late spring or early summer. Its leaves are covered in fine, bristle-like hairs, which provide additional protection against desiccation. Acantholoma spinosum is adapted to survive in nutrient-poor soils and can go dormant during periods of extreme drought.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholoma spinosum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky and arid environments, often found in coastal areas and mountainous regions. This plant is well adapted to dry climates and can tolerate poor soil conditions. It is commonly seen in scrublands and along cliffs where it receives ample sunlight. Its spiny structure helps protect it from herbivores and harsh weather conditions.",
    "distribution_introduced_art_desc": "Acantholoma spinosum was mainly introduced to new environments through human activities such as trade and accidental transport. It thrives in disturbed soils and can establish itself in urban and agricultural areas. This plant is considered an invasive species in some regions due to its rapid growth and competitive nature. Its introduction has led to concerns about its impact on native plant communities. Efforts are being made to monitor and manage its spread to prevent ecological disruption."
}
