{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax aculeatus",
    "plant_slug": "acanthopanax-aculeatus",
    "plant_name_scientific": "acanthopanax aculeatus",
    "intro": "Acanthopanax aculeatus, commonly known as the Chinese angel's trumpet, is a deciduous shrub native to East Asia. It features compound leaves with serrated edges and produces clusters of small, fragrant flowers. The plant is characterized by its thorny stems and is often found in forested areas. It is valued for its ornamental qualities and has traditional medicinal uses in Chinese medicine. The species is also used in horticulture for its hardiness and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax aculeatus is primarily native to Southeast Asia, including countries such as China, Vietnam, Laos, Cambodia, and Thailand. It is commonly found in tropical and subtropical regions, particularly in mountainous areas with dense forests. This plant thrives in humid climates and is often associated with secondary growth habitats. It is also present in parts of India and the Philippines. Due to its adaptability, it can be found in a variety of soil types, but it prefers well-drained, nutrient-rich soils.",
    "distribution_introduced_art_desc": "Acanthopanax aculeatus was mainly introduced to new environments as a ornamental plant due to its unique appearance and hardy nature. It is commonly found in regions with temperate climates, where it thrives in well-drained soils and full sun exposure. The plant's introduction has led to its establishment in various ecological niches, sometimes outcompeting native species. Its rapid growth and adaptability make it a potential invasive species in certain areas. Proper management is necessary to prevent its spread and minimize ecological impacts."
}
