{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholippia trifida var. reichei",
    "plant_slug": "acantholippia-trifida-var-reichei",
    "plant_name_scientific": "acantholippia trifida var. reichei",
    "intro": "Acantholippia trifida var. reichei, commonly known as the desert lippia, is a shrub native to arid and semi-arid regions of the southwestern United States and northern Mexico. It is characterized by its small, aromatic leaves and clusters of yellow flowers that bloom in the spring. The plant is adapted to survive in harsh, dry conditions with deep roots and a low, spreading growth habit. It produces small, oval berries that are typically green when immature and turn red when ripe. This species is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholippia trifida var. reichei is primarily native to the western United States, specifically California and Oregon. It is commonly found in coastal scrub and chaparral habitats. This variety thrives in sandy or gravelly soils along the Pacific coast. It is often associated with maritime climates characterized by cool, moist conditions. The plant is well adapted to the unique environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acantholippia trifida var. reichei was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, disturbed forests, and agricultural fields. It thrives in regions with moderate to high levels of sunlight and well-drained soils. This plant is commonly found in the western United States, particularly in California and Oregon. Its introduction has led to its establishment in both natural and human-altered landscapes. Due to its adaptability, it has become a common sight in areas where it has been planted or has spread naturally."
}
