{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax japonicus var. nikaianus",
    "plant_slug": "acanthopanax-japonicus-var-nikaianus",
    "plant_name_scientific": "acanthopanax japonicus var. nikaianus",
    "intro": "Acanthopanax japonicus var. nikaianus, commonly known as the Japanese five-leaf aralia, is a deciduous shrub native to East Asia. It is characterized by its compound leaves, typically consisting of five oval-shaped leaflets. The plant produces small, yellowish-green flowers in umbel-like clusters, followed by red berries that are edible for humans and birds. It thrives in shaded to partially sunny environments and is often found in forest understories. Its ornamental value and adaptability make it a popular choice for garden cultivation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax japonicus var. nikaianus is primarily native to the Korean Peninsula, including parts of South Korea and North Korea. It is also found in northeastern China, particularly in the provinces of Liaoning and Jilin. This plant grows in mountainous regions and forested areas, often in temperate climates. It is commonly associated with secondary growth habitats and can be found at elevations ranging from 500 to 1,500 meters. Its distribution is limited to specific ecological zones where its environmental requirements are met.",
    "distribution_introduced_art_desc": "Acanthopanax japonicus var. nikaianus was mainly introduced to regions with temperate climates and moist, well-drained soils, often found in forested areas. It thrives in partial to full shade and is commonly found in the understory of mixed hardwood forests. This variant is known for its ornamental value, particularly its clusters of small white flowers and its ability to tolerate urban environments. It has been introduced to parts of North America and Europe as a horticultural plant. However, its spread outside its native range requires careful management to prevent ecological disruption."
}
