{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon parsianum",
    "plant_slug": "acantholimon-parsianum",
    "plant_name_scientific": "acantholimon parsianum",
    "intro": "Acantholimon parsianum, commonly known as Persian thornweed, is a flowering plant native to the high-altitude regions of Iran. It belongs to the family Plumbaginaceae and is characterized by its succulent, spiny stems and small, blue to purple flowers. The plant typically grows in rocky and arid environments, showcasing its adaptability to harsh conditions. Its leaves are often fleshy and covered in fine hairs, which help reduce water loss. Acantholimon parsianum plays a role in stabilizing soil in its native habitat and is of interest to botanists studying xerophytic adaptations.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon parsianum is primarily native to the mountainous regions of the western Caucasus, specifically in the areas of Azerbaijan, Armenia, and the northeastern part of Turkey. It is commonly found in alpine and subalpine habitats, growing in rocky soils and open slopes. This plant is adapted to the cold and harsh climate of these high-altitude regions. It is often found in the vicinity of the Greater Caucasus mountain range. Its distribution is limited to these specific geographic areas due to its specialized ecological requirements.",
    "distribution_introduced_art_desc": "Acantholimon parsianum was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions with moderate rainfall. It thrives in open habitats such as grasslands, rocky slopes, and disturbed sites. This plant is often found in the Mediterranean climate zones of Europe and parts of the Middle East. Its introduction has been primarily for ornamental purposes due to its attractive blue or purple flowers. However, it is considered a non-native species in many regions where it has been introduced."
}
