{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum makranicum",
    "plant_slug": "acanthophyllum-makranicum",
    "plant_name_scientific": "acanthophyllum makranicum",
    "intro": "Acanthophyllum makranicum, commonly known as the Makran thorny shrub, is a perennial plant native to the arid regions of Pakistan and Iran. It belongs to the Amaranthaceae family and is characterized by its dense, spiny foliage and small, clustered flowers. The plant is well adapted to harsh, dry environments, with deep root systems that help it survive in nutrient-poor soils. Its structure provides habitat for small animals and insects, contributing to local biodiversity. Due to its resilience, it is often used in ecological restoration projects in semi-arid areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum makranicum"
    },
    "taxonomy_art_desc": "Acanthophyllum makranicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging lineages with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contains species adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many herbaceous plants with simple flowers and often hairy leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny or thorny structures. Its species is Acanthophyllum makranicum, a specific plant species native to certain regions of Pakistan, known for its adaptations to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum makranicum is primarily native to Iran and Pakistan. It is commonly found in arid and semi-arid regions, particularly in the coastal areas of the Makran region. This plant thrives in sandy and saline soils, often growing in dunes and coastal plains. It plays an important role in stabilizing dunes and preventing soil erosion in these environments. Its distribution is closely linked to the unique climatic and geological conditions of the region.",
    "distribution_introduced_art_desc": "Acanthophyllum makranicum was mainly introduced to arid and semi-arid regions of Pakistan, particularly in the Makran region. It is commonly found in sandy and rocky soils, often growing in coastal and inland deserts. This plant is well adapted to extreme temperatures and low precipitation, making it a resilient species in harsh environments. It plays a vital role in stabilizing dunes and preventing soil erosion. Its distribution is largely restricted to specific ecological niches where it can thrive with minimal water availability."
}
