{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon quinquelobum",
    "plant_slug": "acantholimon-quinquelobum",
    "plant_name_scientific": "acantholimon quinquelobum",
    "intro": "Acantholimon quinquelobum, commonly known as the five-lobed thistle, is a flowering plant native to the western United States. It belongs to the family Caryophyllaceae and is characterized by its succulent, hairy stems and basal rosettes of leaves. The plant produces clusters of small, pinkish-white flowers that bloom in late spring to early summer. It thrives in rocky, well-drained soils and is often found in mountainous regions. Due to its unique morphology and habitat, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon quinquelobum"
    },
    "taxonomy_art_desc": "Acantholimon quinquelobum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and retention of primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many diverse species, often characterized by their showy flowers and complex reproductive structures. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert plants, often with distinctive flower structures and some species containing secondary metabolites. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes plants with showy flowers and some medicinal properties. Its genus is Acantholimon, a genus of flowering plants in the family Plumbaginaceae, typically characterized by their succulent stems and often colorful flowers. Its species is Acantholimon quinquelobum, a specific plant within the genus Acantholimon, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon quinquelobum is primarily native to Iran, Transcaucasus, and Turkey. This plant is commonly found in rocky and arid environments within these regions. It thrives in areas with well-drained soils and limited water availability. The species is often associated with mountainous and semi-desert habitats. Its native distribution reflects its adaptation to the climatic conditions of these geographic areas.",
    "distribution_introduced_art_desc": "Acantholimon quinquelobum was mainly introduced to areas with well-drained sandy or gravelly soils, often in open habitats such as coastal dunes, sand plains, and rocky slopes. It thrives in regions with a Mediterranean climate characterized by dry summers and wet winters. This plant is commonly found in southern California, parts of Nevada, and northern Baja California. It is adapted to withstand drought conditions and can tolerate salt spray in coastal environments. Its distribution is largely limited to specific ecological niches where it can establish and persist over time."
}
