{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum elongatum",
    "plant_slug": "acanthophyllum-elongatum",
    "plant_name_scientific": "acanthophyllum elongatum",
    "intro": "Acanthophyllum elongatum, commonly known as the long-stemmed spiny bush, is a flowering plant native to arid and semi-arid regions of Central Asia. It belongs to the Amaranthaceae family and is characterized by its low-growing, succulent stems covered in spines. The plant produces small, clustered flowers that are typically greenish or reddish in color. It is well adapted to harsh environments, storing water in its fleshy stems and leaves. Acanthophyllum elongatum plays a role in stabilizing soil and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum elongatum is primarily native to the arid and semi-arid regions of Central Asia, including parts of Mongolia, Kazakhstan, and western China. It thrives in sandy and gravelly soils, often found in steppes and deserts. This plant is well adapted to harsh environmental conditions, such as extreme temperatures and limited water availability. It plays an important role in stabilizing dunes and preventing soil erosion in its native habitat. Its distribution is closely linked to the ecological zones characterized by low precipitation and high solar radiation.",
    "distribution_introduced_art_desc": "Acanthophyllum elongatum was mainly introduced to areas with arid or semi-arid conditions, where it thrives in sandy or gravelly soils. It is commonly found in regions with low precipitation and high sunlight exposure. This plant is often used for soil stabilization due to its deep root system and ability to prevent erosion. It has been introduced to parts of North America, including the western United States, as part of ecological restoration efforts. Its distribution is expanding in response to climate change and human land management practices."
}
