{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium hirtinervium",
    "plant_slug": "acanthodium-hirtinervium",
    "plant_name_scientific": "acanthodium hirtinervium",
    "intro": "Acanthodium hirtinervium, commonly known as the hairy-veined acanthodium, is a rare flowering plant native to specific regions of South America. It is characterized by its slender, erect stems and small, clustered flowers that range in color from white to pale pink. The leaves are narrow and hairy, giving the plant its common name, while the veins are prominently raised and covered with fine hairs. It thrives in humid, shaded environments and is often found in moist forest understories. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium hirtinervium is primarily native to the eastern and southern regions of South America, particularly in countries such as Brazil, Paraguay, and Argentina. It thrives in humid tropical and subtropical climates, often found in dense forests and along riverbanks. This species is commonly associated with moist, well-drained soils and is often seen in understory vegetation. It plays an important ecological role in its native habitat by contributing to biodiversity and supporting local wildlife. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Acanthodium hirtinervium was mainly introduced to new environments through human activities such as horticulture and landscaping. It is commonly found in disturbed soils and urban areas, where it thrives in nutrient-rich conditions. This plant has spread across various regions, often outcompeting native vegetation due to its rapid growth and adaptability. Its introduction has raised concerns among ecologists due to its potential to become an invasive species. Despite its ornamental appeal, its ecological impact requires further study and management."
}
