{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthostachys pitcairnioides",
    "plant_slug": "acanthostachys-pitcairnioides",
    "plant_name_scientific": "acanthostachys pitcairnioides",
    "intro": "Acanthostachys pitcairnioides, commonly known as the silver grass, is a species of flowering plant in the grass family. It is native to Australia and is characterized by its tall, slender stalks and soft, silvery foliage. The plant produces small, pale blue or purple flowers that appear in dense, spike-like clusters. It thrives in well-drained soils and full sun, making it suitable for rock gardens and coastal landscapes. Its ornamental value is enhanced by its graceful appearance and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Bromeliaceae",
        "genus": "Acanthostachys",
        "species": "Acanthostachys pitcairnioides"
    },
    "taxonomy_art_desc": "Acanthostachys pitcairnioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true vascular system and complex reproductive structures. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Poales, which includes grasses, sedges, and related plants, known for their wind-pollinated flowers and typically narrow leaves. Its family is Bromeliaceae, a family of flowering plants commonly found in tropical and subtropical regions, known for their diverse forms and often water-storing leaves. Its genus is Acanthostachys, a group of flowering plants within the Bromeliaceae family, typically characterized by their spiky or bristly structures. Its species is Acanthostachys pitcairnioides, a specific plant within the genus Acanthostachys, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Northeast",
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthostachys pitcairnioides is primarily native to Brazil Northeast and Brazil Southeast. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in moist, shaded environments within forest understories. The species is part of the Poaceae family, known for its grass-like appearance. Its natural range is limited to specific habitats in these regions of Brazil.",
    "distribution_introduced_art_desc": "Acanthostachys pitcairnioides was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The plant has since become naturalized in certain regions, particularly in the North Island. It is commonly found in open areas such as roadsides and disturbed sites. However, it is not considered a major invasive species in New Zealand."
}
