{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax xizangensis",
    "plant_slug": "acanthopanax-xizangensis",
    "plant_name_scientific": "acanthopanax xizangensis",
    "intro": "Acanthopanax xizangensis, commonly known as the Tibet anise tree, is a deciduous shrub or small tree native to the Himalayan regions of China, Nepal, and India. It belongs to the family Araliaceae and is characterized by its compound leaves and small, yellowish-green flowers. The plant is notable for its medicinal properties, with various parts used in traditional Tibetan and Chinese medicine. It thrives in high-altitude environments, typically at elevations above 2,500 meters. Acanthopanax xizangensis is also valued for its ecological role in stabilizing mountainous terrain and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax xizangensis is primarily native to the Himalayan region, specifically in the eastern part of the Tibetan Plateau. It is found in countries such as China, India, Nepal, and Bhutan. This plant grows in high-altitude areas with cold and temperate climates. It is typically found in mountainous forests and shrublands at elevations ranging from 2,500 to 4,500 meters. Due to its restricted habitat, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acanthopanax xizangensis was mainly introduced to regions with temperate to subtropical climates, characterized by well-drained soils and moderate rainfall. It thrives in mountainous areas, often found in forested regions at elevations ranging from 2,000 to 4,000 meters. This plant is commonly distributed in the eastern Himalayas, including parts of China, Nepal, and Bhutan. It prefers shady to semi-shaded conditions and is often associated with mixed evergreen and deciduous forests. Its introduction to new areas has been primarily through natural dispersal and occasional horticultural cultivation."
}
