{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus horridus",
    "plant_slug": "acanthocereus-horridus",
    "plant_name_scientific": "acanthocereus horridus",
    "intro": "Acanthocereus horridus, commonly known as the night blooming cereus, is a cacti species native to Mexico and parts of Central America. It is a columnar cactus with thick, ribbed stems that store water, allowing it to survive in arid environments. The plant produces large, showy white flowers that open at night, attracting nocturnal pollinators like bats and moths. Its spines are sharp and often covered in a fine, white coating that helps reduce water loss. The plant is well adapted to desert conditions and requires minimal water once established.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus horridus is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in regions such as Arizona, New Mexico, and Texas. This cactus thrives in desert and semi-arid environments, often growing on rocky soils. It is well adapted to the harsh conditions of its native habitat, including high temperatures and low rainfall. The plant is also known as the \"horrid cactus\" due to its spiny appearance.",
    "distribution_introduced_art_desc": "Acanthocereus horridus was mainly introduced to the southwestern United States and parts of northern Mexico. It is commonly found in desert environments, particularly in areas with well-drained soils. This cactus is often cultivated for its ornamental value due to its spiny appearance and ability to thrive in arid conditions. It has been introduced to various regions as a landscape plant, especially in xeriscaping and rock gardens. However, its spread can sometimes lead to ecological concerns in non-native habitats."
}
