{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus doloariu",
    "plant_slug": "acanthus-doloariu",
    "plant_name_scientific": "acanthus doloariu",
    "intro": "Acanthus doloariu, commonly known as the Madagascar acanthus, is a striking plant native to the island of Madagascar. It belongs to the Acanthaceae family and is characterized by its large, velvety leaves with intricate, wavy margins. The plant produces showy, spike-like inflorescences that bear small, tubular flowers in shades of purple and pink. It thrives in moist, well-drained soil and prefers partial to full shade, making it a popular choice for shaded garden settings. Its ornamental value has made it a sought-after plant in horticulture, though it requires careful cultivation to thrive outside its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus doloariu is primarily native to Madagascar. It is found in the island's eastern and southern regions. This plant typically grows in moist, shaded areas within forested habitats. It is a member of the Acanthaceae family and is known for its ornamental foliage. Its native distribution is limited to this specific geographic area.",
    "distribution_introduced_art_desc": "Acanthus doloariu was mainly introduced to ornamental horticulture and landscaping due to its striking foliage and architectural form. It is commonly found in gardens and green spaces in regions with temperate to subtropical climates. The plant's ability to thrive in well-drained soils and its tolerance to partial shade make it a popular choice for urban and suburban landscapes. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation. Proper management is recommended to prevent its spread in non-native environments."
}
