{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum oppositiflorum",
    "plant_slug": "acanthophyllum-oppositiflorum",
    "plant_name_scientific": "acanthophyllum oppositiflorum",
    "intro": "Acanthophyllum oppositiflorum, commonly known as the spiked flax, is a flowering plant native to the arid regions of Central Asia. It is a shrub characterized by its spiny stems and small, opposite leaves. The plant produces clusters of yellow flowers, which bloom in late spring to early summer. It is adapted to survive in harsh, dry environments with minimal water availability. Its structure and growth habits make it an important component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum oppositiflorum"
    },
    "taxonomy_art_desc": "Acanthophyllum oppositiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their spore-producing reproductive structures and often possessing vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often show adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes herbs and shrubs with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid environments, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum oppositiflorum, a specific plant within the genus known for its opposite flowering arrangement and adapted to dry, harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum oppositiflorum is primarily native to Turkey. It is found in the arid and semi-arid regions of the country, particularly in the central and southeastern areas. This plant thrives in sandy and rocky soils, often in steppe and desert environments. It is well adapted to the harsh climate conditions of its native habitat. Its distribution is limited to specific ecological niches within Turkey.",
    "distribution_introduced_art_desc": "Acanthophyllum oppositiflorum was mainly introduced to arid and semi-arid regions of the Middle East and Central Asia. It is commonly found in sandy soils and gravelly plains, where it thrives in harsh environmental conditions. This plant is often used for soil stabilization and as a source of forage for livestock. Its introduction has helped in reclaiming degraded lands in these areas. However, it is also considered an invasive species in some regions, posing a threat to native vegetation."
}
