{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus xiamenensis",
    "plant_slug": "acanthus-xiamenensis",
    "plant_name_scientific": "acanthus xiamenensis",
    "intro": "Acanthus xiamenensis, commonly known as the Xiamen acanthus, is a rare and ornamental plant native to southern China. It belongs to the Acanthaceae family and is characterized by its striking, palmate leaves with serrated edges. The plant produces showy, bracteate inflorescences that bear small, tubular flowers in shades of purple and pink. It thrives in moist, well-drained soils and is often found in shaded, humid environments. Due to its rarity and unique appearance, it is valued in botanical gardens and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus xiamenensis is primarily native to the coastal regions of Fujian Province in southeastern China. It is commonly found in areas with sandy or rocky soils along the shoreline. This plant thrives in humid, subtropical climates with ample sunlight. It is often seen growing in tidal zones and near the mouths of rivers. Due to its unique appearance and habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthus xiamenensis was mainly introduced to coastal regions of southeastern China, particularly in Fujian and Zhejiang provinces. It thrives in sandy or rocky soils along the shoreline, where it can tolerate salt spray and moderate tidal conditions. This plant is often found in urban and suburban landscapes due to its ornamental value and adaptability. It has been cultivated in botanical gardens and public parks as a decorative species. However, its introduction has raised concerns about potential ecological impacts on native coastal flora."
}
