{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon anzobicum var. albiflorum",
    "plant_slug": "acantholimon-anzobicum-var-albiflorum",
    "plant_name_scientific": "acantholimon anzobicum var. albiflorum",
    "intro": "Acantholimon anzobicum var. albiflorum, commonly known as the white-flowered acantholimon, is a perennial plant native to the arid regions of central Asia. It belongs to the family Plumbaginaceae and is characterized by its succulent, fleshy leaves adapted to conserve water. The plant produces clusters of small, white or pale blue flowers during the summer months. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its unique appearance and drought tolerance, it is sometimes cultivated in xeriscapes and rock gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon anzobicum var. albiflorum is primarily native to the arid and semi-arid regions of central and western Australia. It is commonly found in sandy soils within the states of South Australia, Western Australia, and the Northern Territory. This plant thrives in environments with low rainfall and high sunlight exposure. It is often seen in coastal dunes and inland saltbush plains. Its distribution is closely tied to specific ecological zones that provide the right balance of moisture and drainage.",
    "distribution_introduced_art_desc": "Acantholimon anzobicum var. albiflorum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal regions. It is commonly found in sandy or gravelly soils, often near dunes or along the edges of salt marshes. This plant thrives in environments with moderate to high salinity, making it suitable for coastal restoration projects. Its introduction has been noted in several regions along the Pacific coast, where it has established itself in natural and disturbed habitats. However, its spread is limited by its specific ecological requirements and local climate conditions."
}
