{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon lycaonicum var. cataonicum",
    "plant_slug": "acantholimon-lycaonicum-var-cataonicum",
    "plant_name_scientific": "acantholimon lycaonicum var. cataonicum",
    "intro": "Acantholimon lycaonicum var. cataonicum, commonly known as the Cataonic saltbush, is a perennial shrub native to the arid regions of Turkey. It belongs to the family Amaranthaceae and is characterized by its succulent, fleshy leaves that help it retain moisture in harsh environments. The plant produces small, clustered flowers that are typically greenish or pale yellow, blooming in the spring. It thrives in saline and alkaline soils, making it well adapted to coastal and desert areas. This variety is valued for its resilience and is often used in ecological restoration projects in arid landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon lycaonicum var. cataonicum is primarily native to the eastern Mediterranean region, specifically Turkey and Cyprus. This plant is commonly found in rocky and calcareous soils in coastal and inland areas. It thrives in arid and semi-arid environments, often growing on cliffs, slopes, and rocky outcrops. The species is adapted to withstand drought and high temperatures, making it a characteristic element of the local flora. Its distribution is limited to specific habitats within its native range, reflecting its ecological specialization.",
    "distribution_introduced_art_desc": "Acantholimon lycaonicum var. cataonicum was mainly introduced to areas with well-drained sandy or gravelly soils, typically in arid or semi-arid environments. It thrives in regions with low precipitation and high sunlight exposure, making it suitable for xerophytic habitats. This plant is commonly found in coastal dunes, sandy plains, and disturbed sites where it can establish quickly. Its introduction has been noted in parts of the Mediterranean and western Europe, where it has adapted to local climate conditions. However, its spread is limited by its preference for specific soil types and environmental conditions."
}
