{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon caryophyllaceum var. brachystachium",
    "plant_slug": "acantholimon-caryophyllaceum-var-brachystachium",
    "plant_name_scientific": "acantholimon caryophyllaceum var. brachystachium",
    "intro": "Acantholimon caryophyllaceum var. brachystachium, commonly known as the short-stalked flaxvetch, is a flowering plant belonging to the Caryophyllaceae family. It is characterized by its erect, hairy stems and small, clustered flowers that bloom in shades of pink to purple. The plant typically grows in rocky or sandy soils and is adapted to arid or semi-arid environments. It has narrow, linear leaves and produces small, capsule-like fruits. This variety is often found in mountainous regions and is valued for its ornamental appeal and ecological role in stabilizing soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon caryophyllaceum var. brachystachium is primarily native to the western United States, particularly in California and Nevada. It thrives in arid and semi-arid environments, often found in rocky soils and open habitats. This plant is commonly associated with coastal and inland desert regions, where it adapts to harsh climatic conditions. It is well-suited to areas with low rainfall and high solar exposure. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acantholimon caryophyllaceum var. brachystachium was mainly introduced to stabilize soil and prevent erosion in disturbed areas. It is commonly found in rocky and sandy soils, particularly in coastal and inland regions. This plant is valued for its ability to thrive in harsh environmental conditions. It has been used in restoration projects due to its hardy nature and low maintenance requirements. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
