{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax wardii",
    "plant_slug": "acanthopanax-wardii",
    "plant_name_scientific": "acanthopanax wardii",
    "intro": "Acanthopanax wardii, commonly known as the Ward's angel's trumpet, is a climbing shrub native to the mountainous regions of Southeast Asia. It belongs to the Araliaceae family and is characterized by its compound leaves and showy, trumpet-shaped flowers. The plant produces small, berry-like fruits that are typically orange or red in color. It thrives in humid, shaded environments and is often found in tropical and subtropical forests. Due to its ornamental value, it is sometimes cultivated in gardens, though it can be invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax wardii is primarily native to the mountainous regions of Southeast Asia, including countries such as China, Vietnam, and Laos. It is commonly found in tropical and subtropical forests at elevations ranging from 500 to 2,000 meters. This plant thrives in humid climates with well-drained soil and partial to full sunlight. It is often associated with secondary growth areas and disturbed habitats. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthopanax wardii was mainly introduced to regions with temperate climates and well-drained soils, particularly in East Asia. It thrives in forested areas and is often found in mountainous regions. The plant is known for its adaptability to various environmental conditions. It has been introduced to several countries as an ornamental species due to its attractive foliage. However, its invasive potential remains a topic of concern in some areas."
}
