{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon rhodopolium",
    "plant_slug": "acantholimon-rhodopolium",
    "plant_name_scientific": "acantholimon rhodopolium",
    "intro": "Acantholimon rhodopolium, commonly known as the red-flowered flax, is a perennial plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its slender, upright stems and clusters of small, pink to red flowers. The plant has narrow, linear leaves that are often covered in fine hairs, and it thrives in well-drained soils. It is often found in rocky or sandy habitats and is valued for its ornamental appeal. Acantholimon rhodopolium is also known for its ability to tolerate drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon rhodopolium"
    },
    "taxonomy_art_desc": "Acantholimon rhodopolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and roses. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often exhibit adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon rhodopolium, a specific plant within the genus Acantholimon, known for its unique floral characteristics and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon rhodopolium is primarily native to Iran. It is found in the arid and semi-arid regions of the country, particularly in the central and eastern parts. This plant thrives in rocky and gravelly soils, often in mountainous areas. It is adapted to the harsh climate conditions of its native habitat. Its distribution is limited to specific ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon rhodopolium was mainly introduced to areas with well-drained sandy or gravelly soils, often in coastal or inland dune environments. It thrives in full sun and is typically found in regions with a Mediterranean climate characterized by dry summers and wet winters. This plant is commonly established along roadsides, disturbed sites, and in open habitats where it can spread rapidly. Its introduction has been documented in several regions of California, particularly in the central and southern coastal areas. Due to its hardy nature and ability to colonize new areas, it has become a common sight in these environments."
}
