{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax delavayi",
    "plant_slug": "acanthopanax-delavayi",
    "plant_name_scientific": "acanthopanax delavayi",
    "intro": "Acanthopanax delavayi, commonly known as the Yunnan five-leaf ginseng, is a climbing shrub native to the mountainous regions of southwestern China. It is characterized by its compound leaves, which typically consist of five to seven leaflets, and its distinctive yellowish flowers that appear in clusters. The plant produces small, red berries that are a source of food for various wildlife species. It is valued in traditional medicine for its purported health benefits, including its use as an adaptogen. Due to habitat loss and overharvesting, Acanthopanax delavayi is considered an endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax delavayi is primarily native to the mountainous regions of southwestern China, particularly in Yunnan and Sichuan provinces. It thrives in temperate to subtropical climates at elevations ranging from 1,500 to 3,500 meters. This plant is commonly found in forested areas, often growing on rocky slopes or in mixed evergreen and deciduous forests. It is also present in neighboring regions of northern Vietnam and northern Myanmar. Due to its habitat preferences, it is typically associated with humid and cool environments.",
    "distribution_introduced_art_desc": "Acanthopanax delavayi was mainly introduced to regions with temperate climates, particularly in East Asia, where it has been cultivated for its medicinal properties. It is commonly found in areas such as China, where it thrives in mountainous and forested environments. The plant is valued for its roots, which are used in traditional Chinese medicine to treat various ailments. Its distribution has been expanded through both natural spread and human cultivation efforts. However, it is not widely introduced outside its native range due to specific climatic and ecological requirements."
}
