{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus chiapensis",
    "plant_slug": "acanthocereus-chiapensis",
    "plant_name_scientific": "acanthocereus chiapensis",
    "intro": "Acanthocereus chiapensis, commonly known as the Chiapas night bloomer, is a species of cactus native to Mexico. It is characterized by its cylindrical stems and spiny areoles, typical of the Cactaceae family. The plant produces large, fragrant white flowers that open at night, attracting nocturnal pollinators such as bats and moths. It thrives in arid and semi-arid environments, requiring minimal water and well-draining soil. Due to its unique blooming habit and ornamental value, it is cultivated in botanical gardens and by cactus enthusiasts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus chiapensis"
    },
    "taxonomy_art_desc": "Acanthocereus chiapensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and root system. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and beets, often characterized by their showy flowers and specialized adaptations. Its family is Cactaceae, commonly known as the cactus family, which consists of succulent plants adapted to arid environments. Its genus is Acanthocereus, a group of cacti native to Mexico and Central America, typically featuring spiny stems and flowers. Its species is Acanthocereus chiapensis, a specific type of cactus found in Chiapas, Mexico, known for its distinctive spines and flowering characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Honduras",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus chiapensis is primarily native to Guatemala, Honduras, and the southeastern regions of Mexico. This cactus species is found in the tropical and subtropical climates of these countries. It typically grows in dry, rocky, or sandy soils in open habitats. The plant is well adapted to the arid and semi-arid environments of its native range. It is often seen in coastal areas and lowland regions where it thrives in full sun.",
    "distribution_introduced_art_desc": "Acanthocereus chiapensis was mainly introduced to the United States, particularly in regions with suitable arid or semi-arid climates. It has been established in several states, including Texas, Arizona, and California, where it thrives in hot, dry environments. The plant is often found in disturbed areas such as roadsides, abandoned fields, and along fence lines. Its introduction has raised concerns due to its potential to become invasive in native ecosystems. Despite its ornamental value, it requires careful management to prevent spread into natural habitats."
}
