{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon mishaudaghense",
    "plant_slug": "acantholimon-mishaudaghense",
    "plant_name_scientific": "acantholimon mishaudaghense",
    "intro": "Acantholimon mishaudaghense, commonly known as the Mishudagh flaxflower, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Plumbaginaceae and is characterized by its succulent, often hairy leaves and small, blue or purple flowers. The plant typically grows in rocky or sandy soils and is adapted to withstand drought conditions. It is a perennial species that produces seeds in compact, spike-like inflorescences. Due to its limited distribution and habitat specificity, it is considered a rare and potentially endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon mishaudaghense"
    },
    "taxonomy_art_desc": "Acantholimon mishaudaghense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to photosynthesize. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their unique flower structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes many species with distinctive blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants known for their succulent leaves and showy flowers, typically found in arid or rocky environments. Its species is Acantholimon mishaudaghense, a specific type of plant native to certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon mishaudaghense is primarily native to Iran. It is found in the arid and semi-arid regions of the country, particularly in the central and eastern parts. This plant thrives in rocky and sandy soils, often in mountainous areas. It is adapted to the harsh climate conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in Iran.",
    "distribution_introduced_art_desc": "Acantholimon mishaudaghense was mainly introduced to areas with rocky or gravelly soils in arid and semi-arid regions. It is commonly found in mountainous and coastal environments where it can thrive in poor soil conditions. This plant is adapted to withstand drought and high salinity, making it a resilient species. Its distribution is limited to specific regions in Central Asia, particularly in Kazakhstan and Uzbekistan. It plays a role in stabilizing soil and providing habitat for local wildlife."
}
