{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon taschkurganicum var. escaposum",
    "plant_slug": "acantholimon-taschkurganicum-var-escaposum",
    "plant_name_scientific": "acantholimon taschkurganicum var. escaposum",
    "intro": "Acantholimon taschkurganicum var. escaposum, commonly known as the alpine spurgeflower, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many species with showy, often colorful flowers. The plant is characterized by its upright growth habit, with flowering stems that are typically unbranched and bear clusters of small, pink or white flowers. It thrives in rocky, well-drained soils and is adapted to cold, alpine environments. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon taschkurganicum"
    },
    "taxonomy_art_desc": "Acantholimon taschkurganicum var. escaposum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and a wide range of growth forms. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in dry habitats, known for their medicinal properties and often containing secondary compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon taschkurganicum, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon taschkurganicum var. escaposum is primarily native to Uzbekistan. This plant is found in the arid and semi-arid regions of the country. It typically grows in rocky or sandy soils along the edges of deserts and in mountainous areas. The species is adapted to the harsh climatic conditions of Central Asia. Its limited distribution reflects its specific ecological requirements and habitat preferences.",
    "distribution_introduced_art_desc": "Acantholimon taschkurganicum var. escaposum was mainly introduced to areas with well-drained soils and moderate to high elevations, typically found in mountainous or semi-arid regions. It thrives in environments with full sun exposure and requires minimal water once established. This plant is commonly found in rocky or gravelly habitats, often growing along slopes or in open grasslands. Its introduction has been primarily associated with ecological restoration projects and ornamental horticulture. Due to its hardy nature, it has shown potential for stabilizing soil in degraded landscapes."
}
