{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium mantinianum",
    "plant_slug": "acanthophippium-mantinianum",
    "plant_name_scientific": "acanthophippium mantinianum",
    "intro": "Acanthophippium mantinianum, commonly known as the Mantianian spurge, is a rare and endemic plant species found exclusively in the island of Mantineia in Greece. It is a member of the Euphorbiaceae family, characterized by its milky sap and unique floral structures. The plant typically grows in rocky and limestone soils, thriving in the Mediterranean climate with its specific microhabitat requirements. Its small, yellowish flowers are clustered in cup-like structures called cyathia, a feature typical of the genus. Due to its limited distribution and habitat specificity, it is considered a vulnerable species, highlighting the importance of conservation efforts in preserving its natural environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium mantinianum"
    },
    "taxonomy_art_desc": "Acanthophippium mantinianum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex vascular system and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises a group of ferns and their allies, including horsetails, and is known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Asparagales, a large group of flowering plants that includes grasses, lilies, and orchids, and is notable for its wide range of growth forms and habitats. Its family is Orchidaceae, commonly known as the orchid family, which is one of the largest families of flowering plants, characterized by their complex and often showy flowers. Its genus is Acanthophippium, a group of flowering plants within the Orchidaceae family, typically distinguished by specific morphological features such as the structure of their flowers and leaves. Its species is Acanthophippium mantinianum, a specific type of orchid found in a particular geographic region, known for its unique characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Philippines"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium mantinianum is primarily native to the Philippines. It is found in specific regions of the country, particularly in the tropical and subtropical areas. This plant thrives in humid environments, often growing in forested areas or near water sources. Its distribution is limited to certain islands where the climate and soil conditions are suitable. Due to its restricted range, it is considered a rare and endemic species in the Philippines.",
    "distribution_introduced_art_desc": "Acanthophippium mantinianum was mainly introduced to areas with rocky and limestone substrates, typically in dry and semi-arid environments. It thrives in regions with well-drained soils and moderate to high sunlight exposure. This plant is commonly found in Mediterranean climates, particularly in southern Europe and parts of North Africa. Its introduction has been primarily through natural dispersal or human-assisted propagation in similar ecological niches. It plays a role in stabilizing soil and providing habitat for small invertebrates in its native range."
}
