{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus tetragonus",
    "plant_slug": "acanthocereus-tetragonus",
    "plant_name_scientific": "acanthocereus tetragonus",
    "intro": "Acanthocereus tetragonus, commonly known as the four-angled cactus, is a species native to Mexico and parts of the southwestern United States. It is a columnar cactus characterized by its ridged, four-sided stems and spines that are typically yellow or reddish in color. The plant produces small, white flowers that bloom at night, attracting nocturnal pollinators such as bats and moths. It is adapted to arid environments and requires minimal water, making it a hardy choice for xeriscaping. The plant's structure and appearance make it a distinctive and visually striking addition to desert gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus tetragonus"
    },
    "taxonomy_art_desc": "Acanthocereus tetragonus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, which consists of flowering plants often with specialized storage tissues and a wide range of habitats. Its family is Cactaceae, known as the cactus family, characterized by succulent stems and spines adapted to arid environments. Its genus is Acanthocereus, a group of cacti typically found in desert regions, with distinctive spines and nocturnal blooming flowers. Its species is Acanthocereus tetragonus, a specific type of cactus known for its compact growth, spiny stems, and showy flowers that bloom at night.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Aruba",
        "Belize",
        "Colombia",
        "Costa Rica",
        "Cuba",
        "El Salvador",
        "Florida",
        "Guatemala",
        "Honduras",
        "Leeward Is.",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Netherlands Antilles",
        "Nicaragua",
        "Panamá",
        "Southwest Caribbean",
        "Texas",
        "Trinidad-Tobago",
        "Venezuela",
        "Venezuelan Antilles",
        "Windward Is."
    ],
    "distribution_introduced": [
        "New Caledonia",
        "Queensland"
    ],
    "distribution_native_art_desc": "Acanthocereus tetragonus is primarily native to Aruba, Belize, Colombia, Costa Rica, Cuba, El Salvador, Florida, Guatemala, Honduras, Leeward Is., Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, Netherlands Antilles, Nicaragua, Panamá, Southwest Caribbean, Texas, Trinidad-Tobago, Venezuela, Venezuelan Antilles, and Windward Is. This species is commonly found in arid and semi-arid regions across these areas. It thrives in coastal and desert environments, often growing on rocky soils. The plant is well adapted to the warm, tropical climates of its native range. Its distribution includes both mainland countries and various island territories in the Caribbean and along the Gulf of Mexico.",
    "distribution_introduced_art_desc": "Acanthocereus tetragonus was mainly introduced to New Caledonia and Queensland. It is a cactus species native to South America, specifically Argentina. The introduction of this plant to these regions is likely due to horticultural interest or ornamental use. It has since become established in these areas, though its ecological impact remains under study. The plant's distribution in these locations highlights the role of human activity in introducing non-native species."
}
