{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium thionanthum subsp. ferrarii",
    "plant_slug": "acanthocalycium-thionanthum-subsp-ferrarii",
    "plant_name_scientific": "acanthocalycium thionanthum subsp. ferrarii",
    "intro": "Acanthocalycium thionanthum subsp. ferrarii, commonly known as the Ferrari's hedgehog cactus, is a compact, spiny cactus native to Mexico. It features a globular to cylindrical stem covered in dense, white to pale blue spines. The plant produces small, yellow flowers during the spring and summer months. It thrives in well-drained soil and requires minimal water, making it suitable for arid environments. Due to its unique appearance and hardy nature, it is a popular choice for cactus enthusiasts and xeriscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocalycium",
        "species": "Acanthocalycium thionanthum"
    },
    "taxonomy_art_desc": "Acanthocalycium thionanthum subsp. ferrarii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient evolutionary lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species such as roses and magnolias, characterized by their diverse floral structures and reproductive systems. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and beets, known for their often showy flowers and specialized adaptations to various environments. Its family is Cactaceae, commonly known as the cactus family, which consists of succulent plants adapted to arid environments with spiny stems and modified leaves. Its genus is Acanthocalycium, a group of cacti native to South America, characterized by their cylindrical stems and flowers that are typically yellow or orange. Its species is Acanthocalycium thionanthum, a specific type within the genus known for its unique floral characteristics and its subspecies ferrarii, which may exhibit slight morphological differences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium thionanthum subsp. ferrarii is primarily native to Argentina Northwest. This subspecies is found in the arid and semi-arid regions of northern Argentina. It typically grows in rocky soils and is adapted to the harsh climate of the area. The plant is part of the Cactaceae family and is known for its compact growth habit. It is a rare and endemic species within its native range.",
    "distribution_introduced_art_desc": "Acanthocalycium thionanthum subsp. ferrarii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions with low rainfall and high temperatures, such as parts of the southwestern United States and northern Mexico. This subspecies is often cultivated as a cactus for its ornamental value due to its unique spiny stems and vibrant flowers. It is adapted to survive in harsh environments with minimal water availability. Its introduction has been primarily through horticultural trade and intentional planting by enthusiasts."
}
