{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon laxiusculum",
    "plant_slug": "acantholimon-laxiusculum",
    "plant_name_scientific": "acantholimon laxiusculum",
    "intro": "Acantholimon laxiusculum, commonly known as the slender flaxvetch, is a low-growing perennial plant native to the western United States. It belongs to the legume family, Fabaceae, and is characterized by its finely divided, fern-like leaves. The plant produces small, pea-like flowers that range in color from white to pale purple, typically blooming in early spring. It thrives in dry, rocky soils and is often found in sagebrush steppe and grassland habitats. Acantholimon laxiusculum plays a role in stabilizing soil and providing habitat for small insects and wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon laxiusculum is primarily native to the western United States, particularly in California and Oregon. It thrives in coastal and inland areas with sandy or gravelly soils. This plant is commonly found in dunes, coastal bluffs, and open grasslands. It is well adapted to dry, sunny conditions and can tolerate salt spray. Acantholimon laxiusculum is an important part of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acantholimon laxiusculum was mainly introduced to areas with well-drained sandy or gravelly soils, often in coastal or inland dunes. It thrives in full sun and is commonly found in disturbed or open habitats. This plant is typically associated with maritime climates but can also adapt to semi-arid environments. It is often seen growing in coastal scrub and sand dune ecosystems. Its distribution is limited to specific regions where these environmental conditions are met."
}
