{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon quinquelobum var. quinquelobum",
    "plant_slug": "acantholimon-quinquelobum-var-quinquelobum",
    "plant_name_scientific": "acantholimon quinquelobum var. quinquelobum",
    "intro": "Acantholimon quinquelobum var. quinquelobum, commonly known as the five-lobed sandwort, is a perennial flowering plant native to the western United States. It is characterized by its low-growing, mat-forming habit and gray-green foliage with a woolly texture. The plant produces small, white to pale blue flowers in clusters during the spring and summer months. It thrives in well-drained, sandy or gravelly soils and is often found in arid or semi-arid environments. Its botanical features make it well adapted to harsh, dry conditions typical of its natural habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon quinquelobum"
    },
    "taxonomy_art_desc": "Acantholimon quinquelobum var. quinquelobum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle with distinct gametophytic and sporophytic stages. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many shrubs and herbs. Its genus is Acantholimon, a genus of flowering plants that typically have succulent leaves and are often found in arid or rocky habitats. Its species is Acantholimon quinquelobum, a specific plant within the genus known for its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon quinquelobum var. quinquelobum is primarily native to Iran. This plant is found in the arid and semi-arid regions of the country. It typically grows in rocky soils and is adapted to the harsh climatic conditions of the region. The species is part of the Plumbagaceae family and is known for its resilience. Its native distribution is limited to specific areas within Iran, reflecting its ecological preferences.",
    "distribution_introduced_art_desc": "Acantholimon quinquelobum var. quinquelobum was mainly introduced to areas with well-drained sandy or gravelly soils, often in coastal or inland dunes. It prefers full sun exposure and is adapted to arid or semi-arid environments. This plant is commonly found in regions with low annual precipitation and is often used in xeriscaping due to its drought tolerance. It has been introduced to several parts of the United States, particularly in the western states. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
