{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ponticus",
    "plant_slug": "acanthus-ponticus",
    "plant_name_scientific": "acanthus ponticus",
    "intro": "Acanthus ponticus, commonly known as the Turkish acanthus, is a species of flowering plant in the family Acanthaceae. It is native to the eastern Mediterranean region, including parts of Turkey, Greece, and the Balkans. The plant is characterized by its striking, palmate leaves with prominent veins and clusters of showy, violet-blue flowers. It thrives in moist, well-drained soils and is often found near water bodies such as rivers and lakes. Acanthus ponticus is valued in horticulture for its ornamental appeal and is sometimes cultivated in gardens for its aesthetic and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bulgaria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ponticus is primarily native to Bulgaria. It is commonly found in the region's coastal areas and along the Black Sea shorelines. This plant thrives in sandy or gravelly soils and is often associated with dune ecosystems. It is also occasionally seen in rocky habitats near the sea. Its distribution is limited to specific geographic areas within Bulgaria due to its particular environmental requirements.",
    "distribution_introduced_art_desc": "Acanthus ponticus was mainly introduced to the Mediterranean region and parts of southern Europe. It has been widely cultivated for its ornamental value due to its striking foliage and flowers. The plant is often found in gardens and along coastal areas where it thrives in well-drained soils. It has also been naturalized in some areas, leading to its spread beyond cultivated sites. Its introduction has contributed to both horticultural diversity and ecological changes in local environments."
}
