{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon macranthum",
    "plant_slug": "acantholimon-macranthum",
    "plant_name_scientific": "acantholimon macranthum",
    "intro": "Acantholimon macranthum, commonly known as the tall stonecress, is a perennial herbaceous plant native to the mountainous regions of Central Asia. It belongs to the family Montiaceae and is characterized by its upright growth habit and dense clusters of small, white or pink flowers. The plant typically grows in rocky or gravelly soils and is adapted to arid or semi-arid environments. Its leaves are usually linear and covered in a fine layer of silky hairs, which help reduce water loss. Acantholimon macranthum is often found in alpine and subalpine habitats, where it thrives in full sun and well-drained conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon macranthum"
    },
    "taxonomy_art_desc": "Acantholimon macranthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse reproductive structures. Its order is Caryophyllales, a group of flowering plants that includes plants with specialized adaptations to arid environments, such as succulence and salt tolerance. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes flowering plants with distinctive flowers and often contains toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon macranthum, a specific plant within the genus known for its robust growth and adaptation to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon macranthum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central parts. This plant thrives in rocky and arid environments, often growing at higher elevations. It is adapted to the harsh climate and limited soil conditions of its native habitat. Due to its specific ecological requirements, it is not commonly found outside of Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon macranthum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed sites such as roadsides, fields, and gravelly slopes. This plant has adapted well to dry climates and can thrive in low-nutrient soils. Its introduction has been noted in several regions of the western United States. However, it is considered a non-native species and may compete with native vegetation in certain habitats."
}
