{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon creticum",
    "plant_slug": "acantholimon-creticum",
    "plant_name_scientific": "acantholimon creticum",
    "intro": "Acantholimon creticum, commonly known as Cretan thornweed, is a flowering plant native to the Mediterranean region, particularly found in Greece and Turkey. It is a perennial herb that typically grows in rocky or limestone soils, thriving in arid and semi-arid environments. The plant features slender, upright stems with small, spiny leaves that help reduce water loss. Its flowers are usually blue or violet, arranged in dense clusters, and bloom in the spring. Acantholimon creticum is valued for its ornamental appeal and is sometimes cultivated in gardens with well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon creticum is primarily native to the island of Crete, specifically in the Mediterranean region of Greece. It is commonly found in rocky and limestone habitats, often in coastal areas and dry, sunny slopes. This plant thrives in arid and semi-arid environments, adapting well to the harsh climatic conditions of the Mediterranean. It is part of the Caryophyllaceae family and is known for its distinctive pink or purple flowers. Due to its limited distribution, it is considered a rare and endemic species within its native range.",
    "distribution_introduced_art_desc": "Acantholimon creticum was mainly introduced to areas with well-drained soils and full sun exposure, typically found in rocky or gravelly habitats. It is commonly found in Mediterranean climates, where it thrives in dry, warm conditions. This plant is often cultivated in gardens for its ornamental value and drought tolerance. It has been introduced to several regions outside its native range, including parts of California and the Pacific Northwest. However, its spread is limited due to its specific environmental requirements."
}
