{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus rosei",
    "plant_slug": "acanthocereus-rosei",
    "plant_name_scientific": "acanthocereus rosei",
    "intro": "Acanthocereus rosei, commonly known as the night blooming cactus, is a species of cactus native to the southwestern United States and northern Mexico. It is characterized by its spiny, cylindrical stems and is adapted to arid environments. The plant produces large, fragrant, white flowers that open at night, attracting nocturnal pollinators like bats and moths. Its foliage is reduced to spines, and it stores water in its thick, fleshy stems. This plant is often cultivated for its ornamental value and unique blooming behavior.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus rosei"
    },
    "taxonomy_art_desc": "Acanthocereus rosei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often includes species adapted to arid environments. Its family is Cactaceae, commonly known as cacti, which are predominantly found in arid regions and are characterized by their succulent stems and spines. Its genus is Acanthocereus, a group of cacti native to the Americas, typically featuring spiny stems and flowers. Its species is Acanthocereus rosei, a specific type of cactus known for its unique appearance and adaptation to desert environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus rosei is primarily native to Mexico Northwest and Mexico Southwest. This species is found in the arid and semi-arid regions of these areas. It thrives in desert environments with low rainfall and high sunlight exposure. The plant is well adapted to the harsh conditions of its native habitat. It is commonly found in rocky soils and along rocky outcrops in these regions.",
    "distribution_introduced_art_desc": "Acanthocereus rosei was mainly introduced to the southern United States, particularly in Texas and Arizona, as an ornamental plant due to its striking appearance and cold hardiness. It is often cultivated in arid and semi-arid regions because of its ability to thrive in well-drained soils and minimal water requirements. The plant has been reported in several states, including California and Nevada, where it has occasionally become naturalized in disturbed areas. Its introduction has raised concerns among ecologists due to its potential to spread in native ecosystems. Despite its ornamental value, Acanthocereus rosei is considered a potential invasive species in some regions."
}
