{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum ejtehadii",
    "plant_slug": "acanthophyllum-ejtehadii",
    "plant_name_scientific": "acanthophyllum ejtehadii",
    "intro": "Acanthophyllum ejtehadii, commonly known as the Persian sandmat, is a flowering plant native to arid regions of Iran. It belongs to the Amaranthaceae family and is characterized by its low-growing, shrub-like structure with fleshy, spine-tipped leaves. The plant produces small, greenish-yellow flowers that bloom in clusters during the spring. It is well adapted to harsh, dry environments, with deep roots that help it survive in sandy soils. Acanthophyllum ejtehadii plays a role in stabilizing dunes and is of interest for its potential ecological and medicinal uses.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum ejtehadii"
    },
    "taxonomy_art_desc": "Acanthophyllum ejtehadii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their unique morphology and ancient evolutionary lineage. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes a variety of flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum ejtehadii, a specific plant within this genus, native to certain arid regions and adapted to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum ejtehadii is primarily native to Iran. This plant is found in the arid and semi-arid regions of the country. It thrives in sandy and gravelly soils, often in areas with low precipitation. It is commonly found in the central and eastern parts of Iran, including regions like Kerman and Yazd. The plant is well adapted to the harsh environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acanthophyllum ejtehadii was mainly introduced to the arid and semi-arid regions of Iran, particularly in the central and eastern parts of the country. It thrives in sandy and gravelly soils, often found in desert and steppe environments. This plant is well adapted to high temperatures and low precipitation, making it a resilient species in harsh climatic conditions. Its distribution is limited to specific ecological niches where it can establish and persist over time. The introduction of this species to these areas is likely due to its ability to colonize disturbed and barren landscapes."
}
