{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale malasica",
    "plant_slug": "acanthopale-malasica",
    "plant_name_scientific": "acanthopale malasica",
    "intro": "Acanthopale malasica, commonly known as the Malacca acanthopale, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the family Rubiaceae, which includes over 13,000 species of flowering plants. The plant is characterized by its small, clustered flowers that are typically white or pink in color. Its leaves are usually elliptical or ovate, with a smooth or slightly hairy surface. Acanthopale malasica is often found in moist, shaded environments such as forest understories.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale malasica is primarily native to the island of Sumba in Indonesia. It is found in the tropical rainforests of this region, where it thrives in humid and warm conditions. The plant is commonly associated with secondary growth areas and disturbed sites within its native habitat. It plays a role in the local ecosystem by providing food and shelter for various insects and small animals. Due to its restricted distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthopale malasica was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activities such as land clearing and agriculture. It thrives in tropical and subtropical regions, particularly in Southeast Asia, where it has become naturalized in several countries. The plant is commonly found along roadsides, in degraded forests, and in areas with frequent human disturbance. Its introduction has led to its spread in regions with similar climatic conditions to its native range. Due to its adaptability, it is considered a potential invasive species in some areas where it outcompetes native flora."
}
