{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon butkovii",
    "plant_slug": "acantholimon-butkovii",
    "plant_name_scientific": "acantholimon butkovii",
    "intro": "Acantholimon butkovii, commonly known as the Butkov's thornscale, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy leaves and spikes of small, blue to purple flowers. The plant typically grows in rocky or gravelly soils and is adapted to arid and semi-arid environments. It is a perennial species that thrives in high-altitude areas with cool temperatures and moderate precipitation. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered plant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon butkovii"
    },
    "taxonomy_art_desc": "Acantholimon butkovii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes species with specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their medicinal and ornamental uses. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon butkovii, a specific plant within the genus Acantholimon, native to certain regions of the Middle East and known for its unique morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon butkovii is primarily native to Uzbekistan. This plant is found in the arid and semi-arid regions of the country. It typically grows in sandy or rocky soils, often in steppe and desert environments. It is adapted to the harsh climatic conditions of Central Asia. Due to its limited distribution, it is considered a rare and endemic species in Uzbekistan.",
    "distribution_introduced_art_desc": "Acantholimon butkovii was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in rocky or gravelly habitats, often growing in open landscapes such as slopes and disturbed soils. This plant is adapted to survive in environments with low rainfall and high temperatures. It is often used in xeriscaping due to its drought tolerance and ornamental value. However, it may become invasive in certain regions if not managed properly."
}
