{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholepis orientalis",
    "plant_slug": "acantholepis-orientalis",
    "plant_name_scientific": "acantholepis orientalis",
    "intro": "Acantholepis orientalis, commonly known as the oriental acantholepis, is a flowering plant belonging to the family Acanthaceae. It is native to regions of Asia, particularly in countries such as India and China. The plant is characterized by its upright growth habit and clusters of small, tubular flowers that are typically pink or purple in color. Its leaves are opposite and lance-shaped, often with a slight pubescence. Acantholepis orientalis is valued in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholepis orientalis is primarily native to the Arabian Peninsula, specifically found in countries such as Saudi Arabia, Yemen, and Oman. It thrives in arid and semi-arid environments, often growing in rocky or sandy soils. This plant is commonly found in coastal areas and inland deserts, adapting well to the harsh climatic conditions of the region. It plays a role in stabilizing soil and providing habitat for local fauna. Due to its limited distribution, it is considered a regionally significant species in its native range.",
    "distribution_introduced_art_desc": "Acantholepis orientalis was mainly introduced to the Pacific Northwest region of the United States. It was initially brought in for its ornamental value due to its unique foliage and adaptability to various soil types. The plant has since spread beyond its original introduction sites, establishing itself in both urban and natural areas. Its introduction has raised concerns due to its potential to outcompete native species in invaded habitats. Despite its aesthetic appeal, management efforts are ongoing to control its spread and minimize ecological impacts."
}
