{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus thalassinus",
    "plant_slug": "acanthocereus-thalassinus",
    "plant_name_scientific": "acanthocereus thalassinus",
    "intro": "Acanthocereus thalassinus, commonly known as the night blooming cactus, is a species of cactus native to Mexico. It is characterized by its columnar stem and spiny foliage, which help it retain water in arid environments. The plant produces large, fragrant white flowers that open at night, attracting nocturnal pollinators such as moths. Its flowering period typically occurs during the warmer months, and it is adapted to thrive in full sun. The plant is often cultivated for its ornamental value and unique blooming habit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus thalassinus is primarily native to the southern United States, Mexico, and parts of Central America. It is commonly found in arid and semi-arid regions, particularly in states like Texas, New Mexico, and Arizona. This cactus thrives in rocky soils and is often seen in desert environments. It is also present in countries such as Guatemala, Belize, and Honduras. The plant is well adapted to hot, dry climates and is a common sight in the Sonoran and Chihuahuan Deserts.",
    "distribution_introduced_art_desc": "Acanthocereus thalassinus was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of the southwestern United States, northern Mexico, and parts of the Caribbean. This plant is often cultivated for its ornamental value due to its striking, spiny stems and vibrant flowers. It has been introduced to several regions outside its native range, sometimes as an ornamental or for erosion control. However, in some areas, it has become invasive, outcompeting native vegetation."
}
