{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus paradoxus",
    "plant_slug": "acanthocereus-paradoxus",
    "plant_name_scientific": "acanthocereus paradoxus",
    "intro": "Acanthocereus paradoxus, commonly known as the night blooming cactus, is a member of the Cactaceae family and is native to the arid regions of South America. It is a small, columnar cactus with a ribbed stem and spines that provide protection against herbivores. The plant is notable for its striking, fragrant flowers that open at night, attracting nocturnal pollinators such as bats and moths. Its adaptations to extreme desert conditions include a thick, water-storing stem and reduced leaves. Acanthocereus paradoxus is often cultivated for its ornamental value and unique blooming behavior.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus paradoxus"
    },
    "taxonomy_art_desc": "Acanthocereus paradoxus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants with a distinctive life cycle involving both a sporophyte and a gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and beets, known for their diverse morphologies and ecological adaptations. Its family is Cactaceae, commonly known as the cactus family, which consists of plants adapted to arid environments with succulent stems and spines. Its genus is Acanthocereus, a group of cacti native to the Americas, characterized by their cylindrical stems and often nocturnal blooming flowers. Its species is Acanthocereus paradoxus, a specific type of cactus known for its unique growth form and flowering habits, typically found in arid regions of the southwestern United States and northern Mexico.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus paradoxus is primarily native to Mexico Southwest. This cactus species is found in the arid and semi-arid regions of northern Mexico, particularly in the states of Chihuahua, Coahuila, and Durango. It thrives in rocky soils and is often found in desert scrublands and limestone hills. The plant is well adapted to the harsh climate with its spiny stems and ability to store water. It is a valuable species for both ecological and horticultural purposes in its native range.",
    "distribution_introduced_art_desc": "Acanthocereus paradoxus was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in desert environments, particularly in areas with well-drained soils. This plant is often cultivated for its ornamental value due to its distinctive appearance and ability to thrive in arid conditions. It has been introduced to various regions as a drought-tolerant ornamental species. However, its spread outside its native range is limited due to its specific climate requirements."
}
