{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum afghanicum",
    "plant_slug": "acanthophyllum-afghanicum",
    "plant_name_scientific": "acanthophyllum afghanicum",
    "intro": "Acanthophyllum afghanicum, commonly known as Afghan spiny holly, is a flowering plant belonging to the Amaranthaceae family. It is a shrub characterized by its spiny stems and small, scale-like leaves adapted to arid environments. Native to Central Asia, particularly Afghanistan and Pakistan, it thrives in sandy or rocky soils. The plant produces small, inconspicuous flowers that are typically green or red, and it is often used in traditional medicine. Due to its resilience, it plays a role in stabilizing desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum afghanicum"
    },
    "taxonomy_art_desc": "Acanthophyllum afghanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive vascular structures and often spore-producing reproductive systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flowers and often contains species adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum afghanicum, a specific type of plant native to Afghanistan, known for its adaptations to harsh, dry environments and its role in local ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum afghanicum is primarily native to Afghanistan. It is commonly found in the arid and semi-arid regions of the country, particularly in the southern and eastern parts. This plant thrives in sandy and rocky soils, often growing in steppes and deserts. It is well adapted to the harsh climate and low precipitation typical of its native habitat. Due to its resilience, it plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthophyllum afghanicum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Afghanistan and surrounding areas. It is adapted to harsh environmental conditions, including high temperatures and low precipitation. This plant thrives in sandy or gravelly soils and is often found in desert ecosystems. It plays a role in stabilizing dunes and preventing soil erosion. Its introduction has been documented in ecological studies focusing on drought-resistant flora."
}
