{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum aculeatum",
    "plant_slug": "acanthophyllum-aculeatum",
    "plant_name_scientific": "acanthophyllum aculeatum",
    "intro": "Acanthophyllum aculeatum, commonly known as the spiny saxifrage, is a low-growing perennial plant native to arid and semi-arid regions of the Middle East and Central Asia. It is characterized by its dense, cushion-like growth form and is typically found in rocky or sandy soils. The plant produces small, pink or white flowers during the summer months, which are clustered in dense inflorescences. Its leaves are usually short and covered in fine hairs, and the stems are often spiny, providing protection against herbivores. Acanthophyllum aculeatum is well adapted to harsh environmental conditions, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum aculeatum"
    },
    "taxonomy_art_desc": "Acanthophyllum aculeatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex life cycles and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their floral morphology. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive floral structures and often adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many ornamental and medicinal plants with showy flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum aculeatum, a specific plant within this genus known for its thorny foliage and adaptation to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum aculeatum is primarily native to Uzbekistan. It is commonly found in the arid and semi-arid regions of the country. This plant thrives in sandy and gravelly soils, often in desert and steppe environments. It plays an important role in stabilizing dunes and preventing soil erosion. Its distribution is closely linked to the unique climatic conditions of Uzbekistan's central and southern regions.",
    "distribution_introduced_art_desc": "Acanthophyllum aculeatum was mainly introduced to the Great Basin region of North America. It is commonly found in sandy and gravelly soils, often in arid and semi-arid environments. This plant has become a significant component of the local vegetation due to its adaptability and resilience. It plays an important role in stabilizing dunes and preventing soil erosion. However, its spread has also raised concerns about its impact on native plant species and ecosystem balance."
}
