{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum stenostegium",
    "plant_slug": "acanthophyllum-stenostegium",
    "plant_name_scientific": "acanthophyllum stenostegium",
    "intro": "Acanthophyllum stenostegium, commonly known as the sand spurge, is a flowering plant native to arid and semi-arid regions of Central Asia. It is a low-growing shrub characterized by its dense, spiny foliage and small, yellowish flowers. The plant has adapted to harsh environments through its succulent stems and reduced leaves, which help minimize water loss. It plays a role in stabilizing sandy soils and providing habitat for small desert animals. Acanthophyllum stenostegium is often found in dunes and other dry, wind-swept habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum stenostegium"
    },
    "taxonomy_art_desc": "Acanthophyllum stenostegium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often show adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and is often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically characterized by their succulent leaves and spiny structures, often found in arid environments. Its species is Acanthophyllum stenostegium, a specific plant within the genus Acanthophyllum, known for its adaptations to harsh environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Tadzhikistan",
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum stenostegium is primarily native to Afghanistan, Tajikistan, and Turkmenistan. This plant is typically found in arid and semi-arid regions within these countries. It thrives in sandy or gravelly soils and is often associated with steppe and desert ecosystems. The species is well adapted to the harsh climatic conditions of its native range. It plays a role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthophyllum stenostegium was mainly introduced to arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in sandy and gravelly soils, often in areas with low precipitation and high temperatures. This plant is adapted to harsh environmental conditions and plays a role in stabilizing dunes and preventing soil erosion. It is also used in traditional medicine and as a source of fodder for livestock. Its distribution has expanded due to human activities and climate change, making it an important species in the region's ecosystems."
}
