{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium spiniflorum f. peitscherianum",
    "plant_slug": "acanthocalycium-spiniflorum-f-peitscherianum",
    "plant_name_scientific": "acanthocalycium spiniflorum f. peitscherianum",
    "intro": "Acanthocalycium spiniflorum f. peitscherianum, commonly known as the Peitscher's spiny-flowered cactus, is a unique cactus species native to the arid regions of northern Mexico. It belongs to the Cactaceae family and is characterized by its short, cylindrical stems that are often covered in spines. The plant produces small, pale yellow flowers during the warmer months, which are typically borne on the areoles. It is a compact, slow-growing species that requires well-draining soil and minimal water to thrive. This rare hybrid is prized by cactus enthusiasts for its distinctive appearance and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium spiniflorum f. peitscherianum is primarily native to northern Mexico, specifically the states of Chihuahua and Coahuila. This cactus is adapted to arid and semi-arid environments, thriving in rocky and sandy soils. It is commonly found in desert scrub and rocky plains where it receives minimal rainfall. The plant is known for its spiny stems and small, clustered flowers that bloom in the spring. Due to its limited range, it is considered a rare and locally endemic species within its habitat.",
    "distribution_introduced_art_desc": "Acanthocalycium spiniflorum f. peitscherianum was mainly introduced to the United States as a cultivated ornamental plant. It is primarily found in regions with arid or semi-arid climates, such as California and Arizona. This cactus is valued for its unique, spiny stems and vibrant flowers. It has been introduced to various botanical gardens and private collections across the country. However, it is not considered invasive and is generally cultivated in controlled environments."
}
