{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium oreopepon",
    "plant_slug": "acanthocalycium-oreopepon",
    "plant_name_scientific": "acanthocalycium oreopepon",
    "intro": "Acanthocalycium oreopepon, commonly known as the Oaxaca nightshade, is a species of cactus native to Mexico. It is characterized by its short, cylindrical stems that are often covered in spines. The plant produces small, bell-shaped flowers that are typically white or pale purple, blooming at night. It thrives in arid and semi-arid environments, preferring well-drained soil. Due to its limited distribution and habitat specificity, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium oreopepon is primarily native to the arid regions of northern Mexico, specifically the state of Sonora. It is found in rocky and sandy soils within desert environments. This species thrives in areas with low rainfall and high sunlight exposure. It is commonly associated with limestone formations and can be found in elevations ranging from 500 to 1,500 meters. Due to its limited habitat, it is considered a rare and endemic cactus species.",
    "distribution_introduced_art_desc": "Acanthocalycium oreopepon was mainly introduced to the United States, particularly in the southwestern regions such as Texas and California. It was introduced as an ornamental plant due to its unique and attractive appearance. However, it has since become invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact. Proper management and monitoring are essential to control its spread and mitigate its effects on local ecosystems."
}
