{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum pulchrum",
    "plant_slug": "acanthophyllum-pulchrum",
    "plant_name_scientific": "acanthophyllum pulchrum",
    "intro": "Acanthophyllum pulchrum, commonly known as the beautiful acanthophyllum, is a flowering plant belonging to the Amaranthaceae family. It is native to arid and semi-arid regions of central Asia, including parts of Mongolia and China. The plant is characterized by its succulent, spiny stems and small, clustered flowers that typically bloom in shades of pink or red. It thrives in harsh environments, showcasing adaptations such as reduced leaf surface area to minimize water loss. Due to its unique appearance and ecological significance, it is often of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum pulchrum"
    },
    "taxonomy_art_desc": "Acanthophyllum pulchrum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often produces alkaloids. Its family is Caryophyllaceae, commonly known as the carnation family, which includes plants with simple leaves and showy flowers. Its genus is Acanthophyllum, a group of flowering plants typically characterized by their succulent leaves and small, clustered flowers. Its species is Acanthophyllum pulchrum, a specific type of plant within this genus known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum pulchrum is primarily native to Afghanistan and Tajikistan. It is typically found in arid and semi-arid regions within these countries. This plant is well adapted to the harsh environmental conditions of its native habitat. It often grows in sandy or rocky soils, thriving in areas with low precipitation. Its distribution is closely associated with specific ecological zones in the mountainous and desert regions of Central Asia.",
    "distribution_introduced_art_desc": "Acanthophyllum pulchrum was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions of the southwestern United States and northern Mexico. This plant is often used for erosion control due to its hardy nature and ability to establish quickly. Its introduction has been associated with both natural dispersal and human activities such as landscaping and restoration projects. However, it can sometimes become invasive in non-native environments if not managed properly."
}
