{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus repandus",
    "plant_slug": "acanthus-repandus",
    "plant_name_scientific": "acanthus repandus",
    "intro": "Acanthus repandus, commonly known as the broadleaf acanthus, is a perennial herbaceous plant native to southern Europe and parts of North Africa. It belongs to the Acanthaceae family and is characterized by its large, palmate leaves that are deeply lobed and often covered in fine hairs. The plant produces showy spikes of violet or purple flowers during the summer months. It thrives in well-drained soils and full sun, making it a popular choice for ornamental gardening. Acanthus repandus is also valued for its historical use in decorative art and architecture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus repandus is primarily native to southern Europe, North Africa, and the Middle East. It is commonly found in regions such as Spain, Portugal, Morocco, and parts of southern France. This plant thrives in rocky soils and coastal areas, often growing in Mediterranean climates. It is a hardy perennial that prefers full sun and well-drained soil. Its native range includes areas with a temperate to subtropical climate, where it can flourish in both natural and cultivated environments.",
    "distribution_introduced_art_desc": "Acanthus repandus was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and flowering habit. It was first recorded in the 19th century and has since become naturalized in various regions across the country. The plant thrives in moist, shady environments and is commonly found in forest margins and along stream banks. Its spread has raised concerns due to its potential to outcompete native species in certain ecosystems. Despite its beauty, it is considered a potential weed in some areas of New Zealand."
}
