{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophaca leiosemia",
    "plant_slug": "acanthophaca-leiosemia",
    "plant_name_scientific": "acanthophaca leiosemia",
    "intro": "Acanthophaca leiosemia, commonly known as the smooth-surfaced acanthophaca, is a species of flowering plant native to South Africa. It belongs to the family Asteraceae, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows in open, sunny habitats such as grasslands and rocky outcrops. Its leaves are usually narrow and slightly hairy, while its flowers are small and clustered in dense, spherical heads. Acanthophaca leiosemia is valued for its ornamental appeal and its ability to thrive in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophaca leiosemia is primarily native to the coastal regions of southern Africa, particularly South Africa. It is commonly found in the Western and Eastern Cape provinces. This plant thrives in sandy or gravelly soils along the shoreline. It is often associated with dune ecosystems and can be seen growing in maritime climates. Its distribution is limited to specific areas where the environmental conditions match its ecological requirements.",
    "distribution_introduced_art_desc": "Acanthophaca leiosemia was mainly introduced to new environments through human activities such as trade and accidental transport. It has established populations in regions with similar climatic conditions to its native habitat. The plant's distribution is primarily found in areas with moderate temperatures and well-drained soils. It has shown adaptability to various soil types, contributing to its spread in introduced regions. However, its ecological impact remains under study due to limited data on its interactions with local flora and fauna."
}
