{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus mollis",
    "plant_slug": "acanthus-mollis",
    "plant_name_scientific": "acanthus mollis",
    "intro": "Acanthus mollis, commonly known as the woolly acanthus, is a flowering plant native to the Mediterranean region. It is characterized by its dense, soft, and fuzzy foliage, which gives it its common name. The plant produces showy, spiny, and often fragrant flowers that bloom in late spring to early summer. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardens. Acanthus mollis is also valued for its historical use in classical decorative motifs, particularly in ancient Greek and Roman art.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus mollis"
    },
    "taxonomy_art_desc": "Acanthus mollis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some modern seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Lamiales, a group of flowering plants that includes plants like lavender, olive, and snapdragons. Its family is Acanthaceae, commonly known as the spurred gentians, which includes a variety of ornamental and medicinal plants. Its genus is Acanthus, a group of flowering plants known for their ornate leaves and showy bracts, often used in horticulture. Its species is Acanthus mollis, a specific type of Acanthus known for its soft, fuzzy leaves and spires of violet flowers, commonly cultivated in gardens.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Algeria",
        "East Aegean Is.",
        "Greece",
        "Italy",
        "Lebanon-Syria",
        "Morocco",
        "NW. Balkan Pen.",
        "Sardegna",
        "Sicilia",
        "Tunisia",
        "Türkey",
        "Türkey-in-Europe"
    ],
    "distribution_introduced": [
        "Azores",
        "Baleares",
        "California",
        "Canary Is.",
        "Corse",
        "France",
        "Germany",
        "Great Britain",
        "Ireland",
        "Kriti",
        "Madeira",
        "Mexico Central",
        "New South Wales",
        "New Zealand North",
        "New Zealand South",
        "Portugal",
        "South Australia",
        "Spain",
        "Tasmania",
        "Victoria"
    ],
    "distribution_native_art_desc": "Acanthus mollis is primarily native to Algeria, East Aegean Is., Greece, Italy, Lebanon-Syria, Morocco, NW. Balkan Pen., Sardegna, Sicilia, Tunisia, Türkey, and Türkey-in-Europe. It is commonly found in coastal regions and rocky areas across these Mediterranean countries. The plant thrives in warm, sunny climates with well-drained soils. It is often associated with limestone substrates and is a characteristic species of Mediterranean maquis and coastal scrub habitats. Acanthus mollis is an important ornamental plant in horticulture due to its striking foliage and floral display.",
    "distribution_introduced_art_desc": "Acanthus mollis was mainly introduced to Azores, Baleares, California, Canary Is., Corse, France, Germany, Great Britain, Ireland, Kriti, Madeira, Mexico Central, New South Wales, New Zealand North, New Zealand South, Portugal, South Australia, Spain, Tasmania, and Victoria. It has been widely cultivated for its ornamental value, particularly its striking foliage and spires of soft pink flowers. The plant is commonly found in gardens and along coastal areas in these regions. It thrives in well-drained soils and full sun, making it suitable for a variety of climates. Its introduction has led to its naturalization in some of these areas, where it occasionally escapes cultivation."
}
