{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax ternatus",
    "plant_slug": "acanthopanax-ternatus",
    "plant_name_scientific": "acanthopanax ternatus",
    "intro": "Acanthopanax ternatus, commonly known as the Korean angel's trumpet, is a deciduous shrub native to East Asia. It is characterized by its compound leaves with three leaflets, which are typically serrated and have a dark green upper surface. The plant produces small, yellowish-green flowers that are clustered in umbels, followed by bright red berries that are a notable feature. It thrives in temperate climates and is often found in forested areas. Due to its ornamental value and medicinal uses, it is cultivated in gardens and traditional herbal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax ternatus is primarily native to East Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas within these countries. This plant thrives in temperate climates and is often associated with humid environments. It is particularly prevalent in the northeastern parts of China, such as the provinces of Heilongjiang, Jilin, and Liaoning. Due to its unique ecological preferences, it is less commonly found in lower altitude or more arid regions.",
    "distribution_introduced_art_desc": "Acanthopanax ternatus was mainly introduced to regions with temperate climates, particularly in East Asia, where it has become naturalized in parts of China, Korea, and Japan. It thrives in moist, well-drained soils and is often found in forest understories or along stream banks. The plant is valued for its medicinal properties, including its use in traditional herbal remedies for pain relief and immune support. However, its spread has raised concerns due to its potential to become invasive in certain ecosystems. Despite its benefits, careful management is required to prevent it from outcompeting native plant species."
}
