{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax higoensis",
    "plant_slug": "acanthopanax-higoensis",
    "plant_name_scientific": "acanthopanax higoensis",
    "intro": "Acanthopanax higoensis, commonly known as the Japanese angel's trumpet, is a flowering plant native to Japan. It belongs to the Araliaceae family and is characterized by its compound leaves and showy, fragrant flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its flowers are usually white or pale yellow, and it produces small, fleshy berries that are edible when ripe. Acanthopanax higoensis is valued for its ornamental qualities and is often cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax higoensis is primarily native to Southeast Asia, specifically regions such as Japan, Korea, and parts of China. It is commonly found in temperate forested areas, often growing in shaded undergrowth. The plant prefers moist, well-drained soils and is typically associated with mountainous or hilly terrain. It is a climbing shrub that can reach significant heights, often using other vegetation for support. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthopanax higoensis was mainly introduced to areas with warm climates and well-drained soils, often as an ornamental plant due to its unique appearance. It thrives in regions with moderate to high sunlight exposure and is commonly found in gardens and landscaped areas. The plant is known for its attractive, palmate leaves and clusters of small, white flowers that appear in the spring. It has been introduced to several countries in the Pacific Rim, including Japan, South Korea, and parts of Southeast Asia. However, its spread is limited due to its specific environmental requirements and lack of widespread cultivation."
}
