{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthoxanthium spinosum subsp. catharticum",
    "plant_slug": "acanthoxanthium-spinosum-subsp-catharticum",
    "plant_name_scientific": "acanthoxanthium spinosum subsp. catharticum",
    "intro": "Acanthoxanthium spinosum subsp. catharticum, commonly known as the spiny acanthoxanthium, is a perennial herbaceous plant native to certain regions of Europe. It is characterized by its spiny stems and small, yellowish flowers that bloom in late spring. The leaves are typically lance-shaped and covered in fine hairs, contributing to its distinctive appearance. This subspecies is often found in dry, sandy soils and thrives in open, sunny habitats. It plays a minor role in local ecosystems, primarily as a food source for specific insect species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthoxanthium spinosum subsp. catharticum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky, and coastal environments, often found in scrublands and maquis vegetation. This subspecies is well adapted to arid and semi-arid climates, making it a characteristic plant of Mediterranean ecosystems. It is commonly encountered in countries such as Spain, Italy, Morocco, and Turkey. Its distribution is closely associated with limestone soils and open habitats where it can receive ample sunlight.",
    "distribution_introduced_art_desc": "Acanthoxanthium spinosum subsp. catharticum was mainly introduced to New Zealand. It was brought there intentionally for its medicinal properties. The plant is known for its ability to treat skin conditions and digestive issues. However, it has since become invasive, outcompeting native vegetation in certain areas. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
