{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum latifolium",
    "plant_slug": "acanthophyllum-latifolium",
    "plant_name_scientific": "acanthophyllum latifolium",
    "intro": "Acanthophyllum latifolium, commonly known as the broadleaf acanthophyllum, is a shrub native to arid and semi-arid regions of Central Asia. It is characterized by its dense, spiny foliage and small, grayish-green leaves that help reduce water loss in harsh environments. The plant produces yellow flowers during the summer months, which are clustered in cylindrical inflorescences. It is well adapted to sandy soils and can thrive in regions with low precipitation. Its structure and growth habits make it an important component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum latifolium is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. It thrives in sandy and gravelly soils, often found in desert steppes and dunes. This plant is well adapted to harsh environmental conditions, such as extreme temperatures and limited water availability. It plays an important ecological role in stabilizing sand dunes and providing habitat for various desert organisms. Its distribution is closely linked to specific microhabitats that support its growth and survival.",
    "distribution_introduced_art_desc": "Acanthophyllum latifolium was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in restoration projects due to its ability to thrive in harsh environmental conditions. This plant has been introduced to various parts of the United States, particularly in the western states. It is valued for its drought tolerance and low maintenance requirements. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
