{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax hypoleucus",
    "plant_slug": "acanthopanax-hypoleucus",
    "plant_name_scientific": "acanthopanax hypoleucus",
    "intro": "Acanthopanax hypoleucus, commonly known as the Siberian angel's trumpets, is a deciduous shrub native to the Far East. It is characterized by its compound leaves and clusters of small, white flowers that bloom in summer. The plant produces small, red berries that are edible but often have a bitter taste. It thrives in temperate climates and is often found in forested areas. Its botanical features make it an interesting subject for both horticultural and ecological studies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax hypoleucus is primarily native to eastern Asia, including regions such as China, Korea, and Japan. It is commonly found in mountainous areas and forests, thriving in temperate climates. This plant is often associated with rocky and well-drained soils, preferring partial shade to full sun. It is an important component of the local flora in these regions. Its distribution is closely linked to the specific ecological conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acanthopanax hypoleucus was mainly introduced to regions with temperate climates and well-drained soils, where it can thrive in both full sun and partial shade. It is commonly found in disturbed areas such as roadsides, clearings, and abandoned fields. This plant has been reported in several countries, including China, Russia, and parts of Europe, often as an invasive species. Its rapid growth and ability to spread through both seeds and rhizomes contribute to its success in new environments. However, its introduction has raised concerns due to its potential to outcompete native vegetation."
}
