{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon blandum",
    "plant_slug": "acantholimon-blandum",
    "plant_name_scientific": "acantholimon blandum",
    "intro": "Acantholimon blandum, commonly known as the bluntleaf flaxflower, is a flowering plant native to the western United States. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit. The plant features narrow, gray-green leaves and produces spikes of blue to purple flowers in late spring to early summer. It thrives in rocky, well-drained soils and is often found in sagebrush steppe ecosystems. Acantholimon blandum is adapted to arid conditions and is considered a valuable plant for stabilizing soil in disturbed areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon blandum"
    },
    "taxonomy_art_desc": "Acantholimon blandum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants with a wide variety of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar families such as the magnolias and laurels. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with distinctive blue or purple flowers and often contains medicinal or ornamental species. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, characterized by their spiny leaves and showy flowers. Its species is Acantholimon blandum, a specific plant within the genus Acantholimon, known for its distinctive appearance and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon blandum is primarily native to Iran and Turkmenistan. It is commonly found in arid and semi-arid regions within these countries. This plant typically grows in rocky or sandy soils, often in mountainous or desert environments. It is well adapted to the harsh climatic conditions of its native range. Due to its limited distribution, it is considered a rare and localized species in both Iran and Turkmenistan.",
    "distribution_introduced_art_desc": "Acantholimon blandum was mainly introduced to areas with well-drained soils and moderate climates, often found in coastal regions and sandy habitats. It is typically spread through seed dispersal by wind, water, or human activity. This plant has become established in several regions outside its native range, including parts of the western United States. Its introduction has led to concerns about its potential impact on local ecosystems. Despite its adaptability, it is not considered a major invasive species in most areas."
}
