{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus arboreus var. pubescens",
    "plant_slug": "acanthus-arboreus-var-pubescens",
    "plant_name_scientific": "acanthus arboreus var. pubescens",
    "intro": "Acanthus arboreus var. pubescens, commonly known as the hairy acanthus, is a striking perennial plant native to southern Europe and western Asia. It features large, palmate leaves with a velvety texture and a distinctive, foamy appearance on the underside. The plant produces showy, spires of purple or pink flowers in late summer, which are borne on tall, branched inflorescences. It thrives in full sun to partial shade and requires well-drained soil, making it suitable for rock gardens or borders. Its ornamental value has made it a popular choice in horticulture, though it can be somewhat invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus arboreus var. pubescens is primarily native to southern Europe, including countries such as Spain, Portugal, and southern France. It is also found in parts of North Africa, particularly in regions like Morocco and Algeria. This plant thrives in coastal areas and sandy soils, often growing along the Mediterranean coast. It is commonly found in rocky or limestone habitats, where it can withstand saline and dry conditions. Its native range includes regions with a Mediterranean climate characterized by hot, dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Acanthus arboreus var. pubescens was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and architectural form. It is commonly cultivated in gardens and public spaces for its aesthetic value and ability to thrive in well-drained soils. This variety is particularly valued for its silver-green leaves and tall, spiky flower heads that add visual interest throughout the growing season. It has been introduced to various regions beyond its native habitat, including parts of Europe and the United States. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
