{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon birandii",
    "plant_slug": "acantholimon-birandii",
    "plant_name_scientific": "acantholimon birandii",
    "intro": "Acantholimon birandii, commonly known as the Persian sandthorn, is a flowering plant native to the arid regions of Central Asia. It belongs to the Caryophyllaceae family and is characterized by its succulent, fleshy leaves adapted to water conservation. The plant produces small, yellowish flowers that bloom in late spring or early summer. It thrives in sandy or gravelly soils and is often found in coastal dunes or semi-desert environments. Due to its hardy nature, it is sometimes cultivated as an ornamental plant in dry climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon birandii"
    },
    "taxonomy_art_desc": "Acantholimon birandii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex cellular structures and ability to photosynthesize. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes many desert and succulent species, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often contains compounds with medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon birandii, a specific plant within the genus Acantholimon, known for its unique morphological features and habitat preferences in rocky or sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon birandii is primarily native to Turkey. It is found in specific regions within the country, particularly in the eastern and southeastern areas. This plant typically grows in rocky and arid environments, often in mountainous regions. It is adapted to the harsh climate and limited soil conditions of its native habitat. Due to its restricted distribution, it is considered a rare and endemic species in Turkey.",
    "distribution_introduced_art_desc": "Acantholimon birandii was mainly introduced to the western United States, particularly in California and Oregon. It thrives in dry, rocky habitats and is commonly found in coastal and inland areas with well-drained soils. This species is often associated with disturbed sites such as roadsides and gravelly slopes. Its introduction has led to its establishment in native plant communities, sometimes outcompeting local flora. Despite its invasive potential, it is also valued for its ornamental qualities and erosion control abilities."
}
