{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocladus tehuelchum",
    "plant_slug": "acanthocladus-tehuelchum",
    "plant_name_scientific": "acanthocladus tehuelchum",
    "intro": "Acanthocladus tehuelchum, commonly known as the Tehuelchum thornplant, is a shrub native to the southern Andes of South America. It is characterized by its woody stems and small, clustered leaves that are typically covered in fine hairs. The plant produces yellowish-green flowers that are clustered in dense inflorescences, which bloom in early spring. Its leaves are often glandular and emit a mild aromatic scent. Acanthocladus tehuelchum is adapted to grow in rocky and arid environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocladus tehuelchum is primarily native to the southern Andes of South America, specifically in regions of Chile and Argentina. It is found in the temperate rainforests and mountainous areas of these countries. This plant thrives in humid, cool climates with well-drained soils. It is commonly associated with forest understory habitats. Its native range is limited to these specific geographic areas, making it a regionally restricted species.",
    "distribution_introduced_art_desc": "Acanthocladus tehuelchum was mainly introduced to New Zealand as part of the early European colonization efforts. It was brought for its ornamental value and potential ecological benefits. However, it has since become an invasive species, outcompeting native vegetation in certain regions. The plant thrives in moist, temperate climates and is often found along stream banks and in damp forests. Its rapid spread has raised concerns among conservationists due to its impact on local biodiversity."
}
