{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthobotrya linearifolia",
    "plant_slug": "acanthobotrya-linearifolia",
    "plant_name_scientific": "acanthobotrya linearifolia",
    "intro": "Acanthobotrya linearifolia, commonly known as the linear-leaf acanthobotrya, is a flowering plant native to southern Africa. It belongs to the family Acanthaceae and is characterized by its slender, linear leaves and showy, tubular flowers. The plant typically grows in rocky or sandy soils and thrives in full sun. Its flowers are often brightly colored, attracting pollinators such as bees and butterflies. It is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthobotrya linearifolia is primarily native to the coastal regions of southern Africa, particularly South Africa. It is commonly found along the eastern and southern coasts, including the Cape Peninsula and the Eastern Cape. This plant thrives in sandy or rocky soils near the shoreline, often in areas with high salt exposure. It is well adapted to the harsh coastal climate and is an important component of the local flora. Its distribution is limited to these specific coastal habitats, making it a rare and specialized species.",
    "distribution_introduced_art_desc": "Acanthobotrya linearifolia was mainly introduced to control invasive plant species in coastal areas. It is commonly used as a biological control agent against plants like *Mimosa pigra* and *Prosopis juliflora*. The plant thrives in saline and alkaline soils, making it suitable for coastal and estuarine environments. It is native to South Africa but has been introduced to several regions including the United States and Australia. Its rapid growth and ability to tolerate harsh conditions contribute to its effectiveness as a control species."
}
