{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon asphodelinum",
    "plant_slug": "acantholimon-asphodelinum",
    "plant_name_scientific": "acantholimon asphodelinum",
    "intro": "Acantholimon asphodelinum, commonly known as the desert flax, is a flowering plant native to the arid regions of the southwestern United States and northern Mexico. It is a member of the Plumbagaceae family and is characterized by its erect, sparsely branched stems and narrow, linear leaves. The plant produces small, yellowish to greenish flowers in late spring to early summer, which are clustered in dense inflorescences. It is well adapted to harsh, dry environments, with a deep root system and reduced leaf surface to minimize water loss. Acantholimon asphodelinum is often found in rocky soils and is considered a valuable plant for xeriscaping due to its low water requirements and ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon asphodelinum"
    },
    "taxonomy_art_desc": "Acantholimon asphodelinum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes species such as carnations and beets, often with distinctive flower structures and some containing secondary compounds. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with small, often blue or purple flowers and some with medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, characterized by their spiny leaves and showy flowers. Its species is Acantholimon asphodelinum, a specific plant within the genus known for its adaptations to harsh environments and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon asphodelinum is primarily native to Iran. This plant is found in specific regions within Iran, particularly in the central and eastern parts of the country. It thrives in arid and semi-arid environments, often growing in rocky or sandy soils. The species is adapted to the harsh climatic conditions of its native habitat. It is a member of the Plumbagaceae family and is known for its distinctive floral structure.",
    "distribution_introduced_art_desc": "Acantholimon asphodelinum was mainly introduced to areas with well-drained sandy or gravelly soils, typically in coastal or inland regions with a Mediterranean climate. It thrives in full sun and is often found in disturbed sites such as roadsides, dunes, and agricultural fields. This plant is adapted to dry conditions and can tolerate salt spray, making it common in coastal environments. It is considered an invasive species in some regions due to its rapid spread and competitive growth. Its distribution is largely restricted to the western United States, particularly in California and Oregon."
}
