{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus hirsutus subsp. syriacus",
    "plant_slug": "acanthus-hirsutus-subsp-syriacus",
    "plant_name_scientific": "acanthus hirsutus subsp. syriacus",
    "intro": "Acanthus hirsutus subsp. syriacus, commonly known as the Syrian acanthus, is a perennial herbaceous plant native to the Mediterranean region. It features large, palmate leaves with a distinctive, wavy margin and a silvery underside. The plant produces showy, spiny bracts that enclose small, greenish-yellow flowers. It is often cultivated for its ornamental value in gardens and is adapted to well-drained soils. This subspecies is closely related to other acanthus species but is distinguished by its unique leaf structure and geographic distribution.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus hirsutus"
    },
    "taxonomy_art_desc": "Acanthus hirsutus subsp. syriacus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures such as stomata. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their unique reproductive structures and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Lamiales, which comprises flowering plants with typically showy flowers and includes well-known families such as the mint family and the figwort family. Its family is Acanthaceae, a group of flowering plants known for their showy flowers and often hairy leaves, with many species used in ornamental gardening. Its genus is Acanthus, a group of flowering plants known for their distinctive spiny leaves and showy bracteate inflorescences, commonly used in horticulture. Its species is Acanthus hirsutus, a specific variety within the genus Acanthus, characterized by its hairy appearance and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lebanon-Syria",
        "Palestine",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus hirsutus subsp. syriacus is primarily native to Lebanon-Syria, Palestine, and Turkey. This species is commonly found in rocky and coastal areas across these regions. It thrives in well-drained soils and is often associated with Mediterranean climates. The plant is known for its ornate foliage and is sometimes cultivated for ornamental purposes. Its native range reflects its adaptation to the arid and semi-arid environments of the Levant.",
    "distribution_introduced_art_desc": "Acanthus hirsutus subsp. syriacus was mainly introduced to regions with Mediterranean climates, where it thrives in well-drained soils and full sun. It is commonly found in gardens and horticultural collections due to its ornamental value. This subspecies is known for its distinctive, palmate leaves and spiny, lavender-colored flowers. It has been cultivated in parts of Europe and North America as a decorative plant. However, it is considered invasive in some areas, where it can outcompete native vegetation."
}
