{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax divaricatus",
    "plant_slug": "acanthopanax-divaricatus",
    "plant_name_scientific": "acanthopanax divaricatus",
    "intro": "Acanthopanax divaricatus, commonly known as the Chinese goat's beard, is a climbing shrub native to East Asia. It is characterized by its compound leaves with serrated margins and small, yellowish flowers that appear in clusters. The plant produces red berries that are edible and often used in traditional medicine. It thrives in moist, shaded environments and is often found in forest understories. Its distinctive appearance and medicinal properties make it a notable species in botanical studies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax divaricatus is primarily native to East Asia, including regions such as China, Korea, and Japan. It thrives in temperate climates and is commonly found in mountainous areas with well-drained soils. This plant is often associated with forested environments and can be seen growing in both deciduous and evergreen forests. It is particularly prevalent in the northeastern parts of China, including provinces like Heilongjiang, Jilin, and Liaoning. Due to its hardy nature, it is also occasionally found in parts of Russia and Southeast Asia.",
    "distribution_introduced_art_desc": "Acanthopanax divaricatus was mainly introduced to regions with temperate climates and well-drained soils, often as an ornamental plant due to its attractive foliage and unique appearance. It has been reported in parts of North America, particularly in the eastern United States, where it has established itself in disturbed habitats and forest edges. The plant's rapid growth and adaptability have contributed to its spread, making it a potential invasive species in some areas. It prefers partial to full sunlight and can tolerate a range of soil types, which further aids its establishment. However, its ecological impact remains under study, as it may compete with native plant species in invaded areas."
}
