{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis carduifolia var. longearistata",
    "plant_slug": "acanthopsis-carduifolia-var-longearistata",
    "plant_name_scientific": "acanthopsis carduifolia var. longearistata",
    "intro": "Acanthopsis carduifolia var. longearistata, commonly known as the long-spined hedgehog cactus, is a species of flowering plant native to the arid regions of South America. It belongs to the Cactaceae family and is characterized by its spiny, cylindrical stems that store water. The plant produces small, yellow flowers during the warmer months, which attract pollinators such as bees and moths. Its leaves are modified into spines, reducing water loss and providing protection from herbivores. This variety is well adapted to harsh desert environments, making it a resilient and visually striking plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis carduifolia var. longearistata is primarily native to the Canary Islands, specifically Tenerife and La Gomera. This variety is adapted to the unique volcanic soils and mild, Mediterranean climate of these islands. It typically grows in coastal scrublands and rocky areas where it can receive ample sunlight. The plant is part of the Asteraceae family and is known for its distinctive, spiny leaves and small yellow flowers. Due to its limited distribution, it is considered a rare and endemic species within the Canary Islands.",
    "distribution_introduced_art_desc": "Acanthopsis carduifolia var. longearistata was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and degraded grasslands. It thrives in regions with moderate to high sunlight exposure and well-drained soils. This plant is often found in Mediterranean-type climates with mild, wet winters and warm, dry summers. Its introduction has been associated with human activities, including agriculture and land development. Due to its adaptability, it has become an invasive species in some regions, outcompeting native flora."
}
