{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza collinsii",
    "plant_slug": "acanthorhiza-collinsii",
    "plant_name_scientific": "acanthorhiza collinsii",
    "intro": "Acanthorhiza collinsii, commonly known as the Collins' thornweed, is a flowering plant native to the southeastern United States. It is a herbaceous perennial that typically grows in moist, sandy soils along stream banks and forest edges. The plant features slender, branching stems covered with small, sharp spines, which are a distinctive botanical characteristic. Its flowers are small and white, arranged in clusters, and bloom in the spring. The species is part of the Rubiaceae family, known for its diverse and often aromatic plants.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza collinsii is primarily native to the southeastern United States, specifically found in parts of Georgia, South Carolina, and Florida. It is commonly associated with wetland habitats such as swamps, marshes, and along the edges of ponds. This species thrives in areas with consistently moist soil and is often found in the understory of hardwood forests. It is a rare and endangered plant, with a limited geographic range. Due to its restricted habitat, it is highly sensitive to environmental changes and habitat destruction.",
    "distribution_introduced_art_desc": "Acanthorhiza collinsii was mainly introduced to disturbed soils and open habitats such as roadsides, fields, and forest edges. It thrives in areas with full sun to partial shade and well-drained soil. This plant is often found in regions with a temperate climate and is known for its ability to colonize new areas quickly. Its introduction has been documented in several states across the eastern United States. Due to its invasive tendencies, it is considered a noxious weed in some areas."
}
