{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum gypsophiloides var. papillatum",
    "plant_slug": "acanthophyllum-gypsophiloides-var-papillatum",
    "plant_name_scientific": "acanthophyllum gypsophiloides var. papillatum",
    "intro": "Acanthophyllum gypsophiloides var. papillatum, commonly known as the Papillate Gypseum, is a succulent shrub native to arid regions of Central Asia. It is characterized by its dense, spiny stems and small, fleshy leaves adapted to store water. The plant produces yellow flowers during the growing season, typically in summer. It thrives in sandy or gravelly soils and is well-suited to harsh, dry environments. Due to its unique morphology and ecological role, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum gypsophiloides var. papillatum is primarily native to arid and semi-arid regions of Central Asia, particularly Kazakhstan and parts of Mongolia. This plant thrives in sandy and gravelly soils, often found in steppe and desert environments. It is well adapted to extreme temperatures and low precipitation, making it a resilient species in harsh climates. The variety is characterized by its dense, spiny foliage and ability to store water efficiently. Its distribution is closely linked to specific ecological zones where it plays a role in stabilizing soil and supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthophyllum gypsophiloides var. papillatum was mainly introduced to areas with sandy or gravelly soils in arid and semi-arid regions. It is commonly found in regions such as the southwestern United States, northern Mexico, and parts of Australia. This plant thrives in environments with low precipitation and high solar exposure. It is often used for erosion control due to its hardy nature and ability to establish quickly. However, its introduction has raised concerns about its potential to become invasive in non-native habitats."
}
