{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon goeksunicum",
    "plant_slug": "acantholimon-goeksunicum",
    "plant_name_scientific": "acantholimon goeksunicum",
    "intro": "Acantholimon goeksunicum, commonly known as the Goeksun stonecrop, is a flowering plant native to Turkey. It belongs to the family Montiaceae and is characterized by its low-growing, succulent-like appearance. The plant features small, fleshy leaves that are often covered in a waxy coating, which helps it retain moisture in arid environments. Its flowers are typically blue or purple, clustered in dense inflorescences, and bloom during the summer months. It is well adapted to rocky and sandy soils, making it a hardy species suitable for xerophytic gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon goeksunicum"
    },
    "taxonomy_art_desc": "Acantholimon goeksunicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissues. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes flowering plants often found in rocky or sandy soils. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny or hairy stems and small flowers. Its species is Acantholimon goeksunicum, a specific plant species native to Turkey, known for its distinctive appearance and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon goeksunicum is primarily native to Turkey. It is found in specific regions of the country, particularly in the eastern and southeastern areas. This plant typically grows in rocky or semi-arid environments. It is adapted to the local climate and soil conditions of its native habitat. Its distribution is limited to certain ecological zones within Turkey.",
    "distribution_introduced_art_desc": "Acantholimon goeksunicum was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive silvery foliage and drought tolerance. It has since spread to other areas with similar climates, including parts of southern Europe and North Africa. The plant is typically found in rocky soils and dry habitats, often growing along slopes and in coastal areas. Its introduction has raised concerns about its potential to become invasive in native ecosystems. Despite its beauty, it requires careful management to prevent it from outcompeting local flora."
}
