{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon modestum",
    "plant_slug": "acantholimon-modestum",
    "plant_name_scientific": "acantholimon modestum",
    "intro": "Acantholimon modestum, commonly known as the modest spinyweed, is a flowering plant native to the arid regions of central Asia, including parts of Kazakhstan and western China. It is a low-growing perennial herb with succulent, spiny stems and small, clustered leaves adapted to conserve water. The plant produces delicate, blue to violet flowers in early summer, which attract pollinators such as bees and butterflies. Its botanical features reflect its ability to thrive in harsh, dry environments, making it a resilient species in its native habitat. Acantholimon modestum is often found in rocky soils and is considered a characteristic plant of steppe and desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon modestum"
    },
    "taxonomy_art_desc": "Acantholimon modestum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their vascular systems and often primitive reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms, often with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes many succulent and salt-tolerant species, often with distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and saline environments, known for their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in rocky or coastal areas, characterized by their succulent leaves and showy flowers. Its species is Acantholimon modestum, a specific plant within the genus Acantholimon, known for its small stature and adaptation to harsh, coastal environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon modestum is primarily native to Iran. It is found in various regions across the country, particularly in areas with dry and semi-arid climates. This plant typically grows in rocky or gravelly soils, often in mountainous or coastal regions. It is well adapted to the local environmental conditions, including high temperatures and limited rainfall. Its distribution is closely tied to the specific ecological niches it occupies within Iran.",
    "distribution_introduced_art_desc": "Acantholimon modestum was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dunes. It thrives in environments with low moisture and full sun exposure. This plant is commonly found in regions with Mediterranean or semi-arid climates. It has been reported in several countries across Europe and North Africa. Its introduction is often associated with human activities such as land development and transportation."
}
