{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum xanthioides var. acutifolium",
    "plant_slug": "acanthospermum-xanthioides-var-acutifolium",
    "plant_name_scientific": "acanthospermum xanthioides var. acutifolium",
    "intro": "Acanthospermum xanthioides var. acutifolium, commonly known as the narrow-leaved goldenweed, is a flowering plant native to arid and semi-arid regions of Africa and the Middle East. It is a member of the Acanthaceae family, characterized by its showy, tubular flowers that are often brightly colored. The plant typically grows as a herbaceous perennial, featuring hairy stems and lance-shaped leaves with serrated edges. Its flowers bloom in clusters, attracting pollinators such as bees and butterflies. It is well adapted to dry conditions, making it a resilient species in harsh environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum xanthioides var. acutifolium is primarily native to the arid and semi-arid regions of northern Australia, including parts of Queensland and the Northern Territory. This plant thrives in sandy soils and is commonly found in coastal dunes and inland shrublands. It is well adapted to high temperatures and low rainfall, making it a resilient species in harsh environments. The variety acutifolium is distinguished by its sharp, pointed leaves, which help reduce water loss. It plays an important ecological role in stabilizing soil and providing habitat for native fauna.",
    "distribution_introduced_art_desc": "Acanthospermum xanthioides var. acutifolium was mainly introduced to the United States as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It is commonly found in the southern and southwestern regions, where it thrives in disturbed soils and open habitats. This plant has also been reported in parts of Florida and Texas, where it has established itself in both natural and urban environments. Its rapid growth and ability to spread through seeds have raised concerns about its potential invasiveness in native ecosystems. Despite its ornamental value, its introduction has led to ecological impacts in some areas."
}
