{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon alatavicum var. korolkovii",
    "plant_slug": "acantholimon-alatavicum-var-korolkovii",
    "plant_name_scientific": "acantholimon alatavicum var. korolkovii",
    "intro": "Acantholimon alatavicum var. korolkovii, commonly known as the Korolkov's stonecress, is a flowering plant native to Central Asia. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming structure with fleshy leaves. The plant produces small, white or pale pink flowers during the summer months. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. Due to its drought tolerance and ornamental value, it is occasionally cultivated in gardens with well-draining soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon alatavicum var. korolkovii is primarily native to the eastern Transcaucasus region, specifically in the areas of Azerbaijan and southern Dagestan. This plant is found in rocky and mountainous terrains, often growing in dry, well-drained soils. It is commonly associated with steppe and semi-desert environments, thriving in the arid and semi-arid climates of its native range. The species is adapted to harsh environmental conditions, including strong sunlight and limited water availability. Its distribution is limited to specific localities within its native range, making it a rare and localized plant.",
    "distribution_introduced_art_desc": "Acantholimon alatavicum var. korolkovii was mainly introduced to areas with well-drained soils and full sun exposure, typically found in arid or semi-arid regions. It thrives in environments with low moisture and moderate temperatures, making it suitable for rocky or sandy soils. This plant is often cultivated in xeriscaped gardens and is valued for its drought tolerance and ornamental appeal. It is also used in erosion control due to its deep root system and ability to stabilize soil. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
