{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum scapiflorum",
    "plant_slug": "acanthophyllum-scapiflorum",
    "plant_name_scientific": "acanthophyllum scapiflorum",
    "intro": "Acanthophyllum scapiflorum, commonly known as the desert holly, is a flowering plant native to arid regions of North America. It is a shrub characterized by its spiny stems and small, scale-like leaves adapted to reduce water loss. The plant produces yellow or green flowers that bloom in early spring, attracting pollinators such as bees and butterflies. Its root system is deep and extensive, allowing it to access groundwater in dry conditions. Acanthophyllum scapiflorum plays an important ecological role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum scapiflorum"
    },
    "taxonomy_art_desc": "Acanthophyllum scapiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive species with a wide variety of floral structures. Its order is Caryophyllales, a group of flowering plants that includes many succulent and shrub species, often found in arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often hairy leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny or thorny structures. Its species is Acanthophyllum scapiflorum, a specific type of plant within this genus, known for its distinctive morphology and adaptation to harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum scapiflorum is primarily native to Afghanistan. It is commonly found in the arid and semi-arid regions of the country. This plant thrives in sandy and rocky soils, often in areas with low precipitation. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is limited to specific ecological niches within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum scapiflorum was mainly introduced to arid and semi-arid regions of the Middle East and Central Asia. It is commonly found in sandy and gravelly soils, often in areas with low precipitation. This plant is well adapted to harsh environmental conditions, making it a resilient species in its introduced range. It plays a role in stabilizing soil and preventing erosion in these ecosystems. However, its introduction has raised concerns about its potential impact on native flora and biodiversity."
}
