{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum australe",
    "plant_slug": "acanthospermum-australe",
    "plant_name_scientific": "acanthospermum australe",
    "intro": "Acanthospermum australe, commonly known as the Australian thornweed, is a flowering plant native to Australia. It is a herbaceous annual or perennial species belonging to the family Asteraceae. The plant features small, yellowish to brownish flowers arranged in composite inflorescences. Its leaves are typically narrow and have a rough texture, while its stems are often hairy. Acanthospermum australe is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acanthospermum",
        "species": "Acanthospermum australe"
    },
    "taxonomy_art_desc": "Acanthospermum australe belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and algae that have a complex life cycle with a distinct sexual phase. Its class is Equisetopsida, which comprises ferns and their allies, characterized by their vascular systems and often spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Asterales, which includes flowering plants known for their composite flower heads and often aromatic properties. Its family is Asteraceae, commonly known as the aster family, which is characterized by its unique flower heads composed of many small flowers. Its genus is Acanthospermum, a group of flowering plants typically found in tropical and subtropical regions, often with spiny or thorny structures. Its species is Acanthospermum australe, a specific plant species native to Australia, known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Colombia",
        "French Guiana",
        "Guyana",
        "Paraguay",
        "Peru",
        "Suriname",
        "Uruguay",
        "Venezuela",
        "Venezuelan Antilles",
        "Windward Is."
    ],
    "distribution_introduced": [
        "Alabama",
        "Angola",
        "Arkansas",
        "Cameroon",
        "Cape Provinces",
        "DR Congo",
        "Eswatini",
        "Florida",
        "Georgia",
        "Germany",
        "Hawaii",
        "India",
        "KwaZulu-Natal",
        "Louisiana",
        "Malaya",
        "Massachusetts",
        "Mississippi",
        "Mozambique",
        "New South Wales",
        "New York",
        "North Carolina",
        "Northern Provinces",
        "Oregon",
        "Pennsylvania",
        "Queensland",
        "South Carolina",
        "Tennessee",
        "Texas",
        "Virginia",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acanthospermum australe is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Brazil North, Brazil Northeast, Brazil South, Brazil Southeast, Brazil West-Central, Colombia, French Guiana, Guyana, Paraguay, Peru, Suriname, Uruguay, Venezuela, Venezuelan Antilles, and Windward Is. This plant is commonly found in tropical and subtropical regions across South America. It thrives in a variety of habitats, including grasslands, disturbed soils, and along roadsides. Its wide distribution suggests a high adaptability to different environmental conditions. It is often recognized for its distinctive appearance and ecological significance in the regions where it is native.",
    "distribution_introduced_art_desc": "Acanthospermum australe was mainly introduced to Alabama, Angola, Arkansas, Cameroon, Cape Provinces, DR Congo, Eswatini, Florida, Georgia, Germany, Hawaii, India, KwaZulu-Natal, Louisiana, Malaya, Massachusetts, Mississippi, Mozambique, New South Wales, New York, North Carolina, Northern Provinces, Oregon, Pennsylvania, Queensland, South Carolina, Tennessee, Texas, Virginia, Zambia, and Zimbabwe. It has established itself in various habitats across these regions, often thriving in disturbed soils and open areas. The plant's introduction is likely due to its adaptability and potential use in horticulture or as an ornamental species. It has become naturalized in many of these locations, sometimes posing a risk to native ecosystems. Its wide distribution highlights its ability to spread across diverse climates and environments."
}
