{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum fontanesii var. glandulosum",
    "plant_slug": "acanthophyllum-fontanesii-var-glandulosum",
    "plant_name_scientific": "acanthophyllum fontanesii var. glandulosum",
    "intro": "Acanthophyllum fontanesii var. glandulosum, commonly known as the glandular acanthophyllum, is a flowering plant native to arid regions of Central Asia. It is a member of the Amaranthaceae family and is characterized by its dense, spiny foliage and small, clustered flowers. The plant typically grows in sandy or gravelly soils and is adapted to withstand extreme drought conditions. Its glandular surfaces help reduce water loss, making it well-suited for harsh, dry environments. It plays a role in stabilizing soil and providing habitat for small desert organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum fontanesii var. glandulosum is primarily native to the arid and semi-arid regions of Central Asia, particularly in countries such as Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in sandy and gravelly soils, often found in desert steppes and dunes. This plant is well adapted to extreme environmental conditions, including high temperatures and low precipitation. It plays a crucial role in stabilizing soil and preventing erosion in these harsh landscapes. Its distribution is closely tied to the specific ecological conditions of the Central Asian deserts.",
    "distribution_introduced_art_desc": "Acanthophyllum fontanesii var. glandulosum was mainly introduced to arid and semi-arid regions of central Asia, particularly in Kazakhstan and southern Russia. It is commonly found in sandy and gravelly soils, often in steppe and desert steppe environments. This plant is adapted to extreme temperatures and low precipitation, making it a resilient species in harsh climates. It plays a role in stabilizing dunes and preventing soil erosion in these areas. Its introduction has been primarily for ecological restoration and land stabilization purposes."
}
