{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus haackeanus",
    "plant_slug": "acanthocereus-haackeanus",
    "plant_name_scientific": "acanthocereus haackeanus",
    "intro": "Acanthocereus haackeanus, commonly known as the night-blooming cactus, is a species of cactus native to Mexico. It is characterized by its spiny stems and is part of the Cactaceae family. The plant produces large, white, fragrant flowers that open at night, attracting nocturnal pollinators like bats and moths. It thrives in arid environments and requires minimal water, making it well adapted to desert conditions. The plant's unique blooming pattern and striking appearance make it a popular choice for collectors and gardeners.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus haackeanus"
    },
    "taxonomy_art_desc": "Acanthocereus haackeanus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by specific floral structures. Its order is Caryophyllales, which includes plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Cactaceae, commonly known as cacti, which are primarily found in arid regions and are characterized by their succulent stems and spines. Its genus is Acanthocereus, a group of cacti native to the Americas, typically featuring a short, thick stem and spines. Its species is Acanthocereus haackeanus, a specific type of cactus known for its unique morphology and adaptation to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus haackeanus is primarily native to the southern United States, particularly Texas, and northern Mexico. It is found in arid and semi-arid regions, often growing in rocky soils and limestone areas. This cactus thrives in environments with full sun exposure and minimal rainfall. It is commonly associated with desert scrub and grassland habitats. The plant is well adapted to withstand extreme temperatures and drought conditions.",
    "distribution_introduced_art_desc": "Acanthocereus haackeanus was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in desert environments, particularly in areas with well-drained soils. This plant is often cultivated for its ornamental value due to its unique appearance and ability to thrive in arid conditions. It has been introduced to several regions outside its native range, including parts of California and Arizona. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
