{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalycium rhodotrichum subsp. rhodotrichum",
    "plant_slug": "acanthocalycium-rhodotrichum-subsp-rhodotrichum",
    "plant_name_scientific": "acanthocalycium rhodotrichum subsp. rhodotrichum",
    "intro": "Acanthocalycium rhodotrichum subsp. rhodotrichum, commonly known as the red-ribbed hedgehog cactus, is a species of cactus native to the arid regions of northern Mexico. It is characterized by its cylindrical stems that are typically green with red or purple ribs, which give it its common name. The plant produces small, yellow flowers during the spring and summer months. It is a slow-growing species that thrives in well-draining soil and full sun. Due to its unique appearance and hardy nature, it is a popular choice among cactus enthusiasts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocalycium",
        "species": "Acanthocalycium rhodotrichum"
    },
    "taxonomy_art_desc": "Acanthocalycium rhodotrichum subsp. rhodotrichum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Caryophyllales, a group of flowering plants that includes succulents, cacti, and other plants with often showy flowers and specialized adaptations to arid environments. Its family is Cactaceae, commonly known as cacti, which are primarily found in arid regions and are characterized by spines, reduced leaves, and the ability to store water. Its genus is Acanthocalycium, a group of cacti native to South America, known for their cylindrical stems and spiny, often colorful flowers. Its species is Acanthocalycium rhodotrichum, a specific type within the genus known for its distinctive appearance and adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Bolivia",
        "Brazil West-Central",
        "Paraguay",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalycium rhodotrichum subsp. rhodotrichum is primarily native to Argentina Northeast, Bolivia, Brazil West-Central, Paraguay, and Uruguay. This cactus species is typically found in arid and semi-arid regions within these areas. It thrives in rocky soils and open habitats, often in areas with limited rainfall. The plant is well adapted to the harsh environmental conditions of its native range. Its distribution reflects its preference for specific ecological niches across these South American countries.",
    "distribution_introduced_art_desc": "Acanthocalycium rhodotrichum subsp. rhodotrichum was mainly introduced to the United States as a decorative cactus for horticultural purposes. It is native to Mexico and has been cultivated for its unique appearance and resilience. This subspecies is often found in gardens and rockeries due to its ability to thrive in arid conditions. However, it is considered an invasive species in some regions where it can outcompete native flora. Proper management is essential to prevent its spread beyond controlled environments."
}
