{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon genistioides var. genistioides",
    "plant_slug": "acantholimon-genistioides-var-genistioides",
    "plant_name_scientific": "acantholimon genistioides var. genistioides",
    "intro": "Acantholimon genistioides var. genistioides, commonly known as the desert sand verbena, is a flowering plant native to the arid regions of the southwestern United States and northwestern Mexico. It is characterized by its low, sprawling growth habit and is typically found in sandy or gravelly soils. The plant produces small, yellowish to reddish flowers that bloom in late spring to early summer. Its leaves are usually narrow and covered in fine hairs, which help reduce water loss in hot, dry environments. The species is well adapted to harsh desert conditions, making it a hardy and resilient plant in xerophytic ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon genistioides"
    },
    "taxonomy_art_desc": "Acantholimon genistioides var. genistioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and algae that have a complex life cycle with a dominant sporophyte phase. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and some modern gymnosperms. Its subclass is Magnoliidae, a group of flowering plants characterized by their complex floral structures and a wide variety of growth forms. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive floral morphology and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often showy flowers and medicinal properties. Its genus is Acantholimon, a genus of flowering plants typically found in arid or semi-arid regions, known for their spiny or thorny structures. Its species is Acantholimon genistioides, a specific plant within the genus Acantholimon, notable for its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon genistioides var. genistioides is primarily native to Iran and Iraq. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky and sandy soils, often in mountainous or coastal areas. The species is well adapted to the harsh climatic conditions of its native range. Its distribution is limited to specific ecological niches in the Middle East.",
    "distribution_introduced_art_desc": "Acantholimon genistioides var. genistioides was mainly introduced to regions with Mediterranean climates, characterized by dry summers and wet winters. It thrives in well-drained soils and full sun exposure, making it suitable for rocky or gravelly habitats. This plant is often found in coastal areas and open woodlands where it can establish itself easily. Its introduction has been primarily for ornamental purposes due to its attractive blue-gray foliage and showy flowers. However, it is considered invasive in some areas, outcompeting native vegetation and altering local ecosystems."
}
