{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kandaharense",
    "plant_slug": "acantholimon-kandaharense",
    "plant_name_scientific": "acantholimon kandaharense",
    "intro": "Acantholimon kandaharense, commonly known as the Kandahar thornweed, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Plumbaginaceae and is characterized by its succulent, spiny stems and small, blue to purple flowers. The plant is adapted to survive in harsh, dry environments, with thick leaves that store water and reduce transpiration. It typically grows in rocky or sandy soils and is often found in mountainous areas. Due to its limited distribution and habitat specificity, it is considered a rare and potentially endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon kandaharense"
    },
    "taxonomy_art_desc": "Acantholimon kandaharense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex structures. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive flowers and sometimes by a peculiar water storage mechanism. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes shrubs and herbs with showy flowers and often contains toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky environments, characterized by their spiny leaves and showy flowers. Its species is Acantholimon kandaharense, a specific type of plant native to Afghanistan, known for its unique adaptations to its harsh environment and its role in local ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kandaharense is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant thrives in rocky and arid environments, often growing at higher elevations. It is adapted to the harsh climatic conditions of the region, including low precipitation and extreme temperature variations. Due to its restricted habitat, it is considered a rare and endemic species within Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon kandaharense was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It thrives in regions with low precipitation and moderate temperatures, making it suitable for rocky or gravelly soils. This plant is often found in disturbed sites such as roadsides, fields, and disturbed habitats due to its adaptability. Its introduction has been noted in several regions outside its native range, including parts of the United States and Europe. It plays a role in stabilizing soil and providing habitat for small invertebrates in these environments."
}
