{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus castellae",
    "plant_slug": "acanthocereus-castellae",
    "plant_name_scientific": "acanthocereus castellae",
    "intro": "Acanthocereus castellae, commonly known as the Castle Cactus, is a species of cactus native to the Sonoran Desert. It is characterized by its cylindrical stems and spiny areoles, which are typical features of the Cactaceae family. The plant produces small, white flowers that bloom at night, attracting nocturnal pollinators such as bats and moths. It is adapted to arid environments, storing water in its thick, fleshy stems. Due to its unique appearance and ecological significance, it is often cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Cactaceae",
        "genus": "Acanthocereus",
        "species": "Acanthocereus castellae"
    },
    "taxonomy_art_desc": "Acanthocereus castellae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes cacti, carnations, and beets, often with specialized adaptations for arid environments. Its family is Cactaceae, commonly known as cacti, which are succulent plants typically found in arid regions and characterized by spines and water-storing stems. Its genus is Acanthocereus, a group of cacti native to the Americas, known for their columnar stems and nocturnal flowering. Its species is Acanthocereus castellae, a specific type of cactus found in Mexico, distinguished by its spiny stems and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus castellae is primarily native to Mexico Southwest. This species is found in the arid and semi-arid regions of the southern and western parts of Mexico. It thrives in rocky soils and is commonly associated with desert ecosystems. The plant is well adapted to the harsh environmental conditions of its native habitat. It is often seen growing in limestone areas and along rocky outcrops.",
    "distribution_introduced_art_desc": "Acanthocereus castellae was mainly introduced to the United States as an ornamental plant due to its unique appearance and drought tolerance. It is commonly found in arid and semi-arid regions, particularly in the southwestern states like Texas and Arizona. The plant is often cultivated in gardens and landscapes where it serves as a striking focal point. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns about its ecological impact in non-native habitats."
}
