{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon acerosum var. pinardii",
    "plant_slug": "acantholimon-acerosum-var-pinardii",
    "plant_name_scientific": "acantholimon acerosum var. pinardii",
    "intro": "Acantholimon acerosum var. pinardii, commonly known as the hard-leaved sandthrift, is a perennial plant native to the Mediterranean region. It is characterized by its dense, mat-forming growth habit and its distinctive, often blue to purple flowers. The plant has rigid, needle-like leaves that are covered in fine hairs, providing it with a gritty texture. It thrives in well-drained, sandy or gravelly soils and is adapted to full sun. This species is often used in xeriscaping due to its drought tolerance and low maintenance requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon acerosum var. pinardii is primarily native to the Mediterranean Basin, specifically the southeastern regions of Spain and parts of southern France. This variety thrives in rocky and coastal environments, often found on limestone substrates. It is commonly associated with dry, sunny habitats such as cliffs, slopes, and coastal dunes. The plant is well adapted to the harsh climatic conditions of the region, including high temperatures and limited rainfall. Its distribution is relatively restricted, making it a characteristic species of the Mediterranean flora.",
    "distribution_introduced_art_desc": "Acantholimon acerosum var. pinardii was mainly introduced to areas with well-drained sandy or gravelly soils, typically in coastal or inland dune environments. It thrives in full sun and is commonly found in arid or semi-arid regions. This plant is often used for erosion control due to its deep root system and drought tolerance. It has been introduced to several regions in the Mediterranean and parts of western North America. Its distribution is largely limited by its specific habitat requirements and climate preferences."
}
