{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax davidii",
    "plant_slug": "acanthopanax-davidii",
    "plant_name_scientific": "acanthopanax davidii",
    "intro": "Acanthopanax davidii, commonly known as David's arrowhead, is a deciduous shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves with serrated edges. The plant produces small, greenish-yellow flowers followed by red berries that are attractive to birds. It thrives in temperate climates and is often found in forested areas. Its ornamental value and adaptability make it a popular choice for garden cultivation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax davidii is primarily native to China, specifically in the provinces of Sichuan, Yunnan, and Guizhou. It grows in mountainous regions at elevations ranging from 1,500 to 3,500 meters. This plant is commonly found in forests and shrublands, often in areas with moist, well-drained soils. It is part of the Araliaceae family and is known for its medicinal properties in traditional Chinese medicine. The species is also occasionally found in neighboring countries such as Vietnam and Myanmar.",
    "distribution_introduced_art_desc": "Acanthopanax davidii was mainly introduced to regions with temperate climates, particularly in East Asia, where it thrives in forested areas. It is commonly found in countries such as China, Korea, and Japan, where it has been historically used in traditional medicine. The plant's introduction to these areas is largely due to its medicinal properties and ecological adaptability. It is often cultivated for its roots, which are valued for their health benefits. However, its spread has raised concerns about its potential impact on local ecosystems."
}
