{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon esfandiarii",
    "plant_slug": "acantholimon-esfandiarii",
    "plant_name_scientific": "acantholimon esfandiarii",
    "intro": "Acantholimon esfandiarii, commonly known as the Esfandiari's thornweed, is a flowering plant native to the arid regions of Iran. It belongs to the Plumbagaceae family and is characterized by its succulent, fleshy leaves that help it retain water in harsh environments. The plant produces small, blue or purple flowers that bloom in the spring, attracting pollinators such as bees and butterflies. It is typically found in rocky soils and is adapted to withstand extreme temperatures and limited rainfall. Due to its specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon esfandiarii"
    },
    "taxonomy_art_desc": "Acantholimon esfandiarii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often having spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms, typically with primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flower structures and often contains species adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes flowering plants often found in dry and rocky habitats. Its genus is Acantholimon, a group of flowering plants typically characterized by their succulent leaves and often found in arid or semi-arid regions. Its species is Acantholimon esfandiarii, a specific plant within the genus Acantholimon, native to Iran, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon esfandiarii is primarily native to Iran. This plant is found in specific regions of Iran, particularly in the northern and western parts of the country. It thrives in rocky and arid environments, often growing on slopes and in mountainous areas. The species is adapted to the dry and temperate climate conditions of its native habitat. It is a rare and endemic plant, highlighting the unique biodiversity of Iran's flora.",
    "distribution_introduced_art_desc": "Acantholimon esfandiarii was mainly introduced to areas with specific ecological conditions that mimic its native habitat. It thrives in well-drained soils and full sun exposure, making it suitable for arid and semi-arid environments. This plant has been observed in regions with low precipitation and high temperatures, where it establishes itself along rocky outcrops and disturbed soils. Its introduction has been linked to human activities such as landscaping and habitat modification. However, its impact on local ecosystems remains under study due to its limited distribution and recent introduction."
}
