{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon avenaceum var. avenaceum",
    "plant_slug": "acantholimon-avenaceum-var-avenaceum",
    "plant_name_scientific": "acantholimon avenaceum var. avenaceum",
    "intro": "Acantholimon avenaceum var. avenaceum, commonly known as the slender leafed stonecrop, is a low-growing perennial plant native to the Mediterranean region. It features succulent, fleshy leaves that are typically narrow and grass-like, adapted to retain moisture in arid environments. The plant produces small, star-shaped flowers in shades of pink or white, which bloom in early summer. It thrives in well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. Its hardy nature and ornamental value make it a popular choice for drought-tolerant landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon avenaceum"
    },
    "taxonomy_art_desc": "Acantholimon avenaceum var. avenaceum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives. Its class is Equisetopsida, a group that includes ferns and their relatives, characterized by their vascular systems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often contain secondary compounds. Its family is Plumbaginaceae, a family of flowering plants known for their often blue or purple flowers and some containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, characterized by their spiny leaves and small flowers. Its species is Acantholimon avenaceum, a specific type within the genus known for its distinctive features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Transcaucasus",
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon avenaceum var. avenaceum is primarily native to Iran, Transcaucasus, and Turkmenistan. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in rocky soils and is often seen in mountainous and coastal habitats. The species is well adapted to the climate and environmental conditions of its native range. It plays an important ecological role in its local ecosystems.",
    "distribution_introduced_art_desc": "Acantholimon avenaceum var. avenaceum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed soils, such as roadsides, fields, and degraded landscapes. This plant is often used for erosion control due to its hardy nature and ability to thrive in harsh conditions. It has a low-growing habit with small, needle-like leaves and produces clusters of blue or purple flowers. Its introduction has helped stabilize soil in areas prone to wind and water erosion."
}
