{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthyllis tragacanthoides",
    "plant_slug": "acanthyllis-tragacanthoides",
    "plant_name_scientific": "acanthyllis tragacanthoides",
    "intro": "Acanthyllis tragacanthoides, commonly known as the Tragacanth-like Thistle, is a flowering plant native to southern Africa. It belongs to the family Asteraceae and is characterized by its spiny stems and small, yellowish flowers. The plant produces a distinctive latex that has been historically used in traditional medicine. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. Its ecological role includes providing habitat and nectar for pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthyllis tragacanthoides is primarily native to southern Africa, specifically South Africa. It is found in the region of the Western Cape, particularly in the fynbos biome. This plant thrives in rocky and sandy soils, often in coastal and mountainous areas. It is commonly associated with open vegetation types and is adapted to the Mediterranean climate of the region. The species is also found in parts of Namibia and into the eastern regions of South Africa.",
    "distribution_introduced_art_desc": "Acanthyllis tragacanthoides was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in fynbos vegetation, particularly in the Western Cape. The plant spreads rapidly through its seeds, which are dispersed by wind and animals. It competes with native plants for resources, leading to ecological concerns. Efforts are being made to control its spread and mitigate its impact on local biodiversity."
}
