{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon wendelboi",
    "plant_slug": "acantholimon-wendelboi",
    "plant_name_scientific": "acantholimon wendelboi",
    "intro": "Acantholimon wendelboi, commonly known as the Wendelbo's thornscale, is a flowering plant belonging to the family Plumbagaceae. It is native to the high-altitude regions of the eastern Mediterranean, particularly in Cyprus and Turkey. The plant is characterized by its succulent, fleshy leaves and small, blue or violet flowers that bloom in the summer months. It thrives in rocky, well-drained soils and is adapted to arid and semi-arid environments. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon wendelboi"
    },
    "taxonomy_art_desc": "Acantholimon wendelboi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and often ancient lineage. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many familiar families such as the magnoliaceae and asteraceae. Its order is Caryophyllales, which consists of flowering plants with a wide range of morphological diversity, including many succulent and desert-adapted species. Its family is Plumbaginaceae, commonly known as the leadplant family, characterized by plants with often blue or purple flowers and a variety of growth forms. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their small, often spiny leaves and showy flowers. Its species is Acantholimon wendelboi, a specific plant within this genus, noted for its adaptations to harsh environments and its role in local ecosystems.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon wendelboi is primarily native to Iran. This plant is found in the mountainous regions of the country, particularly in the western and central parts. It thrives in rocky and arid environments, often growing at higher elevations. The species is adapted to the harsh climatic conditions of these regions. Its native distribution is limited to specific areas within Iran, reflecting its ecological preferences.",
    "distribution_introduced_art_desc": "Acantholimon wendelboi was mainly introduced to areas with rocky or gravelly soils, often in alpine or subalpine environments. It is typically found in regions with cool, temperate climates and moderate precipitation. This plant prefers well-drained soil and is often associated with mountainous or coastal habitats. Its introduction has been noted in several regions outside its native range, including parts of Europe and North America. It is considered a rare and specialized species with limited distribution."
}
