{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax humillimus",
    "plant_slug": "acanthopanax-humillimus",
    "plant_name_scientific": "acanthopanax humillimus",
    "intro": "Acanthopanax humillimus, commonly known as the dwarf devil's ivy, is a climbing shrub native to eastern Asia. It belongs to the Araliaceae family and is characterized by its compound leaves and small, clustered flowers. The plant typically grows in shaded, moist environments such as forests and rocky slopes. Its stems are woody and can produce aerial roots to support its climbing habit. Acanthopanax humillimus is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax humillimus is primarily native to eastern Asia, including regions such as China, Japan, and Korea. It is commonly found in forested areas, particularly in temperate and subtropical climates. This plant thrives in moist, well-drained soils and is often associated with understory vegetation in mixed hardwood forests. It is also occasionally found in mountainous regions where the climate is cooler and more humid. Due to its limited distribution, it is considered a relatively rare species in its native range.",
    "distribution_introduced_art_desc": "Acanthopanax humillimus was mainly introduced to the Pacific Northwest region of the United States. It was first documented in the early 2000s in Washington State. The plant was likely introduced through the horticultural trade as an ornamental species. It has since spread to neighboring areas, including parts of Oregon and British Columbia. Its establishment in these regions has raised concerns due to its potential invasive characteristics."
}
