{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosyris spinescens",
    "plant_slug": "acanthosyris-spinescens",
    "plant_name_scientific": "acanthosyris spinescens",
    "intro": "Acanthosyris spinescens, commonly known as the spiny acanthosyris, is a succulent plant native to the arid regions of South Africa. It is characterized by its dense, spiny foliage that serves as a defense mechanism against herbivores. The plant produces small, tubular flowers that are typically yellow or orange in color, blooming in late summer. Its leaves are thick and fleshy, adapted to store water in its native desert environment. Acanthosyris spinescens is often grown as an ornamental plant due to its unique appearance and resilience.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Santalales",
        "family": "Santalaceae",
        "genus": "Acanthosyris",
        "species": "Acanthosyris spinescens"
    },
    "taxonomy_art_desc": "Acanthosyris spinescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Santalales, a group of flowering plants that includes parasitic and hemiparasitic species, often with reduced leaves and specialized root systems. Its family is Santalaceae, a family of flowering plants that includes both parasitic and non-parasitic species, many of which have small, clustered flowers. Its genus is Acanthosyris, a group of flowering plants primarily found in arid regions, characterized by their spiny or thorny structures. Its species is Acanthosyris spinescens, a specific plant within this genus known for its spiny appearance and adaptation to dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Brazil South",
        "Brazil West-Central",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosyris spinescens is primarily native to Argentina Northeast, Brazil South, Brazil West-Central, and Uruguay. This shrub is typically found in dry, rocky, or sandy soils in these regions. It thrives in arid and semi-arid environments, often growing in coastal or inland areas with low rainfall. The plant is well adapted to the harsh climatic conditions of its native range. Its distribution is limited to specific ecological niches within these countries.",
    "distribution_introduced_art_desc": "Acanthosyris spinescens was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it suitable for xerophytic habitats. The plant is often found in rocky or sandy soils, where it can establish itself with minimal water requirements. Its spiny structure provides protection from herbivores, allowing it to persist in disturbed or degraded landscapes. Due to its hardy nature, it has been introduced to various regions as an ornamental or for erosion control."
}
