{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon rubellum",
    "plant_slug": "acantholimon-rubellum",
    "plant_name_scientific": "acantholimon rubellum",
    "intro": "Acantholimon rubellum, commonly known as the red sand verbena, is a flowering plant native to the arid regions of the southwestern United States and northern Mexico. It is characterized by its slender, branching stems and small, clustered flowers that range in color from pink to red. The plant has small, narrow leaves that are typically covered in fine hairs, which help reduce water loss in its harsh environment. It thrives in well-drained soils and is often found in desert scrub and rocky habitats. Acantholimon rubellum is valued for its ornamental appeal and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon rubellum is primarily native to the western United States, particularly in California and Nevada. It is commonly found in rocky and coastal areas, including cliffs, dunes, and sandy soils. This plant thrives in arid and semi-arid environments, often growing in open habitats with well-drained soils. It is also present in parts of Oregon and Baja California, Mexico. Due to its limited range and specific habitat requirements, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acantholimon rubellum was mainly introduced to areas with well-drained soils and full sun exposure, often found in rocky or gravelly habitats. It is commonly established in disturbed sites such as roadsides, railroads, and abandoned fields. This plant thrives in Mediterranean climates and is known for its drought tolerance. It has become a common weed in parts of California and other western United States regions. Its rapid growth and ability to spread through seeds make it a persistent invasive species in these environments."
}
