{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum xanthioides var. obtusifolium",
    "plant_slug": "acanthospermum-xanthioides-var-obtusifolium",
    "plant_name_scientific": "acanthospermum xanthioides var. obtusifolium",
    "intro": "Acanthospermum xanthioides var. obtusifolium, commonly known as the broadleaf false dandelion, is a flowering plant native to tropical and subtropical regions. It is characterized by its hairy, lance-shaped leaves and yellow flowers that bloom in clusters. The plant belongs to the Asteraceae family, which includes daisies and sunflowers, and is often found in disturbed soils. Its leaves are typically broad and have a slightly waxy texture, while the stems are erect and branched. The plant is known for its ability to thrive in dry conditions, making it a common weed in agricultural areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum xanthioides var. obtusifolium is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in open, sunny habitats like grasslands and disturbed soils. This variant is commonly found in coastal areas and lowland regions with warm climates. It is often associated with human-modified landscapes, including agricultural fields and roadsides. Its distribution is largely limited to the eastern and southern parts of the African continent.",
    "distribution_introduced_art_desc": "Acanthospermum xanthioides var. obtusifolium was mainly introduced to the United States as an ornamental plant due to its attractive, fuzzy foliage and yellow flowers. It has since become established in several southern states, particularly in disturbed soils and along roadsides. This plant is considered invasive in some regions because of its rapid growth and ability to outcompete native vegetation. It thrives in full sun and well-drained soils, making it adaptable to a variety of environments. Due to its spread, it is often found in agricultural areas and natural habitats where it can disrupt local ecosystems."
}
