{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus horribarbis",
    "plant_slug": "acanthocereus-horribarbis",
    "plant_name_scientific": "acanthocereus horribarbis",
    "intro": "Acanthocereus horribarbis, commonly known as the devil's claw cactus, is a species of cactus native to the arid regions of South America. It is characterized by its spiny, columnar stems and produces vibrant yellow flowers during the night. The plant is adapted to survive in harsh, dry environments with minimal water requirements. Its flowers are pollinated primarily by bats and moths, which are active during the evening. The plant's unique morphology and nocturnal blooming habit make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus horribarbis is primarily native to the arid regions of the southwestern United States and northwestern Mexico. It is commonly found in areas such as Arizona, New Mexico, and parts of Sonora. This cactus thrives in desert environments with well-drained soils and low rainfall. It is often seen in rocky crevices and open plains where it can receive ample sunlight. Due to its hardy nature, it is well adapted to the extreme conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acanthocereus horribarbis was mainly introduced to the United States as an ornamental plant due to its unique appearance and hardy nature. It is commonly found in desert regions, particularly in Arizona and California, where it thrives in arid conditions. This cactus is known for its spiny stems and yellow flowers, making it a popular choice for xeriscaping and rock gardens. However, its introduction has raised concerns about its potential to become invasive in local ecosystems. Despite its aesthetic appeal, careful management is needed to prevent its spread beyond cultivated areas."
}
