{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum kandaharicum",
    "plant_slug": "acanthophyllum-kandaharicum",
    "plant_name_scientific": "acanthophyllum kandaharicum",
    "intro": "Acanthophyllum kandaharicum, commonly known as the Kandahar spiny shrub, is a halophytic plant adapted to arid and saline environments. It belongs to the Amaranthaceae family and is characterized by its dense, spiny foliage and compact growth habit. The plant produces small, greenish flowers that are typically clustered in inflorescences. It is native to regions of Central Asia, including Afghanistan and Pakistan, where it thrives in sandy or gravelly soils. Due to its resilience, it is often found in desert ecosystems and is used for soil stabilization in degraded landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum kandaharicum"
    },
    "taxonomy_art_desc": "Acanthophyllum kandaharicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall and a complex life cycle involving alternating generations. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Caryophyllales, a group of flowering plants that includes many plants with showy flowers and a variety of ecological adaptations. Its family is Caryophyllaceae, commonly known as the carnation family, which includes plants with simple leaves and flowers that are often pink or white. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum kandaharicum, a specific plant species native to Afghanistan, known for its succulent leaves and ability to thrive in harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran",
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum kandaharicum is primarily native to Afghanistan, Iran, and Pakistan. This plant is typically found in arid and semi-arid regions, often in rocky or sandy soils. It is well adapted to the harsh climatic conditions of these areas. The species is commonly observed in desert and steppe environments. Its distribution is largely confined to the central and southern parts of these countries.",
    "distribution_introduced_art_desc": "Acanthophyllum kandaharicum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Afghanistan and Pakistan. It thrives in sandy and gravelly soils with low precipitation. The plant is well adapted to harsh environmental conditions, making it a resilient species in desert ecosystems. It plays a role in stabilizing dunes and preventing soil erosion. Its introduction has been documented in several ecological studies focusing on plant adaptation in extreme climates."
}
