{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthella montana",
    "plant_slug": "acanthella-montana",
    "plant_name_scientific": "acanthella montana",
    "intro": "Acanthella montana, commonly known as the mountain acanthella, is a flowering plant native to the mountainous regions of South America. It is characterized by its woody stems and narrow, lance-shaped leaves. The plant produces small, clustered white or pale yellow flowers during the spring and summer months. Acanthella montana thrives in well-drained soils and is often found in rocky or forested habitats. It is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthella montana is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in sandy soils along the coastal regions and inland areas. This plant thrives in wetland environments, including marshes and swamps. It is often associated with the Florida scrub ecosystem, where it plays a role in the local biodiversity. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Acanthella montana was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, quarries, and degraded grasslands. It thrives in regions with full sun exposure and moderate to high rainfall. The plant has been observed spreading rapidly in these environments, often outcompeting native vegetation. Its introduction is associated with human activities, including land clearing and accidental seed dispersal. Due to its aggressive growth, it is considered a potential invasive species in some regions."
}
