{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax leucorrhizus var. fulvescens",
    "plant_slug": "acanthopanax-leucorrhizus-var-fulvescens",
    "plant_name_scientific": "acanthopanax leucorrhizus var. fulvescens",
    "intro": "Acanthopanax leucorrhizus var. fulvescens, commonly known as the yellow-flowered five-leaf aralia, is a shrub native to eastern Asia. It is characterized by its compound leaves, which typically consist of five leaflets with a serrated edge. The plant produces small, yellowish-green flowers arranged in umbels, followed by bright red berries that are attractive to birds. It thrives in shaded, moist environments and is often found in forest understories. The species is valued for its ornamental appeal and has traditional uses in herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax leucorrhizus var. fulvescens is primarily native to China, specifically in the provinces of Yunnan, Sichuan, and Guizhou. This variety thrives in mountainous regions with temperate to subtropical climates. It is commonly found in forested areas at elevations ranging from 1,500 to 3,000 meters. The plant prefers well-drained soils and is often associated with mixed evergreen and deciduous forests. It plays an important ecological role in its native habitat, supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acanthopanax leucorrhizus var. fulvescens was mainly introduced to regions with temperate to subtropical climates, where it thrives in well-drained soils. It is commonly found in forested areas and along stream banks, preferring partial to full shade. This plant has been introduced to parts of East Asia, including China, Japan, and Korea, where it is used in traditional medicine. Its introduction has led to its naturalization in some areas, contributing to local biodiversity. However, it is not considered invasive in most regions where it has been established."
}
