{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus dioscoridis var. perringii",
    "plant_slug": "acanthus-dioscoridis-var-perringii",
    "plant_name_scientific": "acanthus dioscoridis var. perringii",
    "intro": "Acanthus dioscoridis var. perringii, commonly known as the Perring's spiny acanthus, is a rare and ornamental plant native to southern Africa. It is characterized by its striking, spiny leaves with a distinctive silvery-blue underside. The plant produces showy, spire-like inflorescences that bear small, pale blue to purple flowers. It thrives in well-drained soils and full sun, making it suitable for rock gardens or containers. Due to its rarity and specific habitat requirements, it is often cultivated in botanical gardens and by enthusiasts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus dioscoridis"
    },
    "taxonomy_art_desc": "Acanthus dioscoridis var. perringii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with diverse morphological features. Its order is Lamiales, a group of flowering plants that includes many aromatic herbs and shrubs, often with showy flowers. Its family is Acanthaceae, a family of flowering plants known for their often striking and showy flowers, many of which are used in ornamental horticulture. Its genus is Acanthus, a group of flowering plants commonly known for their spiny leaves and showy, spathiform inflorescences, often used in ornamental gardening. Its species is Acanthus dioscoridis, a specific type within the Acanthus genus, characterized by its distinct morphological features and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus dioscoridis var. perringii is primarily native to Turkey. This plant is found in specific regions within Turkey, particularly in the southeastern part of the country. It thrives in rocky and arid environments, often growing in mountainous areas. The variety is known for its distinctive foliage and is a member of the Acanthaceae family. Its native distribution is limited to Turkey, making it a rare and localized species in its natural habitat.",
    "distribution_introduced_art_desc": "Acanthus dioscoridis var. perringii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its striking foliage and floral display. The distribution of this species has been limited to specific regions within New Zealand, primarily in the North Island. It is often found in disturbed habitats such as roadsides and gardens. Despite its ornamental value, it is considered a potential weed in certain areas."
}
