{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon bobrovii",
    "plant_slug": "acantholimon-bobrovii",
    "plant_name_scientific": "acantholimon bobrovii",
    "intro": "Acantholimon bobrovii, commonly known as the Bobrov's thornsteppe, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit with silver-gray foliage. The plant produces small, blue or violet flowers arranged in dense clusters, typically blooming in the summer months. It is adapted to harsh, arid environments and is often found in rocky or sandy soils. Due to its limited distribution and specific habitat requirements, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon bobrovii is primarily native to the Caucasus region, specifically in the mountainous areas of Georgia and the northern part of Azerbaijan. It thrives in rocky and calcareous soils, often found in alpine and subalpine zones. This species is adapted to the cold, dry climates of its native habitat. It is commonly found in open slopes and meadows at high elevations. Due to its limited distribution, it is considered a rare and endemic plant in the region.",
    "distribution_introduced_art_desc": "Acantholimon bobrovii was mainly introduced to areas with well-drained soils and moderate climates, often found in rocky or gravelly habitats. It is typically found in regions with limited water availability, making it suited for arid and semi-arid environments. This plant is commonly used in xeriscaping due to its drought tolerance and low maintenance requirements. It has been introduced to several regions outside its native range, including parts of the western United States. Its distribution is largely influenced by human activity and landscaping preferences in dryland areas."
}
