{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax connatistylus",
    "plant_slug": "acanthopanax-connatistylus",
    "plant_name_scientific": "acanthopanax connatistylus",
    "intro": "Acanthopanax connatistylus, commonly known as the Chinese angel's trumpet, is a climbing shrub native to China. It belongs to the family Araliaceae and is characterized by its compound leaves and showy, trumpet-shaped flowers. The plant produces small, greenish-yellow flowers that are clustered in umbels, and it is known for its medicinal properties in traditional Chinese medicine. It thrives in moist, shaded environments and is often found in forested areas. Its unique morphology and ecological role make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax connatistylus is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Sichuan. It thrives in temperate to subtropical climates, often found in forested areas at elevations ranging from 1,500 to 3,000 meters. This plant is commonly associated with secondary growth forests and rocky slopes, where it benefits from partial shade and well-drained soil. Its distribution is limited to specific ecological niches, making it a rare and endemic species in its native range. Due to habitat loss and fragmentation, Acanthopanax connatistylus is considered vulnerable in its natural environment.",
    "distribution_introduced_art_desc": "Acanthopanax connatistylus was mainly introduced to areas with temperate climates and well-drained soils, often in forested regions. It thrives in environments with moderate sunlight and humidity, making it suitable for cultivation in gardens and natural landscapes. This plant is commonly found in regions of East Asia, including parts of China, Japan, and Korea. Its introduction has been driven by its ornamental value and potential medicinal uses. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
