{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocereus princeps",
    "plant_slug": "acanthocereus-princeps",
    "plant_name_scientific": "acanthocereus princeps",
    "intro": "Acanthocereus princeps, commonly known as the Mexican torch cactus, is a species of cactus native to Mexico. It is characterized by its tall, cylindrical stems that are often sparsely branched and covered with white, woolly hairs. The plant produces clusters of yellow flowers during the summer months, which are followed by small, red fruits. It is adapted to arid and semi-arid environments, thriving in full sun and well-drained soil. Due to its striking appearance and resilience, it is a popular choice for desert gardens and collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocereus princeps is primarily native to the southern United States, specifically Texas, and northern Mexico. It is commonly found in the Chihuahuan Desert region, where it thrives in arid and semi-arid environments. This cactus is often seen growing on rocky slopes and in limestone soils. It is well adapted to the hot, dry climate of its native range. The plant is known for its spiny stems and yellow flowers that bloom in the summer months.",
    "distribution_introduced_art_desc": "Acanthocereus princeps was mainly introduced to the United States, particularly in the southwestern states such as Texas and Arizona. It was brought in for ornamental purposes due to its unique appearance and ability to thrive in arid environments. This cactus species is often cultivated in gardens and landscapes where it can provide visual interest and drought tolerance. However, it has also been reported to escape cultivation and establish itself in natural areas, raising concerns about its potential invasive impact. Despite its beauty, its introduction has led to discussions about ecological management and control strategies."
}
