{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon mirtadzadinii",
    "plant_slug": "acantholimon-mirtadzadinii",
    "plant_name_scientific": "acantholimon mirtadzadinii",
    "intro": "Acantholimon mirtadzadinii, commonly known as the Armenian thimblecress, is a flowering plant native to the mountainous regions of Armenia. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit. The plant features small, blue to purple flowers that bloom in early spring, attracting pollinators such as bees. Its leaves are narrow and grass-like, adapted to withstand the harsh, arid conditions of its native habitat. Acantholimon mirtadzadinii is valued for its ornamental appeal and ecological importance in its native environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon mirtadzadinii"
    },
    "taxonomy_art_desc": "Acantholimon mirtadzadinii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures and reproductive systems. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flowers and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants known for their often blue or purple flowers and some species containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon mirtadzadinii, a specific plant within the genus Acantholimon, native to certain regions and distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon mirtadzadinii is primarily native to Iran. This species is found in specific regions of Iran, particularly in the western and southwestern parts of the country. It typically grows in rocky or gravelly soils in mountainous areas. The plant is adapted to the arid and semi-arid climates of its native habitat. It is a member of the Plumbagaceae family and is known for its hardy nature.",
    "distribution_introduced_art_desc": "Acantholimon mirtadzadinii was mainly introduced to areas with dry, rocky soils and elevations between 1,500 and 3,000 meters. It thrives in regions with limited rainfall and full sun exposure. This plant is commonly found in mountainous regions of eastern Turkey and northern Iran. It is often associated with limestone and granitic substrates. Its introduction has been documented in several botanical gardens and conservation areas focused on endemic flora."
}
