{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospora conantha",
    "plant_slug": "acanthospora-conantha",
    "plant_name_scientific": "acanthospora conantha",
    "intro": "Acanthospora conantha, commonly known as the slender coral tree, is a species of flowering plant in the family Malvaceae. It is native to parts of Africa, particularly South Africa, where it thrives in arid and semi-arid environments. The plant is characterized by its delicate, branched stems and clusters of small, pale pink or white flowers. Its leaves are usually small and opposite, with a hairy texture that helps reduce water loss. Acanthospora conantha is often cultivated for its ornamental value and ability to withstand harsh climatic conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospora conantha is primarily native to the Pacific Islands, including Hawaii, Tahiti, and other parts of Oceania. It is commonly found in coastal areas and rocky shores where it thrives in well-drained, sandy soils. This plant is adapted to the humid and tropical climate of its native habitat. It plays an important role in stabilizing coastal dunes and preventing erosion. Due to its restricted distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthospora conantha was mainly introduced to new environments through human activity, such as horticultural trade and accidental transport. It has been reported in several regions outside its native range, including parts of Southeast Asia and the Pacific Islands. The plant's ability to thrive in disturbed soils and its rapid growth rate contribute to its successful establishment in these areas. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, careful monitoring is recommended to prevent ecological impacts."
}
