{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon listoniae",
    "plant_slug": "acantholimon-listoniae",
    "plant_name_scientific": "acantholimon listoniae",
    "intro": "Acantholimon listoniae, commonly known as the Liston's thornscale, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy stems and leaves adapted to conserve water. The plant produces small, clustered flowers that are typically pink or purple in color, which bloom during the summer months. It thrives in well-drained soils and is often found in rocky or gravelly habitats. Due to its limited distribution and specific ecological requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon listoniae is primarily native to the western United States, specifically California. It is found in the coastal ranges and foothills of southern California. This plant thrives in sandy or gravelly soils and is adapted to a Mediterranean climate with dry summers and wet winters. It is commonly found in open habitats such as chaparral and coastal scrub. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Acantholimon listoniae was mainly introduced to areas with well-drained sandy or gravelly soils, often in coastal or inland dune environments. It thrives in full sun and is commonly found in regions with a Mediterranean climate. This plant is typically distributed in southern Europe, particularly in Spain and Portugal, as well as parts of North Africa. It is often associated with disturbed or open habitats, such as roadsides and agricultural fields. Its introduction has been linked to human activity, including land development and accidental seed dispersal."
}
