{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon balansae",
    "plant_slug": "acantholimon-balansae",
    "plant_name_scientific": "acantholimon balansae",
    "intro": "Acantholimon balansae, commonly known as the Balansae's thorned bladder, is a perennial flowering plant native to the arid regions of the Middle East and Central Asia. It belongs to the family Caryophyllaceae, which includes many flowering plants adapted to dry environments. The plant is characterized by its succulent, fleshy leaves and small, clustered flowers that typically bloom in shades of pink or white. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its unique adaptations, it is considered a valuable species for studying xerophytic plant physiology.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon balansae is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, Lebanon, and Israel. It is commonly found in rocky and arid environments, particularly on slopes and among limestone formations. This plant thrives in regions with low precipitation and high sunlight exposure, typical of Mediterranean climates. Its distribution is limited to specific microhabitats where it can access limited water and nutrients. Due to its restricted range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon balansae was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It is commonly found in rocky and coastal areas where it thrives in well-drained soils. This plant is often cultivated in gardens for its ornamental value due to its attractive blue to purple flowers. It is also used in landscaping for its drought tolerance and ability to withstand harsh environmental conditions. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
