{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax lasiogyne",
    "plant_slug": "acanthopanax-lasiogyne",
    "plant_name_scientific": "acanthopanax lasiogyne",
    "intro": "Acanthopanax lasiogyne, commonly known as the hairy five-finger plant, is a climbing shrub native to Southeast Asia. It belongs to the family Araliaceae and is characterized by its compound leaves with five leaflets, often covered in fine hairs. The plant produces small, greenish-white flowers followed by red berries that are edible for some animals. It thrives in moist, shaded environments and is often found in tropical and subtropical forests. Its woody stems and unique foliage make it a distinctive species within its habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax lasiogyne is primarily native to Southeast Asia, including countries such as China, Vietnam, Laos, and Cambodia. It is commonly found in tropical and subtropical regions, particularly in forested areas and mountainous terrain. The plant thrives in humid climates with well-drained soil, often growing at elevations ranging from lowlands to mid-altitudes. It is a climbing shrub that is often used in traditional medicine for its purported health benefits. Its distribution is closely tied to the biodiversity of the region's ecosystems.",
    "distribution_introduced_art_desc": "Acanthopanax lasiogyne was mainly introduced to areas with temperate climates and well-drained soils, often found in forested regions. It thrives in regions with moderate rainfall and partial to full sunlight. This plant is commonly used in traditional medicine for its purported health benefits. Its introduction has been associated with both ornamental and medicinal purposes. However, it can become invasive in certain ecosystems if not managed properly."
}
