{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ugandensis",
    "plant_slug": "acanthus-ugandensis",
    "plant_name_scientific": "acanthus ugandensis",
    "intro": "Acanthus ugandensis, commonly known as the Uganda spurge, is a flowering plant native to East Africa. It belongs to the Euphorbiaceae family and is characterized by its striking, palmate leaves with a waxy texture. The plant produces small, greenish-yellow flowers arranged in clusters, which are often surrounded by modified leaves called bracts. It thrives in moist, shaded environments and is often found in forest understories. Acanthus ugandensis is valued for its ornamental appeal and has some traditional medicinal uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ugandensis is primarily native to eastern Africa, specifically Uganda and parts of neighboring countries such as Tanzania and Rwanda. It is commonly found in moist, shaded forest understories and along riverbanks in these regions. This species thrives in humid, tropical climates with high rainfall. It is often associated with secondary growth areas and disturbed habitats. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acanthus ugandensis was mainly introduced to gardens and horticultural collections due to its ornamental value and unique foliage. It is often cultivated for its striking leaves and potential flowering, making it a popular choice among plant enthusiasts. Although native to Uganda, it has been introduced to various regions with suitable climates for its growth. Its introduction has been primarily through intentional planting by gardeners and botanic institutions. However, it is not widely naturalized in the wild outside its native range."
}
