{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax stenophyllus f. angustissimus",
    "plant_slug": "acanthopanax-stenophyllus-f-angustissimus",
    "plant_name_scientific": "acanthopanax stenophyllus f. angustissimus",
    "intro": "Acanthopanax stenophyllus f. angustissimus, commonly known as the narrow-leafed Chinese angel's trumpet, is a variant of the Acanthopanax stenophyllus species. It is a climbing shrub native to eastern Asia, particularly China, where it thrives in forested areas. The plant is characterized by its slender, elongated leaves and clusters of small, yellowish-green flowers. It produces small, red berries that are often consumed by birds and other wildlife. This fern-like plant is valued for its ornamental appeal and ecological importance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax stenophyllus f. angustissimus is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. This plant thrives in temperate climates and is commonly found in forested areas at high altitudes. It is particularly associated with the Korean Peninsula and parts of northern China. The species is adapted to cool, moist environments and often grows in rocky or well-drained soils. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acanthopanax stenophyllus f. angustissimus was mainly introduced to regions with temperate climates and well-drained soils, particularly in eastern Asia. It thrives in forested areas and is commonly found in mountainous regions. This distribution is likely due to its adaptation to specific environmental conditions and historical dispersal patterns. The plant is often used in traditional medicine and has ecological significance in its native habitats. Its introduction to new areas is typically associated with human activity and trade."
}
