{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kuramense",
    "plant_slug": "acantholimon-kuramense",
    "plant_name_scientific": "acantholimon kuramense",
    "intro": "Acantholimon kuramense, commonly known as the Kuram sandwort, is a flowering plant native to the high-altitude regions of the Caucasus, particularly in Georgia. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy, often pink or white flowers. The plant is characterized by its low-growing, mat-forming habit with small, fleshy leaves adapted to arid conditions. It produces clusters of delicate, bell-shaped flowers that bloom in the summer months. Acantholimon kuramense is of interest to botanists due to its unique adaptations to its harsh, mountainous environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon kuramense"
    },
    "taxonomy_art_desc": "Acantholimon kuramense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with distinctive flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon kuramense, a specific plant native to certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kuramense is primarily native to Tajikistan. It is found in the mountainous regions of the country, particularly in the eastern and southern parts. This plant typically grows in rocky and gravelly soils at higher altitudes. It is adapted to the cold and arid conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in Tajikistan.",
    "distribution_introduced_art_desc": "Acantholimon kuramense was mainly introduced to areas with well-drained soils and moderate to high elevations, typically found in mountainous regions. It thrives in environments with cool summers and cold winters, making it suitable for alpine and subalpine habitats. This plant is often found in rocky or gravelly soils, where it can anchor itself and access nutrients. Its introduction has been noted in parts of Turkey, particularly in the Kuramos region, where it has adapted to local climatic conditions. Due to its specific habitat requirements, it is not commonly found outside of these introduced areas."
}
