{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon calvertii var. glabrum",
    "plant_slug": "acantholimon-calvertii-var-glabrum",
    "plant_name_scientific": "acantholimon calvertii var. glabrum",
    "intro": "Acantholimon calvertii var. glabrum, commonly known as the smooth sand-verbena, is a flowering plant native to the southwestern United States. It is characterized by its low, mat-forming growth habit and produces small, blue to purple flowers. The plant has smooth, glabrous foliage, which distinguishes it from other varieties in the genus. It thrives in well-drained, sandy soils and is adapted to arid environments. This species is often found in desert scrub and grassland habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon calvertii"
    },
    "taxonomy_art_desc": "Acantholimon calvertii var. glabrum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants characterized by their complex floral structures and diverse evolutionary adaptations. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert-adapted species. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, often found in arid environments. Its genus is Acantholimon, a group of flowering plants typically characterized by their succulent leaves and showy flowers. Its species is Acantholimon calvertii, a specific type of plant known for its distinctive morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon calvertii var. glabrum is primarily native to Turkey. This plant is found in specific regions of Turkey, particularly in areas with suitable arid or semi-arid conditions. It is adapted to the local climate and soil types prevalent in its native habitat. The species is part of the Caryophyllaceae family and is known for its hardy nature. Its native distribution is limited to Turkey, where it thrives in specific ecological niches.",
    "distribution_introduced_art_desc": "Acantholimon calvertii var. glabrum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It thrives in environments where there is minimal competition from native vegetation. This plant is often found in disturbed soils, such as those near roadsides or in open fields. Its introduction has been associated with human activities, including landscaping and land development. However, it is considered a non-native species and may have limited ecological impact in its introduced range."
}
