{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis carduifolia",
    "plant_slug": "acanthopsis-carduifolia",
    "plant_name_scientific": "acanthopsis carduifolia",
    "intro": "Acanthopsis carduifolia, commonly known as the woolly thistle, is a flowering plant native to southern Africa. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant features dense, woolly foliage that helps it retain moisture in arid environments. Its flowers are typically purple or pink, and they bloom in spring and early summer. Acanthopsis carduifolia is often found in rocky or sandy soils and is adapted to full sun.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis carduifolia"
    },
    "taxonomy_art_desc": "Acanthopsis carduifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and specialized structures for water transport. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Lamiales, which includes plants with typically showy flowers and often aromatic compounds, such as mint and snapdragons. Its family is Acanthaceae, commonly known as the acanthus family, which includes plants with distinctive bracts and often colorful flowers. Its genus is Acanthopsis, a group of flowering plants typically found in tropical and subtropical regions, characterized by their spiny or toothed leaves. Its species is Acanthopsis carduifolia, a specific plant species within the Acanthaceae family, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis carduifolia is primarily native to the Cape Provinces. This plant is found in the western and southern regions of South Africa. It thrives in rocky and arid environments within these areas. The Cape Provinces are known for their unique biodiversity, and Acanthopsis carduifolia is a part of that ecological richness. It is commonly seen in coastal and mountainous habitats in the region.",
    "distribution_introduced_art_desc": "Acanthopsis carduifolia was mainly introduced to regions with Mediterranean climates, characterized by dry summers and mild, wet winters. It thrives in rocky or gravelly soils and is often found in disturbed areas such as roadsides and abandoned fields. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to ecological concerns in parts of California and other Mediterranean-type ecosystems. Proper management is essential to prevent its spread and mitigate its impact on local biodiversity."
}
