{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax brachypus",
    "plant_slug": "acanthopanax-brachypus",
    "plant_name_scientific": "acanthopanax brachypus",
    "intro": "Acanthopanax brachypus, commonly known as the short-stemmed Chinese angel's trumpet, is a climbing shrub native to East Asia. It is characterized by its compound leaves, which are typically arranged alternately along the stems. The plant produces small, yellowish-green flowers that bloom in clusters, followed by red or orange berries. It thrives in temperate climates and is often found in forested areas. Due to its ornamental value, it is occasionally cultivated in gardens, though it can be invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax brachypus is primarily native to East Asia, including China, Korea, and Japan. It thrives in temperate forest regions, often growing in mountainous areas with well-drained soil. This plant is commonly found in regions with a humid climate and partial shade. It is particularly prevalent in the northern parts of China, such as Heilongjiang, Jilin, and Liaoning provinces. Its natural habitat includes mixed deciduous and coniferous forests, where it contributes to the local biodiversity.",
    "distribution_introduced_art_desc": "Acanthopanax brachypus was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed areas, including roadsides, waste grounds, and forest edges. The plant thrives in a variety of soil types and can tolerate partial to full sunlight. Its rapid growth and adaptability have led to its establishment in regions beyond its native range. Due to its invasive potential, it is often monitored in ecological studies to assess its impact on local flora."
}
