{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum stewartii",
    "plant_slug": "acanthophyllum-stewartii",
    "plant_name_scientific": "acanthophyllum stewartii",
    "intro": "Acanthophyllum stewartii, commonly known as Stewart's spiny saxifrage, is a low-growing, mat-forming perennial plant native to arid and semi-arid regions of the western United States. It has succulent, spiny stems and leaves that help it retain water in harsh, dry environments. The plant produces small, pink to white flowers during the summer months, which attract pollinators such as bees and butterflies. Its root system is extensive, allowing it to anchor itself in rocky or sandy soils. Acanthophyllum stewartii plays a crucial role in stabilizing soil and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum stewartii is primarily native to the arid and semi-arid regions of western North America. It is found in states such as Nevada, Utah, Arizona, and New Mexico. This plant typically grows in sandy or gravelly soils within desert environments. It is well adapted to harsh conditions with limited water availability. Its distribution is closely tied to specific ecological niches in the Great Basin and Mojave Desert areas.",
    "distribution_introduced_art_desc": "Acanthophyllum stewartii was mainly introduced to arid and semi-arid regions of the western United States, particularly in states like Nevada, Utah, and Arizona. It is commonly found in sandy soils and is often associated with shrublands and grasslands. This plant is adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing soil and preventing erosion in these ecosystems. However, its introduction has raised concerns about its potential impact on native plant communities."
}
