{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus mollis subsp. mollis",
    "plant_slug": "acanthus-mollis-subsp-mollis",
    "plant_name_scientific": "acanthus mollis subsp. mollis",
    "intro": "Acanthus mollis subsp. mollis, commonly known as the woolly acanthus, is a perennial herbaceous plant native to southern Europe and western Asia. It is characterized by its large, heart-shaped leaves that are covered in a dense layer of soft, white, woolly hairs. The plant produces tall spikes of violet or purple flowers in the summer months. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Its distinctive appearance and hardy nature make it a valuable addition to both garden landscapes and natural habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus mollis"
    },
    "taxonomy_art_desc": "Acanthus mollis subsp. mollis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages and is distinguished by their diverse floral structures. Its order is Lamiales, a group of flowering plants that includes many economically important species such as mint and snapdragons, characterized by their bilaterally symmetric flowers. Its family is Acanthaceae, commonly known as the spurred orchid family, which includes a variety of ornamental and medicinal plants. Its genus is Acanthus, a group of flowering plants known for their distinctive, spiny leaves and showy flowers, often used in horticulture. Its species is Acanthus mollis, a specific variety within the genus Acanthus, characterized by its soft, velvety leaves and clusters of blue or purple flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "East Aegean Is.",
        "Greece",
        "Italy",
        "Lebanon-Syria",
        "NW. Balkan Pen.",
        "Sardegna",
        "Sicilia",
        "Türkey",
        "Türkey-in-Europe"
    ],
    "distribution_introduced": [
        "Azores",
        "Baleares",
        "California",
        "Canary Is.",
        "Corse",
        "France",
        "Germany",
        "Great Britain",
        "Ireland",
        "Kriti",
        "Madeira",
        "Mexico Central",
        "Morocco",
        "New South Wales",
        "New Zealand North",
        "New Zealand South",
        "Portugal",
        "South Australia",
        "Spain",
        "Tasmania",
        "Victoria"
    ],
    "distribution_native_art_desc": "Acanthus mollis subsp. mollis is primarily native to the East Aegean Is., Greece, Italy, Lebanon-Syria, NW. Balkan Pen., Sardegna, Sicilia, Türkey, and Türkey-in-Europe. This plant thrives in coastal and rocky habitats across these regions. It is commonly found in areas with mild climates and well-drained soils. Its native range includes the Mediterranean Basin, where it has adapted to a variety of microhabitats. The subspecies is known for its ornamental value and is often used in horticulture.",
    "distribution_introduced_art_desc": "Acanthus mollis subsp. mollis was mainly introduced to Azores, Baleares, California, Canary Is., Corse, France, Germany, Great Britain, Ireland, Kriti, Madeira, Mexico Central, Morocco, New South Wales, New Zealand North, New Zealand South, Portugal, South Australia, Spain, Tasmania, and Victoria. It has been established in various regions across Europe, North America, and Oceania. The plant is often found in coastal and urban environments due to its adaptability. It is commonly cultivated as an ornamental species in gardens and public spaces. Its introduction has led to its naturalization in many of these regions."
}
