{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon × baubaschatense",
    "plant_slug": "acantholimon-×-baubaschatense",
    "plant_name_scientific": "acantholimon × baubaschatense",
    "intro": "Acantholimon × baubaschatense, commonly known as the hybrid stonecress, is a perennial plant belonging to the family Brassicaceae. It is a naturally occurring hybrid between *Acantholimon baubaschat* and *Acantholimon sibiricum*, exhibiting a mix of characteristics from both parent species. The plant typically grows in rocky or gravelly soils, preferring sunny to partially shaded environments. It produces small, clustered flowers that are usually pink or purple, blooming in late spring to early summer. Its foliage consists of narrow, gray-green leaves that are often covered in a fine layer of wax, aiding in water retention in arid conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon × baubaschatense"
    },
    "taxonomy_art_desc": "Acantholimon × baubaschatense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive floral morphology and often contains plants adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often contains species with medicinal or ornamental value. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon × baubaschatense, a hybrid plant resulting from the cross between two species of Acantholimon, often exhibiting traits from both parent species.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon × baubaschatense is primarily native to Kirgizstan. This plant is typically found in the mountainous regions of the country, where it thrives in rocky and semi-arid environments. It is often associated with alpine and subalpine habitats, growing at higher elevations. The species is part of the Caryophyllaceae family and is known for its distinctive floral characteristics. Due to its limited distribution, it is considered a rare and endemic plant in Kirgizstan.",
    "distribution_introduced_art_desc": "Acantholimon × baubaschatense was mainly introduced to regions with temperate climates and well-drained soils, particularly in parts of Europe and North America. It is often found in disturbed areas such as roadsides, fields, and along riverbanks. This hybrid plant is known for its tolerance to harsh environmental conditions, including drought and poor soil quality. Its introduction has been associated with human activities such as agriculture and landscaping. However, its spread has raised concerns about potential impacts on native plant communities in non-native regions."
}
