{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon armenum",
    "plant_slug": "acantholimon-armenum",
    "plant_name_scientific": "acantholimon armenum",
    "intro": "Acantholimon armenum, commonly known as Armenian sandthorn, is a perennial herb native to the mountainous regions of Armenia and Turkey. It belongs to the Plumbagaceae family and is characterized by its spiny stems and small, clustered flowers. The plant typically grows in rocky or sandy soils and is adapted to arid or semi-arid environments. Its leaves are often covered in a fine layer of white wax, which helps reduce water loss. Acantholimon armenum is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon armenum"
    },
    "taxonomy_art_desc": "Acantholimon armenum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes species with a variety of growth forms and often have specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and specialized leaves. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon armenum, a specific plant species native to certain regions, distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iraq",
        "Lebanon-Syria",
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon armenum is primarily native to Iraq, Lebanon-Syria, Transcaucasus, and Turkey. This plant is commonly found in rocky and arid environments across these regions. It thrives in mountainous and semi-desert areas, often growing on limestone substrates. Its distribution reflects its adaptation to the Mediterranean and adjacent climates. The species is of particular interest due to its limited range and ecological significance in these areas.",
    "distribution_introduced_art_desc": "Acantholimon armenum was mainly introduced to areas with well-drained soils and full to partial sunlight, typically in dry to semi-arid environments. It thrives in regions with moderate temperatures and low humidity, making it suitable for cultivation in Mediterranean climates. This plant is often found in rocky or gravelly soils, where it can establish itself along slopes or in disturbed areas. Its introduction has been noted in several regions outside its native range, including parts of North America and Australia. Due to its hardy nature, it is sometimes used in xeriscaping and as a drought-tolerant ornamental plant."
}
