{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax septemlobus var. maximowiczii",
    "plant_slug": "acanthopanax-septemlobus-var-maximowiczii",
    "plant_name_scientific": "acanthopanax septemlobus var. maximowiczii",
    "intro": "Acanthopanax septemlobus var. maximowiczii, commonly known as the Chinese arrowroot or giant devil's ivy, is a climbing shrub native to China. It features compound leaves with seven lobes, giving it a distinctive appearance. The plant produces small, greenish-yellow flowers that are followed by red berries. It thrives in moist, shaded environments and is often found in mountainous regions. Its botanical characteristics make it a popular choice for ornamental gardening and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax septemlobus var. maximowiczii is primarily native to eastern Asia, specifically China, Korea, and Russia. It is commonly found in the temperate regions of these countries, particularly in the northeastern parts of China such as Heilongjiang and Jilin provinces. This plant thrives in forested areas and mountainous regions, often growing in mixed deciduous and coniferous forests. It is adapted to cool climates and is often associated with moist, well-drained soils. The species is also known to occur in the Korean Peninsula and the Russian Far East, where it is part of the local flora.",
    "distribution_introduced_art_desc": "Acanthopanax septemlobus var. maximowiczii was mainly introduced to areas with temperate climates and well-drained soils, often found in forested regions. It is commonly distributed in parts of East Asia, including China, Korea, and Japan. This plant thrives in shaded to semi-shaded environments, making it suitable for understory growth in natural forests. Its introduction has been associated with both natural dispersal and human activities such as horticulture and landscaping. Due to its adaptability, it has become established in several regions beyond its native range."
}
