{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpus canaliculatus",
    "plant_slug": "acanthocarpus-canaliculatus",
    "plant_name_scientific": "acanthocarpus canaliculatus",
    "intro": "Acanthocarpus canaliculatus, commonly known as the narrow-ridged acanthocarp, is a flowering plant native to southern Africa. It is a member of the Fabaceae family, characterized by its compound leaves and pod fruits. The plant typically grows in open woodland and grassland habitats, thriving in well-drained soils. Its small, yellow flowers are followed by narrow, ribbed pods that contain several seeds. The species is often used in traditional medicine and for forage in livestock grazing.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Asparagaceae",
        "genus": "Acanthocarpus",
        "species": "Acanthocarpus canaliculatus"
    },
    "taxonomy_art_desc": "Acanthocarpus canaliculatus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, characterized by their complex flower structures and varied habitats. Its order is Asparagales, a large group of flowering plants that includes many ornamental and edible plants, such as orchids and onions, and is known for its diverse morphology. Its family is Asparagaceae, a family of flowering plants that includes grasses, lilies, and asparagus, known for their fibrous roots and often showy flowers. Its genus is Acanthocarpus, a group of flowering plants characterized by their spiny fruits and often used in horticulture and ornamental gardening. Its species is Acanthocarpus canaliculatus, a specific type of plant within the genus Acanthocarpus, known for its distinctive features and specific ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpus canaliculatus is primarily native to Western Australia. It is found in various regions across the state, including the coastal and inland areas. This plant typically grows in sandy soils and is often associated with open habitats such as woodlands and heathlands. It is well adapted to the dry and variable climatic conditions of the region. Its distribution reflects its ecological preference for well-drained soils and full sun exposure.",
    "distribution_introduced_art_desc": "Acanthocarpus canaliculatus was mainly introduced to control erosion and for forage production in degraded lands. It is commonly found in disturbed areas such as roadsides, fields, and along riverbanks. This plant thrives in tropical and subtropical climates with well-drained soils. Its rapid growth and ability to establish dense stands make it effective for soil stabilization. However, it can become invasive in some regions if not managed properly."
}
