{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthospermum leptolobum",
    "plant_slug": "acanthospermum-leptolobum",
    "plant_name_scientific": "acanthospermum leptolobum",
    "intro": "Acanthospermum leptolobum, commonly known as slender thornweed, is a flowering plant native to tropical and subtropical regions of the Americas. It is a member of the Asteraceae family, characterized by its composite flower heads and distinctive bracts. The plant typically grows as an annual herb with hairy stems and small, greenish-yellow flowers. Its leaves are alternate, ovate to lanceolate, and often have glandular dots. Acanthospermum leptolobum is often found in disturbed soils and can thrive in a variety of environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthospermum leptolobum is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is commonly found in grasslands, open woodlands, and disturbed habitats. This plant thrives in areas with well-drained soils and full sun exposure. It is also occasionally reported in parts of southern Asia, including India and Sri Lanka. Its distribution is closely linked to its adaptability to arid and semi-arid environments.",
    "distribution_introduced_art_desc": "Acanthospermum leptolobum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and degraded lands. It thrives in tropical and subtropical regions due to its adaptability to various soil types and its ability to tolerate drought. This plant is often found in regions with warm climates and low to moderate rainfall. Its introduction has led to its establishment in several invasive plant lists in parts of the Americas. It is considered a problematic species in some areas due to its rapid growth and competitive nature."
}
