{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon chlorostegium",
    "plant_slug": "acantholimon-chlorostegium",
    "plant_name_scientific": "acantholimon chlorostegium",
    "intro": "Acantholimon chlorostegium, commonly known as the silverleaf saxifrage, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Montiaceae and is characterized by its succulent, silver-gray foliage that reflects sunlight. The plant produces small, white or pale blue flowers clustered in dense inflorescences during the summer months. It thrives in arid and rocky habitats, demonstrating remarkable drought tolerance. Due to its unique appearance and ecological significance, it is often of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon chlorostegium"
    },
    "taxonomy_art_desc": "Acantholimon chlorostegium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species adapted to various environmental conditions. Its genus is Acantholimon, a group of flowering plants typically found in arid and coastal regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon chlorostegium, a specific plant within the genus Acantholimon, known for its distinctive greenish-white flowers and its ability to thrive in saline or coastal environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon chlorostegium is primarily native to Iran. It is found in the arid and semi-arid regions of the country. This plant typically grows in rocky or gravelly soils. It is adapted to the harsh climate conditions of its native habitat. Its distribution is limited to specific areas within Iran where the environmental conditions are suitable.",
    "distribution_introduced_art_desc": "Acantholimon chlorostegium was mainly introduced to areas with dry, rocky soils and moderate climates, often as an ornamental plant or for erosion control. It is commonly found in regions such as California, Oregon, and parts of the Pacific Northwest in the United States. This plant has adapted well to disturbed sites and can thrive in full sun to partial shade. Its introduction has led to its establishment in both natural and cultivated landscapes. However, it is considered a non-native species and may have limited ecological impact in its new environment."
}
