{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax japonicus f. kiusianus",
    "plant_slug": "acanthopanax-japonicus-f-kiusianus",
    "plant_name_scientific": "acanthopanax japonicus f. kiusianus",
    "intro": "Acanthopanax japonicus f. kiusianus, commonly known as the Kiusianus Chinese five-leaf, is a variant of the Chinese five-leaf plant native to East Asia. It is characterized by its distinctive five-lobed leaves and branched, woody stems. The plant typically grows in temperate regions and is often found in forested areas. It produces small, greenish-yellow flowers followed by red berries that attract various wildlife. This plant is valued for its ornamental qualities and has been used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax japonicus f. kiusianus is primarily native to the Korean Peninsula, including parts of South Korea and North Korea. It is also found in southern and central regions of Japan, particularly in Honshu, Shikoku, and Kyushu. This plant typically grows in forested areas, often in mountainous regions with humid climates. It is commonly associated with secondary growth and disturbed habitats. Its distribution is limited to these specific geographic areas within East Asia.",
    "distribution_introduced_art_desc": "Acanthopanax japonicus f. kiusianus was mainly introduced to regions with temperate climates, particularly in East Asia, where it thrives in moist, shaded environments. This variant is often cultivated for its ornamental value due to its unique foliage and growth habits. It has been introduced to gardens and greenhouses in countries such as Japan, Korea, and parts of China. The plant is also occasionally found in botanical collections and conservation areas. Its introduction has been largely driven by horticultural interest rather than natural spread."
}
