{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax nikaianus",
    "plant_slug": "acanthopanax-nikaianus",
    "plant_name_scientific": "acanthopanax nikaianus",
    "intro": "Acanthopanax nikaianus, commonly known as the Nikaians' spurge, is a woody shrub native to the Korean Peninsula. It is characterized by its compound leaves with serrated edges and small, yellowish-green flowers that appear in clusters. The plant produces small, berry-like fruits that are typically red when mature. It thrives in moist, shaded environments and is often found in forest understories. Due to its ornamental value and medicinal potential, it is occasionally cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax nikaianus is primarily native to the Korean Peninsula, including South Korea and North Korea. It is also found in parts of eastern China, particularly in the provinces of Liaoning and Jilin. This plant typically grows in forested areas, often in temperate climates with well-drained soil. It is commonly associated with mountainous regions and is often found in secondary growth forests. Its distribution is limited to these specific geographic areas, making it a regionally significant species in East Asia.",
    "distribution_introduced_art_desc": "Acanthopanax nikaianus was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed areas like roadsides, urban environments, and abandoned fields. This plant has adapted well to a variety of soil types and can thrive in both full sun and partial shade. Its rapid growth and ability to spread through vegetative propagation make it a potential invasive species in some regions. However, its impact on native ecosystems varies depending on local environmental conditions."
}
