{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon breviscapum",
    "plant_slug": "acantholimon-breviscapum",
    "plant_name_scientific": "acantholimon breviscapum",
    "intro": "Acantholimon breviscapum, commonly known as the short-stemmed thornscale, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Plumbagaceae and is characterized by its low-growing, mat-forming habit. The plant produces small, blue to purple flowers that bloom in summer, attracting pollinators such as bees and butterflies. Its leaves are typically narrow and covered in fine hairs, adapted to reduce water loss in arid environments. Acantholimon breviscapum is often found in rocky soils and is well-suited to harsh, high-altitude conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon breviscapum is primarily native to the Mediterranean region, particularly in parts of southern Europe, North Africa, and the Middle East. It is commonly found in rocky habitats, coastal areas, and dry, sandy soils. This plant thrives in regions with mild, wet winters and hot, dry summers. It is often associated with limestone and gravelly substrates. Its distribution includes countries such as Spain, Portugal, Morocco, and parts of Turkey.",
    "distribution_introduced_art_desc": "Acantholimon breviscapum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in coastal dunes and sandy soils, where it thrives in dry conditions. This plant is often cultivated as an ornamental due to its attractive, compact growth habit and drought tolerance. It has been introduced to various regions outside its native range, including parts of the United States and Australia. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
