{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium macrum",
    "plant_slug": "acanthodium-macrum",
    "plant_name_scientific": "acanthodium macrum",
    "intro": "Acanthodium macrum, commonly known as the rough acanthodium, is a species of flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its distinctive, spiny bracts that enclose its small, showy flowers. The plant typically grows in rocky or sandy soils and thrives in full sun conditions. Its foliage consists of narrow, lance-shaped leaves that are often covered in fine hairs. Acanthodium macrum is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium macrum is primarily native to the southern United States, particularly Texas and New Mexico. It thrives in arid and semi-arid environments, often found in rocky soils and open grasslands. This plant is commonly associated with limestone and sandy soils in these regions. It is well adapted to the harsh climatic conditions of its native habitat. Due to its specific environmental requirements, it is not found outside of its native range.",
    "distribution_introduced_art_desc": "Acanthodium macrum was mainly introduced to new habitats through human activity, such as landscaping and horticultural trade. It thrives in disturbed soils and is commonly found in urban and suburban areas. This plant has spread rapidly in regions with mild climates and adequate moisture. Its introduction has led to concerns about its impact on native plant communities. However, further research is needed to fully understand its ecological effects."
}
