{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophoenix rousselii",
    "plant_slug": "acanthophoenix-rousselii",
    "plant_name_scientific": "acanthophoenix rousselii",
    "intro": "Acanthophoenix rousselii, commonly known as the Socotra palm, is a unique species native to the island of Socotra in the Arabian Sea. It is characterized by its distinctive, spiny leaves and a slender, unbranched trunk that can grow up to 15 meters tall. The plant has a slow growth rate and is adapted to the arid and rocky environment of its native habitat. Its leaves are feather-like and can reach lengths of up to three meters, providing shade and reducing water loss. The Socotra palm is also notable for its unusual fruit, which contains a single seed surrounded by a fibrous pulp.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Arecales",
        "family": "Arecaceae",
        "genus": "Acanthophoenix",
        "species": "Acanthophoenix rousselii"
    },
    "taxonomy_art_desc": "Acanthophoenix rousselii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct vascular system and the ability to perform photosynthesis. Its class is Equisetopsida, which consists of ferns and horsetails, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Arecales, which comprises palm-like plants with a single trunk and large, compound leaves. Its family is Arecaceae, commonly known as the palm family, characterized by their tall, unbranched stems and large, fan-shaped or feather-like leaves. Its genus is Acanthophoenix, a group of palms typically found in tropical regions, distinguished by their spiny leaves and robust growth habits. Its species is Acanthophoenix rousselii, a specific type of palm native to Madagascar, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Réunion"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophoenix rousselii is primarily native to Réunion. This palm species is found in the tropical region of Réunion, which is an island in the Indian Ocean. It thrives in the humid and warm climate of the island, typically in forested areas. The plant is well adapted to the local environmental conditions, including its unique geology and biodiversity. It plays an important role in the local ecosystem and is a characteristic species of the island's flora.",
    "distribution_introduced_art_desc": "Acanthophoenix rousselii was mainly introduced to areas with warm, tropical climates where it can thrive in well-drained soils. It is commonly found in regions with high humidity and moderate to high rainfall. This plant is often cultivated in gardens and landscapes for its ornamental value due to its palm-like appearance. It prefers full sun exposure and is relatively drought-tolerant once established. However, it may require careful management to prevent it from becoming invasive in certain environments."
}
