{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ekimii",
    "plant_slug": "acantholimon-ekimii",
    "plant_name_scientific": "acantholimon ekimii",
    "intro": "Acantholimon ekimii, commonly known as the Armenian thimbleweed, is a perennial herbaceous plant native to the mountainous regions of Armenia. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming structure with dense clusters of small, blue to purple flowers. The plant features hairy stems and leaves that are typically narrow and linear, adapted to withstand arid and rocky environments. It thrives in well-drained soils and is often found in alpine and subalpine habitats. Due to its limited distribution and specific ecological requirements, Acantholimon ekimii is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ekimii"
    },
    "taxonomy_art_desc": "Acantholimon ekimii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, a group of vascular plants that includes ferns and their relatives, characterized by their spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species adapted to various habitats. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon ekimii, a specific plant species within the genus Acantholimon, native to Turkey, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ekimii is primarily native to Transcaucasus and Turkey. This plant is found in the mountainous regions of these areas, where it thrives in rocky and dry environments. It is commonly associated with steppe and semi-arid habitats. The species is well adapted to the harsh climate conditions of its native range. Its distribution is limited to specific localities within these regions.",
    "distribution_introduced_art_desc": "Acantholimon ekimii was mainly introduced to areas with well-drained soils and full sun exposure, typically found in arid or semi-arid regions. It is commonly found in disturbed sites such as roadsides, fields, and along fences. This plant is often used for erosion control due to its hardy nature and ability to thrive in poor soil conditions. It has also been introduced as an ornamental plant in some regions for its attractive foliage. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
