{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon damassanum var. lancibracteatum",
    "plant_slug": "acantholimon-damassanum-var-lancibracteatum",
    "plant_name_scientific": "acantholimon damassanum var. lancibracteatum",
    "intro": "Acantholimon damassanum var. lancibracteatum, commonly known as the narrow-bracted sandthrift, is a flowering plant native to the Mediterranean region. It is a member of the Plumbagaceae family and is characterized by its low-growing, mat-forming habit. The plant features linear, succulent leaves and produces small, blue to purple flowers in late spring. It thrives in sandy or gravelly soils and is often found in coastal or inland dunes. Due to its hardy nature, it is sometimes cultivated in gardens for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon damassanum var. lancibracteatum is primarily native to the coastal regions of southern California, particularly in the counties of San Diego and Orange. It thrives in sandy or gravelly soils along the shoreline, often found in dunes or near the base of coastal cliffs. This variety is well adapted to the Mediterranean climate of the region, characterized by mild, wet winters and hot, dry summers. It is commonly found in habitats such as beachscapes and coastal scrub. Due to its limited range, it is considered a rare and endemic species within its native area.",
    "distribution_introduced_art_desc": "Acantholimon damassanum var. lancibracteatum was mainly introduced to the Pacific Northwest region of the United States. It was brought in during the early 20th century as part of botanical collections and horticultural introductions. This variety is characterized by its distinctive lance-shaped bracts and is often cultivated for its ornamental value. It has since become naturalized in some areas, particularly in disturbed soils and along roadsides. However, its spread is limited compared to other introduced plant species in the region."
}
