{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium thailandica",
    "plant_slug": "acanthophippium-thailandica",
    "plant_name_scientific": "acanthophippium thailandica",
    "intro": "Acanthophippium thailandica, commonly known as the Thai thorned milkweed, is a flowering plant native to Southeast Asia, particularly Thailand. It belongs to the Apocynaceae family and is characterized by its woody stems and milky sap. The plant produces showy, trumpet-shaped flowers that are typically pink or red in color. It thrives in tropical and subtropical climates, often found in moist, well-drained soils. Due to its ornamental value and ecological importance, it is sometimes cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium thailandica is primarily native to the tropical and subtropical regions of Southeast Asia, particularly Thailand. It is commonly found in lowland forests and secondary growth areas within the country. This plant thrives in humid climates with well-drained soil, often growing near riverbanks or in shaded undergrowth. Its natural range extends into parts of Malaysia and Indonesia, where similar environmental conditions exist. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Acanthophippium thailandica was mainly introduced to regions with tropical and subtropical climates, where it thrives in moist, well-drained soils. It is commonly found in areas with high humidity and partial shade, making it suitable for cultivation in gardens and greenhouses. This plant is often used for ornamental purposes due to its attractive foliage and unique growth habit. Its introduction has been noted in several countries in Southeast Asia, including Thailand, Malaysia, and Indonesia. However, its spread outside its native range is limited due to specific environmental requirements."
}
