{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum myrianthum",
    "plant_slug": "acanthophyllum-myrianthum",
    "plant_name_scientific": "acanthophyllum myrianthum",
    "intro": "Acanthophyllum myrianthum, commonly known as the many-flowered acanthophyllum, is a flowering plant native to arid and semi-arid regions of Central Asia. It is a shrub-like plant characterized by its dense, spiny foliage and compact growth habit. The plant produces small, yellowish flowers arranged in clusters, which bloom during the summer months. It is well adapted to harsh environments, with deep roots and water-storing tissues. This species plays a role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum myrianthum"
    },
    "taxonomy_art_desc": "Acanthophyllum myrianthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species such as roses and magnolias. Its order is Caryophyllales, which consists of flowering plants that often have specialized adaptations for arid environments. Its family is Caryophyllaceae, known as the carnation family, which includes many flowering plants with showy flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions and characterized by their spiny or thorny structures. Its species is Acanthophyllum myrianthum, a specific type of plant within this genus known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum myrianthum is primarily native to Afghanistan. It is commonly found in arid and semi-arid regions of the country. This plant thrives in rocky and sandy soils, often in mountainous areas. It plays an important role in stabilizing soil and preventing erosion in its native habitat. Its distribution is limited to specific ecological niches within Afghanistan.",
    "distribution_introduced_art_desc": "Acanthophyllum myrianthum was mainly introduced to arid and semi-arid regions of central Asia, including parts of Kazakhstan, Mongolia, and western China. It is commonly found in sandy or gravelly soils, often in steppe and desert steppe ecosystems. This plant is well adapted to harsh environmental conditions, such as high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion in these areas. However, its introduction has raised concerns about its potential impact on native vegetation in some regions."
}
