{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon scorpioideum",
    "plant_slug": "acantholimon-scorpioideum",
    "plant_name_scientific": "acantholimon scorpioideum",
    "intro": "Acantholimon scorpioideum, commonly known as the scorpion's tail stonecrop, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy leaves that help it conserve water in dry environments. The plant produces small, clustered flowers that are typically pink or purple, adding a delicate touch to its rocky habitat. It thrives in well-drained soils and is often found in mountainous or semi-desert areas. Due to its unique appearance and adaptations, it is a valuable species for ecological studies in arid ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon scorpioideum is primarily native to the arid and semi-arid regions of central and southern Europe, particularly in the Mediterranean Basin. It is found in countries such as Spain, France, Italy, and parts of Greece. This plant thrives in rocky soils and open landscapes, often growing in scrublands and along coastal areas. Its distribution is closely tied to specific microclimates that provide the necessary conditions for its survival. It is a member of the Plumbagaceae family and is known for its drought-resistant adaptations.",
    "distribution_introduced_art_desc": "Acantholimon scorpioideum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, gravelly slopes, and disturbed agricultural lands. It thrives in arid to semi-arid environments and is commonly found in regions with low precipitation and high solar exposure. This plant is often spread through human activity, including transportation and land development, which facilitate its colonization of new areas. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
