{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis carduifolia var. glabra",
    "plant_slug": "acanthopsis-carduifolia-var-glabra",
    "plant_name_scientific": "acanthopsis carduifolia var. glabra",
    "intro": "Acanthopsis carduifolia var. glabra, commonly known as the smooth thornweed, is a flowering plant native to southern Africa. It belongs to the Asteraceae family, characterized by its composite flower heads. The plant features slender, branching stems covered with soft, hairless foliage. Its small, yellow flowers are typically arranged in dense clusters, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and is often found in open grasslands and rocky areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis carduifolia var. glabra is primarily native to the Mediterranean Basin, including regions such as southern Europe, North Africa, and western Asia. It thrives in dry, rocky, and often sunny habitats, commonly found in scrublands and coastal areas. This plant is well adapted to arid and semi-arid climates, which are characteristic of its native range. It is particularly common in countries like Spain, France, and parts of Turkey. Its distribution is closely linked to limestone soils and open vegetation types typical of the Mediterranean ecosystem.",
    "distribution_introduced_art_desc": "Acanthopsis carduifolia var. glabra was mainly introduced to New Zealand. It was first recorded in the 19th century and has since spread across various regions of the country. The plant is commonly found in coastal areas and disturbed soils, often outcompeting native vegetation. Its introduction is believed to have occurred through accidental means, such as seed transport on maritime vessels. Due to its invasive nature, it is now considered a weed in many parts of New Zealand."
}
