{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon glumaceum var. sahandicum",
    "plant_slug": "acantholimon-glumaceum-var-sahandicum",
    "plant_name_scientific": "acantholimon glumaceum var. sahandicum",
    "intro": "Acantholimon glumaceum var. sahandicum, commonly known as the Sahand sandmat, is a flowering plant native to the mountainous regions of northern Iran. It is a low-growing perennial herb characterized by its dense, mat-forming growth habit and hairy stems. The plant produces small, greenish-white flowers arranged in clusters, which bloom in late spring to early summer. Its leaves are narrow, linear, and often covered with fine hairs, adapting to the arid and rocky environments it inhabits. This variety is notable for its ecological role in stabilizing soils in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon glumaceum var. sahandicum is primarily native to the eastern part of the Caspian Sea region, including parts of southern Russia and northern Iran. This plant is typically found in arid and semi-arid environments, such as steppe and rocky slopes. It thrives in well-drained soils and is adapted to the harsh climatic conditions of its native habitat. The species is commonly observed in areas with low precipitation and high sunlight exposure. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acantholimon glumaceum var. sahandicum was mainly introduced to areas with well-drained soils and full to partial sunlight, typically found in rocky or gravelly habitats. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and wet winters. This plant thrives in environments with low moisture retention and is often seen in disturbed or open areas. It is particularly adapted to withstand periods of drought and can tolerate light foot traffic. Its introduction has been noted in several regions where it has established itself as a characteristic component of the local flora."
}
