{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon araxanum",
    "plant_slug": "acantholimon-araxanum",
    "plant_name_scientific": "acantholimon araxanum",
    "intro": "Acantholimon araxanum, commonly known as the Araxan stonecress, is a flowering plant native to the arid regions of central Australia. It is a low-growing perennial herb with succulent, fleshy leaves that help it conserve water in its harsh environment. The plant produces small, white or pale pink flowers arranged in clusters, typically blooming in spring. Its root system is extensive, allowing it to access deep groundwater sources. Acantholimon araxanum plays an important role in stabilizing sandy soils and providing habitat for native insects and small animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon araxanum"
    },
    "taxonomy_art_desc": "Acantholimon araxanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with showy flowers and some medicinal uses. Its genus is Acantholimon, a genus of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon araxanum, a specific plant within the genus Acantholimon, known for its adaptations to harsh environments and its unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon araxanum is primarily native to Iran, Transcaucasus, and Turkey. This plant is typically found in arid and semi-arid regions, often growing in rocky or sandy soils. It is commonly associated with mountainous and coastal areas where it can thrive in limited moisture conditions. The species is well adapted to the harsh climates of its native range. Its distribution is limited to these specific geographic areas, reflecting its ecological preferences.",
    "distribution_introduced_art_desc": "Acantholimon araxanum was mainly introduced to areas with well-drained sandy or gravelly soils, typically in coastal or inland dune environments. It thrives in regions with a Mediterranean climate, characterized by dry summers and wet winters. This plant is often found in disturbed or open habitats, such as roadsides, fields, and rocky outcrops. Its introduction has been documented in several regions of southern California and parts of the western United States. Due to its adaptability, it has become a common weed in agricultural and natural landscapes."
}
