{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus dioscoridis var. boissieri",
    "plant_slug": "acanthus-dioscoridis-var-boissieri",
    "plant_name_scientific": "acanthus dioscoridis var. boissieri",
    "intro": "Acanthus dioscoridis var. boissieri, commonly known as the Persian acanthus, is a perennial herbaceous plant native to the Mediterranean region. It features rosettes of lance-shaped, gray-green leaves with a distinctive waxy coating. The plant produces spires of violet-blue flowers in late summer, which are arranged in dense, terminal clusters. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and xeriscaping. Its ornamental value is enhanced by its architectural foliage and showy blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus dioscoridis var. boissieri is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, and Lebanon. It is commonly found in rocky and limestone areas, often growing in dry, sunny environments. This variety is part of the Acanthus genus, which is known for its ornamental leaves and spires of flowers. It is typically found in coastal and mountainous regions, where it thrives in well-drained soils. The plant is considered a hardy species, capable of surviving in harsh climatic conditions.",
    "distribution_introduced_art_desc": "Acanthus dioscoridis var. boissieri was mainly introduced to regions with Mediterranean climates, where it thrives in well-drained soils and full sun. It is commonly found in southern Europe, parts of North Africa, and the Middle East. This plant is often cultivated for its ornamental value due to its striking foliage and floral display. However, it can become invasive in certain areas if not managed properly. Its introduction has raised concerns about its impact on native plant communities in non-native habitats."
}
