{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthostemma kuhlii",
    "plant_slug": "acanthostemma-kuhlii",
    "plant_name_scientific": "acanthostemma kuhlii",
    "intro": "Acanthostemma kuhlii, commonly known as the Kuhli's milkweed, is a flowering plant native to tropical regions of Africa. It belongs to the family Apocynaceae, which includes many species with milky sap. The plant is characterized by its simple, opposite leaves and showy, tubular flowers that are typically pink or purple in color. It thrives in moist, shaded environments and is often found in forest understories. The plant's latex contains toxic compounds, making it unpalatable to most herbivores.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthostemma kuhlii is primarily native to parts of tropical Africa, specifically countries such as Kenya, Tanzania, and Uganda. It is commonly found in the coastal regions and lowland areas with a humid climate. This plant thrives in sandy or loamy soils and is often associated with coastal dunes and open woodlands. It is a member of the Asteraceae family and is known for its distinctive yellow flowers. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthostemma kuhlii was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in disturbed areas, including roadsides and abandoned fields. The plant thrives in tropical and subtropical climates, making it a potential invasive species in certain regions. Its rapid growth and ability to spread through seeds contribute to its successful establishment in non-native environments. However, its impact on local ecosystems is still under study."
}
