{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum minuartioides",
    "plant_slug": "acanthophyllum-minuartioides",
    "plant_name_scientific": "acanthophyllum minuartioides",
    "intro": "Acanthophyllum minuartioides, commonly known as the sandmat, is a flowering plant native to arid regions of Central Asia and the Middle East. It is a low-growing, mat-forming perennial shrub with dense, compact growth that helps it survive in harsh, dry environments. The plant features small, scale-like leaves that reduce water loss and are adapted to minimize exposure to intense sunlight. Its flowers are typically yellow or greenish-yellow, arranged in clusters, and bloom during the spring or early summer. Acanthophyllum minuartioides plays a role in stabilizing sandy soils and is often found in habitats such as dunes and rocky slopes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum minuartioides is primarily native to the arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. It thrives in sandy and gravelly soils, often found in desert steppe and semi-arid environments. This plant is well adapted to harsh climatic conditions, such as low rainfall and extreme temperature fluctuations. It plays an important role in stabilizing dunes and preventing soil erosion in its native habitat. Its distribution is closely linked to specific ecological zones characterized by sparse vegetation and high solar exposure.",
    "distribution_introduced_art_desc": "Acanthophyllum minuartioides was mainly introduced to arid and semi-arid regions of central Asia, particularly in Kazakhstan, Mongolia, and western China. It is commonly found in sandy soils and gravelly plains, where it forms dense, low-growing shrubs. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion in its native habitat. However, its introduction to new areas can sometimes lead to competition with native vegetation."
}
