{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon gulistanum var. glabrescens",
    "plant_slug": "acantholimon-gulistanum-var-glabrescens",
    "plant_name_scientific": "acantholimon gulistanum var. glabrescens",
    "intro": "Acantholimon gulistanum var. glabrescens, commonly known as the smoothleaf sandthrift, is a perennial flowering plant native to Central Asia. It belongs to the Plumbagaceae family and is characterized by its low-growing, mat-forming habit. The plant features silvery-gray leaves that are often covered in fine hairs, which help reduce water loss in arid environments. Its flowers are typically blue or violet, appearing in clusters during the summer months. It is well adapted to sandy and rocky soils, making it a hardy species suitable for xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon gulistanum var. glabrescens is primarily native to the high-altitude regions of the Pamir Mountains in Tajikistan. This plant is found in rocky and gravelly soils at elevations ranging from 3,000 to 5,000 meters. It thrives in cold, arid environments with limited vegetation cover. The species is adapted to the harsh climatic conditions of this mountainous region. It is a rare and endemic plant, contributing to the unique biodiversity of the area.",
    "distribution_introduced_art_desc": "Acantholimon gulistanum var. glabrescens was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It thrives in regions with low precipitation and is often found in rocky or gravelly soils. This plant is commonly used in xeriscaping due to its drought tolerance and ornamental value. It has been introduced to several regions outside its native range, including parts of the western United States. However, its spread is limited by its specific environmental requirements and lack of widespread cultivation."
}
