{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthoxanthium ambrosioides",
    "plant_slug": "acanthoxanthium-ambrosioides",
    "plant_name_scientific": "acanthoxanthium ambrosioides",
    "intro": "Acanthoxanthium ambrosioides, commonly known as the ambrosia grass, is a flowering plant belonging to the family Poaceae. It is native to the Americas and is characterized by its tall, slender stems and small, spike-like inflorescences. The plant produces wind-pollinated flowers, which are typically green or pale in color. It thrives in disturbed soils and can often be found in open areas such as fields and roadsides. Due to its ability to spread rapidly, it is sometimes considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthoxanthium ambrosioides is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Kenya. It is commonly found in humid lowland areas, often growing in disturbed soils near human settlements. The plant thrives in open habitats like grasslands, shrublands, and forest edges. It is also occasionally reported in parts of southern Asia, including India and Sri Lanka. Due to its adaptability, it can sometimes spread to new areas through human activity or natural dispersal.",
    "distribution_introduced_art_desc": "Acanthoxanthium ambrosioides was mainly introduced to new environments through human activities such as agriculture and horticulture. It is commonly found in disturbed soils and areas with poor vegetation. This plant has spread to various regions outside its native range, often outcompeting native species. Its rapid growth and adaptability make it an invasive species in many areas. Due to its aggressive nature, it poses a threat to local ecosystems and biodiversity."
}
