{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus longibracteatus",
    "plant_slug": "acanthus-longibracteatus",
    "plant_name_scientific": "acanthus longibracteatus",
    "intro": "Acanthus longibracteatus, commonly known as the long-bract acanthus, is a striking evergreen shrub native to southern Africa. It is characterized by its large, palmate leaves that are deeply lobed and often covered in a waxy coating. The plant produces showy, spiky inflorescences with small, clustered flowers that range in color from white to pink. Its robust growth habit and ornamental foliage make it a popular choice for gardens and landscapes. Acanthus longibracteatus is well-suited to full sun and well-drained soils, thriving in Mediterranean climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus longibracteatus"
    },
    "taxonomy_art_desc": "Acanthus longibracteatus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures such as vascular tissue. Its class is Equisetopsida, which comprises ferns and their allies, known for their spore reproduction and often having a primitive vascular system. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms, often with showy flowers and diverse leaf forms. Its order is Lamiales, a group of flowering plants that includes many economically important species such as mint and snapdragons, characterized by their bilaterally symmetrical flowers. Its family is Acanthaceae, a family of flowering plants known for their showy, often brightly colored flowers and their presence in tropical and subtropical regions. Its genus is Acanthus, a group of flowering plants known for their ornamental value, featuring spiny bracts and large, showy flowers, commonly used in horticulture. Its species is Acanthus longibracteatus, a specific type of Acanthus known for its long bracts and is native to certain regions of Africa, often cultivated for its ornamental appeal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Myanmar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus longibracteatus is primarily native to Myanmar. It is commonly found in the tropical and subtropical regions of the country. This plant typically grows in moist, shaded areas such as forests and along riverbanks. It is well adapted to the warm and humid climate of Myanmar. Its natural habitat includes both lowland and hill forest environments.",
    "distribution_introduced_art_desc": "Acanthus longibracteatus was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and architectural form. It is commonly cultivated in gardens and as a decorative plant in tropical and subtropical regions. The plant's introduction has led to its establishment in some non-native areas, where it can sometimes become invasive. Its popularity is driven by its ability to thrive in a variety of soil types and its tolerance to different climatic conditions. However, its spread outside of controlled environments requires careful management to prevent ecological disruption."
}
