{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax spinosus f. espinosus",
    "plant_slug": "acanthopanax-spinosus-f-espinosus",
    "plant_name_scientific": "acanthopanax spinosus f. espinosus",
    "intro": "Acanthopanax spinosus f. espinosus, commonly known as the spiny Chinese dogwood, is a variant of the Chinese dogwood characterized by its dense, thorny growth. It is a deciduous shrub or small tree native to parts of East Asia, particularly China. The plant features compound leaves with serrated edges and small, clustered yellow flowers that appear in the spring. Its berries are red and edible, though often used in traditional medicine. This form is notable for its robust, spiny structure and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax spinosus f. espinosus is primarily native to Southeast Asia, including countries such as China, India, and parts of Indonesia. This fern is commonly found in tropical and subtropical regions, growing in moist, shaded environments such as forests and mountainous areas. It thrives in humid climates with well-drained soil, often in the understory of dense vegetation. The plant is known for its distinctive spiny stems and is often used in traditional medicine. Its native distribution reflects its adaptation to the rich biodiversity of the region.",
    "distribution_introduced_art_desc": "Acanthopanax spinosus f. espinosus was mainly introduced to regions with temperate climates and well-drained soils, often as an ornamental plant due to its distinctive spiny foliage and growth habit. It thrives in full sun to partial shade and is commonly found in gardens and along roadsides in parts of North America and Europe. This distribution is largely the result of horticultural interest rather than natural dispersal. While it is not considered invasive in most areas, it can become established in disturbed sites. Its presence in these regions highlights the impact of human activity on plant distribution patterns."
}
