{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus humilis",
    "plant_slug": "acanthus-humilis",
    "plant_name_scientific": "acanthus humilis",
    "intro": "Acanthus humilis, commonly known as the narrow-leaved acanthus, is a herbaceous perennial native to southern Europe and parts of western Asia. It features distinctive, deeply lobed leaves that are often covered in a dense layer of soft, silky hairs. The plant produces showy, spiny bracts that enclose small, inconspicuous flowers. It thrives in moist, well-drained soils and prefers partial to full shade. Due to its ornamental value, it is often cultivated in gardens and used in horticultural designs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus humilis is primarily native to southern Europe, including countries such as Spain, Portugal, and parts of southern France. It is also found in North Africa, particularly in regions like Morocco and Algeria. This plant thrives in rocky or coastal areas and is often associated with Mediterranean climates. It is commonly found in dry, sunny habitats such as cliffs, slopes, and along the edges of forests. Its native range extends into the Canary Islands, where it grows in similar environmental conditions.",
    "distribution_introduced_art_desc": "Acanthus humilis was mainly introduced to ornamental horticulture and garden design due to its striking foliage and floral display. It is commonly cultivated in temperate regions for its aesthetic value in landscapes and as a decorative plant. Despite its ornamental appeal, it has occasionally become invasive in certain areas where it can outcompete native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats. Proper management is recommended to prevent its spread beyond controlled environments."
}
