{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyton spinosum",
    "plant_slug": "acanthophyton-spinosum",
    "plant_name_scientific": "acanthophyton spinosum",
    "intro": "Acanthophyton spinosum, commonly known as the spiny acanthophyton, is a succulent plant native to arid and semi-arid regions of Africa. It is characterized by its thick, fleshy stems and leaves, which are adapted to store water and reduce water loss. The plant produces small, yellowish flowers during the rainy season, which are typically clustered at the ends of the stems. Its spiny structure serves as a defense mechanism against herbivores. Acanthophyton spinosum is often used in traditional medicine for its purported healing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyton spinosum is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, thriving in environments with low rainfall and high temperatures. This plant is well adapted to harsh conditions, with its spiny structure providing protection from herbivores and reducing water loss. It plays an important ecological role in stabilizing soil and providing habitat for small animals. Its distribution is closely linked to specific microhabitats that support its unique survival strategies.",
    "distribution_introduced_art_desc": "Acanthophyton spinosum was mainly introduced to areas with disturbed soils and dry, open habitats. It thrives in regions with low rainfall and poor nutrient conditions. This plant is often found in agricultural fields and along roadsides where human activity has altered the landscape. Its introduction has led to concerns about its potential to invade native plant communities. Due to its spiny structure, it is often avoided by grazing animals, giving it a competitive advantage in certain environments."
}
