{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus pectinatus",
    "plant_slug": "acanthus-pectinatus",
    "plant_name_scientific": "acanthus pectinatus",
    "intro": "Acanthus pectinatus, commonly known as the woolly acanthus, is a perennial herb native to southern Europe and western Asia. It is characterized by its tall, slender stems and large, velvety leaves that are often covered in fine, white hairs. The plant produces spikes of showy, violet-blue flowers in the summer months. Its foliage and floral structure make it a popular choice for ornamental gardening. Acanthus pectinatus is also valued in horticulture for its ability to thrive in well-drained soils and full sun conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus pectinatus is primarily native to southern Europe, particularly the Iberian Peninsula, northern Africa, and parts of the Middle East. It is commonly found in regions with Mediterranean climates, including southern France, Italy, and Greece. This plant thrives in rocky or limestone soils and is often associated with coastal and mountainous areas. It is also present in some parts of North Africa, such as Morocco and Algeria. Its distribution is limited to specific ecological niches where it can receive ample sunlight and well-drained soil.",
    "distribution_introduced_art_desc": "Acanthus pectinatus was mainly introduced to areas with temperate climates and well-drained soils, where it thrives in full sun to partial shade. It is commonly found in disturbed sites such as roadsides, fields, and along stream banks. This plant is known for its ornamental value, with its distinctive spiny leaves and showy purple flowers. It has been introduced to several regions outside its native range, including parts of Europe and North America. Due to its rapid growth and adaptability, it can become invasive in certain environments if not managed properly."
}
