{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax setchuenensis var. latifoliatus",
    "plant_slug": "acanthopanax-setchuenensis-var-latifoliatus",
    "plant_name_scientific": "acanthopanax setchuenensis var. latifoliatus",
    "intro": "Acanthopanax setchuenensis var. latifoliatus, commonly known as the broadleaf Chinese angel's trumpet, is a climbing shrub native to China. It features compound leaves with broad, ovate leaflets that are typically arranged alternately along the stem. The plant produces small, yellowish-green flowers that are clustered in umbels, followed by red berries that are edible for humans but toxic to livestock. It thrives in humid, shaded environments and is often found in mountainous regions. Due to its ornamental value and medicinal properties, it is occasionally cultivated in gardens and traditional herbal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax setchuenensis var. latifoliatus is primarily native to the mountainous regions of Sichuan and Yunnan provinces in southwest China. It thrives in temperate to subtropical climates, often growing at elevations between 1,500 and 3,000 meters. This plant is commonly found in dense forests and rocky slopes, where it benefits from partial shade and well-drained soil. It plays an important role in the local ecosystem, providing habitat and food for various wildlife species. Due to its limited distribution, it is considered a rare and endemic species in the region.",
    "distribution_introduced_art_desc": "Acanthopanax setchuenensis var. latifoliatus was mainly introduced to the eastern United States as a ornamental plant due to its attractive foliage and unique appearance. It was first documented in the early 20th century in botanical gardens and private collections. The plant is typically found in moist, shaded areas such as woodland edges and stream banks. Its introduction has led to concerns about its potential invasiveness in native ecosystems. Despite its ornamental value, it requires careful management to prevent it from spreading beyond cultivated areas."
}
