{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax senticosus",
    "plant_slug": "acanthopanax-senticosus",
    "plant_name_scientific": "acanthopanax senticosus",
    "intro": "Acanthopanax senticosus, commonly known as Siberian ginseng, is a shrub native to the cold regions of Asia. It is characterized by its compound leaves and clusters of small, yellowish-green flowers. The plant produces red berries that contain seeds, and its roots are the primary part used in traditional medicine. It thrives in temperate climates and is often found in forested areas. The plant contains various bioactive compounds, including saponins and alkaloids, which contribute to its medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax senticosus is primarily native to the mountainous regions of East Asia, including China, Korea, and Russia. It thrives in temperate to subarctic climates, often growing in dense forests and rocky terrain. This plant is particularly common in the northern parts of China, such as the provinces of Heilongjiang, Jilin, and Liaoning. It is also found in the Korean Peninsula and the southern regions of Siberia. Due to its adaptability, it can be found at elevations ranging from 500 to 2,500 meters above sea level.",
    "distribution_introduced_art_desc": "Acanthopanax senticosus was mainly introduced to traditional medicine practices in East Asia, particularly in China, Korea, and Japan. It is valued for its purported health benefits, including immune support and anti-inflammatory properties. The plant is commonly used in herbal remedies and is often referred to as \"devil's club\" in some regions. Its distribution has expanded beyond its native range due to increasing demand in the global herbal market. However, it is not considered an invasive species in most areas where it is cultivated."
}
