{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus spathularis",
    "plant_slug": "acanthus-spathularis",
    "plant_name_scientific": "acanthus spathularis",
    "intro": "Acanthus spathularis, commonly known as the narrow-leaved acanthus, is a perennial herb native to southern Europe and western Asia. It features rosettes of narrow, lance-shaped leaves with a distinctive waxy coating. The plant produces spires of purple to pink flowers in late summer, which are borne on tall, leafless stems. It thrives in well-drained soils and full sun, making it suitable for rock gardens and borders. Its ornamental value is enhanced by its architectural foliage and long-lasting blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus spathularis is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky coastal areas and dry, sunny environments. This species is commonly found in countries such as Italy, Greece, Turkey, and Morocco. It is well adapted to coastal climates and can tolerate salt spray and sandy soils. Due to its hardy nature, it is sometimes cultivated in gardens in similar climates outside its native range.",
    "distribution_introduced_art_desc": "Acanthus spathularis was mainly introduced to new environments through human activity, such as horticultural trade and accidental transport. It is commonly found in disturbed areas, along roadsides, and in urban settings where it can thrive in disturbed soils. This plant has become an invasive species in some regions, outcompeting native vegetation due to its rapid growth and adaptability. Its introduction has led to ecological concerns in areas where it has established itself outside its native range. Efforts are being made to control its spread and mitigate its impact on local ecosystems."
}
