{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthonychia ramosissima var. andina",
    "plant_slug": "acanthonychia-ramosissima-var-andina",
    "plant_name_scientific": "acanthonychia ramosissima var. andina",
    "intro": "Acanthonychia ramosissima var. andina, commonly known as the Andean acanthonychia, is a shrub native to the high-altitude regions of South America. It is characterized by its dense, branched stems and small, leathery leaves that are adapted to withstand cold and arid conditions. The plant produces clusters of tiny, yellowish flowers during the summer months, which are followed by small, oval-shaped fruits. It thrives in well-drained soils and requires full sun exposure. Due to its unique morphology and ecological niche, it is of interest to botanists and horticulturists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthonychia ramosissima var. andina is primarily native to the Andean regions of South America, particularly in countries such as Peru, Bolivia, and Ecuador. It is commonly found in high-altitude environments, including mountainous areas and dry valleys. This variety thrives in rocky soils and is often associated with alpine vegetation. Its distribution is limited to specific ecological zones that provide the necessary climate and soil conditions. It is an endemic species, meaning it is not found naturally outside of these particular regions.",
    "distribution_introduced_art_desc": "Acanthonychia ramosissima var. andina was mainly introduced to South America, particularly in regions with high altitudes and temperate climates. It is commonly found in the Andes Mountains, where it thrives in rocky and well-drained soils. This plant is often cultivated in gardens for its ornamental value due to its unique foliage and hardy nature. It has been introduced to various countries in the region, including Peru, Bolivia, and Ecuador. However, its spread is limited due to its specific environmental requirements."
}
