{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon distachyum",
    "plant_slug": "acantholimon-distachyum",
    "plant_name_scientific": "acantholimon distachyum",
    "intro": "Acantholimon distachyum, commonly known as the two-stemmed sandthorn, is a flowering plant native to the arid regions of central Asia. It belongs to the family Caryophyllaceae and is characterized by its succulent, hairy stems and small, clustered flowers. The plant thrives in sandy and rocky soils, often found in desert and steppe environments. Its leaves are typically linear and reduced, adapting to minimize water loss in harsh conditions. The flowers, which are usually pink or white, bloom in summer and attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon distachyum"
    },
    "taxonomy_art_desc": "Acantholimon distachyum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon distachyum, a specific plant within the genus Acantholimon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon distachyum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the northeastern and central areas. This plant thrives in rocky and gravelly soils at high altitudes. It is commonly associated with alpine and subalpine habitats. Its distribution is limited to specific ecological niches within Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon distachyum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in disturbed sites such as roadsides, gravelly slopes, and wastelands. This plant has been introduced to several regions outside its native range, including parts of North America and Europe. It is often used for erosion control due to its hardy nature and ability to thrive in poor soil conditions. However, it may become invasive in certain ecosystems if not managed properly."
}
