{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax evodiifolius var. pseudoevodiifolius",
    "plant_slug": "acanthopanax-evodiifolius-var-pseudoevodiifolius",
    "plant_name_scientific": "acanthopanax evodiifolius var. pseudoevodiifolius",
    "intro": "Acanthopanax evodiifolius var. pseudoevodiifolius, commonly known as the Korean ginseng vine, is a climbing shrub native to East Asia. It features compound leaves with serrated edges and small, greenish-white flowers that bloom in clusters. The plant produces berries that are typically red or black when mature. It is often found in forested areas and is valued for its medicinal properties. Its botanical characteristics make it an important species in traditional herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax evodiifolius var. pseudoevodiifolius is primarily native to East Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas, particularly in the temperate zones of these countries. This variant is often associated with humid climates and is typically found in areas with well-drained soils. It grows at elevations ranging from lowland to subalpine regions. The plant is part of the Araliaceae family and is known for its medicinal properties in traditional herbal medicine.",
    "distribution_introduced_art_desc": "Acanthopanax evodiifolius var. pseudoevodiifolius was mainly introduced to regions with temperate climates and well-drained soils, where it thrives in partial to full sunlight. It is commonly found in forest edges, shrublands, and disturbed areas due to its adaptability to various soil types. This variant is valued for its ornamental foliage and potential medicinal properties, making it a popular choice for horticultural use. Its introduction has been documented in parts of East Asia, including China and Korea, where it has been cultivated for both aesthetic and traditional purposes. However, its spread outside native habitats requires careful management to prevent ecological disruption."
}
