{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax verticillatus",
    "plant_slug": "acanthopanax-verticillatus",
    "plant_name_scientific": "acanthopanax verticillatus",
    "intro": "Acanthopanax verticillatus, commonly known as the clustered arrowhead plant, is a shrub native to eastern Asia. It features compound leaves with three to five leaflets, often arranged in a whorl at the nodes. The plant produces small, yellowish-green flowers followed by red berries that are attractive to birds. It is often used in traditional medicine for its purported health benefits. The species is valued in horticulture for its ornamental foliage and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax verticillatus is primarily native to East Asia, including China, Korea, and Japan. It is commonly found in forested areas, particularly in mountainous regions with moist, well-drained soils. This plant thrives in temperate climates and is often associated with mixed deciduous and evergreen forests. It is known for its climbing or shrub-like growth habit and is sometimes used in traditional medicine. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acanthopanax verticillatus was mainly introduced to new regions for its potential medicinal properties and ornamental value. It has been reported in several countries, including China, Korea, and parts of Southeast Asia. The plant is often cultivated for its use in traditional medicine, particularly for its purported health benefits. Its introduction has sometimes led to concerns about its potential invasiveness in local ecosystems. Proper management is recommended to prevent unintended ecological impacts."
}
