{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis dispermoides",
    "plant_slug": "acanthopsis-dispermoides",
    "plant_name_scientific": "acanthopsis dispermoides",
    "intro": "Acanthopsis dispermoides, commonly known as the slender spurge, is a flowering plant native to southern Africa. It is a member of the Euphorbiaceae family, characterized by its milky sap and small, clustered flowers. The plant typically grows as a shrub or herb, featuring narrow, lance-shaped leaves and yellowish-green flowers. It thrives in arid and semi-arid environments, often found in rocky soils and open woodlands. Due to its ornamental value and adaptability, it is occasionally cultivated in gardens in regions with suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis dispermoides"
    },
    "taxonomy_art_desc": "Acanthopsis dispermoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Lamiales, a group of flowering plants that includes plants like mint and snapdragons, known for their aromatic properties. Its family is Acanthaceae, a group of flowering plants commonly known as the acanthus family, characterized by their showy flowers and often hairy leaves. Its genus is Acanthopsis, a small genus of flowering plants native to tropical regions, typically featuring small, showy flowers. Its species is Acanthopsis dispermoides, a specific plant within the genus Acanthopsis, known for its distinctive floral structure and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis dispermoides is primarily native to the Cape Provinces. This species is found in the western and southern regions of South Africa. It typically grows in rocky or sandy soils in open habitats. The plant is adapted to the Mediterranean climate of the area, characterized by dry summers and wet winters. It is commonly seen in fynbos vegetation types.",
    "distribution_introduced_art_desc": "Acanthopsis dispermoides was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded environments such as forest floors and along stream banks. This plant was introduced as an ornamental species due to its attractive, fern-like foliage. However, it has since become invasive in certain areas, outcompeting native vegetation. Its spread has raised concerns among local conservationists and land managers."
}
