{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax rosthornii",
    "plant_slug": "acanthopanax-rosthornii",
    "plant_name_scientific": "acanthopanax rosthornii",
    "intro": "Acanthopanax rosthornii, commonly known as the red-rooted dogwood, is a deciduous shrub native to eastern Asia. It belongs to the family Araliaceae and is characterized by its compound leaves and clusters of small white flowers. The plant produces red berries that are an important food source for birds and small mammals. It thrives in moist, well-drained soils and is often found in forested areas. Due to its ornamental value and ecological importance, it is cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax rosthornii is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It thrives in temperate to subtropical climates, often found in forested areas at high altitudes. This plant is commonly associated with rocky and well-drained soils, making it a characteristic species of mountain ecosystems. It is particularly prevalent in the northeastern parts of China, such as the provinces of Heilongjiang, Jilin, and Liaoning. Due to its rugged habitat preferences, it is not widely distributed beyond these specific regions.",
    "distribution_introduced_art_desc": "Acanthopanax rosthornii was mainly introduced to regions with temperate climates, particularly in East Asia, where it has been historically used in traditional medicine. It is commonly found in forested areas, often growing on rocky slopes or in mountainous regions. The plant is valued for its medicinal properties, including potential anti-inflammatory and antioxidant effects. Its introduction has also led to its cultivation in some parts of the world for both medicinal and ornamental purposes. However, its spread outside its native range is limited due to specific environmental requirements."
}
