{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon narynense",
    "plant_slug": "acantholimon-narynense",
    "plant_name_scientific": "acantholimon narynense",
    "intro": "Acantholimon narynense, commonly known as the Naryn stonecress, is a flowering plant native to the mountainous regions of Central Asia. It belongs to the family Brassicaceae, which includes many economically important plants such as mustard and cabbage. The plant is characterized by its low-growing habit, with small, fleshy leaves and clusters of yellow flowers. It thrives in rocky or gravelly soils and is adapted to cold, arid environments. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon narynense"
    },
    "taxonomy_art_desc": "Acantholimon narynense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes species like carnations and beets, often with distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, known for their spiny leaves and showy flowers. Its species is Acantholimon narynense, a specific plant native to Central Asia, known for its unique adaptations to its harsh environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon narynense is primarily native to Kazakhstan. It is found in the mountainous regions of the country, particularly in the Tien Shan and Pamir-Alay mountain ranges. This plant thrives in alpine and subalpine environments, often growing in rocky soils at high elevations. It is commonly found in areas with cold climates and limited vegetation cover. Due to its specific habitat requirements, it is a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acantholimon narynense was mainly introduced to areas with arid or semi-arid climates, particularly in Central Asia. It thrives in well-drained soils and is commonly found in steppe and rocky habitats. This plant is adapted to withstand extreme temperature fluctuations and low precipitation. Its introduction has been noted in regions such as Kazakhstan and the Tian Shan mountains. It plays a role in stabilizing soil and supporting local biodiversity in these environments."
}
