{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum fontanesii f. tenuispinum",
    "plant_slug": "acanthophyllum-fontanesii-f-tenuispinum",
    "plant_name_scientific": "acanthophyllum fontanesii f. tenuispinum",
    "intro": "Acanthophyllum fontanesii f. tenuispinum, commonly known as the slender-spined acanthophyllum, is a succulent plant native to arid regions of Central Asia. It belongs to the Amaranthaceae family and is characterized by its compact, cushion-like growth form. The plant features small, fleshy leaves and produces pale yellow flowers during the summer months. It is well adapted to harsh, dry environments, with thick stems that store water. This subspecies is notable for its reduced spines compared to other varieties in the species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum fontanesii f. tenuispinum is primarily native to the arid and semi-arid regions of Central Asia, particularly in countries such as Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in sandy or gravelly soils and is commonly found in steppe and desert environments. This plant is adapted to withstand extreme temperatures and low precipitation, making it a characteristic species of these harsh climates. It plays an important role in stabilizing dunes and preventing soil erosion. Its distribution is closely linked to the ecological conditions of the Central Asian deserts and steppes.",
    "distribution_introduced_art_desc": "Acanthophyllum fontanesii f. tenuispinum was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions with low precipitation and high solar radiation, such as parts of the Middle East and Central Asia. This plant is often used for soil stabilization due to its extensive root system and ability to withstand harsh environmental conditions. Its introduction has been associated with ecological restoration projects in degraded landscapes. However, its spread can sometimes lead to competition with native vegetation in certain environments."
}
