{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon evrenii",
    "plant_slug": "acantholimon-evrenii",
    "plant_name_scientific": "acantholimon evrenii",
    "intro": "Acantholimon evrenii, commonly known as the Evren's thornflax, is a flowering plant species native to Turkey. It belongs to the family Plumbaginaceae and is characterized by its distinctive thorn-like structures on its stems. The plant produces small, blue to purple flowers that bloom in the summer months. It thrives in rocky and arid environments, showcasing its adaptability to harsh conditions. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon evrenii"
    },
    "taxonomy_art_desc": "Acantholimon evrenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and cacti, often characterized by their specialized water storage tissues. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with distinctive blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and coastal regions, often with spiny or hairy structures. Its species is Acantholimon evrenii, a specific type of flowering plant native to certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon evrenii is primarily native to Turkey. It is found in specific regions within the country, particularly in the eastern and southeastern areas. This plant typically grows in rocky and arid environments, often in mountainous regions. It is adapted to the dry and harsh conditions of its native habitat. Its distribution is limited to certain localities in Turkey, making it a regionally endemic species.",
    "distribution_introduced_art_desc": "Acantholimon evrenii was mainly introduced to areas with rocky or gravelly soils, often in dry or semi-arid environments. It thrives in regions with low precipitation and high sunlight exposure. This plant is commonly found in mountainous areas and along coastal cliffs. It has adapted to harsh conditions by developing deep root systems and drought-resistant foliage. Its introduction has been noted in several Mediterranean and Middle Eastern countries."
}
