{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum xanthoporphyranthum",
    "plant_slug": "acanthophyllum-xanthoporphyranthum",
    "plant_name_scientific": "acanthophyllum xanthoporphyranthum",
    "intro": "Acanthophyllum xanthoporphyranthum, commonly known as the yellow porphyranthum, is a flowering plant belonging to the Amaranthaceae family. It is native to arid and semi-arid regions of Central Asia, including parts of Kazakhstan and Mongolia. The plant is characterized by its succulent, branched stems and small, clustered flowers that range in color from yellow to reddish-pink. It thrives in sandy or gravelly soils and is adapted to withstand drought and high temperatures. Due to its resilience, it plays a role in stabilizing desert ecosystems and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum xanthoporphyranthum"
    },
    "taxonomy_art_desc": "Acanthophyllum xanthoporphyranthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers and often have a distinctive arrangement of stamens and petals. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with simple, often showy flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small, clustered flowers. Its species is Acanthophyllum xanthoporphyranthum, a specific type of plant within the genus Acanthophyllum, known for its unique yellow and purple flower coloration and its adaptation to dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum xanthoporphyranthum is primarily native to Afghanistan. This plant is typically found in arid and semi-arid regions within the country. It thrives in sandy or rocky soils, often in areas with low precipitation. The species is well adapted to the harsh environmental conditions of its native habitat. It plays a role in stabilizing soil and supporting local ecosystems.",
    "distribution_introduced_art_desc": "Acanthophyllum xanthoporphyranthum was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions with low precipitation and high solar exposure, making it well-suited for harsh environmental conditions. This plant is often used in ecological restoration projects due to its ability to stabilize soil and prevent erosion. Its introduction has been primarily associated with regions in Central Asia and parts of the Middle East. However, its spread has raised concerns about potential invasiveness in non-native ecosystems."
}
