{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophora scandens",
    "plant_slug": "acanthophora-scandens",
    "plant_name_scientific": "acanthophora scandens",
    "intro": "Acanthophora scandens, commonly known as the climbing coral tree, is a tropical plant native to regions of Africa and Asia. It is characterized by its woody stems and clusters of small, white or pink flowers that bloom throughout the year. The plant has palmate leaves with three to five leaflets, and its growth habit is typically vine-like, allowing it to climb trees or structures. It thrives in warm, humid climates and is often used in ornamental gardening due to its attractive appearance. The plant is also valued for its ability to provide habitat for various insects and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophora scandens is primarily native to the coastal regions of southern Africa, particularly South Africa. It is commonly found in sandy or rocky habitats along the coastline. This plant thrives in areas with high salt exposure and strong winds. It is often seen growing on cliffs, dunes, or along the edges of beaches. Its distribution is limited to the southernmost parts of the African continent.",
    "distribution_introduced_art_desc": "Acanthophora scandens was mainly introduced to new areas through human activities such as horticulture and landscaping. It is commonly found in disturbed soils and urban environments, where it thrives in moist, shaded conditions. This plant has spread to several regions outside its native range, including parts of North America and Europe. Its rapid growth and ability to form dense colonies make it an invasive species in some areas. However, it is also valued for its ornamental qualities in certain garden settings."
}
