{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon moradii",
    "plant_slug": "acantholimon-moradii",
    "plant_name_scientific": "acantholimon moradii",
    "intro": "Acantholimon moradii, commonly known as the Moradi's thornweed, is a flowering plant native to the arid regions of the Middle East. It belongs to the family Plumbaginaceae and is characterized by its succulent, fleshy leaves adapted to conserve water. The plant produces small, blue or purple flowers that bloom in late spring or early summer. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon moradii"
    },
    "taxonomy_art_desc": "Acantholimon moradii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants, and is distinguished by the presence of true vascular tissues. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, known for their diverse morphological features and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes herbs and shrubs often found in dry habitats. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon moradii, a specific plant within the genus Acantholimon, native to certain regions of the Mediterranean, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon moradii is primarily native to Iran. This species is found in specific regions within Iran, particularly in the central and eastern parts of the country. It typically grows in rocky or gravelly soils in arid and semi-arid environments. The plant is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to certain ecological zones within Iran, reflecting its specialized environmental requirements.",
    "distribution_introduced_art_desc": "Acantholimon moradii was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in disturbed soils along roadsides, railway embankments, and construction sites. This plant thrives in well-drained soils and can tolerate high levels of salinity and drought. Its introduction has helped in restoring degraded landscapes in areas with limited vegetation. However, it is considered a weed in some regions due to its aggressive growth and ability to outcompete native species."
}
