{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon paniculatum",
    "plant_slug": "acantholimon-paniculatum",
    "plant_name_scientific": "acantholimon paniculatum",
    "intro": "Acantholimon paniculatum, commonly known as the panicled acantholimon, is a flowering plant native to the Mediterranean region. It is a member of the Plumbagaceae family and is characterized by its succulent, branched stems and small, blue to purple flowers. The plant typically grows in rocky or sandy soils and is adapted to arid or semi-arid environments. It produces capsule fruits that contain numerous seeds, which are dispersed by wind. Due to its ornamental value and drought tolerance, it is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon paniculatum is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal and inland areas with well-drained soils. This plant thrives in sandy or gravelly habitats, often in open woodlands or along the edges of chaparral. It is adapted to Mediterranean climates with dry summers and mild, wet winters. Acantholimon paniculatum plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acantholimon paniculatum was mainly introduced to areas with well-drained soils and moderate to high elevations, typically in mountainous or semi-arid regions. It thrives in environments with full sun exposure and is often found in rocky or gravelly habitats. This plant is particularly adapted to withstand drought conditions and can tolerate poor soil fertility. Its introduction has been noted in several regions of the western United States, including California and Nevada. However, its spread is limited by its specific ecological requirements and climate constraints."
}
