{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax setosus",
    "plant_slug": "acanthopanax-setosus",
    "plant_name_scientific": "acanthopanax setosus",
    "intro": "Acanthopanax setosus, commonly known as the hairy arrowhead, is a woody climbing plant native to East Asia. It is characterized by its compound leaves, which are often lobed and covered with fine, stiff hairs. The plant produces small, greenish-yellow flowers arranged in umbels, followed by red berries that are edible for birds and some mammals. It thrives in moist, shaded environments and is often found in temperate forests. Its vigorous growth and climbing habit make it a notable species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax setosus is primarily native to East Asia, including regions such as China, Japan, and Korea. It is commonly found in mountainous areas, particularly in temperate and subtropical forests. This plant thrives in regions with well-drained soil and moderate to high humidity. It is often associated with secondary growth and disturbed habitats. Its distribution extends into parts of Southeast Asia, including Vietnam and Indonesia.",
    "distribution_introduced_art_desc": "Acanthopanax setosus was mainly introduced to regions with temperate climates, particularly in East Asia, where it thrives in forested areas. It is commonly found in China, Korea, and Japan, where it has been historically used in traditional medicine. The plant prefers well-drained soil and partial to full sunlight, making it adaptable to various environmental conditions. Its introduction to these areas has been largely through natural dispersal and human cultivation for medicinal purposes. However, it is considered invasive in some regions due to its rapid growth and ability to outcompete native species."
}
