{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon kotschyi",
    "plant_slug": "acantholimon-kotschyi",
    "plant_name_scientific": "acantholimon kotschyi",
    "intro": "Acantholimon kotschyi, commonly known as the Kotschyi's thornscale, is a flowering plant native to the Mediterranean region. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy stems and leaves. The plant produces small, pink to purple flowers that bloom in the spring. It is adapted to arid and rocky environments, making it a hardy species. Its unique appearance and resilience make it a notable subject in botanical studies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon kotschyi"
    },
    "taxonomy_art_desc": "Acantholimon kotschyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often characterized by their distinctive floral morphology and adaptations to various environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species with showy flowers and often found in arid or coastal regions. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and small, clustered flowers. Its species is Acantholimon kotschyi, a specific plant within the genus Acantholimon, known for its adaptations to harsh environments and its unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lebanon-Syria",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon kotschyi is primarily native to Lebanon-Syria, Turkey. This plant is typically found in rocky and arid environments within these regions. It thrives in areas with well-drained soils and receives limited rainfall. The species is commonly observed in mountainous and coastal regions. Its distribution is closely associated with specific microhabitats in the Mediterranean climate zones of the region.",
    "distribution_introduced_art_desc": "Acantholimon kotschyi was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is often found in rocky or gravelly habitats, where it can thrive with minimal water requirements. This plant is commonly used in xeriscaping due to its drought tolerance and low maintenance needs. Its introduction has been primarily for ornamental purposes in gardens and landscapes. However, it is important to monitor its spread to prevent potential ecological impacts in native ecosystems."
}
