{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax ricinifolius",
    "plant_slug": "acanthopanax-ricinifolius",
    "plant_name_scientific": "acanthopanax ricinifolius",
    "intro": "Acanthopanax ricinifolius, commonly known as the Chinese angel's trumpet, is a woody climbing shrub native to East Asia. It is characterized by its compound leaves, which are often palmately arranged and have a distinctive, rough texture. The plant produces small, yellowish-green flowers that are clustered in umbels, followed by red, fleshy berries. It thrives in humid, shaded environments and is often found in forests and mountainous regions. Due to its ornamental value and medicinal uses, it is cultivated in some areas for both horticultural and traditional purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax ricinifolius is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas, particularly in the temperate zones of these countries. This plant thrives in humid climates and is often associated with dense vegetation in the understory of forests. It is known for its distinctive appearance and has been used in traditional medicine in some of these regions. Its natural range extends across various provinces in China, especially in the northeastern and southwestern parts of the country.",
    "distribution_introduced_art_desc": "Acanthopanax ricinifolius was mainly introduced to regions with temperate climates and well-drained soils, where it can thrive in both full sun and partial shade. It is commonly found in forested areas, along stream banks, and in disturbed sites such as roadsides and clearings. This plant is valued for its hardy nature and ability to tolerate a range of environmental conditions. It has been introduced to parts of North America, Europe, and Asia as an ornamental or medicinal plant. However, its spread can sometimes lead to ecological concerns due to its aggressive growth habits."
}
