{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax giraldii",
    "plant_slug": "acanthopanax-giraldii",
    "plant_name_scientific": "acanthopanax giraldii",
    "intro": "Acanthopanax giraldii, commonly known as the Yunnan elephant tree, is a climbing shrub native to the mountainous regions of China. It belongs to the Araliaceae family and is characterized by its woody stems and compound leaves. The plant produces small, greenish-yellow flowers followed by red berries that are edible for some animals. It thrives in temperate climates with high humidity and is often found in dense forests. Due to its unique appearance and ecological importance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax giraldii is primarily native to the mountainous regions of Southeast Asia, including China, Vietnam, and Myanmar. It is commonly found in forested areas at elevations ranging from 1,000 to 3,000 meters. This plant thrives in temperate to subtropical climates with high humidity and well-drained soil. It is often associated with mixed evergreen and deciduous forests. Due to its limited geographic range, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Acanthopanax giraldii was mainly introduced to areas with temperate to subtropical climates, where it thrives in well-drained soils and partial to full sunlight. It has been reported in parts of East Asia, including China, Korea, and Japan, where it has been cultivated for its ornamental value and traditional medicinal uses. The plant's introduction has been largely driven by horticultural interest and its potential in herbal medicine. However, it is considered an invasive species in some regions due to its rapid growth and ability to spread aggressively. Its distribution is expanding in response to changing environmental conditions and human activity."
}
