{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon artosense",
    "plant_slug": "acantholimon-artosense",
    "plant_name_scientific": "acantholimon artosense",
    "intro": "Acantholimon artosense, commonly known as the Armenian thimblecress, is a flowering plant native to the mountainous regions of Armenia and Turkey. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features narrow, grass-like leaves and produces small, inconspicuous flowers in shades of white or pale pink. It thrives in rocky, well-drained soils and is adapted to harsh, alpine environments. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon artosense"
    },
    "taxonomy_art_desc": "Acantholimon artosense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct vascular system and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and often possessing spore-producing reproductive systems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms, often with separate male and female reproductive structures. Its order is Caryophyllales, a group of flowering plants that includes many plants with specialized adaptations to arid environments, such as succulent leaves and flowers with distinctive symmetry. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon artosense, a specific type of plant native to certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon artosense is primarily native to Turkey. This plant is found in specific regions of Turkey, particularly in the eastern and central areas. It typically grows in rocky or gravelly soils in mountainous regions. The species is adapted to arid and semi-arid climates. Its native distribution is limited to certain habitats within Turkey, reflecting its ecological preferences.",
    "distribution_introduced_art_desc": "Acantholimon artosense was mainly introduced to areas with rocky or gravelly soils, often in alpine or subalpine regions. It thrives in environments with low moisture and full sun exposure. This plant is typically found in mountainous areas of Europe, particularly in the Carpathian and Balkan regions. It is adapted to harsh climatic conditions and can tolerate poor soil nutrients. Its distribution is largely restricted to its native range, though it may occasionally be found in nearby regions with similar ecological conditions."
}
