{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon sirchense",
    "plant_slug": "acantholimon-sirchense",
    "plant_name_scientific": "acantholimon sirchense",
    "intro": "Acantholimon sirchense, commonly known as the Sirchen's thornweed, is a perennial plant native to the mountainous regions of Central Asia. It belongs to the Plumbagaceae family and is characterized by its succulent, fleshy leaves and small, blue to purple flowers. The plant typically grows in rocky or sandy soils at high altitudes, showcasing its adaptability to harsh environments. Its flowering period occurs during the summer months, and it plays a role in stabilizing soil in its native habitat. Due to its limited distribution, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon sirchense"
    },
    "taxonomy_art_desc": "Acantholimon sirchense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging lineages with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid and rocky habitats, characterized by their spiny or thorny structures. Its species is Acantholimon sirchense, a specific plant species native to certain regions, known for its unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon sirchense is primarily native to Iran. It is found in specific regions within the country, particularly in the central and southwestern areas. This plant typically grows in rocky and arid environments, often in mountainous regions. Its distribution is limited to certain ecological niches that provide the necessary conditions for its survival. Due to its restricted range, it is considered a rare and endemic species within Iran.",
    "distribution_introduced_art_desc": "Acantholimon sirchense was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in rocky or gravelly soils, often along slopes or in disturbed sites. This plant thrives in regions with low to moderate rainfall and can tolerate drought conditions. It is often used in xeriscaping due to its drought resistance and ornamental value. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
