{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ecae",
    "plant_slug": "acantholimon-ecae",
    "plant_name_scientific": "acantholimon ecae",
    "intro": "Acantholimon ecae, commonly known as the Eocene's acantholimon, is a flowering plant belonging to the family Caryophyllaceae. It is characterized by its succulent, fleshy leaves and small, clustered flowers that typically bloom in shades of pink or purple. Native to the Mediterranean region, this plant thrives in rocky, well-drained soils and is adapted to arid or semi-arid climates. Its unique morphology and ecological niche make it a subject of interest in botanical studies. Due to habitat loss and climate change, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ecae"
    },
    "taxonomy_art_desc": "Acantholimon ecae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes many plants with specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their often showy flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon ecae, a specific plant species within the genus Acantholimon, known for its unique adaptations to its specific ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ecae is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central parts. This species thrives in rocky and arid environments, often growing at higher elevations. It is adapted to the harsh climate and limited soil conditions of its native habitat. The plant is part of the Caryophyllaceae family and is known for its resilience in difficult environments.",
    "distribution_introduced_art_desc": "Acantholimon ecae was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste areas, and agricultural fields. It thrives in environments with moderate to high levels of sunlight and well-drained soils. This species is often found in temperate regions with a Mediterranean climate. Its introduction has been associated with human activity, including land development and transportation infrastructure. Due to its adaptability, it has become a common weed in many regions where it has been introduced."
}
