{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus hirsutus",
    "plant_slug": "acanthus-hirsutus",
    "plant_name_scientific": "acanthus hirsutus",
    "intro": "Acanthus hirsutus, commonly known as the hairy acanthus, is a perennial herb native to southern Europe and western Asia. It is characterized by its large, palmate leaves that are covered in soft, hairy textures. The plant produces showy, spiny flower spikes that bloom in late summer. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Its unique foliage and architectural form make it a striking addition to gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus hirsutus"
    },
    "taxonomy_art_desc": "Acanthus hirsutus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and complex vascular tissues. Its class is Equisetopsida, which comprises ferns and their relatives, known for their spore reproduction and often having a hollow stem structure. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Lamiales, which includes plants with showy flowers and often aromatic leaves, such as mint and snapdragons. Its family is Acanthaceae, known for its ornamental value and diverse species with distinctive bracts and showy inflorescences. Its genus is Acanthus, a group of flowering plants commonly known for their spiny leaves and showy flowers, often used in horticulture. Its species is Acanthus hirsutus, a specific variety within the Acanthus genus characterized by its hairy leaves and distinctive floral structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "East Aegean Is.",
        "Lebanon-Syria",
        "Palestine",
        "Türkey",
        "Türkey-in-Europe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus hirsutus is primarily native to the East Aegean Is., Lebanon-Syria, Palestine, Turkey, and Turkey-in-Europe. This plant is commonly found in rocky and coastal areas across these regions. It thrives in Mediterranean climates with well-drained soils. Acanthus hirsutus is often seen growing in limestone formations and along cliffs. Its distribution reflects its adaptation to the specific environmental conditions of the eastern Mediterranean.",
    "distribution_introduced_art_desc": "Acanthus hirsutus was mainly introduced to ornamental horticulture and landscaping due to its striking foliage and architectural form. It is commonly used in gardens and as a decorative plant in urban environments. The plant has been introduced to various regions outside its native range, including parts of Europe and North America. Its introduction has sometimes led to it becoming invasive in certain areas, outcompeting native vegetation. Careful management is often required to prevent its spread in non-native habitats."
}
