{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon koeycegizicum",
    "plant_slug": "acantholimon-koeycegizicum",
    "plant_name_scientific": "acantholimon koeycegizicum",
    "intro": "Acantholimon koeycegizicum, commonly known as the Koeycegizic thornstep, is a flowering plant native to Turkey. It belongs to the family Caryophyllaceae and is characterized by its succulent, hairy stems and small, clustered flowers. The plant typically grows in rocky or arid environments, showcasing its adaptation to harsh conditions. Its unique morphology and limited distribution make it a subject of interest in botanical studies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon koeycegizicum"
    },
    "taxonomy_art_desc": "Acantholimon koeycegizicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and modern species with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contain secondary metabolites. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes herbs and shrubs with often showy flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid or coastal regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon koeycegizicum and it is a specific type within the genus, native to Turkey, known for its unique floral structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon koeycegizicum is primarily native to Turkey. It is found in specific regions within the country, particularly in the eastern and central areas. This plant typically grows in rocky and arid environments, adapting to the harsh conditions of its native habitat. Its distribution is limited to certain ecological zones where it can thrive with minimal water availability. The species is of interest to botanists due to its unique characteristics and restricted range.",
    "distribution_introduced_art_desc": "Acantholimon koeycegizicum was mainly introduced to the Mediterranean region, particularly in Turkey, as a ornamental plant due to its attractive silvery foliage and compact growth habit. It is often cultivated in rock gardens and alpine settings where it thrives in well-drained soils and full sun. Despite its ornamental value, it has shown limited naturalization outside of cultivated areas. The plant is relatively drought-tolerant, making it suitable for xeriscaping in arid climates. However, its distribution remains primarily restricted to horticultural settings rather than wild populations."
}
