{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax trifoliatus",
    "plant_slug": "acanthopanax-trifoliatus",
    "plant_name_scientific": "acanthopanax trifoliatus",
    "intro": "Acanthopanax trifoliatus, commonly known as the three-leaved arrowhead, is a deciduous shrub native to East Asia. It is characterized by its compound leaves, typically consisting of three leaflets, and its clusters of small, greenish-yellow flowers. The plant produces small, red berries that are edible for some animals but toxic to humans. It thrives in forested areas and is often found in moist, shaded environments. Acanthopanax trifoliatus is valued for its ornamental qualities and has been used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax trifoliatus is primarily native to East Asia, including regions such as China, Korea, and Japan. It is commonly found in forested areas, particularly in temperate and subtropical climates. This plant thrives in moist, well-drained soils and is often seen growing in mountainous regions. It is also present in parts of Russia and Southeast Asia. Acanthopanax trifoliatus is known for its distinctive trifoliate leaves and is often used in traditional medicine.",
    "distribution_introduced_art_desc": "Acanthopanax trifoliatus was mainly introduced to new environments for its medicinal properties and ornamental value. It is commonly used in traditional medicine for its purported health benefits. The plant has been introduced to regions such as Asia, Europe, and parts of North America. It thrives in temperate climates and can grow in a variety of soil types. However, its introduction has raised concerns about its potential to become an invasive species in some areas."
}
