{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium sylhetense var. pictum",
    "plant_slug": "acanthophippium-sylhetense-var-pictum",
    "plant_name_scientific": "acanthophippium sylhetense var. pictum",
    "intro": "Acanthophippium sylhetense var. pictum, commonly known as the Sylhet pictorial orchid, is a rare and endemic species native to the northeastern region of Bangladesh. It belongs to the Orchidaceae family and is characterized by its striking, colorful floral patterns that resemble intricate paintings. The plant typically grows in shaded, moist habitats such as forest understories and along stream banks. Its leaves are lanceolate and covered with a dense layer of fine, white pubescence. Due to its limited distribution and habitat specificity, it is considered a conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium sylhetense var. pictum is primarily native to the northeastern region of Bangladesh, specifically in the Sylhet division. This variety is found in the moist, tropical forested areas of the region, particularly in the Chittagong Hill Tracts. It thrives in the humid and shaded environments of the undergrowth in these forests. The plant is adapted to the specific climatic conditions of this area, including high rainfall and warm temperatures. Due to its restricted distribution, it is considered a rare and endemic species in this part of South Asia.",
    "distribution_introduced_art_desc": "Acanthophippium sylhetense var. pictum was mainly introduced to new habitats in Southeast Asia, particularly in countries like Bangladesh and India. It has been observed thriving in moist, shaded environments such as forest undergrowth and along riverbanks. This plant is often found in areas with high humidity and well-drained soil, which supports its growth and spread. Its introduction has raised concerns due to its potential to become invasive in native ecosystems. Despite its ornamental value, careful monitoring is needed to prevent ecological disruption."
}
