{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus dioscoridis subsp. brevicaulis",
    "plant_slug": "acanthus-dioscoridis-subsp-brevicaulis",
    "plant_name_scientific": "acanthus dioscoridis subsp. brevicaulis",
    "intro": "Acanthus dioscoridis subsp. brevicaulis, commonly known as the narrow-leaved spurge, is a perennial herb native to southern Africa. It features distinctive, spiny stems and lance-shaped leaves with a slightly hairy surface. The plant produces small, yellowish flowers arranged in clusters at the ends of the stems. It thrives in dry, sandy soils and is often found in rocky or coastal habitats. Due to its unique appearance and hardy nature, it is sometimes cultivated in gardens for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus dioscoridis subsp. brevicaulis is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky coastal areas and dry, sunny environments. This subspecies is commonly found in countries such as Spain, Portugal, Morocco, and Turkey. It is well adapted to coastal and arid conditions, often growing on cliffs or in sandy soils. Its distribution is closely associated with the Mediterranean climate, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acanthus dioscoridis subsp. brevicaulis was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and ornamental value. It is commonly cultivated in gardens and as a decorative plant in urban and suburban settings. The plant is often used in mixed borders, rock gardens, and as a ground cover in shaded areas. Its introduction has been associated with both intentional cultivation and accidental spread through human activity. However, it is important to note that its invasive potential varies depending on the region and environmental conditions."
}
