{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ahangarense",
    "plant_slug": "acantholimon-ahangarense",
    "plant_name_scientific": "acantholimon ahangarense",
    "intro": "Acantholimon ahangarense, commonly known as the Ahangaran stonecrop, is a flowering plant native to the arid regions of Iran. It belongs to the family Montiaceae and is characterized by its succulent, fleshy leaves that help it retain water in dry environments. The plant produces small, star-shaped flowers that are typically blue or purple in color, blooming in the spring. It thrives in rocky or sandy soils and is adapted to withstand high temperatures and low precipitation. Due to its unique appearance and ecological significance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ahangarense"
    },
    "taxonomy_art_desc": "Acantholimon ahangarense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with simple floral structures. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive flowers and often includes plants adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly found in dry and coastal areas, known for their often blue or purple flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and showy flowers. Its species is Acantholimon ahangarense, a specific plant species native to certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ahangarense is primarily native to Afghanistan. This plant is found in the mountainous regions of the country, particularly in the eastern and central parts. It thrives in rocky and arid environments, often growing at higher elevations. The species is adapted to the harsh climatic conditions of the region. It is a part of the local flora and is typically found in dry, open habitats.",
    "distribution_introduced_art_desc": "Acantholimon ahangarense was mainly introduced to areas with rocky or gravelly soils in arid and semi-arid regions. It is commonly found in mountainous areas with limited soil depth and high solar exposure. This plant is often associated with disturbed sites and can thrive in environments with low water availability. Its introduction has been documented in several regions of western Asia, including parts of Turkey and Iran. Due to its hardy nature, it has become established in these habitats, sometimes competing with native vegetation."
}
