{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus longifolius var. hungaricus",
    "plant_slug": "acanthus-longifolius-var-hungaricus",
    "plant_name_scientific": "acanthus longifolius var. hungaricus",
    "intro": "Acanthus longifolius var. hungaricus, commonly known as the Hungarian acanthus, is a hardy perennial plant native to the Mediterranean region. It features striking, deeply lobed leaves that are often covered in a dense layer of soft, fuzzy hairs. The plant produces tall, spires of violet-blue flowers in late summer, which attract pollinators such as bees and butterflies. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and borders. Its ornamental value and resilience make it a favored plant in both horticultural and ecological settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus longifolius var. hungaricus is primarily native to the Pannonian Basin and surrounding regions of Central Europe. It is found in countries such as Hungary, Croatia, Serbia, Bosnia and Herzegovina, and parts of Slovenia. This variety thrives in rocky and calcareous soils, often growing in mountainous and semi-arid environments. It is commonly found in open habitats like slopes, cliffs, and along roadsides. Its distribution is limited to specific ecological zones where it can tolerate the local climate and soil conditions.",
    "distribution_introduced_art_desc": "Acanthus longifolius var. hungaricus was mainly introduced to Europe, particularly in the Mediterranean region, as an ornamental plant due to its striking foliage and floral display. It has been cultivated in gardens and landscaped areas for its aesthetic value, often used in classical and contemporary horticultural designs. Despite its ornamental appeal, it has occasionally escaped cultivation and established itself in natural habitats, raising concerns about its potential invasive behavior. The plant's introduction has been documented in several countries, including Spain, Italy, and France, where it has been integrated into local flora. However, its ecological impact remains a subject of ongoing study and monitoring."
}
