{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocalyx nepalensis subsp. delavayi",
    "plant_slug": "acanthocalyx-nepalensis-subsp-delavayi",
    "plant_name_scientific": "acanthocalyx nepalensis subsp. delavayi",
    "intro": "Acanthocalyx nepalensis subsp. delavayi, commonly known as Delavay's acanthocalyx, is a flowering plant native to the Himalayan region. It belongs to the Rubiaceae family and is characterized by its distinctive yellow flowers with prominent stamens. The plant typically grows in moist, shaded environments at high altitudes. Its leaves are opposite, ovate, and often have a hairy texture. It is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocalyx nepalensis subsp. delavayi is primarily native to the eastern Himalayas, including regions in Nepal, Bhutan, and northern India. It thrives in moist, temperate forests at elevations ranging from 1,500 to 3,000 meters. This subspecies is commonly found in areas with well-drained soils and partial to full shade. It plays an important ecological role in its native habitat by providing food and shelter for various wildlife species. Due to its restricted distribution, it is considered a rare and endemic plant in these regions.",
    "distribution_introduced_art_desc": "Acanthocalyx nepalensis subsp. delavayi was mainly introduced to regions with temperate to subtropical climates, particularly in parts of East Asia and Southeast Asia. It thrives in moist, well-drained soils and is often found in forested areas or along stream banks. This subspecies is valued for its ornamental qualities, including its striking foliage and unique flower structure. It has been cultivated in botanical gardens and private collections due to its aesthetic appeal and adaptability. However, its introduction to new habitats may pose ecological risks if it becomes invasive."
}
