{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon echinus f. distica",
    "plant_slug": "acantholimon-echinus-f-distica",
    "plant_name_scientific": "acantholimon echinus f. distica",
    "intro": "Acantholimon echinus f. distica, commonly known as the two-leaved acantholimon, is a flowering plant native to the Mediterranean region. It is a member of the Plumbagaceae family and is characterized by its compact growth habit and distinctive, spiny leaves. The plant produces small, blue or purple flowers that bloom in summer, attracting various pollinators. It thrives in well-drained soils and is often found in rocky or coastal environments. This variety is noted for its ornamental value and resilience to harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon echinus f. distica is primarily native to the mountainous regions of central and eastern Turkey. It is commonly found in rocky and gravelly soils at elevations ranging from 1,500 to 3,000 meters. This plant thrives in arid and semi-arid climates, often growing in open slopes and among shrubs. It is particularly associated with the Taurus and Pontic mountain ranges. Due to its limited distribution, it is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Acantholimon echinus f. distica was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or Mediterranean climates. It is often found in disturbed sites such as roadsides, gravelly slopes, and open fields. This plant thrives in regions with mild, temperate winters and warm, dry summers. Its introduction has been associated with horticultural interest due to its ornamental value and hardy nature. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
