{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ibrahimii",
    "plant_slug": "acantholimon-ibrahimii",
    "plant_name_scientific": "acantholimon ibrahimii",
    "intro": "Acantholimon ibrahimii, commonly known as the Ibrahim's sea holly, is a flowering plant native to the rocky coastal regions of the Middle East. It belongs to the Plumbagaceae family and is characterized by its succulent, fleshy leaves and striking blue to purple flowers. The plant thrives in arid and saline environments, showcasing its adaptation to harsh coastal conditions. It typically grows in low vegetation, often forming dense clusters along cliffs and dunes. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ibrahimii"
    },
    "taxonomy_art_desc": "Acantholimon ibrahimii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their relatives, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes plants with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, characterized by often blue or purple flowers and a variety of growth forms. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon ibrahimii, a specific plant species within the genus Acantholimon, native to certain regions of the Middle East, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ibrahimii is primarily native to Turkey. This rare plant is found in specific regions within Turkey, particularly in the eastern and southeastern parts of the country. It typically grows in rocky or arid environments, often in areas with limited soil and harsh climatic conditions. Its limited distribution makes it a unique and valuable part of Turkey's flora. Conservation efforts are important to protect this endemic species from habitat loss and environmental changes.",
    "distribution_introduced_art_desc": "Acantholimon ibrahimii was mainly introduced to regions with dry, rocky soils and high altitudes, typically found in mountainous areas. It is commonly found in areas with limited water availability and well-drained soils. This plant is often associated with disturbed or marginal habitats such as slopes and gravelly ground. Its introduction has been noted in several parts of the Middle East and Central Asia. It is valued for its ornamental qualities and ability to thrive in harsh environmental conditions."
}
