{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon gracillimum",
    "plant_slug": "acantholimon-gracillimum",
    "plant_name_scientific": "acantholimon gracillimum",
    "intro": "Acantholimon gracillimum, commonly known as the slender saxifrage, is a flowering plant native to the western United States and parts of Canada. It is a member of the Caryophyllaceae family, characterized by its showy, pink to white flowers that bloom in late spring to early summer. The plant typically grows in rocky or gravelly habitats, such as slopes and open woodlands, where it thrives in well-drained soils. Its leaves are linear and often covered in fine hairs, which help reduce water loss in its arid environment. Acantholimon gracillimum is also notable for its low-growing habit and ability to form dense mats, making it an important component of alpine and subalpine ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon gracillimum"
    },
    "taxonomy_art_desc": "Acantholimon gracillimum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures and vascular systems. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, characterized by their complex flower structures and varied habitats. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral morphology and often adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes herbaceous plants often found in rocky or sandy soils. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their small, often spiny leaves and showy flowers. Its species is Acantholimon gracillimum, a specific plant within the genus Acantholimon, known for its slender growth habit and delicate floral structures, often found in Mediterranean climates.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon gracillimum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central parts. This plant typically grows in rocky and arid environments, often in areas with sparse vegetation. It is adapted to the harsh climatic conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon gracillimum was mainly introduced to areas with well-drained soils and full sun exposure, often found in coastal and inland regions. It is typically distributed in regions with a temperate climate, including parts of California and Oregon in the United States. This plant is commonly seen in disturbed soils, such as roadsides and open fields. Its introduction has been associated with human activity, including landscaping and ecological restoration projects. However, it is not considered invasive and is often used for its ornamental value."
}
