{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon aspadanum",
    "plant_slug": "acantholimon-aspadanum",
    "plant_name_scientific": "acantholimon aspadanum",
    "intro": "Acantholimon aspadanum, commonly known as the Persian sandthorn, is a flowering plant native to the arid regions of Iran and Afghanistan. It belongs to the family Caryophyllaceae and is characterized by its succulent, fleshy leaves adapted to conserve water in dry environments. The plant produces small, yellowish flowers that bloom in late spring or early summer. It thrives in sandy or gravelly soils and is often found in mountainous and semi-desert areas. Due to its hardy nature, it is sometimes cultivated as an ornamental plant in dry climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon aspadanum"
    },
    "taxonomy_art_desc": "Acantholimon aspadanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like spinach and cacti, often characterized by their distinctive flowers and adaptations to various environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes species with showy flowers and often found in arid regions. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon aspadanum, a specific type of flowering plant native to Iran, known for its unique morphology and ecological adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon aspadanum is primarily native to Iran. It is found in the arid and semi-arid regions of the country, particularly in the central and southwestern parts. This plant thrives in rocky and gravelly soils, often in mountainous areas. It is adapted to the harsh climate conditions of its native habitat. Its distribution is limited to specific ecological niches within Iran.",
    "distribution_introduced_art_desc": "Acantholimon aspadanum was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It is commonly found in rocky and arid environments, often growing on slopes and in coastal areas. This plant is adapted to dry conditions and can thrive in well-drained soils. It is sometimes cultivated in gardens for its ornamental value due to its attractive blue or purple flowers. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
