{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis disperma var. villosa",
    "plant_slug": "acanthopsis-disperma-var-villosa",
    "plant_name_scientific": "acanthopsis disperma var. villosa",
    "intro": "Acanthopsis disperma var. villosa, commonly known as the hairy acanthopsis, is a flowering plant native to arid regions of southern Africa. It is characterized by its compact growth habit and hairy foliage, which helps reduce water loss in its harsh environment. The plant produces small, tubular flowers that are typically yellow or orange, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and requires minimal water, making it well-suited for xerophytic gardens. Due to its unique appearance and low maintenance requirements, it is a popular choice among succulent enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis disperma var. villosa is primarily native to the arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils within the Kalahari Desert and surrounding areas. This plant thrives in dry, well-drained environments and is often seen in open grasslands and shrublands. It is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. Its distribution is largely restricted to specific ecological zones where it can receive adequate sunlight and minimal competition.",
    "distribution_introduced_art_desc": "Acanthopsis disperma var. villosa was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and disturbed forests. It thrives in regions with moderate to high light exposure and well-drained soils. This plant is often found in temperate climates with seasonal rainfall patterns. Its introduction has led to its establishment in several regions outside its native range. It is considered an invasive species in some areas due to its rapid growth and competitive nature."
}
