{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium curtisii var. albidum",
    "plant_slug": "acanthophippium-curtisii-var-albidum",
    "plant_name_scientific": "acanthophippium curtisii var. albidum",
    "intro": "Acanthophippium curtisii var. albidum, commonly known as the white-flowered spurge, is a rare and delicate flowering plant native to specific regions of South Africa. It belongs to the Euphorbiaceae family and is characterized by its striking white or pale yellow flowers, which contrast with its narrow, lance-shaped leaves. The plant typically grows in rocky or sandy soils and thrives in full sun, exhibiting a low-growing, herbaceous habit. Due to its limited distribution and habitat specificity, it is considered endangered and requires careful conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium curtisii var. albidum is primarily native to the coastal regions of southern California and northern Baja California, Mexico. This variant is commonly found in sandy or gravelly soils along the shoreline. It thrives in environments with moderate to high salinity and is often associated with dune systems. The plant is adapted to withstand coastal winds and fluctuating moisture levels. Its distribution is limited to these specific ecological niches along the Pacific coast.",
    "distribution_introduced_art_desc": "Acanthophippium curtisii var. albidum was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It is commonly found in regions with temperate climates, particularly in the western United States. This plant thrives in environments where there is moderate rainfall and good air circulation. It is often cultivated in gardens for its ornamental value due to its attractive foliage and flowering habits. However, it is considered an invasive species in some regions, posing a threat to native plant communities."
}
