{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza warscewiczii",
    "plant_slug": "acanthorhiza-warscewiczii",
    "plant_name_scientific": "acanthorhiza warscewiczii",
    "intro": "Acanthorhiza warscewiczii, commonly known as the velvetleaf, is a perennial herbaceous plant native to the southeastern United States. It belongs to the family Malvaceae, which includes cotton and hibiscus, and is characterized by its hairy, glandular leaves. The plant typically grows to a height of 1 to 2 meters, with lance-shaped leaves that are often covered in fine, soft hairs. Its flowers are usually pink to purple, with five petals and a prominent central stamen, and it produces capsule fruits containing numerous small seeds. Acanthorhiza warscewiczii is known for its adaptability to various soil types and its ability to thrive in moist, sunny environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza warscewiczii is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in lowland rainforests and moist, shaded environments. This plant thrives in humid climates with well-drained soil, often growing near streams or in forest understories. Its distribution is also reported in parts of India and Sri Lanka, where it occupies similar ecological niches. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acanthorhiza warscewiczii was mainly introduced to North America, particularly in the eastern United States. It was first documented in the early 20th century and has since spread along the Atlantic coast. The plant thrives in moist, sandy soils and is often found in disturbed habitats such as roadsides and dunes. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction is believed to have occurred through accidental transport via shipping or human activity."
}
