{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodesmos gibarensis",
    "plant_slug": "acanthodesmos-gibarensis",
    "plant_name_scientific": "acanthodesmos gibarensis",
    "intro": "Acanthodesmos gibarensis, commonly known as the giant rock cactus, is a unique succulent native to the arid regions of southern Africa. It features a thick, ribbed stem that can grow up to several meters in height, adapted to store water in its fleshy tissues. The plant produces clusters of small, white flowers during the rainy season, which attract pollinators such as bees and butterflies. Its leaves are modified into spines, reducing water loss and deterring herbivores. The species is well-suited to rocky and sandy soils, thriving in full sun with minimal water requirements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Acanthodesmos",
        "species": "Acanthodesmos gibarensis"
    },
    "taxonomy_art_desc": "Acanthodesmos gibarensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Asterales, a group of flowering plants that includes many familiar species such as daisies and sunflowers, known for their composite flower heads. Its family is Asteraceae, commonly known as the sunflower family, which is characterized by its unique inflorescence called a head or composite flower. Its genus is Acanthodesmos, a group of flowering plants typically found in specific geographic regions, often with distinctive morphological features. Its species is Acanthodesmos gibarensis, a specific type within the genus Acanthodesmos, distinguished by its unique characteristics and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodesmos gibarensis is primarily native to Cuba. It is found in specific regions of the island, particularly in the southern and central areas. This plant thrives in coastal and limestone habitats, often growing in dry, sunny environments. It is a member of the Acanthaceae family and is known for its distinctive floral structures. Due to its limited distribution, it is considered a rare and endemic species within Cuba.",
    "distribution_introduced_art_desc": "Acanthodesmos gibarensis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides and agricultural fields. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in the Mediterranean climate zones of southern Africa. Its introduction has led to its spread in several countries including South Africa, Namibia, and Zimbabwe. It is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation."
}
