{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale pubescens",
    "plant_slug": "acanthopale-pubescens",
    "plant_name_scientific": "acanthopale pubescens",
    "intro": "Acanthopale pubescens, commonly known as the hairy acanthopale, is a perennial shrub native to tropical and subtropical regions. It features woody stems covered in dense, glandular hairs, which give it its common name. The plant produces small, clustered flowers that are typically yellow or greenish-yellow in color. Its leaves are simple, alternate, and often have a rough texture due to the presence of pubescence. Acanthopale pubescens is adapted to arid environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopale",
        "species": "Acanthopale pubescens"
    },
    "taxonomy_art_desc": "Acanthopale pubescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their distinctive morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Lamiales, a group of flowering plants that includes many aromatic plants and is characterized by certain floral and vegetative features. Its family is Acanthaceae, commonly known as the acanthus family, which includes a variety of herbaceous and shrubby plants often with showy flowers. Its genus is Acanthopale, a group of flowering plants typically found in tropical regions, characterized by their specific leaf and flower structures. Its species is Acanthopale pubescens, a specific plant within the genus Acanthopale, known for its hairy appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Burundi",
        "DR Congo",
        "Ethiopia",
        "Kenya",
        "Malawi",
        "Mozambique",
        "Rwanda",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale pubescens is primarily native to Burundi, DR Congo, Ethiopia, Kenya, Malawi, Mozambique, Rwanda, Sudan-South Sudan, Tanzania, Uganda, and Zimbabwe. This species is commonly found in tropical and subtropical regions across these countries. It thrives in open woodland and grassland habitats. The plant is well adapted to the variable climate conditions of its native range. It plays an important ecological role in the local ecosystems where it is found.",
    "distribution_introduced_art_desc": "Acanthopale pubescens was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste grounds, and agricultural fields. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is commonly found in tropical and subtropical regions of Africa, Southeast Asia, and the Pacific Islands. Its introduction is often associated with human activities, including land clearing and accidental seed dispersal. Due to its adaptability, it has become a common weed in many invaded ecosystems."
}
