{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum sedifolium",
    "plant_slug": "acanthophyllum-sedifolium",
    "plant_name_scientific": "acanthophyllum sedifolium",
    "intro": "Acanthophyllum sedifolium, commonly known as the sand mat, is a flowering plant native to arid and semi-arid regions of the Middle East and Central Asia. It is a perennial shrub characterized by its low-growing, mat-like structure and succulent leaves that help it conserve water. The plant produces small, greenish-yellow flowers that bloom in early summer, attracting pollinators such as bees and butterflies. Its adaptations to harsh environments include thick, waxy leaves and deep root systems that enable it to survive in nutrient-poor soils. Acanthophyllum sedifolium plays an important ecological role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum sedifolium"
    },
    "taxonomy_art_desc": "Acanthophyllum sedifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adaptations to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny or thorny structures. Its species is Acanthophyllum sedifolium, a specific type of plant known for its leafy appearance and ability to thrive in harsh, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Pakistan",
        "West Himalaya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum sedifolium is primarily native to Afghanistan, Pakistan, and the West Himalaya. This plant is typically found in arid and semi-arid regions within these areas. It thrives in rocky and sandy soils, often in high-altitude environments. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acanthophyllum sedifolium was mainly introduced to arid and semi-arid regions of central Asia, including parts of Kazakhstan, Mongolia, and China. It is commonly found in sandy and gravelly soils, often in steppes and desert margins. This plant is well adapted to harsh environmental conditions, tolerating high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion. However, its introduction has raised concerns about its potential impact on native plant communities."
}
