{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon doganii",
    "plant_slug": "acantholimon-doganii",
    "plant_name_scientific": "acantholimon doganii",
    "intro": "Acantholimon doganii, commonly known as the Turkish sandthorn, is a flowering plant native to Turkey and the eastern Mediterranean. It belongs to the family Plumbaginaceae and is characterized by its succulent, branched stems and small, spiny leaves. The plant produces clusters of blue or violet flowers during the summer months, which attract pollinators such as bees and butterflies. It is adapted to arid and rocky environments, making it a hardy species suitable for xeriscaping. Its unique morphology and ecological role make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon doganii"
    },
    "taxonomy_art_desc": "Acantholimon doganii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of specialized structures such as stomata and vascular tissues. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often showy flowers and sometimes toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and colorful flowers. Its species is Acantholimon doganii, a specific plant within the genus Acantholimon, native to certain regions of Turkey, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon doganii is primarily native to Turkey. It is found in various regions across the country, particularly in the eastern and southeastern areas. This plant typically grows in rocky and arid environments, often in mountainous regions. It is adapted to the dry and semi-arid climates of its native habitat. Due to its specific ecological requirements, it is not commonly found outside of its natural range in Turkey.",
    "distribution_introduced_art_desc": "Acantholimon doganii was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and drought tolerance. It is commonly used in rock gardens and xeriscapes where low maintenance and water efficiency are desired. The plant thrives in well-drained soils and full sun, making it suitable for arid and semi-arid regions. Its introduction has led to its cultivation in various parts of the world, including North America and Europe. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
