{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum popovii",
    "plant_slug": "acanthophyllum-popovii",
    "plant_name_scientific": "acanthophyllum popovii",
    "intro": "Acanthophyllum popovii, commonly known as the Popov's spiny broom, is a low-growing, succulent shrub native to the arid regions of Central Asia. It features dense clusters of spiny, fleshy stems that store water, allowing it to survive in harsh, dry environments. The plant produces small, yellowish flowers during the summer months, which are adapted for pollination by wind or insects. Its leaves are typically reduced to small, scale-like structures, minimizing water loss through transpiration. Acanthophyllum popovii plays a crucial role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum popovii"
    },
    "taxonomy_art_desc": "Acanthophyllum popovii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flower structures and often have a preference for arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically found in arid and semi-arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum popovii, a specific type of plant native to certain regions of Central Asia, known for its adaptations to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tadzhikistan",
        "Turkmenistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum popovii is primarily native to Tadzhikistan, Turkmenistan, and Uzbekistan. This plant is adapted to the arid and semi-arid environments found in these Central Asian countries. It typically grows in sandy or gravelly soils, often in desert or steppe regions. The species is part of the Amaranthaceae family and is known for its resilience to harsh climatic conditions. Its distribution is closely linked to the ecological characteristics of the region, making it a characteristic flora of the area.",
    "distribution_introduced_art_desc": "Acanthophyllum popovii was mainly introduced to areas with arid and semi-arid climates, where it thrives in sandy or gravelly soils. It is commonly found in regions of Central Asia, including Kazakhstan, Uzbekistan, and southern Russia. This plant is often used for soil stabilization due to its extensive root system and ability to withstand harsh environmental conditions. It has been introduced to other parts of the world as part of ecological restoration projects. However, its spread is limited by its specific climatic and soil requirements."
}
