{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ekatherinae",
    "plant_slug": "acantholimon-ekatherinae",
    "plant_name_scientific": "acantholimon ekatherinae",
    "intro": "Acantholimon ekatherinae, commonly known as the Kyzylkum spurge, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Montiaceae and is characterized by its low-growing, succulent appearance, adapted to survive in harsh, dry environments. The plant produces small, often inconspicuous flowers that are typically blue or purple in color. It has hairy leaves and stems, which help reduce water loss in its arid habitat. Due to its limited distribution and specific ecological requirements, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon ekatherinae"
    },
    "taxonomy_art_desc": "Acantholimon ekatherinae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern gymnosperms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, known for their diverse morphological features. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid and coastal regions, known for their succulent leaves and showy flowers. Its species is Acantholimon ekatherinae, a specific plant species within the genus Acantholimon, named after Ekaterina, likely in recognition of its discoverer or a significant contribution to botany.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kazakhstan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ekatherinae is primarily native to Kazakhstan and Uzbekistan. This species is found in the arid and semi-arid regions of these countries. It typically grows in sandy or gravelly soils, often in steppe or desert environments. The plant is adapted to the harsh climatic conditions of Central Asia. Its distribution is limited to specific areas within these two nations.",
    "distribution_introduced_art_desc": "Acantholimon ekatherinae was mainly introduced to areas with dry, rocky soils and moderate to high elevations. It thrives in regions with limited water availability and full sun exposure. This plant is commonly found in alpine and subalpine habitats. Its introduction has been documented in several regions of Europe and parts of Asia. It is valued for its ornamental appeal and ability to stabilize soil in harsh environments."
}
