{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon grammophyllum",
    "plant_slug": "acantholimon-grammophyllum",
    "plant_name_scientific": "acantholimon grammophyllum",
    "intro": "Acantholimon grammophyllum, commonly known as the narrow-leaved flax, is a flowering plant native to the arid regions of the western United States. It belongs to the family Plumbagaceae and is characterized by its slender, grass-like leaves and small, blue to violet flowers. The plant is adapted to survive in dry, sandy soils and is often found in desert environments. It has a compact growth habit and is known for its ability to thrive in low-nutrient conditions. Its fibrous roots help it retain moisture, making it well-suited for xerophytic habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon grammophyllum"
    },
    "taxonomy_art_desc": "Acantholimon grammophyllum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes many succulent and salt-tolerant species, often found in arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often showy flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, known for their distinctive leaf and flower structures. Its species is Acantholimon grammophyllum, a specific plant within the genus Acantholimon, characterized by its unique morphological features and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon grammophyllum is primarily native to Afghanistan. This plant is found in the mountainous regions of the country, particularly in the eastern and central parts. It thrives in high-altitude environments, often in rocky or gravelly soils. The species is adapted to the cold and arid conditions typical of Afghanistan's mountainous terrain. It is an important part of the local flora and is often found in alpine meadows.",
    "distribution_introduced_art_desc": "Acantholimon grammophyllum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland regions with a Mediterranean climate. It is commonly found in disturbed soils such as roadsides, gravelly slopes, and rocky areas. This plant thrives in environments with low moisture and high sunlight, making it adaptable to a variety of habitats. Its introduction has been documented in several regions of California, particularly in the western United States. Due to its resilience and ornamental value, it has become a popular choice for landscaping in arid and semi-arid regions."
}
