{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthorhiza stauracantha",
    "plant_slug": "acanthorhiza-stauracantha",
    "plant_name_scientific": "acanthorhiza stauracantha",
    "intro": "Acanthorhiza stauracantha, commonly known as the clustered acanthorhiza, is a flowering plant native to parts of Southeast Asia. It belongs to the family Rubiaceae, which includes coffee and gardenias, and is characterized by its small, clustered inflorescences. The plant has opposite, ovate leaves with serrated margins and produces small, white to pale pink flowers. Its fruit is a capsule that splits open to release seeds, typical of many members of its family. Acanthorhiza stauracantha is often found in moist, shaded environments such as forest floors or along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthorhiza stauracantha is primarily native to the eastern United States, specifically found in the southeastern region. It is commonly found in wetlands, swamps, and along the edges of ponds and lakes. This plant thrives in moist, sandy soils and is often associated with disturbed or transitional habitats. It is particularly common in states such as Florida, Georgia, and South Carolina. Its distribution is limited to the southeastern coastal plain of the United States.",
    "distribution_introduced_art_desc": "Acanthorhiza stauracantha was mainly introduced to the eastern and southeastern United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This species thrives in moist, sandy soils and is often associated with open habitats. It has been reported in several states including Florida, Georgia, and South Carolina. Its introduction has raised concerns due to its potential to outcompete native plant species in invaded areas."
}
