{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon catenatum",
    "plant_slug": "acantholimon-catenatum",
    "plant_name_scientific": "acantholimon catenatum",
    "intro": "Acantholimon catenatum, commonly known as the chain-thimble cress, is a flowering plant native to the Mediterranean region. It belongs to the family Brassicaceae, which includes many other well-known plants such as cabbages and mustards. The plant is characterized by its small, clustered flowers and hairy, linear leaves. It typically grows in rocky or sandy soils and is adapted to dry, sunny environments. Acantholimon catenatum is often found in coastal areas and is valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon catenatum"
    },
    "taxonomy_art_desc": "Acantholimon catenatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Caryophyllales, which includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants known for their often blue or purple flowers and some species containing toxic compounds. Its genus is Acantholimon, a group of flowering plants typically found in arid or semi-arid regions, characterized by their spiny or bristly leaves. Its species is Acantholimon catenatum, a specific plant within this genus known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon catenatum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and southern parts. This plant typically grows in rocky and arid environments, adapting to the harsh climate of its native habitat. It is often seen in high-altitude areas where vegetation is sparse. Due to its specific ecological requirements, it is not found outside of its native range in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon catenatum was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dunes. It thrives in environments with moderate to high salinity and is commonly found in Mediterranean climates. This plant is typically associated with disturbed habitats and can spread rapidly in such conditions. It has been reported in several regions of Europe, including southern Spain and parts of France. Its introduction has raised concerns due to its potential to outcompete native flora in invaded areas."
}
