{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon leucochlorum",
    "plant_slug": "acantholimon-leucochlorum",
    "plant_name_scientific": "acantholimon leucochlorum",
    "intro": "Acantholimon leucochlorum, commonly known as the white-flowered thrift, is a perennial flowering plant native to the rocky coastal areas of southern California and Baja California. It produces small, white or pale yellow flowers that bloom in late spring to early summer. The plant has narrow, blue-gray leaves that are adapted to thrive in dry, saline environments. It is often found growing in coastal dunes and on rocky slopes where it tolerates strong winds and salt spray. Its ability to thrive in harsh conditions makes it an important component of coastal plant communities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon leucochlorum"
    },
    "taxonomy_art_desc": "Acantholimon leucochlorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with distinctive blue or white flowers and often found in dry habitats. Its genus is Acantholimon, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon leucochlorum, a specific plant within this genus known for its white flowers and preference for rocky, dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon leucochlorum is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant typically grows in rocky and gravelly soils at high altitudes. It is adapted to the arid and semi-arid climate of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon leucochlorum was mainly introduced to areas with sandy or gravelly soils, often in arid or semi-arid environments. It is commonly found in coastal dunes and disturbed areas where it can establish itself quickly. This plant is particularly adapted to low-nutrient conditions and can thrive in environments with limited water availability. Its introduction has been observed in regions where it was not previously native, often as a result of human activity or accidental dispersal. Due to its hardy nature, it can become invasive in certain ecosystems if not managed properly."
}
