{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax evodiifolius var. glaucus",
    "plant_slug": "acanthopanax-evodiifolius-var-glaucus",
    "plant_name_scientific": "acanthopanax evodiifolius var. glaucus",
    "intro": "Acanthopanax evodiifolius var. glaucus, commonly known as the glaucous arrowhead plant, is a shrub native to East Asia. It is characterized by its distinctive, often compound leaves that are typically glaucous, or covered in a whitish waxy coating. The plant produces small, greenish-yellow flowers followed by red berries that are edible for humans and animals. It thrives in temperate climates and is often found in forested areas. Its botanical features make it a notable species in both horticulture and traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax evodiifolius var. glaucus is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in forested areas, particularly in mountainous regions with a temperate climate. This variant is known for its distinctive glaucous foliage, which helps it adapt to its natural habitat. It thrives in well-drained soils and is often associated with mixed deciduous and evergreen forests. The plant is valued for its medicinal properties and is sometimes used in traditional herbal remedies.",
    "distribution_introduced_art_desc": "Acanthopanax evodiifolius var. glaucus was mainly introduced to areas with temperate climates and well-drained soils, typically found in regions of East Asia. It thrives in forested environments, often growing as a shrub or small tree. This plant is commonly found in mountainous regions where it benefits from partial shade and moderate humidity. Its introduction has been noted in several botanical gardens and conservation areas due to its ornamental value. However, it is considered invasive in some regions where it outcompetes native vegetation."
}
