{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus platyphyllus",
    "plant_slug": "acanthus-platyphyllus",
    "plant_name_scientific": "acanthus platyphyllus",
    "intro": "Acanthus platyphyllus, commonly known as the broad-leaf acanthus, is a striking ornamental plant native to the Mediterranean region. It is characterized by its large, palmately lobed leaves that are often covered in a dense layer of soft, silvery hairs. The plant produces tall spikes of showy, spiky flowers in shades of purple and pink, which bloom in the summer months. It thrives in full sun to partial shade and requires well-drained soil to prevent root rot. Acanthus platyphyllus is often used in gardens and landscapes for its dramatic foliage and long-lasting floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "[WRONG START] Acanthus platyphyphillus is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky coastal areas and dry, sunny environments. This plant is commonly found along cliffs and in coastal scrub habitats. It is well adapted to salt spray and poor soils. Its distribution is closely linked to the historical and geological features of the Mediterranean basin.",
    "distribution_introduced_art_desc": "Acanthus platyphyllus was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and architectural form. It is commonly used in gardens and as a decorative plant in public spaces because of its ability to thrive in well-drained soils. The plant is native to southern Africa but has been widely cultivated in other regions with similar climatic conditions. It is often grown as a perennial in temperate climates, where it can add a dramatic visual element to gardens. However, it is important to note that it may become invasive in certain environments if not properly managed."
}
