{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus cristatus",
    "plant_slug": "acanthus-cristatus",
    "plant_name_scientific": "acanthus cristatus",
    "intro": "Acanthus cristatus, commonly known as the crown-of-thorns, is a striking plant native to South Africa. It is characterized by its tall, spiky inflorescences that resemble a crown, hence its common name. The plant features large, waxy, dark green leaves with a rough texture and prominent veins. Its flowers are typically greenish-yellow and appear in summer, adding a unique visual element to its appearance. Acanthus cristatus is often cultivated as an ornamental plant due to its dramatic and architectural form.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus cristatus is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky coastal areas and cliffs where it is exposed to salt spray and strong winds. This plant is commonly found in countries such as Spain, Italy, Greece, and Turkey. It prefers well-drained soils and full sun exposure. Due to its hardy nature, it is often used in horticulture for its ornamental value.",
    "distribution_introduced_art_desc": "Acanthus cristatus was mainly introduced to ornamental horticulture and landscape design due to its striking, palmate leaves and showy, spiky flowers. It is commonly found in gardens and cultivated areas where it is valued for its aesthetic appeal. The plant is native to the Mediterranean region but has been widely introduced to other parts of the world, including North America and Europe. It thrives in well-drained soil and full sun, making it a popular choice for decorative purposes. However, in some regions, it has become invasive, outcompeting native species and altering local ecosystems."
}
