{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale cameronica",
    "plant_slug": "acanthopale-cameronica",
    "plant_name_scientific": "acanthopale cameronica",
    "intro": "Acanthopale cameronica, commonly known as the Cameron's acanthopale, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the family Rubiaceae, which includes coffee and gardenias, and is characterized by its small, clustered flowers. The plant typically grows as a shrub or small tree, with dark green, glossy leaves that are often covered in fine hairs. Its flowers are usually white or pale yellow, and it produces small, red berries that are edible but not commonly consumed by humans. Acanthopale cameronica is valued for its ornamental appeal and is sometimes cultivated in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale cameronica is primarily native to the island of Cameron Highlands in Malaysia. It is found in the highland regions of Pahang, specifically in the area around the Cameron Highlands. This plant thrives in the cool, moist climate of the mountainous terrain. It is commonly found in secondary forests and along forest edges. Its distribution is limited to this specific region due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Acanthopale cameronica was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activity. It thrives in environments with moderate to high light exposure and well-drained soils. This plant is commonly found in coastal regions and disturbed landscapes such as roadsides and abandoned fields. Its introduction has led to its establishment in several regions outside its native range. However, its impact on local ecosystems remains largely undocumented."
}
