{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum sarawschanicum",
    "plant_slug": "acanthophyllum-sarawschanicum",
    "plant_name_scientific": "acanthophyllum sarawschanicum",
    "intro": "Acanthophyllum sarawschanicum, commonly known as the Kashmir spurge, is a flowering plant native to the high altitudes of the Himalayas. It belongs to the family Euphorbiaceae and is characterized by its succulent, spiny stems and small, inconspicuous flowers. The plant is adapted to arid and cold environments, with thick leaves that help reduce water loss. It typically grows in rocky soils and is found in regions such as Pakistan, India, and Afghanistan. Due to its unique morphology and ecological niche, it is of interest to botanists studying plant adaptation in extreme climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum sarawschanicum"
    },
    "taxonomy_art_desc": "Acanthophyllum sarawschanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with a distinctive floral structure and a variety of ecological adaptations. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often succulent leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum sarawschanicum, a specific plant within the genus, native to certain regions of Central Asia, known for its adaptations to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tadzhikistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum sarawschanicum is primarily native to Tajikistan. It is commonly found in the mountainous regions of the country, particularly in the Pamir and Alay mountain ranges. This plant thrives in arid and semi-arid environments, often growing in rocky or gravelly soils. It is well adapted to the harsh climatic conditions of Central Asia. Its distribution is limited to specific ecological niches within Tajikistan's high-altitude areas.",
    "distribution_introduced_art_desc": "Acanthophyllum sarawschanicum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in countries like Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in sandy and gravelly soils, often in steppe and desert environments. This plant is well adapted to harsh climatic conditions, including high temperatures and low precipitation. It plays a role in stabilizing dunes and preventing soil erosion. Its introduction has been largely driven by its ecological resilience and potential for land rehabilitation."
}
