{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium delilei",
    "plant_slug": "acanthodium-delilei",
    "plant_name_scientific": "acanthodium delilei",
    "intro": "Acanthodium delilei, commonly known as the African feather grass, is a flowering plant native to southern Africa. It belongs to the Poaceae family, which includes grasses, and is characterized by its slender, tufted growth habit. The plant features fine, needle-like leaves and produces small, inconspicuous flowers that are typically arranged in spikelets. It is often found in sandy or rocky soils and is adapted to arid environments. Acanthodium delilei is valued for its ornamental appeal and is sometimes cultivated in gardens for its delicate appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium delilei is primarily native to the Mediterranean region, particularly France, Italy, and parts of southern Europe. It is commonly found in rocky and coastal areas, often growing on cliffs or among limestone formations. This plant thrives in well-drained soils and is adapted to the harsh, sunny conditions of its native habitat. It is also occasionally reported in North Africa and the Canary Islands. Due to its specific environmental requirements, it is considered a rare and localized species within its range.",
    "distribution_introduced_art_desc": "Acanthodium delilei was mainly introduced to the Mediterranean region through human activities such as trade and travel. It thrives in disturbed soils and has adapted well to urban and agricultural environments. The plant's rapid growth and ability to spread via seeds have contributed to its establishment in new areas. It is often found in coastal areas and along roadsides, where it can outcompete native vegetation. Due to its invasive potential, it is considered a problematic species in some parts of its introduced range."
}
