{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon petuniiflorum",
    "plant_slug": "acantholimon-petuniiflorum",
    "plant_name_scientific": "acantholimon petuniiflorum",
    "intro": "Acantholimon petuniiflorum, commonly known as the purple sand-verbena, is a flowering plant native to the western United States. It is characterized by its low-growing, mat-forming habit with fleshy, blue-green leaves. The plant produces clusters of small, showy purple or pink flowers that bloom in late spring to early summer. It thrives in well-drained soils and full sun, making it well-suited for rocky or sandy habitats. Its ornamental value and drought tolerance make it a desirable plant for xeriscaping and native gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon petuniiflorum"
    },
    "taxonomy_art_desc": "Acantholimon petuniiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide variety of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often show adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, known for their succulent leaves and showy flowers. Its species is Acantholimon petuniiflorum, a specific type of plant within the genus Acantholimon, known for its attractive, petunia-like flowers and its adaptation to dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran",
        "Iraq",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon petuniiflorum is primarily native to Iran, Iraq, and Turkey. This plant is typically found in regions with rocky or sandy soils, often in mountainous or arid environments. It is well adapted to the climate conditions of these areas, which include hot, dry summers and cold, wet winters. The distribution of this species is limited to specific geographic locations within these countries. It plays a role in local ecosystems and is of interest to botanists and conservationists.",
    "distribution_introduced_art_desc": "Acantholimon petuniiflorum was mainly introduced to gardens and rocky habitats in the western United States, particularly in California and Oregon. It is valued for its attractive, showy flowers that bloom in late spring to early summer. This plant thrives in well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. Due to its ornamental appeal, it has been cultivated by gardeners interested in native and drought-tolerant plants. However, its introduction has raised concerns about its potential to become invasive in certain regions."
}
