{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax divaricatus f. inermis",
    "plant_slug": "acanthopanax-divaricatus-f-inermis",
    "plant_name_scientific": "acanthopanax divaricatus f. inermis",
    "intro": "Acanthopanax divaricatus f. inermis, commonly known as the smooth devil's ivy, is a variant of the genus Acanthopanax, characterized by its lack of thorns. It is a climbing shrub native to eastern Asia, particularly China, where it thrives in forested areas. The plant features compound leaves with serrated edges and produces small, greenish-yellow flowers that are clustered in umbels. Its roots are used in traditional Chinese medicine for their purported health benefits. The f. inermis form is distinguished by its smooth stems, making it distinct from other forms of the species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax divaricatus f. inermis is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas within these countries. This plant thrives in temperate climates and is often associated with shaded or semi-shaded environments. It is typically found at elevations ranging from 1,000 to 2,500 meters. The subspecies is known for its medicinal properties and is used in traditional herbal remedies.",
    "distribution_introduced_art_desc": "Acanthopanax divaricatus f. inermis was mainly introduced to regions with temperate climates and well-drained soils, where it thrives in partial to full sunlight. It is commonly found in forested areas and along riverbanks, where it contributes to local biodiversity. This plant is valued for its ornamental qualities and has been introduced for horticultural purposes in several countries. Its introduction has also led to its use in traditional medicine in some regions. However, it is important to monitor its spread to prevent potential ecological impacts."
}
