{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum takhtajanii",
    "plant_slug": "acanthophyllum-takhtajanii",
    "plant_name_scientific": "acanthophyllum takhtajanii",
    "intro": "Acanthophyllum takhtajanii, commonly known as the Afghan spiny saxifrage, is a low-growing perennial plant native to arid and semi-arid regions of Central Asia. It is characterized by its succulent, spiny stems and small, fleshy leaves adapted to conserve water. The plant produces clusters of pink or white flowers during the summer months, which attract pollinators such as bees and butterflies. It thrives in sandy or rocky soils and is well-suited to harsh environmental conditions. Due to its resilience, it plays a vital role in stabilizing soil and preventing erosion in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum takhtajanii"
    },
    "taxonomy_art_desc": "Acanthophyllum takhtajanii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and photosynthetic capabilities. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert plants, often with distinctive floral and vegetative features. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often hairy leaves. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their spiny leaves and small flowers. Its species is Acanthophyllum takhtajanii, a specific plant species within the genus, native to certain arid regions and adapted to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Transcaucasus"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum takhtajanii is primarily native to the Transcaucasus. It is found in the mountainous regions of this area, which spans parts of modern-day Armenia, Azerbaijan, and Georgia. This plant thrives in arid and semi-arid environments, often growing in rocky or sandy soils. It is adapted to the harsh climatic conditions of the region, including high altitudes and limited water availability. The species is part of the flora unique to the Transcaucasus, contributing to the biodiversity of the area.",
    "distribution_introduced_art_desc": "Acanthophyllum takhtajanii was mainly introduced to arid and semi-arid regions of Central Asia, particularly in countries like Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in sandy and gravelly soils, often in dunes and along the edges of salt lakes. This plant is well adapted to harsh environmental conditions, including high temperatures and low precipitation. It plays a role in stabilizing soil and preventing erosion in these fragile ecosystems. Its introduction has been part of efforts to restore degraded landscapes in the region."
}
