{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus greuterianus",
    "plant_slug": "acanthus-greuterianus",
    "plant_name_scientific": "acanthus greuterianus",
    "intro": "Acanthus greuterianus, commonly known as the narrow-leaved acanthus, is a species of flowering plant in the family Acanthaceae. It is native to tropical and subtropical regions of Africa, particularly South Africa. The plant is characterized by its lance-shaped leaves and showy, spike-like inflorescences that bear clusters of small, tubular flowers. It thrives in well-drained soil and full sun, making it suitable for gardens in warm climates. Its ornamental value has led to its cultivation in horticultural settings despite its specific environmental requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus greuterianus is primarily native to the Canary Islands, specifically Tenerife and La Gomera. It is found in rocky coastal areas and dry, sunny habitats. This species is part of the Acanthus genus, which is known for its ornamental leaves and spires of flowers. It thrives in Mediterranean-type climates with mild, wet winters and warm, dry summers. Due to its limited distribution, it is considered a rare and endemic plant within its range.",
    "distribution_introduced_art_desc": "Acanthus greuterianus was mainly introduced to regions with temperate climates, particularly in parts of Europe and North America. It thrives in well-drained soils and full sunlight, making it suitable for gardens and landscaped areas. This plant is often cultivated for its ornamental value due to its striking foliage and flower clusters. However, it has become invasive in some areas, outcompeting native species. Proper management is essential to prevent its spread in natural ecosystems."
}
