{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthocarpea sulcata",
    "plant_slug": "acanthocarpea-sulcata",
    "plant_name_scientific": "acanthocarpea sulcata",
    "intro": "Acanthocarpea sulcata, commonly known as the serrated acanthocarpea, is a flowering plant belonging to the family Acanthaceae. It is native to tropical regions of Africa and is characterized by its distinctive serrated leaves and showy, tubular flowers. The plant typically grows in moist, shaded environments, such as forest understories or along stream banks. Its flowers are often visited by bees and other pollinators, contributing to its ecological role in supporting insect biodiversity. The plant's unique morphology and habitat preferences make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthocarpea sulcata is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as South Africa, Kenya, and Tanzania. It is commonly found in grasslands, savannas, and along riverbanks where it thrives in well-drained soils. This plant is adapted to dry and semi-arid climates, making it a characteristic species of these ecosystems. It plays an important role in local biodiversity and is often used in traditional medicine. Its distribution is closely linked to the availability of sunlight and moderate rainfall.",
    "distribution_introduced_art_desc": "Acanthocarpea sulcata was mainly introduced to control invasive plant species through biological control methods. It was introduced to specific regions where its target weeds were prevalent. The plant was distributed in areas with suitable climate conditions for its growth. It was primarily introduced to the United States and parts of Europe. However, its introduction has raised concerns about potential ecological impacts."
}
