{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus ciliaris",
    "plant_slug": "acanthus-ciliaris",
    "plant_name_scientific": "acanthus ciliaris",
    "intro": "Acanthus ciliaris, commonly known as the narrow-leaved acanthus, is a flowering plant native to southern Europe and parts of the Middle East. It is characterized by its striking, spiny leaves that are often used in ornamental horticulture. The plant produces tall spikes of small, pale blue or purple flowers in the summer months. It thrives in well-drained soils and full sun, making it suitable for rock gardens and borders. Acanthus ciliaris is also valued for its historical use in classical art and architecture as a decorative motif.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus ciliaris is primarily native to southern Europe, North Africa, and the Middle East. It is commonly found in regions such as Spain, Portugal, Italy, and parts of the Mediterranean basin. This plant thrives in coastal areas and sandy soils, often growing along the edges of dunes and rocky shores. It is also present in some parts of the United States, particularly in California and Florida, where it has been introduced. Despite its ornamental appeal, it is considered an invasive species in certain regions outside its native range.",
    "distribution_introduced_art_desc": "Acanthus ciliaris was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and ornate floral structure. It is commonly used in gardens and public spaces for its aesthetic appeal and hardy nature. Despite its ornamental value, it has become invasive in some regions, outcompeting native vegetation. The plant thrives in moist, well-drained soils and can spread through both seeds and rhizomes. Its introduction has led to ecological concerns in areas where it is not native."
}
