{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum borsczowii",
    "plant_slug": "acanthophyllum-borsczowii",
    "plant_name_scientific": "acanthophyllum borsczowii",
    "intro": "Acanthophyllum borsczowii, commonly known as the Borsczow's spiny cactus, is a succulent plant native to the arid regions of Central Asia. It is characterized by its dense, spiny stems that store water, allowing it to survive in harsh, dry environments. The plant produces small, yellow flowers during the summer months, adding a striking contrast to its rugged appearance. Its leaves are typically reduced to spines, minimizing water loss through transpiration. Acanthophyllum borsczowii plays a vital role in its ecosystem by providing shelter and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum borsczowii is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and southern Siberia. It thrives in sandy and gravelly soils, often found in steppe and desert environments. This plant is well adapted to harsh climatic conditions, including extreme temperature fluctuations and limited precipitation. It plays a vital role in stabilizing soil and preventing erosion in its native habitat. Due to its specialized requirements, it is not commonly found outside of these specific geographic areas.",
    "distribution_introduced_art_desc": "Acanthophyllum borsczowii was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Kazakhstan and Uzbekistan. It thrives in sandy and saline soils, making it well-suited for disturbed and marginal lands. The plant is often found in dunes and along the edges of salt lakes, where it plays a role in stabilizing soil and preventing erosion. Its introduction has been associated with human activities such as grazing and land use changes. However, its spread is limited by its specific environmental requirements and climate conditions."
}
