{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon truncatum",
    "plant_slug": "acantholimon-truncatum",
    "plant_name_scientific": "acantholimon truncatum",
    "intro": "Acantholimon truncatum, commonly known as the short-fruited sandthrift, is a flowering plant native to the arid regions of the Mediterranean and parts of southern Europe. It is a low-growing perennial that thrives in sandy or gravelly soils, often found in coastal dunes and dry grasslands. The plant produces small, blue to purple flowers that bloom in late spring or early summer. Its leaves are typically linear and covered in fine hairs, which help reduce water loss in its harsh environment. Acantholimon truncatum is valued for its ornamental appeal and ecological role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon truncatum"
    },
    "taxonomy_art_desc": "Acantholimon truncatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a diverse range of flower structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with showy flowers and often found in sandy or rocky soils. Its genus is Acantholimon, a genus of flowering plants typically found in arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon truncatum, a specific plant within the genus Acantholimon, known for its distinctive morphology and adaptation to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon truncatum is primarily native to Iran. It is found in the arid and semi-arid regions of the country, particularly in the central and eastern parts. This species thrives in rocky and gravelly soils, often in mountainous areas. It is adapted to the harsh climate and limited water availability typical of its habitat. The plant is commonly found in regions such as Kerman, Yazd, and Sistan and Baluchestan provinces.",
    "distribution_introduced_art_desc": "Acantholimon truncatum was mainly introduced to disturbed soils and rocky habitats, often in arid or semi-arid regions. It is commonly found in areas with low nutrient levels and poor soil structure. This plant thrives in environments where competition from native vegetation is minimal. Its introduction has been noted in several regions of the western United States. However, its impact on local ecosystems remains largely undocumented."
}
