{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon annae",
    "plant_slug": "acantholimon-annae",
    "plant_name_scientific": "acantholimon annae",
    "intro": "Acantholimon annae, commonly known as the Ann's thornscale, is a flowering plant native to the rocky habitats of the Mediterranean region. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming structure with silver-gray foliage. The plant produces small, blue to violet flowers that bloom in early spring, attracting various pollinators. Its leaves are covered in fine, scale-like hairs, which help reduce water loss in arid conditions. Acantholimon annae is valued for its ornamental appeal and is often cultivated in rock gardens and dry landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon annae"
    },
    "taxonomy_art_desc": "Acantholimon annae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive vascular systems and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms, often with simple flower structures and diverse leaf forms. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often blue or purple flowers and medicinal properties. Its genus is Acantholimon, a genus of flowering plants typically found in arid and semi-arid regions, known for their spiny leaves and showy flowers. Its species is Acantholimon annae, a specific plant within the genus Acantholimon, distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon annae is primarily native to Uzbekistan. It is found in the arid and semi-arid regions of the country, particularly in the southern and central areas. This plant thrives in rocky and sandy soils, often growing in mountainous and steppe environments. It is adapted to the harsh climate of Uzbekistan, with its distribution limited to specific ecological niches. Due to its restricted range, it is considered a rare and endemic species within the region.",
    "distribution_introduced_art_desc": "Acantholimon annae was mainly introduced to areas with well-drained soils and moderate climates, often found in rocky or gravelly habitats. It is commonly associated with coastal and inland dunes, where it thrives in sandy or loamy soils. This plant prefers full sun exposure and is drought-tolerant, making it suitable for arid and semi-arid environments. It has been observed in regions such as California, Oregon, and parts of the Pacific Northwest. Its distribution is largely limited to areas where it can establish itself in open, disturbed soils with minimal competition."
}
