{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon scabrellum var. scabrellum",
    "plant_slug": "acantholimon-scabrellum-var-scabrellum",
    "plant_name_scientific": "acantholimon scabrellum var. scabrellum",
    "intro": "Acantholimon scabrellum var. scabrellum, commonly known as the rough stonecress, is a flowering plant native to the Mediterranean region. It is characterized by its upright growth habit and dense clusters of small, greenish-yellow flowers. The plant has hairy, often glandular leaves that are typically blue-green in color. It thrives in rocky or gravelly soils and is adapted to dry, sunny conditions. This variety is known for its resilience and is often found in coastal and mountainous areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon scabrellum"
    },
    "taxonomy_art_desc": "Acantholimon scabrellum var. scabrellum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which includes vascular plants with a diverse range of forms, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar families such as Magnoliaceae and Lauraceae, known for their primitive floral structures. Its order is Caryophyllales, a group of flowering plants that includes species such as carnations and beets, often characterized by their distinctive flower structures and adaptations to various environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, which includes species with often showy flowers and some medicinal uses. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky environments, characterized by their succulent leaves and showy flowers. Its species is Acantholimon scabrellum, a specific type within the genus Acantholimon, known for its distinctive morphology and ecological adaptations to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon scabrellum var. scabrellum is primarily native to Iran. This plant is typically found in rocky and arid environments within the country. It thrives in regions with low rainfall and well-drained soils. Its distribution is limited to specific ecological niches in Iran's mountainous and desert areas. The species is adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acantholimon scabrellum var. scabrellum was mainly introduced to disturbed soils and rocky areas in the western United States. It is commonly found in arid and semi-arid regions, particularly in California, Nevada, and Utah. This plant thrives in well-drained soils and full sun exposure. It is often seen along roadsides, in open woodlands, and on slopes. Its introduction has been noted in ecological studies due to its adaptability and potential impact on native plant communities."
}
