{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon glumaceum",
    "plant_slug": "acantholimon-glumaceum",
    "plant_name_scientific": "acantholimon glumaceum",
    "intro": "Acantholimon glumaceum, commonly known as the glume rush, is a perennial herbaceous plant native to the Mediterranean region. It typically grows in rocky or sandy soils and thrives in sunny, well-drained environments. The plant features narrow, grass-like leaves and produces small, inconspicuous flowers in clusters. Its scientific name reflects its characteristic glume-like bracts surrounding the flowers. Acantholimon glumaceum is often found in coastal and inland habitats, contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon glumaceum"
    },
    "taxonomy_art_desc": "Acantholimon glumaceum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often salt-tolerant species. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadplant family, characterized by their often showy flowers. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, known for their succulent leaves and showy flowers. Its species is Acantholimon glumaceum, a specific plant within the genus Acantholimon, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "North Caucasus",
        "Transcaucasus",
        "Türkey"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon glumaceum is primarily native to the North Caucasus, Transcaucasus, and Turkey. This plant is typically found in rocky or mountainous regions within these areas. It thrives in dry, sunny environments with well-drained soils. Its distribution is limited to specific habitats in these geographic regions. The species is relatively rare and is often associated with alpine or subalpine ecosystems.",
    "distribution_introduced_art_desc": "Acantholimon glumaceum was mainly introduced to areas with well-drained sandy or gravelly soils, often found in arid or semi-arid regions. It thrives in environments with low moisture and full sun exposure, making it suitable for xerophytic habitats. This plant is commonly found in disturbed soils, such as along roadsides or in degraded landscapes. Its distribution is largely limited to regions with specific climatic conditions that support its growth. It is considered an invasive species in some areas where it outcompetes native vegetation."
}
