{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholobivia tegeleriana",
    "plant_slug": "acantholobivia-tegeleriana",
    "plant_name_scientific": "acantholobivia tegeleriana",
    "intro": "Acantholobivia tegeleriana, commonly known as the Tegeler's acantholobivia, is a rare and striking member of the Cactaceae family. It is native to the arid regions of South America, particularly in parts of Argentina and Chile. The plant is characterized by its spiny, segmented stems and clusters of vibrant yellow flowers that bloom during the dry season. Its adaptations include thick, fleshy stems for water storage and reduced leaves to minimize water loss. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholobivia tegeleriana is primarily native to the arid regions of southern Africa, specifically Namibia and South Africa. It is commonly found in rocky outcrops and dry, sandy soils within these areas. This species thrives in environments with low rainfall and high sunlight exposure. It is often associated with quartzite formations and other mineral-rich substrates. Due to its limited distribution, it is considered a rare and localized plant species in its native habitat.",
    "distribution_introduced_art_desc": "Acantholobivia tegeleriana was mainly introduced to specific regions with suitable climatic conditions, including areas with warm temperatures and well-drained soils. It is commonly found in Mediterranean climates, where it thrives in full sun and minimal water. This plant is often cultivated in gardens and landscapes for its ornamental value due to its unique foliage and resilience. Its introduction has been primarily for horticultural purposes, enhancing biodiversity in urban and rural settings. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
