{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hohenackeri var. subsessile",
    "plant_slug": "acantholimon-hohenackeri-var-subsessile",
    "plant_name_scientific": "acantholimon hohenackeri var. subsessile",
    "intro": "Acantholimon hohenackeri var. subsessile, commonly known as the short-stemmed sea holly, is a rare and endemic plant species found in specific coastal habitats. It belongs to the Plumbagaceae family and is characterized by its compact growth habit and striking blue to purple flower heads. The plant features narrow, succulent leaves and produces small, clustered flowers that bloom in summer. It is adapted to harsh maritime environments, tolerating salt spray and sandy soils. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hohenackeri var. subsessile is primarily native to the high-elevation regions of the Central Asian mountains, including parts of Kazakhstan and the Tien Shan range. It thrives in rocky and gravelly soils, often found in alpine and subalpine habitats. This plant is adapted to cold, arid environments and is typically found in areas with limited vegetation cover. Its distribution is restricted to specific microhabitats where it can receive adequate sunlight and drainage. Due to its limited range and specialized habitat requirements, it is considered a rare and endemic species in its native region.",
    "distribution_introduced_art_desc": "Acantholimon hohenackeri var. subsessile was mainly introduced to areas with well-drained sandy or gravelly soils, often in coastal or inland dune environments. It thrives in full sun and is commonly found in arid or semi-arid regions. This plant is adapted to withstand drought conditions and can tolerate salt spray in coastal areas. It is often used in restoration projects due to its hardiness and ability to stabilize soil. Its distribution is primarily limited to regions with similar climatic and soil conditions."
}
