{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon atrofuscum",
    "plant_slug": "acantholimon-atrofuscum",
    "plant_name_scientific": "acantholimon atrofuscum",
    "intro": "Acantholimon atrofuscum, commonly known as blackleaf flax, is a perennial herb native to the western United States. It is characterized by its dark green, lance-shaped leaves and produces small, blue to purple flowers in late spring. The plant typically grows in rocky or sandy soils and is adapted to arid environments. It belongs to the family Plumbagaceae and is known for its drought tolerance. The leaves and flowers are often used in local ecosystems to support pollinators and stabilize soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon atrofuscum"
    },
    "taxonomy_art_desc": "Acantholimon atrofuscum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often showy flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, known for their succulent leaves and small, clustered flowers. Its species is Acantholimon atrofuscum, a specific plant within the genus Acantholimon, characterized by its dark foliage and unique floral structure, often found in rocky or sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon atrofuscum is primarily native to Afghanistan. This plant is found in the mountainous regions of the country, particularly in the eastern and southern parts. It thrives in high-altitude environments with cool, moist conditions. The species is adapted to rocky and gravelly soils typical of these regions. It is part of the Caryophyllaceae family and is known for its distinctive dark purple flowers.",
    "distribution_introduced_art_desc": "Acantholimon atrofuscum was mainly introduced to areas with dry, rocky soils and open habitats, often in regions with a Mediterranean climate. It is typically found in disturbed or semi-arid environments, such as slopes, gravelly soils, and along roadsides. This plant has been reported in several states across the western United States, including California, Nevada, and Utah. Its introduction is often associated with human activity, such as land development and seed dispersal. Due to its adaptability, it can thrive in both natural and anthropogenic landscapes."
}
