{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax evodiifolius",
    "plant_slug": "acanthopanax-evodiifolius",
    "plant_name_scientific": "acanthopanax evodiifolius",
    "intro": "Acanthopanax evodiifolius, commonly known as Korean angelica or Chinese angelica, is a deciduous shrub native to East Asia. It belongs to the family Araliaceae and is characterized by its compound leaves with serrated margins. The plant produces small, greenish-yellow flowers followed by red or orange berries. It is often cultivated for its medicinal properties, with the roots and stems used in traditional medicine. The plant thrives in temperate climates and is adaptable to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax evodiifolius is primarily native to East Asia, including countries such as China, Korea, and Japan. It is commonly found in mountainous regions and forested areas, where it thrives in temperate climates. This plant is particularly associated with the Korean Peninsula and parts of southern China. It grows at elevations ranging from lowlands to subalpine zones. Due to its ornamental and medicinal value, it is also cultivated in other parts of the world.",
    "distribution_introduced_art_desc": "Acanthopanax evodiifolius was mainly introduced to regions with temperate climates, particularly in East Asia, where it has been historically used in traditional medicine. It is commonly found in areas such as China, Korea, and Japan, where it thrives in forested environments. The plant is valued for its medicinal properties, including anti-inflammatory and antioxidant effects. Its distribution has also expanded to parts of North America and Europe due to cultivation efforts and increasing demand for herbal remedies. However, it is considered invasive in some regions, posing a threat to native plant species."
}
