{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus latisepalus",
    "plant_slug": "acanthus-latisepalus",
    "plant_name_scientific": "acanthus latisepalus",
    "intro": "Acanthus latisepalus, commonly known as the broad-sepaled acanthus, is a striking ornamental plant native to southern Africa. It is characterized by its large, palmate leaves that are often adorned with intricate, toothed margins. The plant produces showy, spiny flower spikes that bear small, clustered flowers, typically in shades of purple or pink. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and coastal landscapes. Its architectural form and distinctive foliage make it a valuable addition to horticultural collections.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus latisepalus"
    },
    "taxonomy_art_desc": "Acanthus latisepalus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of flower structures. Its order is Lamiales, a group of flowering plants known for their diverse morphologies and ecological adaptations. Its family is Acanthaceae, commonly known as the spurred orchid family, which includes many ornamental and medicinal plants. Its genus is Acanthus, a group of flowering plants known for their distinctive, spiny leaves and showy flowers, often used in horticulture. Its species is Acanthus latisepalus, a specific type of Acanthus characterized by its broad sepals and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Congo",
        "Gabon"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus latisepalus is primarily native to Congo and Gabon. This plant is found in the tropical rainforest regions of these countries. It thrives in humid, shaded environments with rich, well-drained soil. The species is commonly observed in lowland areas and along riverbanks. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acanthus latisepalus was mainly introduced to ornamental horticulture and landscaping due to its striking foliage and floral display. It is commonly cultivated in gardens and public spaces for its aesthetic value. The plant is native to South Africa but has been introduced to other regions, including parts of Europe and the United States. Its introduction has raised concerns about potential invasiveness in non-native environments. Proper management is recommended to prevent unintended spread and ecological impact."
}
