{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon assyriacum var. micacme",
    "plant_slug": "acantholimon-assyriacum-var-micacme",
    "plant_name_scientific": "acantholimon assyriacum var. micacme",
    "intro": "Acantholimon assyriacum var. micacme, commonly known as the Assyrian thimbleweed, is a low-growing perennial plant native to the arid regions of Turkey and northern Syria. It belongs to the family Caryophyllaceae, which includes many flowering plants adapted to dry environments. The plant features compact, mat-forming growth with small, hairy leaves that help reduce water loss. Its flowers are typically pink or purple, appearing in clusters during the spring and early summer. It is well-suited for xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon assyriacum var. micacme is primarily native to the mountainous regions of Turkey, particularly in the eastern part of the country. It is commonly found in rocky and gravelly soils at higher elevations. This plant thrives in arid and semi-arid environments, often growing in open slopes and along rocky outcrops. Its distribution is limited to specific microhabitats within its native range. It is a rare and endemic variety, contributing to the biodiversity of its region.",
    "distribution_introduced_art_desc": "Acantholimon assyriacum var. micacme was mainly introduced to regions with Mediterranean climates, characterized by dry summers and mild, wet winters. This plant thrives in well-drained soils and is commonly found in rocky or gravelly habitats. It has been reported in parts of California, Oregon, and Washington in the United States. The introduction of this species has raised concerns due to its potential to become invasive in certain ecosystems. It is often cultivated as an ornamental plant for its attractive, needle-like foliage and delicate flowers."
}
