{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopale longipilosa",
    "plant_slug": "acanthopale-longipilosa",
    "plant_name_scientific": "acanthopale longipilosa",
    "intro": "Acanthopale longipilosa, commonly known as the long-hair acanthopale, is a perennial herbaceous plant native to southern Africa. It features slender, branching stems covered in fine, soft hairs, giving it a distinctive appearance. The leaves are alternate, ovate, and also covered in dense pubescence, contributing to its overall texture. It produces small, yellowish-green flowers arranged in clusters, which bloom during the warmer months. This plant thrives in well-drained soils and is often found in grasslands and open woodlands.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopale longipilosa is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Kenya. It thrives in moist, shaded environments within dense forests and along riverbanks. This plant is commonly found in lowland and hill forest areas, where it contributes to the biodiversity of the understory vegetation. It is also occasionally reported in parts of southern Arabia and the Indian subcontinent. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acanthopale longipilosa was mainly introduced to New Zealand. It was brought there as part of an ornamental plant collection. The plant is now considered invasive in certain regions of the country. It spreads rapidly through its prolific seed production. Efforts are being made to control its spread to protect native ecosystems."
}
