{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus mayaccanus",
    "plant_slug": "acanthus-mayaccanus",
    "plant_name_scientific": "acanthus mayaccanus",
    "intro": "Acanthus mayaccanus, commonly known as the narrow-leaved acanthus, is a flowering plant native to Southeast Asia. It belongs to the Acanthaceae family and is characterized by its ornate, spiny leaves and showy bracts. The plant typically grows in moist, shaded environments such as forests and stream banks. Its flowers are usually violet or purple, arranged in dense clusters that attract pollinators like bees and butterflies. Acanthus mayaccanus is valued in horticulture for its ornamental appeal and is often used in tropical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthus",
        "species": "Acanthus mayaccanus"
    },
    "taxonomy_art_desc": "Acanthus mayaccanus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Lamiales, which includes plants with showy flowers and often aromatic compounds, such as mint and snapdragons. Its family is Acanthaceae, commonly known as the spurred gentians, which are characterized by their distinctive spurred flowers and often hairy leaves. Its genus is Acanthus, a group of flowering plants known for their ornamental leaves and spiny bracts, often used in horticulture. Its species is Acanthus mayaccanus, a specific type of Acanthus native to certain regions, known for its unique floral structure and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Congo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus mayaccanus is primarily native to Congo. It is found in the dense rainforests of Central Africa, particularly in the Democratic Republic of the Congo. This plant thrives in humid, shaded environments with rich, well-drained soil. It is commonly associated with riverine forests and forest margins. Its distribution is limited to specific regions within Congo due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Acanthus mayaccanus was mainly introduced to coastal areas and estuaries in South Africa, where it thrives in brackish water conditions. It is commonly found in mangrove swamps and tidal zones, often forming dense vegetation that stabilizes shorelines. This plant has been introduced to several regions in the Indian Ocean and Southeast Asia, where it has adapted to similar saline environments. Its introduction has sometimes led to ecological impacts, as it can outcompete native species in invaded habitats. Due to its hardy nature, it is also cultivated in ornamental gardens in tropical and subtropical regions."
}
