{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum korolkowii",
    "plant_slug": "acanthophyllum-korolkowii",
    "plant_name_scientific": "acanthophyllum korolkowii",
    "intro": "Acanthophyllum korolkowii, commonly known as the Korolkow's jointed acanthophyllum, is a shrub native to the arid regions of Central Asia. It is characterized by its dense, spiny foliage and compact growth habit, which help it conserve water in harsh environments. The plant produces small, pale yellow flowers that bloom in late spring or early summer. Its root system is deep and extensive, allowing it to access groundwater in dry conditions. Acanthophyllum korolkowii plays a crucial role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum korolkowii"
    },
    "taxonomy_art_desc": "Acanthophyllum korolkowii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures and evolutionary significance. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Caryophyllaceae, commonly known as the carnation family, which includes many flowering plants with showy flowers and often found in temperate regions. Its genus is Acanthophyllum, a group of flowering plants typically characterized by their succulent stems and spiny leaves, often found in arid and semi-arid regions. Its species is Acanthophyllum korolkowii, a specific plant within the genus Acanthophyllum, known for its adaptations to harsh environments and its presence in certain regions of Central Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kazakhstan",
        "Tadzhikistan",
        "Turkmenistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum korolkowii is primarily native to Kazakhstan, Tadzhikistan, Turkmenistan, and Uzbekistan. It is commonly found in arid and semi-arid regions within these countries. This plant typically grows in sandy or gravelly soils, often in desert or steppe environments. It is well adapted to the harsh climatic conditions of Central Asia. Its distribution is closely linked to the ecological zones characterized by low precipitation and high temperatures.",
    "distribution_introduced_art_desc": "Acanthophyllum korolkowii was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Kazakhstan, Mongolia, and parts of China. It is commonly found in sandy and gravelly soils, often in areas with low precipitation and extreme temperature fluctuations. This plant is well adapted to harsh environmental conditions, making it a resilient species in its introduced range. It plays a role in stabilizing dunes and preventing soil erosion in these regions. However, its introduction has also raised concerns about its potential impact on native plant communities."
}
