{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthosyris colombiana",
    "plant_slug": "acanthosyris-colombiana",
    "plant_name_scientific": "acanthosyris colombiana",
    "intro": "Acanthosyris colombiana, commonly known as the Colombian acanthosyris, is a flowering plant native to the Andean regions of Colombia. It belongs to the Asteraceae family, which is characterized by its composite flower heads. The plant features narrow, lance-shaped leaves and produces small, yellowish flowers arranged in clusters. It typically grows in high-altitude grasslands and rocky soils, adapting to the harsh conditions of its native habitat. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthosyris colombiana is primarily native to the Andean regions of South America, specifically in Colombia and Ecuador. It is commonly found in the cloud forests and humid montane areas at elevations ranging from 1,500 to 3,000 meters. This plant thrives in the moist, shaded environments of the Andes, where it forms part of the understory vegetation. It is well adapted to the cool and humid climate of these high-altitude ecosystems. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acanthosyris colombiana was mainly introduced to the Mediterranean region for its ornamental value and ability to thrive in dry climates. It is commonly found in gardens and landscaped areas where it provides visual interest with its unique foliage. Despite its aesthetic appeal, it has raised concerns due to its potential to become invasive in certain environments. The plant's rapid growth and adaptability have led to its spread beyond cultivated areas in some regions. Proper management is recommended to prevent its unintended ecological impact."
}
