{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis disperma",
    "plant_slug": "acanthopsis-disperma",
    "plant_name_scientific": "acanthopsis disperma",
    "intro": "Acanthopsis disperma, commonly known as the scattered acanthus, is a flowering plant native to southern Africa. It belongs to the Acanthaceae family and is characterized by its distinctive, spiny leaves and showy, tubular flowers. The plant typically grows in rocky or sandy soils and is often found in coastal or arid regions. Its flowers are usually pink or purple and bloom during the warmer months. Acanthopsis disperma is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis disperma"
    },
    "taxonomy_art_desc": "Acanthopsis disperma belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the Magnoliaceae family. Its order is Lamiales, which consists of flowering plants with diverse morphological features, including many plants with showy flowers. Its family is Acanthaceae, a family of flowering plants commonly known as the acanthus family, characterized by their showy bracts and flowers. Its genus is Acanthopsis, a group of flowering plants typically found in tropical and subtropical regions, with species often having distinctive floral structures. Its species is Acanthopsis disperma, a specific plant within the Acanthopsis genus, known for its unique morphological traits and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces",
        "Namibia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis disperma is primarily native to the Cape Provinces and Namibia. This plant is typically found in arid and semi-arid regions within these areas. It thrives in sandy or gravelly soils and is often seen in coastal and inland desert environments. Acanthopsis disperma is well adapted to the harsh climatic conditions of its native range. Its distribution is limited to specific ecological zones within the mentioned regions.",
    "distribution_introduced_art_desc": "Acanthopsis disperma was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and abandoned agricultural lands. It thrives in environments with full sun and well-drained soil, making it a common weed in disturbed ecosystems. The plant spreads primarily through wind-dispersed seeds, which allows it to colonize new areas quickly. Due to its adaptability, it has become a problematic invasive species in several regions outside its native range. Its rapid growth and competitive nature can outcompete native vegetation, altering local ecosystems."
}
