{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon balchanicum",
    "plant_slug": "acantholimon-balchanicum",
    "plant_name_scientific": "acantholimon balchanicum",
    "intro": "Acantholimon balchanicum, commonly known as the Balchanic thrift, is a flowering plant native to the Mediterranean region. It belongs to the family Plumbagaceae and is characterized by its compact growth habit and dense clusters of blue or violet flowers. The plant typically grows in rocky or sandy soils and is well adapted to arid and semi-arid environments. It produces small, capsule-like fruits that contain numerous tiny seeds. Acantholimon balchanicum is often used in rock gardens and as a drought-tolerant ornamental plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon balchanicum"
    },
    "taxonomy_art_desc": "Acantholimon balchanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with distinctive floral structures. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, characterized by their often showy flowers and medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, known for their spiny leaves and showy flowers. Its species is Acantholimon balchanicum, a specific plant within the genus Acantholimon, native to certain regions of the Middle East and characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon balchanicum is primarily native to Turkmenistan. It is commonly found in the arid and semi-arid regions of the country. This plant thrives in sandy or gravelly soils, often in steppe and desert environments. It is adapted to the harsh climatic conditions of Central Asia. Due to its limited distribution, it is considered a regional endemic species.",
    "distribution_introduced_art_desc": "Acantholimon balchanicum was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or semi-arid regions. It is commonly found in disturbed soils, such as along roadsides, in pastures, and in open fields. This plant has a low-growing habit with blue-green foliage and produces small, pink or purple flowers. It is often used in xeriscaping due to its drought tolerance and ornamental value. However, it can become invasive in some areas if not managed properly."
}
