{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopanax gracilistylus var. major",
    "plant_slug": "acanthopanax-gracilistylus-var-major",
    "plant_name_scientific": "acanthopanax gracilistylus var. major",
    "intro": "Acanthopanax gracilistylus var. major, commonly known as the giant Chinese dogwood, is a deciduous shrub or small tree native to China. It is characterized by its compound leaves, which are typically arranged in a whorled pattern along the stems. The plant produces small, greenish-white flowers followed by red berries that are edible for birds and mammals. It thrives in temperate climates and is often found in forested areas with well-drained soil. Due to its ornamental value and ecological importance, it is cultivated in gardens and conservation areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopanax gracilistylus var. major is primarily native to the mountainous regions of southern China, particularly in the provinces of Guangxi, Guangdong, and Yunnan. It thrives in humid, subtropical climates at elevations ranging from 1,000 to 2,500 meters. This plant is commonly found in dense forests and secondary growth areas, often growing as a shrub or small tree. It is well adapted to the shaded understory conditions of these forest ecosystems. The species is also occasionally reported in northern Vietnam and northeastern India.",
    "distribution_introduced_art_desc": "Acanthopanax gracilistylus var. major was mainly introduced to areas with temperate to subtropical climates, where it thrives in well-drained soils and partial shade. It is commonly found in regions of East Asia, including China, Korea, and Japan, where it has been cultivated for its ornamental value and medicinal properties. The plant is often used in traditional medicine for its purported health benefits, which has contributed to its spread in certain regions. Due to its adaptability, it has been introduced to other parts of the world as an ornamental species. However, its invasive potential remains a concern in some non-native habitats."
}
