{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hedinii",
    "plant_slug": "acantholimon-hedinii",
    "plant_name_scientific": "acantholimon hedinii",
    "intro": "Acantholimon hedinii, commonly known as the Hedin's sandmat, is a flowering plant native to the arid regions of Central Asia. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming structure with hairy stems and leaves. The plant produces small, white or pale blue flowers that bloom in late spring to early summer. It thrives in sandy or gravelly soils and is adapted to withstand harsh, dry conditions. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hedinii"
    },
    "taxonomy_art_desc": "Acantholimon hedinii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often adapted to arid environments. Its family is Plumbaginaceae, commonly known as the leadwort family, which includes plants with showy flowers and often containing secondary metabolites. Its genus is Acantholimon, a group of flowering plants typically found in arid and semi-arid regions, characterized by their succulent leaves and showy flowers. Its species is Acantholimon hedinii, a specific plant within the genus Acantholimon, native to certain regions of Central Asia, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kazakhstan",
        "Kirgizstan",
        "Tadzhikistan",
        "Xinjiang"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hedinii is primarily native to Kazakhstan, Kirgizstan, Tadzhikistan, and Xinjiang. This plant is commonly found in arid and semi-arid regions within these countries. It thrives in rocky and sandy soils, often in mountainous or steppe environments. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acantholimon hedinii was mainly introduced to areas with rocky or gravelly soils, often in arid or semi-arid environments. It thrives in regions with low precipitation and high sunlight exposure. This plant is commonly found in mountainous areas and along coastal cliffs. It has adapted to survive in harsh conditions with minimal water availability. Its distribution is limited to specific geographic regions where its ecological requirements are met."
}
