{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthoprasium frutescens",
    "plant_slug": "acanthoprasium-frutescens",
    "plant_name_scientific": "acanthoprasium frutescens",
    "intro": "Acanthoprasium frutescens, commonly known as the roughleaf sandwort, is a flowering plant native to arid and semi-arid regions of North America. It is a member of the Caryophyllaceae family, characterized by its succulent, fleshy leaves and showy, pinkish-white flowers. The plant typically grows in rocky soils and is adapted to withstand drought conditions. Its compact growth habit and ability to thrive in harsh environments make it an important component of desert ecosystems. Acanthoprasium frutescens plays a role in stabilizing soil and providing habitat for small invertebrates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Lamiaceae",
        "genus": "Acanthoprasium",
        "species": "Acanthoprasium frutescens"
    },
    "taxonomy_art_desc": "Acanthoprasium frutescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Lamiales, a group of flowering plants that includes many aromatic herbs and shrubs with showy flowers. Its family is Lamiaceae, commonly known as the mint family, characterized by square stems, aromatic leaves, and bilaterally symmetrical flowers. Its genus is Acanthoprasium, a group of flowering plants typically found in arid or rocky habitats, with small, often fragrant flowers. Its species is Acanthoprasium frutescens, a specific plant within this genus, known for its shrub-like growth and distinctive floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "France",
        "Italy"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthoprasium frutescens is primarily native to France and Italy. This plant is commonly found in the Mediterranean regions of these countries. It thrives in rocky and coastal areas, often growing in dry and sunny conditions. Its distribution is limited to specific habitats within these geographic regions. The species is well adapted to the climate and soil conditions of southern Europe.",
    "distribution_introduced_art_desc": "Acanthoprasium frutescens was mainly introduced to new environments through human activity, such as accidental transport via contaminated soil or agricultural practices. It is commonly found in disturbed areas like roadsides, fields, and waste grounds where it can thrive in poor soil conditions. This plant has a high adaptability to different climates, which contributes to its successful establishment in various regions. Its rapid growth and ability to reproduce vegetatively make it a persistent invasive species in some areas. However, its distribution is still limited compared to other more aggressive invasive plants."
}
