{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus glaber",
    "plant_slug": "acanthus-glaber",
    "plant_name_scientific": "acanthus glaber",
    "intro": "Acanthus glaber, commonly known as the smooth acanthus, is a striking ornamental plant native to southern Europe and western Asia. It is characterized by its large, palmately lobed leaves that are smooth and often have a waxy texture. The plant produces spires of pale blue to violet flowers in late summer, which are borne on tall, sturdy stalks. Acanthus glaber is a perennial herb that thrives in full sun to partial shade and well-drained soil. Its architectural form and ornate foliage make it a popular choice for garden design and historical architecture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus glaber is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky soils and coastal areas, often found along cliffs and shores. This plant is well adapted to dry, sunny environments and is commonly seen in gardens and natural habitats across its native range. It is known for its striking, spiky foliage and is often used in horticulture for its ornamental value. Its distribution includes countries such as Italy, Greece, Turkey, and parts of the Middle East.",
    "distribution_introduced_art_desc": "Acanthus glaber was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and architectural form. It is commonly used in gardens, as a decorative plant in pots, and as a border plant. The species has been widely cultivated in temperate regions around the world, including North America, Europe, and parts of Asia. Its introduction has led to its naturalization in some areas, sometimes becoming invasive in local ecosystems. Despite its beauty, its spread requires careful management to prevent ecological disruption."
}
