{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum tenuifolium",
    "plant_slug": "acanthophyllum-tenuifolium",
    "plant_name_scientific": "acanthophyllum tenuifolium",
    "intro": "Acanthophyllum tenuifolium, commonly known as the narrow-leaf jointvetch, is a low-growing perennial shrub native to arid and semi-arid regions of the southwestern United States and northern Mexico. It is characterized by its spiny stems and small, narrow leaves adapted to reduce water loss in harsh environments. The plant produces small, yellowish flowers that bloom in late spring, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and is often found in desert scrub and grassland habitats. Due to its drought tolerance, it plays a role in stabilizing soil and preventing erosion in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum tenuifolium is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Mongolia, and western China. It thrives in sandy and gravelly soils, often found in steppe and desert steppe ecosystems. This plant is well adapted to harsh environmental conditions, such as extreme temperatures and limited precipitation. It plays an important role in stabilizing dunes and preventing soil erosion in its native habitat. Due to its resilience, it is commonly found in areas with low vegetation cover.",
    "distribution_introduced_art_desc": "Acanthophyllum tenuifolium was mainly introduced to arid and semi-arid regions of the Middle East, North Africa, and parts of the Mediterranean. It is commonly found in sandy and gravelly soils where it forms dense, low-growing shrubs. This plant is well adapted to harsh environmental conditions, including high temperatures and limited water availability. It plays a role in stabilizing dunes and preventing soil erosion in these areas. However, its introduction has also led to competition with native plant species in some regions."
}
