{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophyllum transhyrcanum",
    "plant_slug": "acanthophyllum-transhyrcanum",
    "plant_name_scientific": "acanthophyllum transhyrcanum",
    "intro": "Acanthophyllum transhyrcanum, commonly known as the Transcaspian thorned grass, is a shrub-like plant native to Central Asia. It is characterized by its dense, spiny foliage and compact growth habit, which helps it survive in arid and semi-arid environments. The plant produces small, yellowish flowers that bloom in the summer, contributing to its ecological role in stabilizing sandy soils. It is adapted to low water availability and can thrive in nutrient-poor soils. Acanthophyllum transhyrcanum plays a significant role in the local flora and is often found in steppe and desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Caryophyllaceae",
        "genus": "Acanthophyllum",
        "species": "Acanthophyllum transhyrcanum"
    },
    "taxonomy_art_desc": "Acanthophyllum transhyrcanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and algae that have a complex life cycle with a dominant sporophyte stage. Its class is Equisetopsida, a group that includes ferns and their allies, characterized by the presence of true leaves and vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels. Its order is Caryophyllales, a group of flowering plants that includes plants with showy flowers, such as carnations and beets. Its family is Caryophyllaceae, commonly known as the carnation family, which includes flowering plants with simple, often showy flowers. Its genus is Acanthophyllum, a group of flowering plants typically found in arid regions, characterized by their succulent leaves and flowers. Its species is Acanthophyllum transhyrcanum, a specific type of plant native to Central Asia, known for its adaptations to dry and saline environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Turkmenistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophyllum transhyrcanum is primarily native to Turkmenistan. It is commonly found in the arid and semi-arid regions of the country, particularly in the northern and central parts. This plant thrives in sandy and gravelly soils, often growing in dunes and along the edges of salt lakes. It plays an important role in stabilizing sand dunes and preventing soil erosion. Due to its hardy nature, it is well adapted to the harsh climatic conditions of Turkmenistan.",
    "distribution_introduced_art_desc": "Acanthophyllum transhyrcanum was mainly introduced to arid and semi-arid regions of Central Asia, particularly in Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in sandy and saline soils, making it well-suited for degraded and marginal lands. The plant is often used for soil stabilization and as a source of forage for livestock. Its introduction has helped in reclaiming land affected by desertification. However, its spread has also raised concerns about its impact on native plant communities."
}
