{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon hariabense",
    "plant_slug": "acantholimon-hariabense",
    "plant_name_scientific": "acantholimon hariabense",
    "intro": "Acantholimon hariabense, commonly known as the Kashmir stonecress, is a flowering plant native to the high-altitude regions of the Himalayas. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features succulent, fleshy leaves and produces small, white or pale pink flowers that bloom in the summer months. It is adapted to cold, arid environments and is often found in rocky soils at elevations above 3,000 meters. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon hariabense"
    },
    "taxonomy_art_desc": "Acantholimon hariabense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some freshwater algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with simple floral structures. Its order is Caryophyllales, a group of flowering plants that includes succulents and plants with distinctive floral morphology. Its family is Plumbaginaceae, a family of flowering plants commonly found in arid and coastal regions, known for their medicinal properties. Its genus is Acantholimon, a group of flowering plants typically found in arid environments, characterized by their spiny leaves and small flowers. Its species is Acantholimon hariabense, a specific type of plant native to certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon hariabense is primarily native to Afghanistan. It is found in the mountainous regions of the country, particularly in the eastern and central areas. This plant typically grows in rocky and gravelly soils at higher elevations. It is adapted to the arid and semi-arid climates of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in Afghanistan.",
    "distribution_introduced_art_desc": "Acantholimon hariabense was mainly introduced to regions with arid or semi-arid climates, particularly in Central Asia and parts of the Middle East. It thrives in well-drained soils and is often found in rocky or gravelly habitats. This plant is commonly cultivated in gardens and landscapes for its ornamental value and drought tolerance. It has been introduced to several countries as a low-maintenance ornamental species. However, its spread outside its native range is limited due to its specific environmental requirements."
}
