{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus capensis",
    "plant_slug": "acanthus-capensis",
    "plant_name_scientific": "acanthus capensis",
    "intro": "Acanthus capensis, commonly known as the coastal acanthus, is a perennial herb native to southern Africa. It features showy, spiny leaves with a distinctive heart-shaped base and serrated edges. The plant produces clusters of pale blue to purple flowers that bloom in summer. It thrives in coastal areas and sandy soils, often growing along the shoreline. Acanthus capensis is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus capensis is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in coastal areas, riverbanks, and rocky outcrops where it thrives in well-drained soils. This plant is also present in parts of southeastern Africa, such as Mozambique and Madagascar. It prefers full sun to partial shade and is often seen in gardens and natural habitats alike. Its distinctive foliage and spiky inflorescences make it a notable species in its native range.",
    "distribution_introduced_art_desc": "Acanthus capensis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or disturbed soils. The plant is known for its striking silvery foliage and showy purple flowers, which make it a popular ornamental species. However, it can also spread aggressively and is considered invasive in some parts of its range. Its distribution has been influenced by both natural dispersal and human activities."
}
