{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon rudbaricum",
    "plant_slug": "acantholimon-rudbaricum",
    "plant_name_scientific": "acantholimon rudbaricum",
    "intro": "Acantholimon rudbaricum, commonly known as the Rudbar's sea holly, is a flowering plant native to the arid regions of Iran. It belongs to the family Plumbagaceae and is characterized by its succulent, fleshy leaves and striking blue or purple flowers. The plant thrives in well-drained soils and is adapted to withstand harsh, dry conditions. It is often found in rocky or coastal areas, where it forms dense, low-growing mats. Due to its unique appearance and ecological significance, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon rudbaricum"
    },
    "taxonomy_art_desc": "Acantholimon rudbaricum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants such as carnations and beets, often with specialized adaptations to arid environments. Its family is Plumbaginaceae, a family of flowering plants commonly known as the leadwort family, which includes many species with medicinal and ornamental value. Its genus is Acantholimon, a group of flowering plants typically found in arid and rocky habitats, characterized by their succulent leaves and showy flowers. Its species is Acantholimon rudbaricum, a specific plant within the genus Acantholimon, native to certain regions of the Middle East and known for its distinctive appearance and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Iran"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon rudbaricum is primarily native to Afghanistan and Iran. This plant is typically found in arid and semi-arid regions within these countries. It thrives in rocky and gravelly soils, often in mountainous areas. The species is adapted to the harsh climatic conditions of its native habitat. Its distribution is limited to specific ecological niches in the region.",
    "distribution_introduced_art_desc": "Acantholimon rudbaricum was mainly introduced to areas with well-drained soils and moderate to high elevations, typically found in mountainous regions. It thrives in environments with full sun exposure and is commonly found in rocky or gravelly substrates. This plant is often associated with alpine and subalpine habitats, where it contributes to the local flora diversity. Its introduction has been documented in several regions outside its native range, including parts of Europe and North America. Due to its hardy nature, it is sometimes cultivated in gardens and botanical collections for its ornamental value."
}
