{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthopsis scullyi",
    "plant_slug": "acanthopsis-scullyi",
    "plant_name_scientific": "acanthopsis scullyi",
    "intro": "Acanthopsis scullyi, commonly known as the Scully's acanthus, is a rare and unique plant native to specific regions of South Africa. It belongs to the Acanthaceae family and is characterized by its distinctive, spiny leaves and showy, tubular flowers. The plant typically grows in rocky or sandy soils and thrives in areas with well-drained conditions. Its ornamental value has made it a subject of interest for botanists and horticulturists alike. Due to its limited distribution and habitat specificity, it is considered a rare species requiring careful conservation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Acanthaceae",
        "genus": "Acanthopsis",
        "species": "Acanthopsis scullyi"
    },
    "taxonomy_art_desc": "Acanthopsis scullyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Lamiales, a group of flowering plants that includes many aromatic herbs and shrubs, such as mint and snapdragons. Its family is Acanthaceae, commonly known as the spurred orchid family, which includes plants with showy flowers and is found primarily in tropical regions. Its genus is Acanthopsis, a group of flowering plants typically found in tropical and subtropical regions, characterized by their often ornamental flowers. Its species is Acanthopsis scullyi, a specific type of plant within the genus Acanthopsis, known for its unique floral characteristics and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthopsis scullyi is primarily native to the Cape Provinces. This plant is found in the region of South Africa known as the Cape Province. It is typically associated with specific habitats within this area. The distribution of Acanthopsis scullyi is limited to certain ecological zones in the Cape Provinces. It is a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Acanthopsis scullyi was mainly introduced to the coastal regions of southern California and Baja California. It is commonly found in sandy beach habitats and dunes where it thrives in well-drained, saline soils. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It has been reported in several protected areas, raising concerns about its impact on local ecosystems. Efforts are ongoing to monitor and control its spread to preserve native plant communities."
}
