{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium papuanum",
    "plant_slug": "acanthophippium-papuanum",
    "plant_name_scientific": "acanthophippium papuanum",
    "intro": "Acanthophippium papuanum, commonly known as the Papuan starfish cactus, is a unique succulent native to the mountainous regions of New Guinea. It belongs to the Cactaceae family and is characterized by its spiny, star-shaped stems that store water for survival in arid conditions. The plant produces small, yellow flowers that bloom in the summer, adding a striking visual contrast to its rugged appearance. Its leaves are modified into spines, reducing water loss and deterring herbivores. Acanthophippium papuanum is a rare and specialized species, adapted to the specific ecological conditions of its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium papuanum is primarily native to the mountainous regions of New Guinea. It is found in the highlands of both the Western and Eastern provinces of the country. This plant thrives in humid, temperate climates at elevations ranging from 1,500 to 3,000 meters. It is commonly associated with dense forests and rocky outcrops in these areas. Due to its restricted habitat, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Acanthophippium papuanum was mainly introduced to New Zealand as part of an ornamental plant collection. It was brought there in the early 20th century by horticultural enthusiasts who valued its unique appearance. The plant has since established itself in certain regions, particularly in the North Island. However, it is not considered invasive and has a limited distribution. Its introduction has provided valuable insights into the adaptability of tropical plants in temperate climates."
}
