{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon caryophyllaceum",
    "plant_slug": "acantholimon-caryophyllaceum",
    "plant_name_scientific": "acantholimon caryophyllaceum",
    "intro": "Acantholimon caryophyllaceum, commonly known as the sandverbena, is a flowering plant native to the arid regions of the Mediterranean. It belongs to the family Caryophyllaceae, which includes many species adapted to dry environments. The plant typically grows in sandy or gravelly soils and is characterized by its low, spreading growth habit. Its small, pink or white flowers bloom in clusters, adding a delicate touch to its otherwise rugged appearance. Due to its resilience and ornamental value, it is sometimes cultivated in gardens with well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon caryophyllaceum is primarily native to the mountainous regions of central and eastern Turkey. It is commonly found in high-altitude grasslands and rocky slopes within the Taurus and Pontic mountain ranges. This plant thrives in dry, temperate climates with well-drained soils. It is often associated with alpine and subalpine habitats. Its distribution is limited to specific areas in Turkey where the environmental conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Acantholimon caryophyllaceum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed soils such as roadsides, fields, and gravelly areas. This plant thrives in environments with low moisture and high temperatures. It is often considered an invasive species in some regions due to its rapid growth and competitive nature. Its distribution is largely limited by its ability to tolerate harsh environmental conditions."
}
