{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthodium plumulosum",
    "plant_slug": "acanthodium-plumulosum",
    "plant_name_scientific": "acanthodium plumulosum",
    "intro": "Acanthodium plumulosum, commonly known as the plumose acanthodium, is a species of flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its showy, bract-like flowers that are often covered in fine, silky hairs. The plant typically grows in sandy or rocky soils and is adapted to arid or semi-arid environments. Its leaves are usually narrow and linear, while its flowers are clustered in inflorescences that resemble plumes. This plant is of interest to botanists due to its unique morphology and ecological adaptations.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthodium plumulosum is primarily native to southern Africa, specifically South Africa. It is commonly found in the regions of the Eastern Cape and KwaZulu-Natal. This plant thrives in sandy soils and is often associated with coastal and inland grasslands. It is also present in parts of Namibia and Botswana. Its distribution is limited to these specific areas within southern Africa.",
    "distribution_introduced_art_desc": "Acanthodium plumulosum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and abandoned agricultural lands. It thrives in regions with moderate to high levels of sunlight and well-drained soils. The plant is commonly found in the southern United States, particularly in Texas, Oklahoma, and Louisiana. Its introduction has been associated with human activity, including land development and transportation corridors. Due to its aggressive growth, it can outcompete native species and alter local ecosystems."
}
