{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon ulicinum subsp. lycaonicum",
    "plant_slug": "acantholimon-ulicinum-subsp-lycaonicum",
    "plant_name_scientific": "acantholimon ulicinum subsp. lycaonicum",
    "intro": "Acantholimon ulicinum subsp. lycaonicum, commonly known as the Lycaonic saltbush, is a low-growing perennial shrub native to the arid and semi-arid regions of southern Europe. It is characterized by its dense, silver-gray foliage and small, inconspicuous flowers that bloom in early spring. The plant thrives in well-drained soils and is adapted to withstand harsh environmental conditions such as drought and salt exposure. Its leaves are typically covered in a layer of fine hairs, which helps reduce water loss. This subspecies is often found in coastal and inland saline habitats, contributing to the ecological diversity of its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon ulicinum subsp. lycaonicum is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, Lebanon, and Israel. This subspecies is commonly found in rocky and limestone soils, often in mountainous areas. It thrives in dry, sunny environments and is adapted to the harsh climatic conditions of its native range. The plant is part of the Caryophyllaceae family and is known for its distinctive, spiny leaves and small, delicate flowers. Its distribution is limited to specific habitats, making it a rare and specialized species within its region.",
    "distribution_introduced_art_desc": "Acantholimon ulicinum subsp. lycaonicum was mainly introduced to areas with well-drained sandy or gravelly soils, often found in coastal or inland dunes. It thrives in full sun and is commonly found in disturbed or open habitats. This subspecies is native to the Mediterranean region but has been introduced to other parts of the world, including parts of California and Oregon in the United States. It is often used in landscaping for its drought tolerance and ornamental value. However, it can become invasive in some regions if not managed properly."
}
