{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthophippium sylhetense",
    "plant_slug": "acanthophippium-sylhetense",
    "plant_name_scientific": "acanthophippium sylhetense",
    "intro": "Acanthophippium sylhetense, commonly known as Sylhet spurge, is a flowering plant native to the Sylhet region of Bangladesh. It belongs to the Euphorbiaceae family and is characterized by its distinctive yellow-orange sap, which is toxic and can cause skin irritation. The plant typically grows in moist, shaded areas and has simple, alternate leaves with a smooth texture. Its small, inconspicuous flowers are clustered in cyathia, a unique structure typical of the Euphorbiaceae family.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Acanthophippium",
        "species": "Acanthophippium sylhetense"
    },
    "taxonomy_art_desc": "Acanthophippium sylhetense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Asparagales, a large group of flowering plants that includes orchids, grasses, and asparagus, known for their diverse floral structures. Its family is Orchidaceae, commonly known as orchids, which are renowned for their complex and showy flowers and are one of the largest families of flowering plants. Its genus is Acanthophippium, a group of flowering plants within the orchid family, characterized by specific morphological features such as the structure of their flowers and leaves. Its species is Acanthophippium sylhetense, a specific type of orchid found in certain regions, distinguished by its unique characteristics and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "China South-Central",
        "East Himalaya",
        "India",
        "Japan",
        "Laos",
        "Malaya",
        "Myanmar",
        "Nansei-shoto",
        "Philippines",
        "Taiwan",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthophippium sylhetense is primarily native to Assam, Bangladesh, China South-Central, East Himalaya, India, Japan, Laos, Malaya, Myanmar, Nansei-shoto, Philippines, Taiwan, Thailand, and Vietnam. This plant is typically found in tropical and subtropical regions, often in moist and shaded environments. It is commonly associated with forested areas and is sometimes found in mountainous regions. The species is known for its ornamental value and is sometimes cultivated for its aesthetic appeal. Its distribution spans a wide range across Southeast Asia and parts of South Asia.",
    "distribution_introduced_art_desc": "Acanthophippium sylhetense was mainly introduced to new habitats in Southeast Asia, particularly in countries like Bangladesh, India, and Myanmar. It has been observed in disturbed forest areas, along roadsides, and in secondary growth vegetation. The plant's introduction is likely due to human activities such as land clearing and accidental dispersal through trade or transportation. It has adapted well to these environments, showing resilience to local climatic conditions. However, its ecological impact remains under study due to limited research on its role in native ecosystems."
}
