{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acantholimon langaricum",
    "plant_slug": "acantholimon-langaricum",
    "plant_name_scientific": "acantholimon langaricum",
    "intro": "Acantholimon langaricum, commonly known as the Langaric thornweed, is a perennial flowering plant native to the arid and semi-arid regions of Central Asia. It belongs to the family Caryophyllaceae, which includes many flowering plants with showy blooms. The plant is characterized by its succulent, fleshy stems and leaves, which help it conserve water in dry environments. It produces small, pink or purple flowers that bloom in late spring or early summer. Acantholimon langaricum is often found in rocky soils and is adapted to withstand extreme temperature fluctuations and limited rainfall.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Plumbaginaceae",
        "genus": "Acantholimon",
        "species": "Acantholimon langaricum"
    },
    "taxonomy_art_desc": "Acantholimon langaricum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with distinctive floral structures. Its family is Plumbaginaceae, commonly known as the leadplant family, which includes plants with showy flowers and often contains alkaloids. Its genus is Acantholimon, a group of flowering plants typically found in arid or rocky habitats, characterized by their spiny leaves and showy flowers. Its species is Acantholimon langaricum, a specific type of flowering plant native to certain regions, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kirgizstan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acantholimon langaricum is primarily native to Kirgizstan. It is commonly found in the mountainous regions of the country, particularly in the alpine and subalpine zones. This plant thrives in rocky and gravelly soils, often growing in open slopes and meadows. It is well adapted to the harsh climate of Central Asia, with cold winters and short growing seasons. Due to its limited range, it is considered a rare and endemic species in Kirgizstan.",
    "distribution_introduced_art_desc": "Acantholimon langaricum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid environments. It is commonly found in rocky soils and open habitats such as slopes and gravelly areas. This plant is often cultivated in gardens and landscapes for its ornamental value and drought tolerance. It has been introduced to several regions outside its native range, including parts of the Mediterranean and California. Its distribution is largely limited by its specific ecological requirements and climate preferences."
}
