{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus procumbens",
    "plant_slug": "acanthus-procumbens",
    "plant_name_scientific": "acanthus procumbens",
    "intro": "Acanthus procumbens, commonly known as the prostrate acanthus, is a low-growing perennial plant native to southern Europe and western Asia. It features broad, waxy leaves that are typically gray-green in color with a velvety texture. The plant produces showy, spiny flowers in shades of pink to purple, which bloom in late summer. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and borders. Its unique foliage and ornamental flowers make it a valuable addition to both garden landscapes and horticultural collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus procumbens is primarily native to southern Europe, North Africa, and the Middle East. It is commonly found in regions with Mediterranean climates, including countries such as Spain, Italy, Morocco, and Turkey. This plant thrives in rocky soils and coastal areas, often growing in sunny, well-drained environments. It is particularly common along the Mediterranean coastlines and in limestone-rich habitats. Its native range extends from the Iberian Peninsula to the eastern Mediterranean, including parts of the Balkans.",
    "distribution_introduced_art_desc": "Acanthus procumbens was mainly introduced to gardens and ornamental landscapes due to its attractive, fern-like foliage and showy flowers. It is often cultivated for its aesthetic value in temperate regions where it thrives in moist, shady environments. Despite its ornamental appeal, it has become an invasive species in some areas, outcompeting native vegetation. Its spread is facilitated by its ability to propagate through rhizomes and seeds dispersed by water and animals. Proper management is essential to prevent its unwanted proliferation in natural ecosystems."
}
