{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acanthus balcanicus",
    "plant_slug": "acanthus-balcanicus",
    "plant_name_scientific": "acanthus balcanicus",
    "intro": "Acanthus balcanicus, commonly known as the Balkan acanthus, is a perennial herb native to the Balkan Peninsula. It is characterized by its large, palmately lobed leaves that are often covered in a dense layer of white, fuzzy hairs. The plant produces showy, spire-like inflorescences with violet to purple flowers that bloom in late summer. Its leaves and flowers are often used in ornamental gardening due to their striking appearance. Acanthus balcanicus is also valued in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acanthus balcanicus is primarily native to the Balkan Peninsula, including parts of Greece, Bulgaria, Serbia, and North Macedonia. It thrives in rocky and calcareous soils, often found in mountainous regions and along riverbanks. This plant is commonly associated with Mediterranean and continental climates, where it grows in open woodlands and shrublands. It is also present in some areas of Turkey and the former Yugoslavia. Due to its ornamental value, it has been introduced to other parts of the world, but it remains most prevalent in its native range.",
    "distribution_introduced_art_desc": "Acanthus balcanicus was mainly introduced to the Mediterranean region and parts of southern Europe. It is commonly found in rocky areas, dry slopes, and along coastal cliffs. This plant has been spread through natural means such as wind and water, as well as human activity. It thrives in well-drained soils and full sun, making it adaptable to various environments. Due to its ornamental value, it has also been cultivated in gardens and landscapes in some areas."
}
